TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:14 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2F43222C-7D72-4821-A597-D2756DFFF658} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                             PC v18.12.4.LTS *
       3              ;* Date/Time created: Tue Jan 31 14:49:12 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_18/sw/modules/hal/boards/drv8301kit_r
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v18.12.4.LTS Copyright (c) 1996-
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("OFFSET_setBeta")

C:\Users\User\AppData\Local\Temp\{2F43222C-7D72-4821-A597-D2756DFFF658} PAGE  281

   14813                      .dwattr $C$DW$1986, DW_AT_const_value(0x04)
   14814              
   14815                      .dwendtag $C$DW$T$325
   14816              
   14817              $C$DW$T$326     .dwtag  DW_TAG_typedef
   14818                      .dwattr $C$DW$T$326, DW_AT_name("SPI_Mode_e")
   14819                      .dwattr $C$DW$T$326, DW_AT_type(*$C$DW$T$325)
   14820                      .dwattr $C$DW$T$326, DW_AT_language(DW_LANG_C)
   14821              
   14822              $C$DW$1987      .dwtag  DW_TAG_TI_far_type
   14823                      .dwattr $C$DW$1987, DW_AT_type(*$C$DW$T$326)
   14824              
   14825              $C$DW$T$327     .dwtag  DW_TAG_const_type
   14826                      .dwattr $C$DW$T$327, DW_AT_type(*$C$DW$1987)
   14827              
   14828              
   14829              $C$DW$T$328     .dwtag  DW_TAG_enumeration_type
   14830                      .dwattr $C$DW$T$328, DW_AT_byte_size(0x01)
   14831              $C$DW$1988      .dwtag  DW_TAG_enumerator
   14832                      .dwattr $C$DW$1988, DW_AT_name("SPI_TxSuspend_00")
   14833                      .dwattr $C$DW$1988, DW_AT_const_value(0x00)
   14834              
   14835              $C$DW$1989      .dwtag  DW_TAG_enumerator
   14836                      .dwattr $C$DW$1989, DW_AT_name("SPI_TxSuspend_10")
   14837                      .dwattr $C$DW$1989, DW_AT_const_value(0x20)
   14838              
   14839              $C$DW$1990      .dwtag  DW_TAG_enumerator
   14840                      .dwattr $C$DW$1990, DW_AT_name("SPI_TxSuspend_free")
   14841                      .dwattr $C$DW$1990, DW_AT_const_value(0x10)
   14842              
   14843                      .dwendtag $C$DW$T$328
   14844              
   14845              $C$DW$T$329     .dwtag  DW_TAG_typedef
   14846                      .dwattr $C$DW$T$329, DW_AT_name("SPI_EmulationSuspend_e")
   14847                      .dwattr $C$DW$T$329, DW_AT_type(*$C$DW$T$328)
   14848                      .dwattr $C$DW$T$329, DW_AT_language(DW_LANG_C)
   14849              
   14850              $C$DW$1991      .dwtag  DW_TAG_TI_far_type
   14851                      .dwattr $C$DW$1991, DW_AT_type(*$C$DW$T$329)
   14852              
   14853              $C$DW$T$330     .dwtag  DW_TAG_const_type
   14854                      .dwattr $C$DW$T$330, DW_AT_type(*$C$DW$1991)
   14855              
   14856              
   14857              $C$DW$T$331     .dwtag  DW_TAG_enumeration_type
   14858                      .dwattr $C$DW$T$331, DW_AT_byte_size(0x01)
   14859              $C$DW$1992      .dwtag  DW_TAG_enumerator
   14860                      .dwattr $C$DW$1992, DW_AT_name("TIMER_EmulationMode_StopAfterNextDecrement")
   14861                      .dwattr $C$DW$1992, DW_AT_const_value(0x00)
   14862              
   14863              $C$DW$1993      .dwtag  DW_TAG_enumerator
   14864                      .dwattr $C$DW$1993, DW_AT_name("TIMER_EmulationMode_StopAtZero")
   14865                      .dwattr $C$DW$1993, DW_AT_const_value(0x400)
   14866              
   14867              $C$DW$1994      .dwtag  DW_TAG_enumerator
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:14 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2F43222C-7D72-4821-A597-D2756DFFF658} PAGE  282

   14868                      .dwattr $C$DW$1994, DW_AT_name("TIMER_EmulationMode_RunFree")
   14869                      .dwattr $C$DW$1994, DW_AT_const_value(0x800)
   14870              
   14871                      .dwendtag $C$DW$T$331
   14872              
   14873              $C$DW$T$332     .dwtag  DW_TAG_typedef
   14874                      .dwattr $C$DW$T$332, DW_AT_name("TIMER_EmulationMode_e")
   14875                      .dwattr $C$DW$T$332, DW_AT_type(*$C$DW$T$331)
   14876                      .dwattr $C$DW$T$332, DW_AT_language(DW_LANG_C)
   14877              
   14878              $C$DW$1995      .dwtag  DW_TAG_TI_far_type
   14879                      .dwattr $C$DW$1995, DW_AT_type(*$C$DW$T$332)
   14880              
   14881              $C$DW$T$333     .dwtag  DW_TAG_const_type
   14882                      .dwattr $C$DW$T$333, DW_AT_type(*$C$DW$1995)
   14883              
   14884              
   14885              $C$DW$T$334     .dwtag  DW_TAG_enumeration_type
   14886                      .dwattr $C$DW$T$334, DW_AT_byte_size(0x01)
   14887              $C$DW$1996      .dwtag  DW_TAG_enumerator
   14888                      .dwattr $C$DW$1996, DW_AT_name("HAL_SensorType_Current")
   14889                      .dwattr $C$DW$1996, DW_AT_const_value(0x00)
   14890              
   14891              $C$DW$1997      .dwtag  DW_TAG_enumerator
   14892                      .dwattr $C$DW$1997, DW_AT_name("HAL_SensorType_Voltage")
   14893                      .dwattr $C$DW$1997, DW_AT_const_value(0x01)
   14894              
   14895                      .dwendtag $C$DW$T$334
   14896              
   14897              $C$DW$T$335     .dwtag  DW_TAG_typedef
   14898                      .dwattr $C$DW$T$335, DW_AT_name("HAL_SensorType_e")
   14899                      .dwattr $C$DW$T$335, DW_AT_type(*$C$DW$T$334)
   14900                      .dwattr $C$DW$T$335, DW_AT_language(DW_LANG_C)
   14901              
   14902              
   14903              $C$DW$T$30      .dwtag  DW_TAG_structure_type
   14904                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
   14905                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
   14906              $C$DW$1998      .dwtag  DW_TAG_member
   14907                      .dwattr $C$DW$1998, DW_AT_type(*$C$DW$T$24)
   14908                      .dwattr $C$DW$1998, DW_AT_name("ADCRESULT")
   14909                      .dwattr $C$DW$1998, DW_AT_TI_symbol_name("_ADCRESULT")
   14910                      .dwattr $C$DW$1998, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14911                      .dwattr $C$DW$1998, DW_AT_accessibility(DW_ACCESS_public)
   14912              
   14913              $C$DW$1999      .dwtag  DW_TAG_member
   14914                      .dwattr $C$DW$1999, DW_AT_type(*$C$DW$T$25)
   14915                      .dwattr $C$DW$1999, DW_AT_name("resvd_1")
   14916                      .dwattr $C$DW$1999, DW_AT_TI_symbol_name("_resvd_1")
   14917                      .dwattr $C$DW$1999, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   14918                      .dwattr $C$DW$1999, DW_AT_accessibility(DW_ACCESS_public)
   14919              
   14920              $C$DW$2000      .dwtag  DW_TAG_member
   14921                      .dwattr $C$DW$2000, DW_AT_type(*$C$DW$T$23)
   14922                      .dwattr $C$DW$2000, DW_AT_name("ADCCTL1")
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:14 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2F43222C-7D72-4821-A597-D2756DFFF658} PAGE  283

   14923                      .dwattr $C$DW$2000, DW_AT_TI_symbol_name("_ADCCTL1")
   14924                      .dwattr $C$DW$2000, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
   14925                      .dwattr $C$DW$2000, DW_AT_accessibility(DW_ACCESS_public)
   14926              
   14927              $C$DW$2001      .dwtag  DW_TAG_member
   14928                      .dwattr $C$DW$2001, DW_AT_type(*$C$DW$T$23)
   14929                      .dwattr $C$DW$2001, DW_AT_name("ADCCTL2")
   14930                      .dwattr $C$DW$2001, DW_AT_TI_symbol_name("_ADCCTL2")
   14931                      .dwattr $C$DW$2001, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
   14932                      .dwattr $C$DW$2001, DW_AT_accessibility(DW_ACCESS_public)
   14933              
   14934              $C$DW$2002      .dwtag  DW_TAG_member
   14935                      .dwattr $C$DW$2002, DW_AT_type(*$C$DW$T$26)
   14936                      .dwattr $C$DW$2002, DW_AT_name("rsvd_2")
   14937                      .dwattr $C$DW$2002, DW_AT_TI_symbol_name("_rsvd_2")
   14938                      .dwattr $C$DW$2002, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
   14939                      .dwattr $C$DW$2002, DW_AT_accessibility(DW_ACCESS_public)
   14940              
   14941              $C$DW$2003      .dwtag  DW_TAG_member
   14942                      .dwattr $C$DW$2003, DW_AT_type(*$C$DW$T$23)
   14943                      .dwattr $C$DW$2003, DW_AT_name("ADCINTFLG")
   14944                      .dwattr $C$DW$2003, DW_AT_TI_symbol_name("_ADCINTFLG")
   14945                      .dwattr $C$DW$2003, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
   14946                      .dwattr $C$DW$2003, DW_AT_accessibility(DW_ACCESS_public)
   14947              
   14948              $C$DW$2004      .dwtag  DW_TAG_member
   14949                      .dwattr $C$DW$2004, DW_AT_type(*$C$DW$T$23)
   14950                      .dwattr $C$DW$2004, DW_AT_name("ADCINTFLGCLR")
   14951                      .dwattr $C$DW$2004, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
   14952                      .dwattr $C$DW$2004, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
   14953                      .dwattr $C$DW$2004, DW_AT_accessibility(DW_ACCESS_public)
   14954              
   14955              $C$DW$2005      .dwtag  DW_TAG_member
   14956                      .dwattr $C$DW$2005, DW_AT_type(*$C$DW$T$23)
   14957                      .dwattr $C$DW$2005, DW_AT_name("ADCINTOVF")
   14958                      .dwattr $C$DW$2005, DW_AT_TI_symbol_name("_ADCINTOVF")
   14959                      .dwattr $C$DW$2005, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
   14960                      .dwattr $C$DW$2005, DW_AT_accessibility(DW_ACCESS_public)
   14961              
   14962              $C$DW$2006      .dwtag  DW_TAG_member
   14963                      .dwattr $C$DW$2006, DW_AT_type(*$C$DW$T$23)
   14964                      .dwattr $C$DW$2006, DW_AT_name("ADCINTOVFCLR")
   14965                      .dwattr $C$DW$2006, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
   14966                      .dwattr $C$DW$2006, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
   14967                      .dwattr $C$DW$2006, DW_AT_accessibility(DW_ACCESS_public)
   14968              
   14969              $C$DW$2007      .dwtag  DW_TAG_member
   14970                      .dwattr $C$DW$2007, DW_AT_type(*$C$DW$T$27)
   14971                      .dwattr $C$DW$2007, DW_AT_name("INTSELxNy")
   14972                      .dwattr $C$DW$2007, DW_AT_TI_symbol_name("_INTSELxNy")
   14973                      .dwattr $C$DW$2007, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
   14974                      .dwattr $C$DW$2007, DW_AT_accessibility(DW_ACCESS_public)
   14975              
   14976              $C$DW$2008      .dwtag  DW_TAG_member
   14977                      .dwattr $C$DW$2008, DW_AT_type(*$C$DW$T$28)
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:14 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2F43222C-7D72-4821-A597-D2756DFFF658} PAGE  284

   14978                      .dwattr $C$DW$2008, DW_AT_name("rsvd_3")
   14979                      .dwattr $C$DW$2008, DW_AT_TI_symbol_name("_rsvd_3")
   14980                      .dwattr $C$DW$2008, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
   14981                      .dwattr $C$DW$2008, DW_AT_accessibility(DW_ACCESS_public)
   14982              
   14983              $C$DW$2009      .dwtag  DW_TAG_member
   14984                      .dwattr $C$DW$2009, DW_AT_type(*$C$DW$T$23)
   14985                      .dwattr $C$DW$2009, DW_AT_name("SOCPRICTRL")
   14986                      .dwattr $C$DW$2009, DW_AT_TI_symbol_name("_SOCPRICTRL")
   14987                      .dwattr $C$DW$2009, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
   14988                      .dwattr $C$DW$2009, DW_AT_accessibility(DW_ACCESS_public)
   14989              
   14990              $C$DW$2010      .dwtag  DW_TAG_member
   14991                      .dwattr $C$DW$2010, DW_AT_type(*$C$DW$T$23)
   14992                      .dwattr $C$DW$2010, DW_AT_name("rsvd_4")
   14993                      .dwattr $C$DW$2010, DW_AT_TI_symbol_name("_rsvd_4")
   14994                      .dwattr $C$DW$2010, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
   14995                      .dwattr $C$DW$2010, DW_AT_accessibility(DW_ACCESS_public)
   14996              
   14997              $C$DW$2011      .dwtag  DW_TAG_member
   14998                      .dwattr $C$DW$2011, DW_AT_type(*$C$DW$T$23)
   14999                      .dwattr $C$DW$2011, DW_AT_name("ADCSAMPLEMODE")
   15000                      .dwattr $C$DW$2011, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
   15001                      .dwattr $C$DW$2011, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
   15002                      .dwattr $C$DW$2011, DW_AT_accessibility(DW_ACCESS_public)
   15003              
   15004              $C$DW$2012      .dwtag  DW_TAG_member
   15005                      .dwattr $C$DW$2012, DW_AT_type(*$C$DW$T$23)
   15006                      .dwattr $C$DW$2012, DW_AT_name("rsvd_5")
   15007                      .dwattr $C$DW$2012, DW_AT_TI_symbol_name("_rsvd_5")
   15008                      .dwattr $C$DW$2012, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
   15009                      .dwattr $C$DW$2012, DW_AT_accessibility(DW_ACCESS_public)
   15010              
   15011              $C$DW$2013      .dwtag  DW_TAG_member
   15012                      .dwattr $C$DW$2013, DW_AT_type(*$C$DW$T$23)
   15013                      .dwattr $C$DW$2013, DW_AT_name("ADCINTSOCSEL1")
   15014                      .dwattr $C$DW$2013, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
   15015                      .dwattr $C$DW$2013, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
   15016                      .dwattr $C$DW$2013, DW_AT_accessibility(DW_ACCESS_public)
   15017              
   15018              $C$DW$2014      .dwtag  DW_TAG_member
   15019                      .dwattr $C$DW$2014, DW_AT_type(*$C$DW$T$23)
   15020                      .dwattr $C$DW$2014, DW_AT_name("ADCINTSOCSEL2")
   15021                      .dwattr $C$DW$2014, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
   15022                      .dwattr $C$DW$2014, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
   15023                      .dwattr $C$DW$2014, DW_AT_accessibility(DW_ACCESS_public)
   15024              
   15025              $C$DW$2015      .dwtag  DW_TAG_member
   15026                      .dwattr $C$DW$2015, DW_AT_type(*$C$DW$T$26)
   15027                      .dwattr $C$DW$2015, DW_AT_name("rsvd_6")
   15028                      .dwattr $C$DW$2015, DW_AT_TI_symbol_name("_rsvd_6")
   15029                      .dwattr $C$DW$2015, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
   15030                      .dwattr $C$DW$2015, DW_AT_accessibility(DW_ACCESS_public)
   15031              
   15032              $C$DW$2016      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:14 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2F43222C-7D72-4821-A597-D2756DFFF658} PAGE  285

   15033                      .dwattr $C$DW$2016, DW_AT_type(*$C$DW$T$23)
   15034                      .dwattr $C$DW$2016, DW_AT_name("ADCSOCFLG1")
   15035                      .dwattr $C$DW$2016, DW_AT_TI_symbol_name("_ADCSOCFLG1")
   15036                      .dwattr $C$DW$2016, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
   15037                      .dwattr $C$DW$2016, DW_AT_accessibility(DW_ACCESS_public)
   15038              
   15039              $C$DW$2017      .dwtag  DW_TAG_member
   15040                      .dwattr $C$DW$2017, DW_AT_type(*$C$DW$T$23)
   15041                      .dwattr $C$DW$2017, DW_AT_name("rsvd_7")
   15042                      .dwattr $C$DW$2017, DW_AT_TI_symbol_name("_rsvd_7")
   15043                      .dwattr $C$DW$2017, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   15044                      .dwattr $C$DW$2017, DW_AT_accessibility(DW_ACCESS_public)
   15045              
   15046              $C$DW$2018      .dwtag  DW_TAG_member
   15047                      .dwattr $C$DW$2018, DW_AT_type(*$C$DW$T$23)
   15048                      .dwattr $C$DW$2018, DW_AT_name("ADCSOCFRC1")
   15049                      .dwattr $C$DW$2018, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   15050                      .dwattr $C$DW$2018, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   15051                      .dwattr $C$DW$2018, DW_AT_accessibility(DW_ACCESS_public)
   15052              
   15053              $C$DW$2019      .dwtag  DW_TAG_member
   15054                      .dwattr $C$DW$2019, DW_AT_type(*$C$DW$T$23)
   15055                      .dwattr $C$DW$2019, DW_AT_name("rsvd_8")
   15056                      .dwattr $C$DW$2019, DW_AT_TI_symbol_name("_rsvd_8")
   15057                      .dwattr $C$DW$2019, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   15058                      .dwattr $C$DW$2019, DW_AT_accessibility(DW_ACCESS_public)
   15059              
   15060              $C$DW$2020      .dwtag  DW_TAG_member
   15061                      .dwattr $C$DW$2020, DW_AT_type(*$C$DW$T$23)
   15062                      .dwattr $C$DW$2020, DW_AT_name("ADCSOCOVF1")
   15063                      .dwattr $C$DW$2020, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   15064                      .dwattr $C$DW$2020, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   15065                      .dwattr $C$DW$2020, DW_AT_accessibility(DW_ACCESS_public)
   15066              
   15067              $C$DW$2021      .dwtag  DW_TAG_member
   15068                      .dwattr $C$DW$2021, DW_AT_type(*$C$DW$T$23)
   15069                      .dwattr $C$DW$2021, DW_AT_name("rsvd_9")
   15070                      .dwattr $C$DW$2021, DW_AT_TI_symbol_name("_rsvd_9")
   15071                      .dwattr $C$DW$2021, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
   15072                      .dwattr $C$DW$2021, DW_AT_accessibility(DW_ACCESS_public)
   15073              
   15074              $C$DW$2022      .dwtag  DW_TAG_member
   15075                      .dwattr $C$DW$2022, DW_AT_type(*$C$DW$T$23)
   15076                      .dwattr $C$DW$2022, DW_AT_name("ADCSOCOVFCLR1")
   15077                      .dwattr $C$DW$2022, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
   15078                      .dwattr $C$DW$2022, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
   15079                      .dwattr $C$DW$2022, DW_AT_accessibility(DW_ACCESS_public)
   15080              
   15081              $C$DW$2023      .dwtag  DW_TAG_member
   15082                      .dwattr $C$DW$2023, DW_AT_type(*$C$DW$T$23)
   15083                      .dwattr $C$DW$2023, DW_AT_name("rsvd_10")
   15084                      .dwattr $C$DW$2023, DW_AT_TI_symbol_name("_rsvd_10")
   15085                      .dwattr $C$DW$2023, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   15086                      .dwattr $C$DW$2023, DW_AT_accessibility(DW_ACCESS_public)
   15087              
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:14 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2F43222C-7D72-4821-A597-D2756DFFF658} PAGE  286

   15088              $C$DW$2024      .dwtag  DW_TAG_member
   15089                      .dwattr $C$DW$2024, DW_AT_type(*$C$DW$T$24)
   15090                      .dwattr $C$DW$2024, DW_AT_name("ADCSOCxCTL")
   15091                      .dwattr $C$DW$2024, DW_AT_TI_symbol_name("_ADCSOCxCTL")
   15092                      .dwattr $C$DW$2024, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   15093                      .dwattr $C$DW$2024, DW_AT_accessibility(DW_ACCESS_public)
   15094              
   15095              $C$DW$2025      .dwtag  DW_TAG_member
   15096                      .dwattr $C$DW$2025, DW_AT_type(*$C$DW$T$24)
   15097                      .dwattr $C$DW$2025, DW_AT_name("rsvd_11")
   15098                      .dwattr $C$DW$2025, DW_AT_TI_symbol_name("_rsvd_11")
   15099                      .dwattr $C$DW$2025, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   15100                      .dwattr $C$DW$2025, DW_AT_accessibility(DW_ACCESS_public)
   15101              
   15102              $C$DW$2026      .dwtag  DW_TAG_member
   15103                      .dwattr $C$DW$2026, DW_AT_type(*$C$DW$T$23)
   15104                      .dwattr $C$DW$2026, DW_AT_name("ADCREFTRIM")
   15105                      .dwattr $C$DW$2026, DW_AT_TI_symbol_name("_ADCREFTRIM")
   15106                      .dwattr $C$DW$2026, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   15107                      .dwattr $C$DW$2026, DW_AT_accessibility(DW_ACCESS_public)
   15108              
   15109              $C$DW$2027      .dwtag  DW_TAG_member
   15110                      .dwattr $C$DW$2027, DW_AT_type(*$C$DW$T$23)
   15111                      .dwattr $C$DW$2027, DW_AT_name("ADCOFFTRIM")
   15112                      .dwattr $C$DW$2027, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   15113                      .dwattr $C$DW$2027, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   15114                      .dwattr $C$DW$2027, DW_AT_accessibility(DW_ACCESS_public)
   15115              
   15116              $C$DW$2028      .dwtag  DW_TAG_member
   15117                      .dwattr $C$DW$2028, DW_AT_type(*$C$DW$T$29)
   15118                      .dwattr $C$DW$2028, DW_AT_name("resvd_12")
   15119                      .dwattr $C$DW$2028, DW_AT_TI_symbol_name("_resvd_12")
   15120                      .dwattr $C$DW$2028, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   15121                      .dwattr $C$DW$2028, DW_AT_accessibility(DW_ACCESS_public)
   15122              
   15123              $C$DW$2029      .dwtag  DW_TAG_member
   15124                      .dwattr $C$DW$2029, DW_AT_type(*$C$DW$T$23)
   15125                      .dwattr $C$DW$2029, DW_AT_name("ADCREV")
   15126                      .dwattr $C$DW$2029, DW_AT_TI_symbol_name("_ADCREV")
   15127                      .dwattr $C$DW$2029, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   15128                      .dwattr $C$DW$2029, DW_AT_accessibility(DW_ACCESS_public)
   15129              
   15130                      .dwendtag $C$DW$T$30
   15131              
   15132              $C$DW$T$337     .dwtag  DW_TAG_typedef
   15133                      .dwattr $C$DW$T$337, DW_AT_name("ADC_Obj")
   15134                      .dwattr $C$DW$T$337, DW_AT_type(*$C$DW$T$30)
   15135                      .dwattr $C$DW$T$337, DW_AT_language(DW_LANG_C)
   15136              
   15137              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
   15138                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$30)
   15139                      .dwattr $C$DW$T$88, DW_AT_address_class(0x20)
   15140              
   15141              $C$DW$T$89      .dwtag  DW_TAG_typedef
   15142                      .dwattr $C$DW$T$89, DW_AT_name("ADC_Handle")
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:14 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2F43222C-7D72-4821-A597-D2756DFFF658} PAGE  287

   15143                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
   15144                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
   15145              
   15146              
   15147              $C$DW$T$32      .dwtag  DW_TAG_structure_type
   15148                      .dwattr $C$DW$T$32, DW_AT_name("_CLK_Obj_")
   15149                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x11)
   15150              $C$DW$2030      .dwtag  DW_TAG_member
   15151                      .dwattr $C$DW$2030, DW_AT_type(*$C$DW$T$23)
   15152                      .dwattr $C$DW$2030, DW_AT_name("XCLK")
   15153                      .dwattr $C$DW$2030, DW_AT_TI_symbol_name("_XCLK")
   15154                      .dwattr $C$DW$2030, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15155                      .dwattr $C$DW$2030, DW_AT_accessibility(DW_ACCESS_public)
   15156              
   15157              $C$DW$2031      .dwtag  DW_TAG_member
   15158                      .dwattr $C$DW$2031, DW_AT_type(*$C$DW$T$23)
   15159                      .dwattr $C$DW$2031, DW_AT_name("rsvd_1")
   15160                      .dwattr $C$DW$2031, DW_AT_TI_symbol_name("_rsvd_1")
   15161                      .dwattr $C$DW$2031, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15162                      .dwattr $C$DW$2031, DW_AT_accessibility(DW_ACCESS_public)
   15163              
   15164              $C$DW$2032      .dwtag  DW_TAG_member
   15165                      .dwattr $C$DW$2032, DW_AT_type(*$C$DW$T$23)
   15166                      .dwattr $C$DW$2032, DW_AT_name("CLKCTL")
   15167                      .dwattr $C$DW$2032, DW_AT_TI_symbol_name("_CLKCTL")
   15168                      .dwattr $C$DW$2032, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15169                      .dwattr $C$DW$2032, DW_AT_accessibility(DW_ACCESS_public)
   15170              
   15171              $C$DW$2033      .dwtag  DW_TAG_member
   15172                      .dwattr $C$DW$2033, DW_AT_type(*$C$DW$T$31)
   15173                      .dwattr $C$DW$2033, DW_AT_name("rsvd_2")
   15174                      .dwattr $C$DW$2033, DW_AT_TI_symbol_name("_rsvd_2")
   15175                      .dwattr $C$DW$2033, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   15176                      .dwattr $C$DW$2033, DW_AT_accessibility(DW_ACCESS_public)
   15177              
   15178              $C$DW$2034      .dwtag  DW_TAG_member
   15179                      .dwattr $C$DW$2034, DW_AT_type(*$C$DW$T$23)
   15180                      .dwattr $C$DW$2034, DW_AT_name("LOSPCP")
   15181                      .dwattr $C$DW$2034, DW_AT_TI_symbol_name("_LOSPCP")
   15182                      .dwattr $C$DW$2034, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   15183                      .dwattr $C$DW$2034, DW_AT_accessibility(DW_ACCESS_public)
   15184              
   15185              $C$DW$2035      .dwtag  DW_TAG_member
   15186                      .dwattr $C$DW$2035, DW_AT_type(*$C$DW$T$23)
   15187                      .dwattr $C$DW$2035, DW_AT_name("PCLKCR0")
   15188                      .dwattr $C$DW$2035, DW_AT_TI_symbol_name("_PCLKCR0")
   15189                      .dwattr $C$DW$2035, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   15190                      .dwattr $C$DW$2035, DW_AT_accessibility(DW_ACCESS_public)
   15191              
   15192              $C$DW$2036      .dwtag  DW_TAG_member
   15193                      .dwattr $C$DW$2036, DW_AT_type(*$C$DW$T$23)
   15194                      .dwattr $C$DW$2036, DW_AT_name("PCLKCR1")
   15195                      .dwattr $C$DW$2036, DW_AT_TI_symbol_name("_PCLKCR1")
   15196                      .dwattr $C$DW$2036, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   15197                      .dwattr $C$DW$2036, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:14 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2F43222C-7D72-4821-A597-D2756DFFF658} PAGE  288

   15198              
   15199              $C$DW$2037      .dwtag  DW_TAG_member
   15200                      .dwattr $C$DW$2037, DW_AT_type(*$C$DW$T$26)
   15201                      .dwattr $C$DW$2037, DW_AT_name("rsvd_3")
   15202                      .dwattr $C$DW$2037, DW_AT_TI_symbol_name("_rsvd_3")
   15203                      .dwattr $C$DW$2037, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   15204                      .dwattr $C$DW$2037, DW_AT_accessibility(DW_ACCESS_public)
   15205              
   15206              $C$DW$2038      .dwtag  DW_TAG_member
   15207                      .dwattr $C$DW$2038, DW_AT_type(*$C$DW$T$23)
   15208                      .dwattr $C$DW$2038, DW_AT_name("PCLKCR3")
   15209                      .dwattr $C$DW$2038, DW_AT_TI_symbol_name("_PCLKCR3")
   15210                      .dwattr $C$DW$2038, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   15211                      .dwattr $C$DW$2038, DW_AT_accessibility(DW_ACCESS_public)
   15212              
   15213                      .dwendtag $C$DW$T$32
   15214              
   15215              $C$DW$T$90      .dwtag  DW_TAG_pointer_type
   15216                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$32)
   15217                      .dwattr $C$DW$T$90, DW_AT_address_class(0x20)
   15218              
   15219              $C$DW$T$91      .dwtag  DW_TAG_typedef
   15220                      .dwattr $C$DW$T$91, DW_AT_name("CLK_Handle")
   15221                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
   15222                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
   15223              
   15224              
   15225              $C$DW$T$35      .dwtag  DW_TAG_structure_type
   15226                      .dwattr $C$DW$T$35, DW_AT_name("_CPU_Obj_")
   15227                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
   15228              $C$DW$2039      .dwtag  DW_TAG_member
   15229                      .dwattr $C$DW$2039, DW_AT_type(*$C$DW$T$34)
   15230                      .dwattr $C$DW$2039, DW_AT_name("tmp")
   15231                      .dwattr $C$DW$2039, DW_AT_TI_symbol_name("_tmp")
   15232                      .dwattr $C$DW$2039, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15233                      .dwattr $C$DW$2039, DW_AT_accessibility(DW_ACCESS_public)
   15234              
   15235                      .dwendtag $C$DW$T$35
   15236              
   15237              $C$DW$T$346     .dwtag  DW_TAG_typedef
   15238                      .dwattr $C$DW$T$346, DW_AT_name("CPU_Obj")
   15239                      .dwattr $C$DW$T$346, DW_AT_type(*$C$DW$T$35)
   15240                      .dwattr $C$DW$T$346, DW_AT_language(DW_LANG_C)
   15241              
   15242              $C$DW$T$92      .dwtag  DW_TAG_pointer_type
   15243                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$35)
   15244                      .dwattr $C$DW$T$92, DW_AT_address_class(0x20)
   15245              
   15246              $C$DW$T$93      .dwtag  DW_TAG_typedef
   15247                      .dwattr $C$DW$T$93, DW_AT_name("CPU_Handle")
   15248                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
   15249                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
   15250              
   15251              
   15252              $C$DW$T$43      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:14 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2F43222C-7D72-4821-A597-D2756DFFF658} PAGE  289

   15253                      .dwattr $C$DW$T$43, DW_AT_name("_DRV8301_Obj_")
   15254                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x08)
   15255              $C$DW$2040      .dwtag  DW_TAG_member
   15256                      .dwattr $C$DW$2040, DW_AT_type(*$C$DW$T$37)
   15257                      .dwattr $C$DW$2040, DW_AT_name("spiHandle")
   15258                      .dwattr $C$DW$2040, DW_AT_TI_symbol_name("_spiHandle")
   15259                      .dwattr $C$DW$2040, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15260                      .dwattr $C$DW$2040, DW_AT_accessibility(DW_ACCESS_public)
   15261              
   15262              $C$DW$2041      .dwtag  DW_TAG_member
   15263                      .dwattr $C$DW$2041, DW_AT_type(*$C$DW$T$39)
   15264                      .dwattr $C$DW$2041, DW_AT_name("gpioHandle")
   15265                      .dwattr $C$DW$2041, DW_AT_TI_symbol_name("_gpioHandle")
   15266                      .dwattr $C$DW$2041, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15267                      .dwattr $C$DW$2041, DW_AT_accessibility(DW_ACCESS_public)
   15268              
   15269              $C$DW$2042      .dwtag  DW_TAG_member
   15270                      .dwattr $C$DW$2042, DW_AT_type(*$C$DW$T$41)
   15271                      .dwattr $C$DW$2042, DW_AT_name("gpioNumber")
   15272                      .dwattr $C$DW$2042, DW_AT_TI_symbol_name("_gpioNumber")
   15273                      .dwattr $C$DW$2042, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15274                      .dwattr $C$DW$2042, DW_AT_accessibility(DW_ACCESS_public)
   15275              
   15276              $C$DW$2043      .dwtag  DW_TAG_member
   15277                      .dwattr $C$DW$2043, DW_AT_type(*$C$DW$T$42)
   15278                      .dwattr $C$DW$2043, DW_AT_name("RxTimeOut")
   15279                      .dwattr $C$DW$2043, DW_AT_TI_symbol_name("_RxTimeOut")
   15280                      .dwattr $C$DW$2043, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   15281                      .dwattr $C$DW$2043, DW_AT_accessibility(DW_ACCESS_public)
   15282              
   15283              $C$DW$2044      .dwtag  DW_TAG_member
   15284                      .dwattr $C$DW$2044, DW_AT_type(*$C$DW$T$42)
   15285                      .dwattr $C$DW$2044, DW_AT_name("enableTimeOut")
   15286                      .dwattr $C$DW$2044, DW_AT_TI_symbol_name("_enableTimeOut")
   15287                      .dwattr $C$DW$2044, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15288                      .dwattr $C$DW$2044, DW_AT_accessibility(DW_ACCESS_public)
   15289              
   15290                      .dwendtag $C$DW$T$43
   15291              
   15292              $C$DW$T$120     .dwtag  DW_TAG_typedef
   15293                      .dwattr $C$DW$T$120, DW_AT_name("DRV8301_Obj")
   15294                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$43)
   15295                      .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
   15296              
   15297              $C$DW$T$118     .dwtag  DW_TAG_pointer_type
   15298                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$43)
   15299                      .dwattr $C$DW$T$118, DW_AT_address_class(0x20)
   15300              
   15301              $C$DW$T$119     .dwtag  DW_TAG_typedef
   15302                      .dwattr $C$DW$T$119, DW_AT_name("DRV8301_Handle")
   15303                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
   15304                      .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
   15305              
   15306              
   15307              $C$DW$T$54      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:14 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2F43222C-7D72-4821-A597-D2756DFFF658} PAGE  290

   15308                      .dwattr $C$DW$T$54, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
   15309                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x05)
   15310              $C$DW$2045      .dwtag  DW_TAG_member
   15311                      .dwattr $C$DW$2045, DW_AT_type(*$C$DW$T$45)
   15312                      .dwattr $C$DW$2045, DW_AT_name("DRV8301_CURRENT")
   15313                      .dwattr $C$DW$2045, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
   15314                      .dwattr $C$DW$2045, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15315                      .dwattr $C$DW$2045, DW_AT_accessibility(DW_ACCESS_public)
   15316              
   15317              $C$DW$2046      .dwtag  DW_TAG_member
   15318                      .dwattr $C$DW$2046, DW_AT_type(*$C$DW$T$47)
   15319                      .dwattr $C$DW$2046, DW_AT_name("DRV8301_RESET")
   15320                      .dwattr $C$DW$2046, DW_AT_TI_symbol_name("_DRV8301_RESET")
   15321                      .dwattr $C$DW$2046, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15322                      .dwattr $C$DW$2046, DW_AT_accessibility(DW_ACCESS_public)
   15323              
   15324              $C$DW$2047      .dwtag  DW_TAG_member
   15325                      .dwattr $C$DW$2047, DW_AT_type(*$C$DW$T$49)
   15326                      .dwattr $C$DW$2047, DW_AT_name("PWM_MODE")
   15327                      .dwattr $C$DW$2047, DW_AT_TI_symbol_name("_PWM_MODE")
   15328                      .dwattr $C$DW$2047, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15329                      .dwattr $C$DW$2047, DW_AT_accessibility(DW_ACCESS_public)
   15330              
   15331              $C$DW$2048      .dwtag  DW_TAG_member
   15332                      .dwattr $C$DW$2048, DW_AT_type(*$C$DW$T$51)
   15333                      .dwattr $C$DW$2048, DW_AT_name("OC_MODE")
   15334                      .dwattr $C$DW$2048, DW_AT_TI_symbol_name("_OC_MODE")
   15335                      .dwattr $C$DW$2048, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   15336                      .dwattr $C$DW$2048, DW_AT_accessibility(DW_ACCESS_public)
   15337              
   15338              $C$DW$2049      .dwtag  DW_TAG_member
   15339                      .dwattr $C$DW$2049, DW_AT_type(*$C$DW$T$53)
   15340                      .dwattr $C$DW$2049, DW_AT_name("OC_ADJ_SET")
   15341                      .dwattr $C$DW$2049, DW_AT_TI_symbol_name("_OC_ADJ_SET")
   15342                      .dwattr $C$DW$2049, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15343                      .dwattr $C$DW$2049, DW_AT_accessibility(DW_ACCESS_public)
   15344              
   15345                      .dwendtag $C$DW$T$54
   15346              
   15347              $C$DW$T$68      .dwtag  DW_TAG_typedef
   15348                      .dwattr $C$DW$T$68, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
   15349                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$54)
   15350                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
   15351              
   15352              
   15353              $C$DW$T$63      .dwtag  DW_TAG_structure_type
   15354                      .dwattr $C$DW$T$63, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
   15355                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
   15356              $C$DW$2050      .dwtag  DW_TAG_member
   15357                      .dwattr $C$DW$2050, DW_AT_type(*$C$DW$T$56)
   15358                      .dwattr $C$DW$2050, DW_AT_name("OCTW_SET")
   15359                      .dwattr $C$DW$2050, DW_AT_TI_symbol_name("_OCTW_SET")
   15360                      .dwattr $C$DW$2050, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15361                      .dwattr $C$DW$2050, DW_AT_accessibility(DW_ACCESS_public)
   15362              
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:14 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2F43222C-7D72-4821-A597-D2756DFFF658} PAGE  291

   15363              $C$DW$2051      .dwtag  DW_TAG_member
   15364                      .dwattr $C$DW$2051, DW_AT_type(*$C$DW$T$58)
   15365                      .dwattr $C$DW$2051, DW_AT_name("GAIN")
   15366                      .dwattr $C$DW$2051, DW_AT_TI_symbol_name("_GAIN")
   15367                      .dwattr $C$DW$2051, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15368                      .dwattr $C$DW$2051, DW_AT_accessibility(DW_ACCESS_public)
   15369              
   15370              $C$DW$2052      .dwtag  DW_TAG_member
   15371                      .dwattr $C$DW$2052, DW_AT_type(*$C$DW$T$60)
   15372                      .dwattr $C$DW$2052, DW_AT_name("DC_CAL_CH1p2")
   15373                      .dwattr $C$DW$2052, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
   15374                      .dwattr $C$DW$2052, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15375                      .dwattr $C$DW$2052, DW_AT_accessibility(DW_ACCESS_public)
   15376              
   15377              $C$DW$2053      .dwtag  DW_TAG_member
   15378                      .dwattr $C$DW$2053, DW_AT_type(*$C$DW$T$62)
   15379                      .dwattr $C$DW$2053, DW_AT_name("OC_TOFF")
   15380                      .dwattr $C$DW$2053, DW_AT_TI_symbol_name("_OC_TOFF")
   15381                      .dwattr $C$DW$2053, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   15382                      .dwattr $C$DW$2053, DW_AT_accessibility(DW_ACCESS_public)
   15383              
   15384                      .dwendtag $C$DW$T$63
   15385              
   15386              $C$DW$T$69      .dwtag  DW_TAG_typedef
   15387                      .dwattr $C$DW$T$69, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
   15388                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$63)
   15389                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
   15390              
   15391              
   15392              $C$DW$T$64      .dwtag  DW_TAG_structure_type
   15393                      .dwattr $C$DW$T$64, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
   15394                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x0b)
   15395              $C$DW$2054      .dwtag  DW_TAG_member
   15396                      .dwattr $C$DW$2054, DW_AT_type(*$C$DW$T$42)
   15397                      .dwattr $C$DW$2054, DW_AT_name("FAULT")
   15398                      .dwattr $C$DW$2054, DW_AT_TI_symbol_name("_FAULT")
   15399                      .dwattr $C$DW$2054, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15400                      .dwattr $C$DW$2054, DW_AT_accessibility(DW_ACCESS_public)
   15401              
   15402              $C$DW$2055      .dwtag  DW_TAG_member
   15403                      .dwattr $C$DW$2055, DW_AT_type(*$C$DW$T$42)
   15404                      .dwattr $C$DW$2055, DW_AT_name("GVDD_UV")
   15405                      .dwattr $C$DW$2055, DW_AT_TI_symbol_name("_GVDD_UV")
   15406                      .dwattr $C$DW$2055, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15407                      .dwattr $C$DW$2055, DW_AT_accessibility(DW_ACCESS_public)
   15408              
   15409              $C$DW$2056      .dwtag  DW_TAG_member
   15410                      .dwattr $C$DW$2056, DW_AT_type(*$C$DW$T$42)
   15411                      .dwattr $C$DW$2056, DW_AT_name("PVDD_UV")
   15412                      .dwattr $C$DW$2056, DW_AT_TI_symbol_name("_PVDD_UV")
   15413                      .dwattr $C$DW$2056, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15414                      .dwattr $C$DW$2056, DW_AT_accessibility(DW_ACCESS_public)
   15415              
   15416              $C$DW$2057      .dwtag  DW_TAG_member
   15417                      .dwattr $C$DW$2057, DW_AT_type(*$C$DW$T$42)
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:14 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2F43222C-7D72-4821-A597-D2756DFFF658} PAGE  292

   15418                      .dwattr $C$DW$2057, DW_AT_name("OTSD")
   15419                      .dwattr $C$DW$2057, DW_AT_TI_symbol_name("_OTSD")
   15420                      .dwattr $C$DW$2057, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   15421                      .dwattr $C$DW$2057, DW_AT_accessibility(DW_ACCESS_public)
   15422              
   15423              $C$DW$2058      .dwtag  DW_TAG_member
   15424                      .dwattr $C$DW$2058, DW_AT_type(*$C$DW$T$42)
   15425                      .dwattr $C$DW$2058, DW_AT_name("OTW")
   15426                      .dwattr $C$DW$2058, DW_AT_TI_symbol_name("_OTW")
   15427                      .dwattr $C$DW$2058, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15428                      .dwattr $C$DW$2058, DW_AT_accessibility(DW_ACCESS_public)
   15429              
   15430              $C$DW$2059      .dwtag  DW_TAG_member
   15431                      .dwattr $C$DW$2059, DW_AT_type(*$C$DW$T$42)
   15432                      .dwattr $C$DW$2059, DW_AT_name("FETHA_OC")
   15433                      .dwattr $C$DW$2059, DW_AT_TI_symbol_name("_FETHA_OC")
   15434                      .dwattr $C$DW$2059, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   15435                      .dwattr $C$DW$2059, DW_AT_accessibility(DW_ACCESS_public)
   15436              
   15437              $C$DW$2060      .dwtag  DW_TAG_member
   15438                      .dwattr $C$DW$2060, DW_AT_type(*$C$DW$T$42)
   15439                      .dwattr $C$DW$2060, DW_AT_name("FETLA_OC")
   15440                      .dwattr $C$DW$2060, DW_AT_TI_symbol_name("_FETLA_OC")
   15441                      .dwattr $C$DW$2060, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15442                      .dwattr $C$DW$2060, DW_AT_accessibility(DW_ACCESS_public)
   15443              
   15444              $C$DW$2061      .dwtag  DW_TAG_member
   15445                      .dwattr $C$DW$2061, DW_AT_type(*$C$DW$T$42)
   15446                      .dwattr $C$DW$2061, DW_AT_name("FETHB_OC")
   15447                      .dwattr $C$DW$2061, DW_AT_TI_symbol_name("_FETHB_OC")
   15448                      .dwattr $C$DW$2061, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   15449                      .dwattr $C$DW$2061, DW_AT_accessibility(DW_ACCESS_public)
   15450              
   15451              $C$DW$2062      .dwtag  DW_TAG_member
   15452                      .dwattr $C$DW$2062, DW_AT_type(*$C$DW$T$42)
   15453                      .dwattr $C$DW$2062, DW_AT_name("FETLB_OC")
   15454                      .dwattr $C$DW$2062, DW_AT_TI_symbol_name("_FETLB_OC")
   15455                      .dwattr $C$DW$2062, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   15456                      .dwattr $C$DW$2062, DW_AT_accessibility(DW_ACCESS_public)
   15457              
   15458              $C$DW$2063      .dwtag  DW_TAG_member
   15459                      .dwattr $C$DW$2063, DW_AT_type(*$C$DW$T$42)
   15460                      .dwattr $C$DW$2063, DW_AT_name("FETHC_OC")
   15461                      .dwattr $C$DW$2063, DW_AT_TI_symbol_name("_FETHC_OC")
   15462                      .dwattr $C$DW$2063, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   15463                      .dwattr $C$DW$2063, DW_AT_accessibility(DW_ACCESS_public)
   15464              
   15465              $C$DW$2064      .dwtag  DW_TAG_member
   15466                      .dwattr $C$DW$2064, DW_AT_type(*$C$DW$T$42)
   15467                      .dwattr $C$DW$2064, DW_AT_name("FETLC_OC")
   15468                      .dwattr $C$DW$2064, DW_AT_TI_symbol_name("_FETLC_OC")
   15469                      .dwattr $C$DW$2064, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   15470                      .dwattr $C$DW$2064, DW_AT_accessibility(DW_ACCESS_public)
   15471              
   15472                      .dwendtag $C$DW$T$64
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:14 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2F43222C-7D72-4821-A597-D2756DFFF658} PAGE  293

   15473              
   15474              $C$DW$T$66      .dwtag  DW_TAG_typedef
   15475                      .dwattr $C$DW$T$66, DW_AT_name("DRV_SPI_8301_Stat1_t_")
   15476                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$64)
   15477                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
   15478              
   15479              
   15480              $C$DW$T$65      .dwtag  DW_TAG_structure_type
   15481                      .dwattr $C$DW$T$65, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
   15482                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x02)
   15483              $C$DW$2065      .dwtag  DW_TAG_member
   15484                      .dwattr $C$DW$2065, DW_AT_type(*$C$DW$T$42)
   15485                      .dwattr $C$DW$2065, DW_AT_name("GVDD_OV")
   15486                      .dwattr $C$DW$2065, DW_AT_TI_symbol_name("_GVDD_OV")
   15487                      .dwattr $C$DW$2065, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15488                      .dwattr $C$DW$2065, DW_AT_accessibility(DW_ACCESS_public)
   15489              
   15490              $C$DW$2066      .dwtag  DW_TAG_member
   15491                      .dwattr $C$DW$2066, DW_AT_type(*$C$DW$T$22)
   15492                      .dwattr $C$DW$2066, DW_AT_name("DeviceID")
   15493                      .dwattr $C$DW$2066, DW_AT_TI_symbol_name("_DeviceID")
   15494                      .dwattr $C$DW$2066, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15495                      .dwattr $C$DW$2066, DW_AT_accessibility(DW_ACCESS_public)
   15496              
   15497                      .dwendtag $C$DW$T$65
   15498              
   15499              $C$DW$T$67      .dwtag  DW_TAG_typedef
   15500                      .dwattr $C$DW$T$67, DW_AT_name("DRV_SPI_8301_Stat2_t_")
   15501                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$65)
   15502                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
   15503              
   15504              
   15505              $C$DW$T$70      .dwtag  DW_TAG_structure_type
   15506                      .dwattr $C$DW$T$70, DW_AT_name("_DRV_SPI_8301_Vars_t_")
   15507                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x18)
   15508              $C$DW$2067      .dwtag  DW_TAG_member
   15509                      .dwattr $C$DW$2067, DW_AT_type(*$C$DW$T$66)
   15510                      .dwattr $C$DW$2067, DW_AT_name("Stat_Reg_1")
   15511                      .dwattr $C$DW$2067, DW_AT_TI_symbol_name("_Stat_Reg_1")
   15512                      .dwattr $C$DW$2067, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15513                      .dwattr $C$DW$2067, DW_AT_accessibility(DW_ACCESS_public)
   15514              
   15515              $C$DW$2068      .dwtag  DW_TAG_member
   15516                      .dwattr $C$DW$2068, DW_AT_type(*$C$DW$T$67)
   15517                      .dwattr $C$DW$2068, DW_AT_name("Stat_Reg_2")
   15518                      .dwattr $C$DW$2068, DW_AT_TI_symbol_name("_Stat_Reg_2")
   15519                      .dwattr $C$DW$2068, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   15520                      .dwattr $C$DW$2068, DW_AT_accessibility(DW_ACCESS_public)
   15521              
   15522              $C$DW$2069      .dwtag  DW_TAG_member
   15523                      .dwattr $C$DW$2069, DW_AT_type(*$C$DW$T$68)
   15524                      .dwattr $C$DW$2069, DW_AT_name("Ctrl_Reg_1")
   15525                      .dwattr $C$DW$2069, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
   15526                      .dwattr $C$DW$2069, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   15527                      .dwattr $C$DW$2069, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:14 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2F43222C-7D72-4821-A597-D2756DFFF658} PAGE  294

   15528              
   15529              $C$DW$2070      .dwtag  DW_TAG_member
   15530                      .dwattr $C$DW$2070, DW_AT_type(*$C$DW$T$69)
   15531                      .dwattr $C$DW$2070, DW_AT_name("Ctrl_Reg_2")
   15532                      .dwattr $C$DW$2070, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
   15533                      .dwattr $C$DW$2070, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   15534                      .dwattr $C$DW$2070, DW_AT_accessibility(DW_ACCESS_public)
   15535              
   15536              $C$DW$2071      .dwtag  DW_TAG_member
   15537                      .dwattr $C$DW$2071, DW_AT_type(*$C$DW$T$42)
   15538                      .dwattr $C$DW$2071, DW_AT_name("SndCmd")
   15539                      .dwattr $C$DW$2071, DW_AT_TI_symbol_name("_SndCmd")
   15540                      .dwattr $C$DW$2071, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   15541                      .dwattr $C$DW$2071, DW_AT_accessibility(DW_ACCESS_public)
   15542              
   15543              $C$DW$2072      .dwtag  DW_TAG_member
   15544                      .dwattr $C$DW$2072, DW_AT_type(*$C$DW$T$42)
   15545                      .dwattr $C$DW$2072, DW_AT_name("RcvCmd")
   15546                      .dwattr $C$DW$2072, DW_AT_TI_symbol_name("_RcvCmd")
   15547                      .dwattr $C$DW$2072, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
   15548                      .dwattr $C$DW$2072, DW_AT_accessibility(DW_ACCESS_public)
   15549              
   15550                      .dwendtag $C$DW$T$70
   15551              
   15552              $C$DW$T$353     .dwtag  DW_TAG_typedef
   15553                      .dwattr $C$DW$T$353, DW_AT_name("DRV_SPI_8301_Vars_t")
   15554                      .dwattr $C$DW$T$353, DW_AT_type(*$C$DW$T$70)
   15555                      .dwattr $C$DW$T$353, DW_AT_language(DW_LANG_C)
   15556              
   15557              $C$DW$T$354     .dwtag  DW_TAG_pointer_type
   15558                      .dwattr $C$DW$T$354, DW_AT_type(*$C$DW$T$353)
   15559                      .dwattr $C$DW$T$354, DW_AT_address_class(0x20)
   15560              
   15561              
   15562              $C$DW$T$72      .dwtag  DW_TAG_structure_type
   15563                      .dwattr $C$DW$T$72, DW_AT_name("_FILTER_FO_")
   15564                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x0a)
   15565              $C$DW$2073      .dwtag  DW_TAG_member
   15566                      .dwattr $C$DW$2073, DW_AT_type(*$C$DW$T$71)
   15567                      .dwattr $C$DW$2073, DW_AT_name("a1")
   15568                      .dwattr $C$DW$2073, DW_AT_TI_symbol_name("_a1")
   15569                      .dwattr $C$DW$2073, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15570                      .dwattr $C$DW$2073, DW_AT_accessibility(DW_ACCESS_public)
   15571              
   15572              $C$DW$2074      .dwtag  DW_TAG_member
   15573                      .dwattr $C$DW$2074, DW_AT_type(*$C$DW$T$71)
   15574                      .dwattr $C$DW$2074, DW_AT_name("b0")
   15575                      .dwattr $C$DW$2074, DW_AT_TI_symbol_name("_b0")
   15576                      .dwattr $C$DW$2074, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15577                      .dwattr $C$DW$2074, DW_AT_accessibility(DW_ACCESS_public)
   15578              
   15579              $C$DW$2075      .dwtag  DW_TAG_member
   15580                      .dwattr $C$DW$2075, DW_AT_type(*$C$DW$T$71)
   15581                      .dwattr $C$DW$2075, DW_AT_name("b1")
   15582                      .dwattr $C$DW$2075, DW_AT_TI_symbol_name("_b1")
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:14 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2F43222C-7D72-4821-A597-D2756DFFF658} PAGE  295

   15583                      .dwattr $C$DW$2075, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15584                      .dwattr $C$DW$2075, DW_AT_accessibility(DW_ACCESS_public)
   15585              
   15586              $C$DW$2076      .dwtag  DW_TAG_member
   15587                      .dwattr $C$DW$2076, DW_AT_type(*$C$DW$T$71)
   15588                      .dwattr $C$DW$2076, DW_AT_name("x1")
   15589                      .dwattr $C$DW$2076, DW_AT_TI_symbol_name("_x1")
   15590                      .dwattr $C$DW$2076, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15591                      .dwattr $C$DW$2076, DW_AT_accessibility(DW_ACCESS_public)
   15592              
   15593              $C$DW$2077      .dwtag  DW_TAG_member
   15594                      .dwattr $C$DW$2077, DW_AT_type(*$C$DW$T$71)
   15595                      .dwattr $C$DW$2077, DW_AT_name("y1")
   15596                      .dwattr $C$DW$2077, DW_AT_TI_symbol_name("_y1")
   15597                      .dwattr $C$DW$2077, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   15598                      .dwattr $C$DW$2077, DW_AT_accessibility(DW_ACCESS_public)
   15599              
   15600                      .dwendtag $C$DW$T$72
   15601              
   15602              $C$DW$T$124     .dwtag  DW_TAG_typedef
   15603                      .dwattr $C$DW$T$124, DW_AT_name("FILTER_FO_Obj")
   15604                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$72)
   15605                      .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
   15606              
   15607              
   15608              $C$DW$T$19      .dwtag  DW_TAG_structure_type
   15609                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
   15610                      .dwattr $C$DW$T$19, DW_AT_declaration
   15611                      .dwendtag $C$DW$T$19
   15612              
   15613              $C$DW$T$125     .dwtag  DW_TAG_pointer_type
   15614                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$19)
   15615                      .dwattr $C$DW$T$125, DW_AT_address_class(0x20)
   15616              
   15617              $C$DW$T$126     .dwtag  DW_TAG_typedef
   15618                      .dwattr $C$DW$T$126, DW_AT_name("FILTER_FO_Handle")
   15619                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$125)
   15620                      .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
   15621              
   15622              
   15623              $C$DW$T$73      .dwtag  DW_TAG_structure_type
   15624                      .dwattr $C$DW$T$73, DW_AT_name("_FLASH_Obj_")
   15625                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x08)
   15626              $C$DW$2078      .dwtag  DW_TAG_member
   15627                      .dwattr $C$DW$2078, DW_AT_type(*$C$DW$T$23)
   15628                      .dwattr $C$DW$2078, DW_AT_name("FOPT")
   15629                      .dwattr $C$DW$2078, DW_AT_TI_symbol_name("_FOPT")
   15630                      .dwattr $C$DW$2078, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15631                      .dwattr $C$DW$2078, DW_AT_accessibility(DW_ACCESS_public)
   15632              
   15633              $C$DW$2079      .dwtag  DW_TAG_member
   15634                      .dwattr $C$DW$2079, DW_AT_type(*$C$DW$T$23)
   15635                      .dwattr $C$DW$2079, DW_AT_name("rsvd_1")
   15636                      .dwattr $C$DW$2079, DW_AT_TI_symbol_name("_rsvd_1")
   15637                      .dwattr $C$DW$2079, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:14 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2F43222C-7D72-4821-A597-D2756DFFF658} PAGE  296

   15638                      .dwattr $C$DW$2079, DW_AT_accessibility(DW_ACCESS_public)
   15639              
   15640              $C$DW$2080      .dwtag  DW_TAG_member
   15641                      .dwattr $C$DW$2080, DW_AT_type(*$C$DW$T$23)
   15642                      .dwattr $C$DW$2080, DW_AT_name("FPWR")
   15643                      .dwattr $C$DW$2080, DW_AT_TI_symbol_name("_FPWR")
   15644                      .dwattr $C$DW$2080, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15645                      .dwattr $C$DW$2080, DW_AT_accessibility(DW_ACCESS_public)
   15646              
   15647              $C$DW$2081      .dwtag  DW_TAG_member
   15648                      .dwattr $C$DW$2081, DW_AT_type(*$C$DW$T$23)
   15649                      .dwattr $C$DW$2081, DW_AT_name("FSTATUS")
   15650                      .dwattr $C$DW$2081, DW_AT_TI_symbol_name("_FSTATUS")
   15651                      .dwattr $C$DW$2081, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   15652                      .dwattr $C$DW$2081, DW_AT_accessibility(DW_ACCESS_public)
   15653              
   15654              $C$DW$2082      .dwtag  DW_TAG_member
   15655                      .dwattr $C$DW$2082, DW_AT_type(*$C$DW$T$23)
   15656                      .dwattr $C$DW$2082, DW_AT_name("FSTDBYWAIT")
   15657                      .dwattr $C$DW$2082, DW_AT_TI_symbol_name("_FSTDBYWAIT")
   15658                      .dwattr $C$DW$2082, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15659                      .dwattr $C$DW$2082, DW_AT_accessibility(DW_ACCESS_public)
   15660              
   15661              $C$DW$2083      .dwtag  DW_TAG_member
   15662                      .dwattr $C$DW$2083, DW_AT_type(*$C$DW$T$23)
   15663                      .dwattr $C$DW$2083, DW_AT_name("FACTIVEWAIT")
   15664                      .dwattr $C$DW$2083, DW_AT_TI_symbol_name("_FACTIVEWAIT")
   15665                      .dwattr $C$DW$2083, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   15666                      .dwattr $C$DW$2083, DW_AT_accessibility(DW_ACCESS_public)
   15667              
   15668              $C$DW$2084      .dwtag  DW_TAG_member
   15669                      .dwattr $C$DW$2084, DW_AT_type(*$C$DW$T$23)
   15670                      .dwattr $C$DW$2084, DW_AT_name("FBANKWAIT")
   15671                      .dwattr $C$DW$2084, DW_AT_TI_symbol_name("_FBANKWAIT")
   15672                      .dwattr $C$DW$2084, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15673                      .dwattr $C$DW$2084, DW_AT_accessibility(DW_ACCESS_public)
   15674              
   15675              $C$DW$2085      .dwtag  DW_TAG_member
   15676                      .dwattr $C$DW$2085, DW_AT_type(*$C$DW$T$23)
   15677                      .dwattr $C$DW$2085, DW_AT_name("FOTPWAIT")
   15678                      .dwattr $C$DW$2085, DW_AT_TI_symbol_name("_FOTPWAIT")
   15679                      .dwattr $C$DW$2085, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   15680                      .dwattr $C$DW$2085, DW_AT_accessibility(DW_ACCESS_public)
   15681              
   15682                      .dwendtag $C$DW$T$73
   15683              
   15684              $C$DW$T$94      .dwtag  DW_TAG_pointer_type
   15685                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$73)
   15686                      .dwattr $C$DW$T$94, DW_AT_address_class(0x20)
   15687              
   15688              $C$DW$T$95      .dwtag  DW_TAG_typedef
   15689                      .dwattr $C$DW$T$95, DW_AT_name("FLASH_Handle")
   15690                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
   15691                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
   15692              
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:14 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2F43222C-7D72-4821-A597-D2756DFFF658} PAGE  297

   15693              
   15694              $C$DW$T$79      .dwtag  DW_TAG_structure_type
   15695                      .dwattr $C$DW$T$79, DW_AT_name("_GPIO_Obj_")
   15696                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x6a)
   15697              $C$DW$2086      .dwtag  DW_TAG_member
   15698                      .dwattr $C$DW$2086, DW_AT_type(*$C$DW$T$76)
   15699                      .dwattr $C$DW$2086, DW_AT_name("GPACTRL")
   15700                      .dwattr $C$DW$2086, DW_AT_TI_symbol_name("_GPACTRL")
   15701                      .dwattr $C$DW$2086, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15702                      .dwattr $C$DW$2086, DW_AT_accessibility(DW_ACCESS_public)
   15703              
   15704              $C$DW$2087      .dwtag  DW_TAG_member
   15705                      .dwattr $C$DW$2087, DW_AT_type(*$C$DW$T$76)
   15706                      .dwattr $C$DW$2087, DW_AT_name("GPAQSEL1")
   15707                      .dwattr $C$DW$2087, DW_AT_TI_symbol_name("_GPAQSEL1")
   15708                      .dwattr $C$DW$2087, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15709                      .dwattr $C$DW$2087, DW_AT_accessibility(DW_ACCESS_public)
   15710              
   15711              $C$DW$2088      .dwtag  DW_TAG_member
   15712                      .dwattr $C$DW$2088, DW_AT_type(*$C$DW$T$76)
   15713                      .dwattr $C$DW$2088, DW_AT_name("GPAQSEL2")
   15714                      .dwattr $C$DW$2088, DW_AT_TI_symbol_name("_GPAQSEL2")
   15715                      .dwattr $C$DW$2088, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15716                      .dwattr $C$DW$2088, DW_AT_accessibility(DW_ACCESS_public)
   15717              
   15718              $C$DW$2089      .dwtag  DW_TAG_member
   15719                      .dwattr $C$DW$2089, DW_AT_type(*$C$DW$T$76)
   15720                      .dwattr $C$DW$2089, DW_AT_name("GPAMUX1")
   15721                      .dwattr $C$DW$2089, DW_AT_TI_symbol_name("_GPAMUX1")
   15722                      .dwattr $C$DW$2089, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15723                      .dwattr $C$DW$2089, DW_AT_accessibility(DW_ACCESS_public)
   15724              
   15725              $C$DW$2090      .dwtag  DW_TAG_member
   15726                      .dwattr $C$DW$2090, DW_AT_type(*$C$DW$T$76)
   15727                      .dwattr $C$DW$2090, DW_AT_name("GPAMUX2")
   15728                      .dwattr $C$DW$2090, DW_AT_TI_symbol_name("_GPAMUX2")
   15729                      .dwattr $C$DW$2090, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   15730                      .dwattr $C$DW$2090, DW_AT_accessibility(DW_ACCESS_public)
   15731              
   15732              $C$DW$2091      .dwtag  DW_TAG_member
   15733                      .dwattr $C$DW$2091, DW_AT_type(*$C$DW$T$76)
   15734                      .dwattr $C$DW$2091, DW_AT_name("GPADIR")
   15735                      .dwattr $C$DW$2091, DW_AT_TI_symbol_name("_GPADIR")
   15736                      .dwattr $C$DW$2091, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   15737                      .dwattr $C$DW$2091, DW_AT_accessibility(DW_ACCESS_public)
   15738              
   15739              $C$DW$2092      .dwtag  DW_TAG_member
   15740                      .dwattr $C$DW$2092, DW_AT_type(*$C$DW$T$76)
   15741                      .dwattr $C$DW$2092, DW_AT_name("GPAPUD")
   15742                      .dwattr $C$DW$2092, DW_AT_TI_symbol_name("_GPAPUD")
   15743                      .dwattr $C$DW$2092, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   15744                      .dwattr $C$DW$2092, DW_AT_accessibility(DW_ACCESS_public)
   15745              
   15746              $C$DW$2093      .dwtag  DW_TAG_member
   15747                      .dwattr $C$DW$2093, DW_AT_type(*$C$DW$T$26)
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:14 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2F43222C-7D72-4821-A597-D2756DFFF658} PAGE  298

   15748                      .dwattr $C$DW$2093, DW_AT_name("rsvd_1")
   15749                      .dwattr $C$DW$2093, DW_AT_TI_symbol_name("_rsvd_1")
   15750                      .dwattr $C$DW$2093, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   15751                      .dwattr $C$DW$2093, DW_AT_accessibility(DW_ACCESS_public)
   15752              
   15753              $C$DW$2094      .dwtag  DW_TAG_member
   15754                      .dwattr $C$DW$2094, DW_AT_type(*$C$DW$T$76)
   15755                      .dwattr $C$DW$2094, DW_AT_name("GPBCTRL")
   15756                      .dwattr $C$DW$2094, DW_AT_TI_symbol_name("_GPBCTRL")
   15757                      .dwattr $C$DW$2094, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   15758                      .dwattr $C$DW$2094, DW_AT_accessibility(DW_ACCESS_public)
   15759              
   15760              $C$DW$2095      .dwtag  DW_TAG_member
   15761                      .dwattr $C$DW$2095, DW_AT_type(*$C$DW$T$76)
   15762                      .dwattr $C$DW$2095, DW_AT_name("GPBQSEL1")
   15763                      .dwattr $C$DW$2095, DW_AT_TI_symbol_name("_GPBQSEL1")
   15764                      .dwattr $C$DW$2095, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   15765                      .dwattr $C$DW$2095, DW_AT_accessibility(DW_ACCESS_public)
   15766              
   15767              $C$DW$2096      .dwtag  DW_TAG_member
   15768                      .dwattr $C$DW$2096, DW_AT_type(*$C$DW$T$76)
   15769                      .dwattr $C$DW$2096, DW_AT_name("GPBQSEL2")
   15770                      .dwattr $C$DW$2096, DW_AT_TI_symbol_name("_GPBQSEL2")
   15771                      .dwattr $C$DW$2096, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   15772                      .dwattr $C$DW$2096, DW_AT_accessibility(DW_ACCESS_public)
   15773              
   15774              $C$DW$2097      .dwtag  DW_TAG_member
   15775                      .dwattr $C$DW$2097, DW_AT_type(*$C$DW$T$76)
   15776                      .dwattr $C$DW$2097, DW_AT_name("GPBMUX1")
   15777                      .dwattr $C$DW$2097, DW_AT_TI_symbol_name("_GPBMUX1")
   15778                      .dwattr $C$DW$2097, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   15779                      .dwattr $C$DW$2097, DW_AT_accessibility(DW_ACCESS_public)
   15780              
   15781              $C$DW$2098      .dwtag  DW_TAG_member
   15782                      .dwattr $C$DW$2098, DW_AT_type(*$C$DW$T$76)
   15783                      .dwattr $C$DW$2098, DW_AT_name("GPBMUX2")
   15784                      .dwattr $C$DW$2098, DW_AT_TI_symbol_name("_GPBMUX2")
   15785                      .dwattr $C$DW$2098, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   15786                      .dwattr $C$DW$2098, DW_AT_accessibility(DW_ACCESS_public)
   15787              
   15788              $C$DW$2099      .dwtag  DW_TAG_member
   15789                      .dwattr $C$DW$2099, DW_AT_type(*$C$DW$T$76)
   15790                      .dwattr $C$DW$2099, DW_AT_name("GPBDIR")
   15791                      .dwattr $C$DW$2099, DW_AT_TI_symbol_name("_GPBDIR")
   15792                      .dwattr $C$DW$2099, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   15793                      .dwattr $C$DW$2099, DW_AT_accessibility(DW_ACCESS_public)
   15794              
   15795              $C$DW$2100      .dwtag  DW_TAG_member
   15796                      .dwattr $C$DW$2100, DW_AT_type(*$C$DW$T$76)
   15797                      .dwattr $C$DW$2100, DW_AT_name("GPBPUD")
   15798                      .dwattr $C$DW$2100, DW_AT_TI_symbol_name("_GPBPUD")
   15799                      .dwattr $C$DW$2100, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   15800                      .dwattr $C$DW$2100, DW_AT_accessibility(DW_ACCESS_public)
   15801              
   15802              $C$DW$2101      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:14 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2F43222C-7D72-4821-A597-D2756DFFF658} PAGE  299

   15803                      .dwattr $C$DW$2101, DW_AT_type(*$C$DW$T$77)
   15804                      .dwattr $C$DW$2101, DW_AT_name("rsvd_4")
   15805                      .dwattr $C$DW$2101, DW_AT_TI_symbol_name("_rsvd_4")
   15806                      .dwattr $C$DW$2101, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   15807                      .dwattr $C$DW$2101, DW_AT_accessibility(DW_ACCESS_public)
   15808              
   15809              $C$DW$2102      .dwtag  DW_TAG_member
   15810                      .dwattr $C$DW$2102, DW_AT_type(*$C$DW$T$76)
   15811                      .dwattr $C$DW$2102, DW_AT_name("AIOMUX1")
   15812                      .dwattr $C$DW$2102, DW_AT_TI_symbol_name("_AIOMUX1")
   15813                      .dwattr $C$DW$2102, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   15814                      .dwattr $C$DW$2102, DW_AT_accessibility(DW_ACCESS_public)
   15815              
   15816              $C$DW$2103      .dwtag  DW_TAG_member
   15817                      .dwattr $C$DW$2103, DW_AT_type(*$C$DW$T$26)
   15818                      .dwattr $C$DW$2103, DW_AT_name("rsvd_5")
   15819                      .dwattr $C$DW$2103, DW_AT_TI_symbol_name("_rsvd_5")
   15820                      .dwattr $C$DW$2103, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   15821                      .dwattr $C$DW$2103, DW_AT_accessibility(DW_ACCESS_public)
   15822              
   15823              $C$DW$2104      .dwtag  DW_TAG_member
   15824                      .dwattr $C$DW$2104, DW_AT_type(*$C$DW$T$76)
   15825                      .dwattr $C$DW$2104, DW_AT_name("AIODIR")
   15826                      .dwattr $C$DW$2104, DW_AT_TI_symbol_name("_AIODIR")
   15827                      .dwattr $C$DW$2104, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   15828                      .dwattr $C$DW$2104, DW_AT_accessibility(DW_ACCESS_public)
   15829              
   15830              $C$DW$2105      .dwtag  DW_TAG_member
   15831                      .dwattr $C$DW$2105, DW_AT_type(*$C$DW$T$78)
   15832                      .dwattr $C$DW$2105, DW_AT_name("rsvd_6")
   15833                      .dwattr $C$DW$2105, DW_AT_TI_symbol_name("_rsvd_6")
   15834                      .dwattr $C$DW$2105, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   15835                      .dwattr $C$DW$2105, DW_AT_accessibility(DW_ACCESS_public)
   15836              
   15837              $C$DW$2106      .dwtag  DW_TAG_member
   15838                      .dwattr $C$DW$2106, DW_AT_type(*$C$DW$T$76)
   15839                      .dwattr $C$DW$2106, DW_AT_name("GPADAT")
   15840                      .dwattr $C$DW$2106, DW_AT_TI_symbol_name("_GPADAT")
   15841                      .dwattr $C$DW$2106, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   15842                      .dwattr $C$DW$2106, DW_AT_accessibility(DW_ACCESS_public)
   15843              
   15844              $C$DW$2107      .dwtag  DW_TAG_member
   15845                      .dwattr $C$DW$2107, DW_AT_type(*$C$DW$T$76)
   15846                      .dwattr $C$DW$2107, DW_AT_name("GPASET")
   15847                      .dwattr $C$DW$2107, DW_AT_TI_symbol_name("_GPASET")
   15848                      .dwattr $C$DW$2107, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   15849                      .dwattr $C$DW$2107, DW_AT_accessibility(DW_ACCESS_public)
   15850              
   15851              $C$DW$2108      .dwtag  DW_TAG_member
   15852                      .dwattr $C$DW$2108, DW_AT_type(*$C$DW$T$76)
   15853                      .dwattr $C$DW$2108, DW_AT_name("GPACLEAR")
   15854                      .dwattr $C$DW$2108, DW_AT_TI_symbol_name("_GPACLEAR")
   15855                      .dwattr $C$DW$2108, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   15856                      .dwattr $C$DW$2108, DW_AT_accessibility(DW_ACCESS_public)
   15857              
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:14 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2F43222C-7D72-4821-A597-D2756DFFF658} PAGE  300

   15858              $C$DW$2109      .dwtag  DW_TAG_member
   15859                      .dwattr $C$DW$2109, DW_AT_type(*$C$DW$T$76)
   15860                      .dwattr $C$DW$2109, DW_AT_name("GPATOGGLE")
   15861                      .dwattr $C$DW$2109, DW_AT_TI_symbol_name("_GPATOGGLE")
   15862                      .dwattr $C$DW$2109, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   15863                      .dwattr $C$DW$2109, DW_AT_accessibility(DW_ACCESS_public)
   15864              
   15865              $C$DW$2110      .dwtag  DW_TAG_member
   15866                      .dwattr $C$DW$2110, DW_AT_type(*$C$DW$T$76)
   15867                      .dwattr $C$DW$2110, DW_AT_name("GPBDAT")
   15868                      .dwattr $C$DW$2110, DW_AT_TI_symbol_name("_GPBDAT")
   15869                      .dwattr $C$DW$2110, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   15870                      .dwattr $C$DW$2110, DW_AT_accessibility(DW_ACCESS_public)
   15871              
   15872              $C$DW$2111      .dwtag  DW_TAG_member
   15873                      .dwattr $C$DW$2111, DW_AT_type(*$C$DW$T$76)
   15874                      .dwattr $C$DW$2111, DW_AT_name("GPBSET")
   15875                      .dwattr $C$DW$2111, DW_AT_TI_symbol_name("_GPBSET")
   15876                      .dwattr $C$DW$2111, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   15877                      .dwattr $C$DW$2111, DW_AT_accessibility(DW_ACCESS_public)
   15878              
   15879              $C$DW$2112      .dwtag  DW_TAG_member
   15880                      .dwattr $C$DW$2112, DW_AT_type(*$C$DW$T$76)
   15881                      .dwattr $C$DW$2112, DW_AT_name("GPBCLEAR")
   15882                      .dwattr $C$DW$2112, DW_AT_TI_symbol_name("_GPBCLEAR")
   15883                      .dwattr $C$DW$2112, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   15884                      .dwattr $C$DW$2112, DW_AT_accessibility(DW_ACCESS_public)
   15885              
   15886              $C$DW$2113      .dwtag  DW_TAG_member
   15887                      .dwattr $C$DW$2113, DW_AT_type(*$C$DW$T$76)
   15888                      .dwattr $C$DW$2113, DW_AT_name("GPBTOGGLE")
   15889                      .dwattr $C$DW$2113, DW_AT_TI_symbol_name("_GPBTOGGLE")
   15890                      .dwattr $C$DW$2113, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   15891                      .dwattr $C$DW$2113, DW_AT_accessibility(DW_ACCESS_public)
   15892              
   15893              $C$DW$2114      .dwtag  DW_TAG_member
   15894                      .dwattr $C$DW$2114, DW_AT_type(*$C$DW$T$31)
   15895                      .dwattr $C$DW$2114, DW_AT_name("rsvd_7")
   15896                      .dwattr $C$DW$2114, DW_AT_TI_symbol_name("_rsvd_7")
   15897                      .dwattr $C$DW$2114, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   15898                      .dwattr $C$DW$2114, DW_AT_accessibility(DW_ACCESS_public)
   15899              
   15900              $C$DW$2115      .dwtag  DW_TAG_member
   15901                      .dwattr $C$DW$2115, DW_AT_type(*$C$DW$T$76)
   15902                      .dwattr $C$DW$2115, DW_AT_name("AIODAT")
   15903                      .dwattr $C$DW$2115, DW_AT_TI_symbol_name("_AIODAT")
   15904                      .dwattr $C$DW$2115, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
   15905                      .dwattr $C$DW$2115, DW_AT_accessibility(DW_ACCESS_public)
   15906              
   15907              $C$DW$2116      .dwtag  DW_TAG_member
   15908                      .dwattr $C$DW$2116, DW_AT_type(*$C$DW$T$76)
   15909                      .dwattr $C$DW$2116, DW_AT_name("AIOSET")
   15910                      .dwattr $C$DW$2116, DW_AT_TI_symbol_name("_AIOSET")
   15911                      .dwattr $C$DW$2116, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   15912                      .dwattr $C$DW$2116, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:14 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2F43222C-7D72-4821-A597-D2756DFFF658} PAGE  301

   15913              
   15914              $C$DW$2117      .dwtag  DW_TAG_member
   15915                      .dwattr $C$DW$2117, DW_AT_type(*$C$DW$T$76)
   15916                      .dwattr $C$DW$2117, DW_AT_name("AIOCLEAR")
   15917                      .dwattr $C$DW$2117, DW_AT_TI_symbol_name("_AIOCLEAR")
   15918                      .dwattr $C$DW$2117, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   15919                      .dwattr $C$DW$2117, DW_AT_accessibility(DW_ACCESS_public)
   15920              
   15921              $C$DW$2118      .dwtag  DW_TAG_member
   15922                      .dwattr $C$DW$2118, DW_AT_type(*$C$DW$T$76)
   15923                      .dwattr $C$DW$2118, DW_AT_name("AIOTOGGLE")
   15924                      .dwattr $C$DW$2118, DW_AT_TI_symbol_name("_AIOTOGGLE")
   15925                      .dwattr $C$DW$2118, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   15926                      .dwattr $C$DW$2118, DW_AT_accessibility(DW_ACCESS_public)
   15927              
   15928              $C$DW$2119      .dwtag  DW_TAG_member
   15929                      .dwattr $C$DW$2119, DW_AT_type(*$C$DW$T$28)
   15930                      .dwattr $C$DW$2119, DW_AT_name("GPIOXINTnSEL")
   15931                      .dwattr $C$DW$2119, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
   15932                      .dwattr $C$DW$2119, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   15933                      .dwattr $C$DW$2119, DW_AT_accessibility(DW_ACCESS_public)
   15934              
   15935              $C$DW$2120      .dwtag  DW_TAG_member
   15936                      .dwattr $C$DW$2120, DW_AT_type(*$C$DW$T$27)
   15937                      .dwattr $C$DW$2120, DW_AT_name("rsvd_8")
   15938                      .dwattr $C$DW$2120, DW_AT_TI_symbol_name("_rsvd_8")
   15939                      .dwattr $C$DW$2120, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   15940                      .dwattr $C$DW$2120, DW_AT_accessibility(DW_ACCESS_public)
   15941              
   15942              $C$DW$2121      .dwtag  DW_TAG_member
   15943                      .dwattr $C$DW$2121, DW_AT_type(*$C$DW$T$76)
   15944                      .dwattr $C$DW$2121, DW_AT_name("GPIOLPMSEL")
   15945                      .dwattr $C$DW$2121, DW_AT_TI_symbol_name("_GPIOLPMSEL")
   15946                      .dwattr $C$DW$2121, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   15947                      .dwattr $C$DW$2121, DW_AT_accessibility(DW_ACCESS_public)
   15948              
   15949                      .dwendtag $C$DW$T$79
   15950              
   15951              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
   15952                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$79)
   15953                      .dwattr $C$DW$T$38, DW_AT_address_class(0x20)
   15954              
   15955              $C$DW$T$39      .dwtag  DW_TAG_typedef
   15956                      .dwattr $C$DW$T$39, DW_AT_name("GPIO_Handle")
   15957                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
   15958                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
   15959              
   15960              
   15961              $C$DW$T$81      .dwtag  DW_TAG_structure_type
   15962                      .dwattr $C$DW$T$81, DW_AT_name("_HAL_AdcData_t_")
   15963                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x0e)
   15964              $C$DW$2122      .dwtag  DW_TAG_member
   15965                      .dwattr $C$DW$2122, DW_AT_type(*$C$DW$T$80)
   15966                      .dwattr $C$DW$2122, DW_AT_name("I")
   15967                      .dwattr $C$DW$2122, DW_AT_TI_symbol_name("_I")
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:14 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2F43222C-7D72-4821-A597-D2756DFFF658} PAGE  302

   15968                      .dwattr $C$DW$2122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15969                      .dwattr $C$DW$2122, DW_AT_accessibility(DW_ACCESS_public)
   15970              
   15971              $C$DW$2123      .dwtag  DW_TAG_member
   15972                      .dwattr $C$DW$2123, DW_AT_type(*$C$DW$T$80)
   15973                      .dwattr $C$DW$2123, DW_AT_name("V")
   15974                      .dwattr $C$DW$2123, DW_AT_TI_symbol_name("_V")
   15975                      .dwattr $C$DW$2123, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15976                      .dwattr $C$DW$2123, DW_AT_accessibility(DW_ACCESS_public)
   15977              
   15978              $C$DW$2124      .dwtag  DW_TAG_member
   15979                      .dwattr $C$DW$2124, DW_AT_type(*$C$DW$T$71)
   15980                      .dwattr $C$DW$2124, DW_AT_name("dcBus")
   15981                      .dwattr $C$DW$2124, DW_AT_TI_symbol_name("_dcBus")
   15982                      .dwattr $C$DW$2124, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   15983                      .dwattr $C$DW$2124, DW_AT_accessibility(DW_ACCESS_public)
   15984              
   15985                      .dwendtag $C$DW$T$81
   15986              
   15987              $C$DW$T$117     .dwtag  DW_TAG_typedef
   15988                      .dwattr $C$DW$T$117, DW_AT_name("HAL_AdcData_t")
   15989                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$81)
   15990                      .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
   15991              
   15992              
   15993              $C$DW$T$87      .dwtag  DW_TAG_structure_type
   15994                      .dwattr $C$DW$T$87, DW_AT_name("_HAL_DacData_t_")
   15995                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x22)
   15996              $C$DW$2125      .dwtag  DW_TAG_member
   15997                      .dwattr $C$DW$2125, DW_AT_type(*$C$DW$T$22)
   15998                      .dwattr $C$DW$2125, DW_AT_name("PeriodMax")
   15999                      .dwattr $C$DW$2125, DW_AT_TI_symbol_name("_PeriodMax")
   16000                      .dwattr $C$DW$2125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16001                      .dwattr $C$DW$2125, DW_AT_accessibility(DW_ACCESS_public)
   16002              
   16003              $C$DW$2126      .dwtag  DW_TAG_member
   16004                      .dwattr $C$DW$2126, DW_AT_type(*$C$DW$T$85)
   16005                      .dwattr $C$DW$2126, DW_AT_name("ptrData")
   16006                      .dwattr $C$DW$2126, DW_AT_TI_symbol_name("_ptrData")
   16007                      .dwattr $C$DW$2126, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16008                      .dwattr $C$DW$2126, DW_AT_accessibility(DW_ACCESS_public)
   16009              
   16010              $C$DW$2127      .dwtag  DW_TAG_member
   16011                      .dwattr $C$DW$2127, DW_AT_type(*$C$DW$T$86)
   16012                      .dwattr $C$DW$2127, DW_AT_name("value")
   16013                      .dwattr $C$DW$2127, DW_AT_TI_symbol_name("_value")
   16014                      .dwattr $C$DW$2127, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   16015                      .dwattr $C$DW$2127, DW_AT_accessibility(DW_ACCESS_public)
   16016              
   16017              $C$DW$2128      .dwtag  DW_TAG_member
   16018                      .dwattr $C$DW$2128, DW_AT_type(*$C$DW$T$86)
   16019                      .dwattr $C$DW$2128, DW_AT_name("offset")
   16020                      .dwattr $C$DW$2128, DW_AT_TI_symbol_name("_offset")
   16021                      .dwattr $C$DW$2128, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   16022                      .dwattr $C$DW$2128, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:14 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2F43222C-7D72-4821-A597-D2756DFFF658} PAGE  303

   16023              
   16024              $C$DW$2129      .dwtag  DW_TAG_member
   16025                      .dwattr $C$DW$2129, DW_AT_type(*$C$DW$T$86)
   16026                      .dwattr $C$DW$2129, DW_AT_name("gain")
   16027                      .dwattr $C$DW$2129, DW_AT_TI_symbol_name("_gain")
   16028                      .dwattr $C$DW$2129, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   16029                      .dwattr $C$DW$2129, DW_AT_accessibility(DW_ACCESS_public)
   16030              
   16031                      .dwendtag $C$DW$T$87
   16032              
   16033              $C$DW$T$364     .dwtag  DW_TAG_typedef
   16034                      .dwattr $C$DW$T$364, DW_AT_name("HAL_DacData_t")
   16035                      .dwattr $C$DW$T$364, DW_AT_type(*$C$DW$T$87)
   16036                      .dwattr $C$DW$T$364, DW_AT_language(DW_LANG_C)
   16037              
   16038              $C$DW$T$365     .dwtag  DW_TAG_pointer_type
   16039                      .dwattr $C$DW$T$365, DW_AT_type(*$C$DW$T$364)
   16040                      .dwattr $C$DW$T$365, DW_AT_address_class(0x20)
   16041              
   16042              $C$DW$2130      .dwtag  DW_TAG_TI_far_type
   16043                      .dwattr $C$DW$2130, DW_AT_type(*$C$DW$T$365)
   16044              
   16045              $C$DW$T$366     .dwtag  DW_TAG_const_type
   16046                      .dwattr $C$DW$T$366, DW_AT_type(*$C$DW$2130)
   16047              
   16048              
   16049              $C$DW$T$121     .dwtag  DW_TAG_structure_type
   16050                      .dwattr $C$DW$T$121, DW_AT_name("_HAL_Obj_")
   16051                      .dwattr $C$DW$T$121, DW_AT_byte_size(0xa8)
   16052              $C$DW$2131      .dwtag  DW_TAG_member
   16053                      .dwattr $C$DW$2131, DW_AT_type(*$C$DW$T$89)
   16054                      .dwattr $C$DW$2131, DW_AT_name("adcHandle")
   16055                      .dwattr $C$DW$2131, DW_AT_TI_symbol_name("_adcHandle")
   16056                      .dwattr $C$DW$2131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16057                      .dwattr $C$DW$2131, DW_AT_accessibility(DW_ACCESS_public)
   16058              
   16059              $C$DW$2132      .dwtag  DW_TAG_member
   16060                      .dwattr $C$DW$2132, DW_AT_type(*$C$DW$T$91)
   16061                      .dwattr $C$DW$2132, DW_AT_name("clkHandle")
   16062                      .dwattr $C$DW$2132, DW_AT_TI_symbol_name("_clkHandle")
   16063                      .dwattr $C$DW$2132, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16064                      .dwattr $C$DW$2132, DW_AT_accessibility(DW_ACCESS_public)
   16065              
   16066              $C$DW$2133      .dwtag  DW_TAG_member
   16067                      .dwattr $C$DW$2133, DW_AT_type(*$C$DW$T$93)
   16068                      .dwattr $C$DW$2133, DW_AT_name("cpuHandle")
   16069                      .dwattr $C$DW$2133, DW_AT_TI_symbol_name("_cpuHandle")
   16070                      .dwattr $C$DW$2133, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16071                      .dwattr $C$DW$2133, DW_AT_accessibility(DW_ACCESS_public)
   16072              
   16073              $C$DW$2134      .dwtag  DW_TAG_member
   16074                      .dwattr $C$DW$2134, DW_AT_type(*$C$DW$T$95)
   16075                      .dwattr $C$DW$2134, DW_AT_name("flashHandle")
   16076                      .dwattr $C$DW$2134, DW_AT_TI_symbol_name("_flashHandle")
   16077                      .dwattr $C$DW$2134, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:14 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2F43222C-7D72-4821-A597-D2756DFFF658} PAGE  304

   16078                      .dwattr $C$DW$2134, DW_AT_accessibility(DW_ACCESS_public)
   16079              
   16080              $C$DW$2135      .dwtag  DW_TAG_member
   16081                      .dwattr $C$DW$2135, DW_AT_type(*$C$DW$T$39)
   16082                      .dwattr $C$DW$2135, DW_AT_name("gpioHandle")
   16083                      .dwattr $C$DW$2135, DW_AT_TI_symbol_name("_gpioHandle")
   16084                      .dwattr $C$DW$2135, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   16085                      .dwattr $C$DW$2135, DW_AT_accessibility(DW_ACCESS_public)
   16086              
   16087              $C$DW$2136      .dwtag  DW_TAG_member
   16088                      .dwattr $C$DW$2136, DW_AT_type(*$C$DW$T$98)
   16089                      .dwattr $C$DW$2136, DW_AT_name("offsetHandle_I")
   16090                      .dwattr $C$DW$2136, DW_AT_TI_symbol_name("_offsetHandle_I")
   16091                      .dwattr $C$DW$2136, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   16092                      .dwattr $C$DW$2136, DW_AT_accessibility(DW_ACCESS_public)
   16093              
   16094              $C$DW$2137      .dwtag  DW_TAG_member
   16095                      .dwattr $C$DW$2137, DW_AT_type(*$C$DW$T$100)
   16096                      .dwattr $C$DW$2137, DW_AT_name("offset_I")
   16097                      .dwattr $C$DW$2137, DW_AT_TI_symbol_name("_offset_I")
   16098                      .dwattr $C$DW$2137, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   16099                      .dwattr $C$DW$2137, DW_AT_accessibility(DW_ACCESS_public)
   16100              
   16101              $C$DW$2138      .dwtag  DW_TAG_member
   16102                      .dwattr $C$DW$2138, DW_AT_type(*$C$DW$T$98)
   16103                      .dwattr $C$DW$2138, DW_AT_name("offsetHandle_V")
   16104                      .dwattr $C$DW$2138, DW_AT_TI_symbol_name("_offsetHandle_V")
   16105                      .dwattr $C$DW$2138, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   16106                      .dwattr $C$DW$2138, DW_AT_accessibility(DW_ACCESS_public)
   16107              
   16108              $C$DW$2139      .dwtag  DW_TAG_member
   16109                      .dwattr $C$DW$2139, DW_AT_type(*$C$DW$T$100)
   16110                      .dwattr $C$DW$2139, DW_AT_name("offset_V")
   16111                      .dwattr $C$DW$2139, DW_AT_TI_symbol_name("_offset_V")
   16112                      .dwattr $C$DW$2139, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   16113                      .dwattr $C$DW$2139, DW_AT_accessibility(DW_ACCESS_public)
   16114              
   16115              $C$DW$2140      .dwtag  DW_TAG_member
   16116                      .dwattr $C$DW$2140, DW_AT_type(*$C$DW$T$102)
   16117                      .dwattr $C$DW$2140, DW_AT_name("oscHandle")
   16118                      .dwattr $C$DW$2140, DW_AT_TI_symbol_name("_oscHandle")
   16119                      .dwattr $C$DW$2140, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
   16120                      .dwattr $C$DW$2140, DW_AT_accessibility(DW_ACCESS_public)
   16121              
   16122              $C$DW$2141      .dwtag  DW_TAG_member
   16123                      .dwattr $C$DW$2141, DW_AT_type(*$C$DW$T$104)
   16124                      .dwattr $C$DW$2141, DW_AT_name("pieHandle")
   16125                      .dwattr $C$DW$2141, DW_AT_TI_symbol_name("_pieHandle")
   16126                      .dwattr $C$DW$2141, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
   16127                      .dwattr $C$DW$2141, DW_AT_accessibility(DW_ACCESS_public)
   16128              
   16129              $C$DW$2142      .dwtag  DW_TAG_member
   16130                      .dwattr $C$DW$2142, DW_AT_type(*$C$DW$T$106)
   16131                      .dwattr $C$DW$2142, DW_AT_name("pllHandle")
   16132                      .dwattr $C$DW$2142, DW_AT_TI_symbol_name("_pllHandle")
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:14 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2F43222C-7D72-4821-A597-D2756DFFF658} PAGE  305

   16133                      .dwattr $C$DW$2142, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
   16134                      .dwattr $C$DW$2142, DW_AT_accessibility(DW_ACCESS_public)
   16135              
   16136              $C$DW$2143      .dwtag  DW_TAG_member
   16137                      .dwattr $C$DW$2143, DW_AT_type(*$C$DW$T$109)
   16138                      .dwattr $C$DW$2143, DW_AT_name("pwmHandle")
   16139                      .dwattr $C$DW$2143, DW_AT_TI_symbol_name("_pwmHandle")
   16140                      .dwattr $C$DW$2143, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
   16141                      .dwattr $C$DW$2143, DW_AT_accessibility(DW_ACCESS_public)
   16142              
   16143              $C$DW$2144      .dwtag  DW_TAG_member
   16144                      .dwattr $C$DW$2144, DW_AT_type(*$C$DW$T$109)
   16145                      .dwattr $C$DW$2144, DW_AT_name("pwmDacHandle")
   16146                      .dwattr $C$DW$2144, DW_AT_TI_symbol_name("_pwmDacHandle")
   16147                      .dwattr $C$DW$2144, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
   16148                      .dwattr $C$DW$2144, DW_AT_accessibility(DW_ACCESS_public)
   16149              
   16150              $C$DW$2145      .dwtag  DW_TAG_member
   16151                      .dwattr $C$DW$2145, DW_AT_type(*$C$DW$T$111)
   16152                      .dwattr $C$DW$2145, DW_AT_name("pwrHandle")
   16153                      .dwattr $C$DW$2145, DW_AT_TI_symbol_name("_pwrHandle")
   16154                      .dwattr $C$DW$2145, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
   16155                      .dwattr $C$DW$2145, DW_AT_accessibility(DW_ACCESS_public)
   16156              
   16157              $C$DW$2146      .dwtag  DW_TAG_member
   16158                      .dwattr $C$DW$2146, DW_AT_type(*$C$DW$T$114)
   16159                      .dwattr $C$DW$2146, DW_AT_name("timerHandle")
   16160                      .dwattr $C$DW$2146, DW_AT_TI_symbol_name("_timerHandle")
   16161                      .dwattr $C$DW$2146, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
   16162                      .dwattr $C$DW$2146, DW_AT_accessibility(DW_ACCESS_public)
   16163              
   16164              $C$DW$2147      .dwtag  DW_TAG_member
   16165                      .dwattr $C$DW$2147, DW_AT_type(*$C$DW$T$116)
   16166                      .dwattr $C$DW$2147, DW_AT_name("wdogHandle")
   16167                      .dwattr $C$DW$2147, DW_AT_TI_symbol_name("_wdogHandle")
   16168                      .dwattr $C$DW$2147, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
   16169                      .dwattr $C$DW$2147, DW_AT_accessibility(DW_ACCESS_public)
   16170              
   16171              $C$DW$2148      .dwtag  DW_TAG_member
   16172                      .dwattr $C$DW$2148, DW_AT_type(*$C$DW$T$117)
   16173                      .dwattr $C$DW$2148, DW_AT_name("adcBias")
   16174                      .dwattr $C$DW$2148, DW_AT_TI_symbol_name("_adcBias")
   16175                      .dwattr $C$DW$2148, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
   16176                      .dwattr $C$DW$2148, DW_AT_accessibility(DW_ACCESS_public)
   16177              
