TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6E84BD55-4A6E-4AD4-B709-882166819E08} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                             PC v18.12.4.LTS *
       3              ;* Date/Time created: Tue Jan 31 14:49:19 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_18/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v18.12.4.LTS Copyright (c) 1996-
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    6254                      .dwattr $C$DW$656, DW_AT_const_value(0x01)
    6255              
    6256              $C$DW$657       .dwtag  DW_TAG_enumerator
    6257                      .dwattr $C$DW$657, DW_AT_name("PIE_GroupNumber_3")
    6258                      .dwattr $C$DW$657, DW_AT_const_value(0x02)
    6259              
    6260              $C$DW$658       .dwtag  DW_TAG_enumerator
    6261                      .dwattr $C$DW$658, DW_AT_name("PIE_GroupNumber_4")
    6262                      .dwattr $C$DW$658, DW_AT_const_value(0x03)
    6263              
    6264              $C$DW$659       .dwtag  DW_TAG_enumerator
    6265                      .dwattr $C$DW$659, DW_AT_name("PIE_GroupNumber_5")
    6266                      .dwattr $C$DW$659, DW_AT_const_value(0x04)
    6267              
    6268              $C$DW$660       .dwtag  DW_TAG_enumerator
    6269                      .dwattr $C$DW$660, DW_AT_name("PIE_GroupNumber_6")
    6270                      .dwattr $C$DW$660, DW_AT_const_value(0x05)
    6271              
    6272              $C$DW$661       .dwtag  DW_TAG_enumerator
    6273                      .dwattr $C$DW$661, DW_AT_name("PIE_GroupNumber_7")
    6274                      .dwattr $C$DW$661, DW_AT_const_value(0x06)
    6275              
    6276              $C$DW$662       .dwtag  DW_TAG_enumerator
    6277                      .dwattr $C$DW$662, DW_AT_name("PIE_GroupNumber_8")
    6278                      .dwattr $C$DW$662, DW_AT_const_value(0x07)
    6279              
    6280              $C$DW$663       .dwtag  DW_TAG_enumerator
    6281                      .dwattr $C$DW$663, DW_AT_name("PIE_GroupNumber_9")
    6282                      .dwattr $C$DW$663, DW_AT_const_value(0x08)
    6283              
    6284              $C$DW$664       .dwtag  DW_TAG_enumerator
    6285                      .dwattr $C$DW$664, DW_AT_name("PIE_GroupNumber_10")
    6286                      .dwattr $C$DW$664, DW_AT_const_value(0x09)
    6287              
    6288              $C$DW$665       .dwtag  DW_TAG_enumerator
    6289                      .dwattr $C$DW$665, DW_AT_name("PIE_GroupNumber_11")
    6290                      .dwattr $C$DW$665, DW_AT_const_value(0x0a)
    6291              
    6292              $C$DW$666       .dwtag  DW_TAG_enumerator
    6293                      .dwattr $C$DW$666, DW_AT_name("PIE_GroupNumber_12")
    6294                      .dwattr $C$DW$666, DW_AT_const_value(0x0b)
    6295              
    6296                      .dwendtag $C$DW$T$218
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6E84BD55-4A6E-4AD4-B709-882166819E08} PAGE  123

    6297              
    6298              $C$DW$T$219     .dwtag  DW_TAG_typedef
    6299                      .dwattr $C$DW$T$219, DW_AT_name("PIE_GroupNumber_e")
    6300                      .dwattr $C$DW$T$219, DW_AT_type(*$C$DW$T$218)
    6301                      .dwattr $C$DW$T$219, DW_AT_language(DW_LANG_C)
    6302              
    6303              
    6304              $C$DW$T$221     .dwtag  DW_TAG_enumeration_type
    6305                      .dwattr $C$DW$T$221, DW_AT_byte_size(0x01)
    6306              $C$DW$667       .dwtag  DW_TAG_enumerator
    6307                      .dwattr $C$DW$667, DW_AT_name("CTRL_Type_PID_spd")
    6308                      .dwattr $C$DW$667, DW_AT_const_value(0x00)
    6309              
    6310              $C$DW$668       .dwtag  DW_TAG_enumerator
    6311                      .dwattr $C$DW$668, DW_AT_name("CTRL_Type_PID_Id")
    6312                      .dwattr $C$DW$668, DW_AT_const_value(0x01)
    6313              
    6314              $C$DW$669       .dwtag  DW_TAG_enumerator
    6315                      .dwattr $C$DW$669, DW_AT_name("CTRL_Type_PID_Iq")
    6316                      .dwattr $C$DW$669, DW_AT_const_value(0x02)
    6317              
    6318                      .dwendtag $C$DW$T$221
    6319              
    6320              $C$DW$T$222     .dwtag  DW_TAG_typedef
    6321                      .dwattr $C$DW$T$222, DW_AT_name("CTRL_Type_e")
    6322                      .dwattr $C$DW$T$222, DW_AT_type(*$C$DW$T$221)
    6323                      .dwattr $C$DW$T$222, DW_AT_language(DW_LANG_C)
    6324              
    6325              
    6326              $C$DW$T$224     .dwtag  DW_TAG_enumeration_type
    6327                      .dwattr $C$DW$T$224, DW_AT_byte_size(0x01)
    6328              $C$DW$670       .dwtag  DW_TAG_enumerator
    6329                      .dwattr $C$DW$670, DW_AT_name("HAL_SensorType_Current")
    6330                      .dwattr $C$DW$670, DW_AT_const_value(0x00)
    6331              
    6332              $C$DW$671       .dwtag  DW_TAG_enumerator
    6333                      .dwattr $C$DW$671, DW_AT_name("HAL_SensorType_Voltage")
    6334                      .dwattr $C$DW$671, DW_AT_const_value(0x01)
    6335              
    6336                      .dwendtag $C$DW$T$224
    6337              
    6338              $C$DW$T$225     .dwtag  DW_TAG_typedef
    6339                      .dwattr $C$DW$T$225, DW_AT_name("HAL_SensorType_e")
    6340                      .dwattr $C$DW$T$225, DW_AT_type(*$C$DW$T$224)
    6341                      .dwattr $C$DW$T$225, DW_AT_language(DW_LANG_C)
    6342              
    6343              
    6344              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    6345                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
    6346                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
    6347              $C$DW$672       .dwtag  DW_TAG_member
    6348                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$25)
    6349                      .dwattr $C$DW$672, DW_AT_name("ADCRESULT")
    6350                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_ADCRESULT")
    6351                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6E84BD55-4A6E-4AD4-B709-882166819E08} PAGE  124

    6352                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    6353              
    6354              $C$DW$673       .dwtag  DW_TAG_member
    6355                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$26)
    6356                      .dwattr $C$DW$673, DW_AT_name("resvd_1")
    6357                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_resvd_1")
    6358                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6359                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    6360              
    6361              $C$DW$674       .dwtag  DW_TAG_member
    6362                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$24)
    6363                      .dwattr $C$DW$674, DW_AT_name("ADCCTL1")
    6364                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_ADCCTL1")
    6365                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    6366                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    6367              
    6368              $C$DW$675       .dwtag  DW_TAG_member
    6369                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$24)
    6370                      .dwattr $C$DW$675, DW_AT_name("ADCCTL2")
    6371                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_ADCCTL2")
    6372                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    6373                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    6374              
    6375              $C$DW$676       .dwtag  DW_TAG_member
    6376                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$27)
    6377                      .dwattr $C$DW$676, DW_AT_name("rsvd_2")
    6378                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_rsvd_2")
    6379                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    6380                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    6381              
    6382              $C$DW$677       .dwtag  DW_TAG_member
    6383                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$24)
    6384                      .dwattr $C$DW$677, DW_AT_name("ADCINTFLG")
    6385                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_ADCINTFLG")
    6386                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    6387                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    6388              
    6389              $C$DW$678       .dwtag  DW_TAG_member
    6390                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$24)
    6391                      .dwattr $C$DW$678, DW_AT_name("ADCINTFLGCLR")
    6392                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    6393                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    6394                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    6395              
    6396              $C$DW$679       .dwtag  DW_TAG_member
    6397                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$24)
    6398                      .dwattr $C$DW$679, DW_AT_name("ADCINTOVF")
    6399                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_ADCINTOVF")
    6400                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    6401                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    6402              
    6403              $C$DW$680       .dwtag  DW_TAG_member
    6404                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$24)
    6405                      .dwattr $C$DW$680, DW_AT_name("ADCINTOVFCLR")
    6406                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6E84BD55-4A6E-4AD4-B709-882166819E08} PAGE  125

    6407                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    6408                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    6409              
    6410              $C$DW$681       .dwtag  DW_TAG_member
    6411                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$28)
    6412                      .dwattr $C$DW$681, DW_AT_name("INTSELxNy")
    6413                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_INTSELxNy")
    6414                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    6415                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    6416              
    6417              $C$DW$682       .dwtag  DW_TAG_member
    6418                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$29)
    6419                      .dwattr $C$DW$682, DW_AT_name("rsvd_3")
    6420                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_rsvd_3")
    6421                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    6422                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    6423              
    6424              $C$DW$683       .dwtag  DW_TAG_member
    6425                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$24)
    6426                      .dwattr $C$DW$683, DW_AT_name("SOCPRICTRL")
    6427                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_SOCPRICTRL")
    6428                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    6429                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    6430              
    6431              $C$DW$684       .dwtag  DW_TAG_member
    6432                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$24)
    6433                      .dwattr $C$DW$684, DW_AT_name("rsvd_4")
    6434                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_rsvd_4")
    6435                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    6436                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    6437              
    6438              $C$DW$685       .dwtag  DW_TAG_member
    6439                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$24)
    6440                      .dwattr $C$DW$685, DW_AT_name("ADCSAMPLEMODE")
    6441                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    6442                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    6443                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    6444              
    6445              $C$DW$686       .dwtag  DW_TAG_member
    6446                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$24)
    6447                      .dwattr $C$DW$686, DW_AT_name("rsvd_5")
    6448                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_rsvd_5")
    6449                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    6450                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    6451              
    6452              $C$DW$687       .dwtag  DW_TAG_member
    6453                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$24)
    6454                      .dwattr $C$DW$687, DW_AT_name("ADCINTSOCSEL1")
    6455                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    6456                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    6457                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    6458              
    6459              $C$DW$688       .dwtag  DW_TAG_member
    6460                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$24)
    6461                      .dwattr $C$DW$688, DW_AT_name("ADCINTSOCSEL2")
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6E84BD55-4A6E-4AD4-B709-882166819E08} PAGE  126

    6462                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    6463                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    6464                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    6465              
    6466              $C$DW$689       .dwtag  DW_TAG_member
    6467                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$27)
    6468                      .dwattr $C$DW$689, DW_AT_name("rsvd_6")
    6469                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_rsvd_6")
    6470                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    6471                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    6472              
    6473              $C$DW$690       .dwtag  DW_TAG_member
    6474                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$24)
    6475                      .dwattr $C$DW$690, DW_AT_name("ADCSOCFLG1")
    6476                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    6477                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    6478                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    6479              
    6480              $C$DW$691       .dwtag  DW_TAG_member
    6481                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$24)
    6482                      .dwattr $C$DW$691, DW_AT_name("rsvd_7")
    6483                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_rsvd_7")
    6484                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    6485                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    6486              
    6487              $C$DW$692       .dwtag  DW_TAG_member
    6488                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$24)
    6489                      .dwattr $C$DW$692, DW_AT_name("ADCSOCFRC1")
    6490                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    6491                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    6492                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    6493              
    6494              $C$DW$693       .dwtag  DW_TAG_member
    6495                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$24)
    6496                      .dwattr $C$DW$693, DW_AT_name("rsvd_8")
    6497                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_rsvd_8")
    6498                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    6499                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    6500              
    6501              $C$DW$694       .dwtag  DW_TAG_member
    6502                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$24)
    6503                      .dwattr $C$DW$694, DW_AT_name("ADCSOCOVF1")
    6504                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    6505                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    6506                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    6507              
    6508              $C$DW$695       .dwtag  DW_TAG_member
    6509                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$24)
    6510                      .dwattr $C$DW$695, DW_AT_name("rsvd_9")
    6511                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_rsvd_9")
    6512                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    6513                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    6514              
    6515              $C$DW$696       .dwtag  DW_TAG_member
    6516                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6E84BD55-4A6E-4AD4-B709-882166819E08} PAGE  127

    6517                      .dwattr $C$DW$696, DW_AT_name("ADCSOCOVFCLR1")
    6518                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    6519                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    6520                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    6521              
    6522              $C$DW$697       .dwtag  DW_TAG_member
    6523                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$24)
    6524                      .dwattr $C$DW$697, DW_AT_name("rsvd_10")
    6525                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_rsvd_10")
    6526                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    6527                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    6528              
    6529              $C$DW$698       .dwtag  DW_TAG_member
    6530                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$25)
    6531                      .dwattr $C$DW$698, DW_AT_name("ADCSOCxCTL")
    6532                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    6533                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    6534                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    6535              
    6536              $C$DW$699       .dwtag  DW_TAG_member
    6537                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$25)
    6538                      .dwattr $C$DW$699, DW_AT_name("rsvd_11")
    6539                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_rsvd_11")
    6540                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    6541                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    6542              
    6543              $C$DW$700       .dwtag  DW_TAG_member
    6544                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$24)
    6545                      .dwattr $C$DW$700, DW_AT_name("ADCREFTRIM")
    6546                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_ADCREFTRIM")
    6547                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    6548                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    6549              
    6550              $C$DW$701       .dwtag  DW_TAG_member
    6551                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$24)
    6552                      .dwattr $C$DW$701, DW_AT_name("ADCOFFTRIM")
    6553                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    6554                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    6555                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    6556              
    6557              $C$DW$702       .dwtag  DW_TAG_member
    6558                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$30)
    6559                      .dwattr $C$DW$702, DW_AT_name("resvd_12")
    6560                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_resvd_12")
    6561                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    6562                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    6563              
    6564              $C$DW$703       .dwtag  DW_TAG_member
    6565                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$24)
    6566                      .dwattr $C$DW$703, DW_AT_name("ADCREV")
    6567                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_ADCREV")
    6568                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    6569                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    6570              
    6571                      .dwendtag $C$DW$T$31
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6E84BD55-4A6E-4AD4-B709-882166819E08} PAGE  128

    6572              
    6573              $C$DW$T$227     .dwtag  DW_TAG_typedef
    6574                      .dwattr $C$DW$T$227, DW_AT_name("ADC_Obj")
    6575                      .dwattr $C$DW$T$227, DW_AT_type(*$C$DW$T$31)
    6576                      .dwattr $C$DW$T$227, DW_AT_language(DW_LANG_C)
    6577              
    6578              $C$DW$T$121     .dwtag  DW_TAG_pointer_type
    6579                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$31)
    6580                      .dwattr $C$DW$T$121, DW_AT_address_class(0x20)
    6581              
    6582              $C$DW$T$122     .dwtag  DW_TAG_typedef
    6583                      .dwattr $C$DW$T$122, DW_AT_name("ADC_Handle")
    6584                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$121)
    6585                      .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
    6586              
    6587              
    6588              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    6589                      .dwattr $C$DW$T$35, DW_AT_name("_CLARKE_Obj_")
    6590                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x06)
    6591              $C$DW$704       .dwtag  DW_TAG_member
    6592                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$32)
    6593                      .dwattr $C$DW$704, DW_AT_name("alpha_sf")
    6594                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_alpha_sf")
    6595                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6596                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    6597              
    6598              $C$DW$705       .dwtag  DW_TAG_member
    6599                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$32)
    6600                      .dwattr $C$DW$705, DW_AT_name("beta_sf")
    6601                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_beta_sf")
    6602                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6603                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    6604              
    6605              $C$DW$706       .dwtag  DW_TAG_member
    6606                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$34)
    6607                      .dwattr $C$DW$706, DW_AT_name("numSensors")
    6608                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_numSensors")
    6609                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6610                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    6611              
    6612                      .dwendtag $C$DW$T$35
    6613              
    6614              $C$DW$T$46      .dwtag  DW_TAG_typedef
    6615                      .dwattr $C$DW$T$46, DW_AT_name("CLARKE_Obj")
    6616                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$35)
    6617                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    6618              
    6619              $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    6620                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$35)
    6621                      .dwattr $C$DW$T$44, DW_AT_address_class(0x20)
    6622              
    6623              $C$DW$T$45      .dwtag  DW_TAG_typedef
    6624                      .dwattr $C$DW$T$45, DW_AT_name("CLARKE_Handle")
    6625                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    6626                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6E84BD55-4A6E-4AD4-B709-882166819E08} PAGE  129

    6627              
    6628              $C$DW$707       .dwtag  DW_TAG_TI_far_type
    6629                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$45)
    6630              
    6631              $C$DW$T$228     .dwtag  DW_TAG_const_type
    6632                      .dwattr $C$DW$T$228, DW_AT_type(*$C$DW$707)
    6633              
    6634              
    6635              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    6636                      .dwattr $C$DW$T$37, DW_AT_name("_CLK_Obj_")
    6637                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x11)
    6638              $C$DW$708       .dwtag  DW_TAG_member
    6639                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$24)
    6640                      .dwattr $C$DW$708, DW_AT_name("XCLK")
    6641                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_XCLK")
    6642                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6643                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    6644              
    6645              $C$DW$709       .dwtag  DW_TAG_member
    6646                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$24)
    6647                      .dwattr $C$DW$709, DW_AT_name("rsvd_1")
    6648                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_rsvd_1")
    6649                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6650                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    6651              
    6652              $C$DW$710       .dwtag  DW_TAG_member
    6653                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$24)
    6654                      .dwattr $C$DW$710, DW_AT_name("CLKCTL")
    6655                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_CLKCTL")
    6656                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6657                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    6658              
    6659              $C$DW$711       .dwtag  DW_TAG_member
    6660                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$36)
    6661                      .dwattr $C$DW$711, DW_AT_name("rsvd_2")
    6662                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_rsvd_2")
    6663                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6664                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    6665              
    6666              $C$DW$712       .dwtag  DW_TAG_member
    6667                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$24)
    6668                      .dwattr $C$DW$712, DW_AT_name("LOSPCP")
    6669                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_LOSPCP")
    6670                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6671                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    6672              
    6673              $C$DW$713       .dwtag  DW_TAG_member
    6674                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$24)
    6675                      .dwattr $C$DW$713, DW_AT_name("PCLKCR0")
    6676                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_PCLKCR0")
    6677                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6678                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    6679              
    6680              $C$DW$714       .dwtag  DW_TAG_member
    6681                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6E84BD55-4A6E-4AD4-B709-882166819E08} PAGE  130

    6682                      .dwattr $C$DW$714, DW_AT_name("PCLKCR1")
    6683                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_PCLKCR1")
    6684                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6685                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    6686              
    6687              $C$DW$715       .dwtag  DW_TAG_member
    6688                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$27)
    6689                      .dwattr $C$DW$715, DW_AT_name("rsvd_3")
    6690                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_rsvd_3")
    6691                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6692                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    6693              
    6694              $C$DW$716       .dwtag  DW_TAG_member
    6695                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$24)
    6696                      .dwattr $C$DW$716, DW_AT_name("PCLKCR3")
    6697                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_PCLKCR3")
    6698                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6699                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    6700              
    6701                      .dwendtag $C$DW$T$37
    6702              
    6703              $C$DW$T$123     .dwtag  DW_TAG_pointer_type
    6704                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$37)
    6705                      .dwattr $C$DW$T$123, DW_AT_address_class(0x20)
    6706              
    6707              $C$DW$T$124     .dwtag  DW_TAG_typedef
    6708                      .dwattr $C$DW$T$124, DW_AT_name("CLK_Handle")
    6709                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$123)
    6710                      .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
    6711              
    6712              
    6713              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    6714                      .dwattr $C$DW$T$38, DW_AT_name("_CPU_Obj_")
    6715                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    6716              $C$DW$717       .dwtag  DW_TAG_member
    6717                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$34)
    6718                      .dwattr $C$DW$717, DW_AT_name("tmp")
    6719                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_tmp")
    6720                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6721                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    6722              
    6723                      .dwendtag $C$DW$T$38
    6724              
    6725              $C$DW$T$125     .dwtag  DW_TAG_pointer_type
    6726                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$38)
    6727                      .dwattr $C$DW$T$125, DW_AT_address_class(0x20)
    6728              
    6729              $C$DW$T$126     .dwtag  DW_TAG_typedef
    6730                      .dwattr $C$DW$T$126, DW_AT_name("CPU_Handle")
    6731                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$125)
    6732                      .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
    6733              
    6734              
    6735              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    6736                      .dwattr $C$DW$T$74, DW_AT_name("_CTRL_Obj_")
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6E84BD55-4A6E-4AD4-B709-882166819E08} PAGE  131

    6737                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x10a)
    6738              $C$DW$718       .dwtag  DW_TAG_member
    6739                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$39)
    6740                      .dwattr $C$DW$718, DW_AT_name("version")
    6741                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_version")
    6742                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6743                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    6744              
    6745              $C$DW$719       .dwtag  DW_TAG_member
    6746                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$41)
    6747                      .dwattr $C$DW$719, DW_AT_name("state")
    6748                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_state")
    6749                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6750                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    6751              
    6752              $C$DW$720       .dwtag  DW_TAG_member
    6753                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$41)
    6754                      .dwattr $C$DW$720, DW_AT_name("prevState")
    6755                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_prevState")
    6756                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6757                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    6758              
    6759              $C$DW$721       .dwtag  DW_TAG_member
    6760                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$43)
    6761                      .dwattr $C$DW$721, DW_AT_name("errorCode")
    6762                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_errorCode")
    6763                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6764                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    6765              
    6766              $C$DW$722       .dwtag  DW_TAG_member
    6767                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$45)
    6768                      .dwattr $C$DW$722, DW_AT_name("clarkeHandle_I")
    6769                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_clarkeHandle_I")
    6770                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6771                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    6772              
    6773              $C$DW$723       .dwtag  DW_TAG_member
    6774                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$46)
    6775                      .dwattr $C$DW$723, DW_AT_name("clarke_I")
    6776                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_clarke_I")
    6777                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6778                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    6779              
    6780              $C$DW$724       .dwtag  DW_TAG_member
    6781                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$45)
    6782                      .dwattr $C$DW$724, DW_AT_name("clarkeHandle_V")
    6783                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_clarkeHandle_V")
    6784                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6785                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    6786              
    6787              $C$DW$725       .dwtag  DW_TAG_member
    6788                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$46)
    6789                      .dwattr $C$DW$725, DW_AT_name("clarke_V")
    6790                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_clarke_V")
    6791                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6E84BD55-4A6E-4AD4-B709-882166819E08} PAGE  132

    6792                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    6793              
    6794              $C$DW$726       .dwtag  DW_TAG_member
    6795                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$48)
    6796                      .dwattr $C$DW$726, DW_AT_name("estHandle")
    6797                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_estHandle")
    6798                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6799                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    6800              
    6801              $C$DW$727       .dwtag  DW_TAG_member
    6802                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$50)
    6803                      .dwattr $C$DW$727, DW_AT_name("parkHandle")
    6804                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_parkHandle")
    6805                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6806                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    6807              
    6808              $C$DW$728       .dwtag  DW_TAG_member
    6809                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$51)
    6810                      .dwattr $C$DW$728, DW_AT_name("park")
    6811                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_park")
    6812                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6813                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    6814              
    6815              $C$DW$729       .dwtag  DW_TAG_member
    6816                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$53)
    6817                      .dwattr $C$DW$729, DW_AT_name("pidHandle_Id")
    6818                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_pidHandle_Id")
    6819                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6820                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    6821              
    6822              $C$DW$730       .dwtag  DW_TAG_member
    6823                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$54)
    6824                      .dwattr $C$DW$730, DW_AT_name("pid_Id")
    6825                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_pid_Id")
    6826                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6827                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    6828              
    6829              $C$DW$731       .dwtag  DW_TAG_member
    6830                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$53)
    6831                      .dwattr $C$DW$731, DW_AT_name("pidHandle_Iq")
    6832                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_pidHandle_Iq")
    6833                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    6834                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    6835              
    6836              $C$DW$732       .dwtag  DW_TAG_member
    6837                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$54)
    6838                      .dwattr $C$DW$732, DW_AT_name("pid_Iq")
    6839                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_pid_Iq")
    6840                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6841                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    6842              
    6843              $C$DW$733       .dwtag  DW_TAG_member
    6844                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$53)
    6845                      .dwattr $C$DW$733, DW_AT_name("pidHandle_spd")
    6846                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_pidHandle_spd")
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6E84BD55-4A6E-4AD4-B709-882166819E08} PAGE  133

    6847                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6848                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    6849              
    6850              $C$DW$734       .dwtag  DW_TAG_member
    6851                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$54)
    6852                      .dwattr $C$DW$734, DW_AT_name("pid_spd")
    6853                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_pid_spd")
    6854                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    6855                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    6856              
    6857              $C$DW$735       .dwtag  DW_TAG_member
    6858                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$56)
    6859                      .dwattr $C$DW$735, DW_AT_name("iparkHandle")
    6860                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_iparkHandle")
    6861                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    6862                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    6863              
    6864              $C$DW$736       .dwtag  DW_TAG_member
    6865                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$57)
    6866                      .dwattr $C$DW$736, DW_AT_name("ipark")
    6867                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_ipark")
    6868                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    6869                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    6870              
    6871              $C$DW$737       .dwtag  DW_TAG_member
    6872                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$59)
    6873                      .dwattr $C$DW$737, DW_AT_name("svgenHandle")
    6874                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_svgenHandle")
    6875                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    6876                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    6877              
    6878              $C$DW$738       .dwtag  DW_TAG_member
    6879                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$60)
    6880                      .dwattr $C$DW$738, DW_AT_name("svgen")
    6881                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_svgen")
    6882                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    6883                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    6884              
    6885              $C$DW$739       .dwtag  DW_TAG_member
    6886                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$62)
    6887                      .dwattr $C$DW$739, DW_AT_name("trajHandle_Id")
    6888                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_trajHandle_Id")
    6889                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    6890                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    6891              
    6892              $C$DW$740       .dwtag  DW_TAG_member
    6893                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$63)
    6894                      .dwattr $C$DW$740, DW_AT_name("traj_Id")
    6895                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_traj_Id")
    6896                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    6897                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    6898              
    6899              $C$DW$741       .dwtag  DW_TAG_member
    6900                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$62)
    6901                      .dwattr $C$DW$741, DW_AT_name("trajHandle_spd")
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6E84BD55-4A6E-4AD4-B709-882166819E08} PAGE  134

    6902                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_trajHandle_spd")
    6903                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    6904                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    6905              
    6906              $C$DW$742       .dwtag  DW_TAG_member
    6907                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$63)
    6908                      .dwattr $C$DW$742, DW_AT_name("traj_spd")
    6909                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_traj_spd")
    6910                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    6911                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    6912              
    6913              $C$DW$743       .dwtag  DW_TAG_member
    6914                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$62)
    6915                      .dwattr $C$DW$743, DW_AT_name("trajHandle_spdMax")
    6916                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    6917                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    6918                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    6919              
    6920              $C$DW$744       .dwtag  DW_TAG_member
    6921                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$63)
    6922                      .dwattr $C$DW$744, DW_AT_name("traj_spdMax")
    6923                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_traj_spdMax")
    6924                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    6925                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    6926              
    6927              $C$DW$745       .dwtag  DW_TAG_member
    6928                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$64)
    6929                      .dwattr $C$DW$745, DW_AT_name("motorParams")
    6930                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_motorParams")
    6931                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    6932                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    6933              
    6934              $C$DW$746       .dwtag  DW_TAG_member
    6935                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$68)
    6936                      .dwattr $C$DW$746, DW_AT_name("waitTimes")
    6937                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_waitTimes")
    6938                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    6939                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    6940              
    6941              $C$DW$747       .dwtag  DW_TAG_member
    6942                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$67)
    6943                      .dwattr $C$DW$747, DW_AT_name("counter_state")
    6944                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_counter_state")
    6945                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    6946                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    6947              
    6948              $C$DW$748       .dwtag  DW_TAG_member
    6949                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$70)
    6950                      .dwattr $C$DW$748, DW_AT_name("numIsrTicksPerCtrlTick")
    6951                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    6952                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    6953                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    6954              
    6955              $C$DW$749       .dwtag  DW_TAG_member
    6956                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$70)
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6E84BD55-4A6E-4AD4-B709-882166819E08} PAGE  135

    6957                      .dwattr $C$DW$749, DW_AT_name("numCtrlTicksPerCurrentTick")
    6958                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    6959                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    6960                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    6961              
    6962              $C$DW$750       .dwtag  DW_TAG_member
    6963                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$70)
    6964                      .dwattr $C$DW$750, DW_AT_name("numCtrlTicksPerSpeedTick")
    6965                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    6966                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    6967                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    6968              
    6969              $C$DW$751       .dwtag  DW_TAG_member
    6970                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$70)
    6971                      .dwattr $C$DW$751, DW_AT_name("numCtrlTicksPerTrajTick")
    6972                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    6973                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    6974                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    6975              
    6976              $C$DW$752       .dwtag  DW_TAG_member
    6977                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$67)
    6978                      .dwattr $C$DW$752, DW_AT_name("ctrlFreq_Hz")
    6979                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    6980                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    6981                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    6982              
    6983              $C$DW$753       .dwtag  DW_TAG_member
    6984                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$67)
    6985                      .dwattr $C$DW$753, DW_AT_name("trajFreq_Hz")
    6986                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_trajFreq_Hz")
    6987                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    6988                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    6989              
    6990              $C$DW$754       .dwtag  DW_TAG_member
    6991                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$32)
    6992                      .dwattr $C$DW$754, DW_AT_name("trajPeriod_sec")
    6993                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_trajPeriod_sec")
    6994                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    6995                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    6996              
    6997              $C$DW$755       .dwtag  DW_TAG_member
    6998                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$71)
    6999                      .dwattr $C$DW$755, DW_AT_name("ctrlPeriod_sec")
    7000                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    7001                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    7002                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    7003              
    7004              $C$DW$756       .dwtag  DW_TAG_member
    7005                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$32)
    7006                      .dwattr $C$DW$756, DW_AT_name("maxVsMag_pu")
    7007                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_maxVsMag_pu")
    7008                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    7009                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    7010              
    7011              $C$DW$757       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6E84BD55-4A6E-4AD4-B709-882166819E08} PAGE  136

    7012                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$72)
    7013                      .dwattr $C$DW$757, DW_AT_name("Iab_in")
    7014                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_Iab_in")
    7015                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    7016                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    7017              
    7018              $C$DW$758       .dwtag  DW_TAG_member
    7019                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$72)
    7020                      .dwattr $C$DW$758, DW_AT_name("Iab_filt")
    7021                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_Iab_filt")
    7022                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    7023                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    7024              
    7025              $C$DW$759       .dwtag  DW_TAG_member
    7026                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$72)
    7027                      .dwattr $C$DW$759, DW_AT_name("Idq_in")
    7028                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_Idq_in")
    7029                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    7030                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    7031              
    7032              $C$DW$760       .dwtag  DW_TAG_member
    7033                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$72)
    7034                      .dwattr $C$DW$760, DW_AT_name("Vab_in")
    7035                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_Vab_in")
    7036                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    7037                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    7038              
    7039              $C$DW$761       .dwtag  DW_TAG_member
    7040                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$32)
    7041                      .dwattr $C$DW$761, DW_AT_name("spd_out")
    7042                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_spd_out")
    7043                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    7044                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    7045              
    7046              $C$DW$762       .dwtag  DW_TAG_member
    7047                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$72)
    7048                      .dwattr $C$DW$762, DW_AT_name("Vab_out")
    7049                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_Vab_out")
    7050                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    7051                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    7052              
    7053              $C$DW$763       .dwtag  DW_TAG_member
    7054                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$72)
    7055                      .dwattr $C$DW$763, DW_AT_name("Vdq_out")
    7056                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_Vdq_out")
    7057                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    7058                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    7059              
    7060              $C$DW$764       .dwtag  DW_TAG_member
    7061                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$71)
    7062                      .dwattr $C$DW$764, DW_AT_name("Rhf")
    7063                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_Rhf")
    7064                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    7065                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    7066              
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6E84BD55-4A6E-4AD4-B709-882166819E08} PAGE  137

    7067              $C$DW$765       .dwtag  DW_TAG_member
    7068                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$71)
    7069                      .dwattr $C$DW$765, DW_AT_name("Lhf")
    7070                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_Lhf")
    7071                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    7072                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    7073              
    7074              $C$DW$766       .dwtag  DW_TAG_member
    7075                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$71)
    7076                      .dwattr $C$DW$766, DW_AT_name("RoverL")
    7077                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_RoverL")
    7078                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    7079                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    7080              
    7081              $C$DW$767       .dwtag  DW_TAG_member
    7082                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$32)
    7083                      .dwattr $C$DW$767, DW_AT_name("Kp_Id")
    7084                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_Kp_Id")
    7085                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    7086                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    7087              
    7088              $C$DW$768       .dwtag  DW_TAG_member
    7089                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$32)
    7090                      .dwattr $C$DW$768, DW_AT_name("Kp_Iq")
    7091                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_Kp_Iq")
    7092                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    7093                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    7094              
    7095              $C$DW$769       .dwtag  DW_TAG_member
    7096                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$32)
    7097                      .dwattr $C$DW$769, DW_AT_name("Kp_spd")
    7098                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_Kp_spd")
    7099                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    7100                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    7101              
    7102              $C$DW$770       .dwtag  DW_TAG_member
    7103                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$32)
    7104                      .dwattr $C$DW$770, DW_AT_name("Ki_Id")
    7105                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_Ki_Id")
    7106                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    7107                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    7108              
    7109              $C$DW$771       .dwtag  DW_TAG_member
    7110                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$32)
    7111                      .dwattr $C$DW$771, DW_AT_name("Ki_Iq")
    7112                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_Ki_Iq")
    7113                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    7114                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    7115              
    7116              $C$DW$772       .dwtag  DW_TAG_member
    7117                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$32)
    7118                      .dwattr $C$DW$772, DW_AT_name("Ki_spd")
    7119                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_Ki_spd")
    7120                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    7121                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6E84BD55-4A6E-4AD4-B709-882166819E08} PAGE  138

    7122              
    7123              $C$DW$773       .dwtag  DW_TAG_member
    7124                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$32)
    7125                      .dwattr $C$DW$773, DW_AT_name("Kd_Id")
    7126                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_Kd_Id")
    7127                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    7128                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    7129              
    7130              $C$DW$774       .dwtag  DW_TAG_member
    7131                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$32)
    7132                      .dwattr $C$DW$774, DW_AT_name("Kd_Iq")
    7133                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_Kd_Iq")
    7134                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    7135                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    7136              
    7137              $C$DW$775       .dwtag  DW_TAG_member
    7138                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$32)
    7139                      .dwattr $C$DW$775, DW_AT_name("Kd_spd")
    7140                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_Kd_spd")
    7141                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    7142                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    7143              
    7144              $C$DW$776       .dwtag  DW_TAG_member
    7145                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$32)
    7146                      .dwattr $C$DW$776, DW_AT_name("Ui_Id")
    7147                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_Ui_Id")
    7148                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    7149                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    7150              
    7151              $C$DW$777       .dwtag  DW_TAG_member
    7152                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$32)
    7153                      .dwattr $C$DW$777, DW_AT_name("Ui_Iq")
    7154                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_Ui_Iq")
    7155                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    7156                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    7157              
    7158              $C$DW$778       .dwtag  DW_TAG_member
    7159                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$32)
    7160                      .dwattr $C$DW$778, DW_AT_name("Ui_spd")
    7161                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_Ui_spd")
    7162                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    7163                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    7164              
    7165              $C$DW$779       .dwtag  DW_TAG_member
    7166                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$72)
    7167                      .dwattr $C$DW$779, DW_AT_name("Idq_ref")
    7168                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_Idq_ref")
    7169                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    7170                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    7171              
    7172              $C$DW$780       .dwtag  DW_TAG_member
    7173                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$32)
    7174                      .dwattr $C$DW$780, DW_AT_name("IdRated")
    7175                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_IdRated")
    7176                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6E84BD55-4A6E-4AD4-B709-882166819E08} PAGE  139

    7177                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    7178              
    7179              $C$DW$781       .dwtag  DW_TAG_member
    7180                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$32)
    7181                      .dwattr $C$DW$781, DW_AT_name("spd_ref")
    7182                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_spd_ref")
    7183                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    7184                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    7185              
    7186              $C$DW$782       .dwtag  DW_TAG_member
    7187                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$32)
    7188                      .dwattr $C$DW$782, DW_AT_name("spd_max")
    7189                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_spd_max")
    7190                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    7191                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    7192              
    7193              $C$DW$783       .dwtag  DW_TAG_member
    7194                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$70)
    7195                      .dwattr $C$DW$783, DW_AT_name("counter_current")
    7196                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_counter_current")
    7197                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    7198                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    7199              
    7200              $C$DW$784       .dwtag  DW_TAG_member
    7201                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$70)
    7202                      .dwattr $C$DW$784, DW_AT_name("counter_isr")
    7203                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_counter_isr")
    7204                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    7205                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    7206              
    7207              $C$DW$785       .dwtag  DW_TAG_member
    7208                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$70)
    7209                      .dwattr $C$DW$785, DW_AT_name("counter_speed")
    7210                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_counter_speed")
    7211                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    7212                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    7213              
    7214              $C$DW$786       .dwtag  DW_TAG_member
    7215                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$70)
    7216                      .dwattr $C$DW$786, DW_AT_name("counter_traj")
    7217                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_counter_traj")
    7218                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    7219                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    7220              
    7221              $C$DW$787       .dwtag  DW_TAG_member
    7222                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$73)
    7223                      .dwattr $C$DW$787, DW_AT_name("flag_enableCtrl")
    7224                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_flag_enableCtrl")
    7225                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    7226                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    7227              
    7228              $C$DW$788       .dwtag  DW_TAG_member
    7229                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$73)
    7230                      .dwattr $C$DW$788, DW_AT_name("flag_enableDcBusComp")
    7231                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6E84BD55-4A6E-4AD4-B709-882166819E08} PAGE  140

    7232                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    7233                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    7234              
    7235              $C$DW$789       .dwtag  DW_TAG_member
    7236                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$73)
    7237                      .dwattr $C$DW$789, DW_AT_name("flag_enablePowerWarp")
    7238                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    7239                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    7240                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    7241              
    7242              $C$DW$790       .dwtag  DW_TAG_member
    7243                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$73)
    7244                      .dwattr $C$DW$790, DW_AT_name("flag_enableOffset")
    7245                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_flag_enableOffset")
    7246                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    7247                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    7248              
    7249              $C$DW$791       .dwtag  DW_TAG_member
    7250                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$73)
    7251                      .dwattr $C$DW$791, DW_AT_name("flag_enableSpeedCtrl")
    7252                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    7253                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    7254                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    7255              
    7256              $C$DW$792       .dwtag  DW_TAG_member
    7257                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$73)
    7258                      .dwattr $C$DW$792, DW_AT_name("flag_enableUserMotorParams")
    7259                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    7260                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    7261                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    7262              
    7263              $C$DW$793       .dwtag  DW_TAG_member
    7264                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$72)
    7265                      .dwattr $C$DW$793, DW_AT_name("Idq_offset_pu")
    7266                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_Idq_offset_pu")
    7267                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    7268                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    7269              
    7270              $C$DW$794       .dwtag  DW_TAG_member
    7271                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$72)
    7272                      .dwattr $C$DW$794, DW_AT_name("Vdq_offset_pu")
    7273                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    7274                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    7275                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    7276              
    7277              $C$DW$795       .dwtag  DW_TAG_member
    7278                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$32)
    7279                      .dwattr $C$DW$795, DW_AT_name("angle_pu")
    7280                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_angle_pu")
    7281                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    7282                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    7283              
    7284              $C$DW$796       .dwtag  DW_TAG_member
    7285                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$32)
    7286                      .dwattr $C$DW$796, DW_AT_name("speed_ref_pu")
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6E84BD55-4A6E-4AD4-B709-882166819E08} PAGE  141

    7287                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_speed_ref_pu")
    7288                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    7289                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    7290              
    7291              $C$DW$797       .dwtag  DW_TAG_member
    7292                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$32)
    7293                      .dwattr $C$DW$797, DW_AT_name("speed_fb_pu")
    7294                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_speed_fb_pu")
    7295                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    7296                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    7297              
    7298              $C$DW$798       .dwtag  DW_TAG_member
    7299                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$32)
    7300                      .dwattr $C$DW$798, DW_AT_name("speed_outMax_pu")
    7301                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_speed_outMax_pu")
    7302                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    7303                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    7304              
    7305              $C$DW$799       .dwtag  DW_TAG_member
    7306                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$73)
    7307                      .dwattr $C$DW$799, DW_AT_name("flag_enableCurrentCtrl")
    7308                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    7309                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    7310                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    7311              
    7312              $C$DW$800       .dwtag  DW_TAG_member
    7313                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$32)
    7314                      .dwattr $C$DW$800, DW_AT_name("torque_head_comm")
    7315                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_torque_head_comm")
    7316                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    7317                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    7318              
    7319                      .dwendtag $C$DW$T$74
    7320              
    7321              $C$DW$T$235     .dwtag  DW_TAG_typedef
    7322                      .dwattr $C$DW$T$235, DW_AT_name("CTRL_Obj")
    7323                      .dwattr $C$DW$T$235, DW_AT_type(*$C$DW$T$74)
    7324                      .dwattr $C$DW$T$235, DW_AT_language(DW_LANG_C)
    7325              
    7326              $C$DW$T$236     .dwtag  DW_TAG_pointer_type
    7327                      .dwattr $C$DW$T$236, DW_AT_type(*$C$DW$T$235)
    7328                      .dwattr $C$DW$T$236, DW_AT_address_class(0x20)
    7329              
    7330              $C$DW$T$200     .dwtag  DW_TAG_pointer_type
    7331                      .dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$74)
    7332                      .dwattr $C$DW$T$200, DW_AT_address_class(0x20)
    7333              
    7334              $C$DW$T$201     .dwtag  DW_TAG_typedef
    7335                      .dwattr $C$DW$T$201, DW_AT_name("CTRL_Handle")
    7336                      .dwattr $C$DW$T$201, DW_AT_type(*$C$DW$T$200)
    7337                      .dwattr $C$DW$T$201, DW_AT_language(DW_LANG_C)
    7338              
    7339              $C$DW$801       .dwtag  DW_TAG_TI_far_type
    7340                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$201)
    7341              
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6E84BD55-4A6E-4AD4-B709-882166819E08} PAGE  142

    7342              $C$DW$T$237     .dwtag  DW_TAG_const_type
    7343                      .dwattr $C$DW$T$237, DW_AT_type(*$C$DW$801)
    7344              
    7345              
    7346              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    7347                      .dwattr $C$DW$T$77, DW_AT_name("_CTRL_Version_")
    7348                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x04)
    7349              $C$DW$802       .dwtag  DW_TAG_member
    7350                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$23)
    7351                      .dwattr $C$DW$802, DW_AT_name("rsvd")
    7352                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_rsvd")
    7353                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7354                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    7355              
    7356              $C$DW$803       .dwtag  DW_TAG_member
    7357                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$76)
    7358                      .dwattr $C$DW$803, DW_AT_name("targetProc")
    7359                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_targetProc")
    7360                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7361                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    7362              
    7363              $C$DW$804       .dwtag  DW_TAG_member
    7364                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$23)
    7365                      .dwattr $C$DW$804, DW_AT_name("major")
    7366                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_major")
    7367                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7368                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    7369              
    7370              $C$DW$805       .dwtag  DW_TAG_member
    7371                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$23)
    7372                      .dwattr $C$DW$805, DW_AT_name("minor")
    7373                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_minor")
    7374                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7375                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    7376              
    7377                      .dwendtag $C$DW$T$77
    7378              
    7379              $C$DW$T$39      .dwtag  DW_TAG_typedef
    7380                      .dwattr $C$DW$T$39, DW_AT_name("CTRL_Version")
    7381                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$77)
    7382                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    7383              
    7384              $C$DW$T$243     .dwtag  DW_TAG_pointer_type
    7385                      .dwattr $C$DW$T$243, DW_AT_type(*$C$DW$T$39)
    7386                      .dwattr $C$DW$T$243, DW_AT_address_class(0x20)
    7387              
    7388              
    7389              $C$DW$T$84      .dwtag  DW_TAG_structure_type
    7390                      .dwattr $C$DW$T$84, DW_AT_name("_DRV8301_Obj_")
    7391                      .dwattr $C$DW$T$84, DW_AT_byte_size(0x08)
    7392              $C$DW$806       .dwtag  DW_TAG_member
    7393                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$79)
    7394                      .dwattr $C$DW$806, DW_AT_name("spiHandle")
    7395                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_spiHandle")
    7396                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6E84BD55-4A6E-4AD4-B709-882166819E08} PAGE  143

    7397                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    7398              
    7399              $C$DW$807       .dwtag  DW_TAG_member
    7400                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$81)
    7401                      .dwattr $C$DW$807, DW_AT_name("gpioHandle")
    7402                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_gpioHandle")
    7403                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7404                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    7405              
    7406              $C$DW$808       .dwtag  DW_TAG_member
    7407                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$83)
    7408                      .dwattr $C$DW$808, DW_AT_name("gpioNumber")
    7409                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_gpioNumber")
    7410                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7411                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    7412              
    7413              $C$DW$809       .dwtag  DW_TAG_member
    7414                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$73)
    7415                      .dwattr $C$DW$809, DW_AT_name("RxTimeOut")
    7416                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_RxTimeOut")
    7417                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7418                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    7419              
    7420              $C$DW$810       .dwtag  DW_TAG_member
    7421                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$73)
    7422                      .dwattr $C$DW$810, DW_AT_name("enableTimeOut")
    7423                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_enableTimeOut")
    7424                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7425                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    7426              
    7427                      .dwendtag $C$DW$T$84
    7428              
    7429              $C$DW$T$153     .dwtag  DW_TAG_typedef
    7430                      .dwattr $C$DW$T$153, DW_AT_name("DRV8301_Obj")
    7431                      .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$84)
    7432                      .dwattr $C$DW$T$153, DW_AT_language(DW_LANG_C)
    7433              
    7434              $C$DW$T$151     .dwtag  DW_TAG_pointer_type
    7435                      .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$84)
    7436                      .dwattr $C$DW$T$151, DW_AT_address_class(0x20)
    7437              
    7438              $C$DW$T$152     .dwtag  DW_TAG_typedef
    7439                      .dwattr $C$DW$T$152, DW_AT_name("DRV8301_Handle")
    7440                      .dwattr $C$DW$T$152, DW_AT_type(*$C$DW$T$151)
    7441                      .dwattr $C$DW$T$152, DW_AT_language(DW_LANG_C)
    7442              
    7443              
    7444              $C$DW$T$95      .dwtag  DW_TAG_structure_type
    7445                      .dwattr $C$DW$T$95, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    7446                      .dwattr $C$DW$T$95, DW_AT_byte_size(0x05)
    7447              $C$DW$811       .dwtag  DW_TAG_member
    7448                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$86)
    7449                      .dwattr $C$DW$811, DW_AT_name("DRV8301_CURRENT")
    7450                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    7451                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6E84BD55-4A6E-4AD4-B709-882166819E08} PAGE  144

    7452                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    7453              
    7454              $C$DW$812       .dwtag  DW_TAG_member
    7455                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$88)
    7456                      .dwattr $C$DW$812, DW_AT_name("DRV8301_RESET")
    7457                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_DRV8301_RESET")
    7458                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7459                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    7460              
    7461              $C$DW$813       .dwtag  DW_TAG_member
    7462                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$90)
    7463                      .dwattr $C$DW$813, DW_AT_name("PWM_MODE")
    7464                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_PWM_MODE")
    7465                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7466                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    7467              
    7468              $C$DW$814       .dwtag  DW_TAG_member
    7469                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$92)
    7470                      .dwattr $C$DW$814, DW_AT_name("OC_MODE")
    7471                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_OC_MODE")
    7472                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7473                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    7474              
    7475              $C$DW$815       .dwtag  DW_TAG_member
    7476                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$94)
    7477                      .dwattr $C$DW$815, DW_AT_name("OC_ADJ_SET")
    7478                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    7479                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7480                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    7481              
    7482                      .dwendtag $C$DW$T$95
    7483              
    7484              $C$DW$T$109     .dwtag  DW_TAG_typedef
    7485                      .dwattr $C$DW$T$109, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    7486                      .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$95)
    7487                      .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    7488              
    7489              
    7490              $C$DW$T$104     .dwtag  DW_TAG_structure_type
    7491                      .dwattr $C$DW$T$104, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    7492                      .dwattr $C$DW$T$104, DW_AT_byte_size(0x04)
    7493              $C$DW$816       .dwtag  DW_TAG_member
    7494                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$97)
    7495                      .dwattr $C$DW$816, DW_AT_name("OCTW_SET")
    7496                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_OCTW_SET")
    7497                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7498                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    7499              
    7500              $C$DW$817       .dwtag  DW_TAG_member
    7501                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$99)
    7502                      .dwattr $C$DW$817, DW_AT_name("GAIN")
    7503                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_GAIN")
    7504                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7505                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    7506              
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6E84BD55-4A6E-4AD4-B709-882166819E08} PAGE  145

    7507              $C$DW$818       .dwtag  DW_TAG_member
    7508                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$101)
    7509                      .dwattr $C$DW$818, DW_AT_name("DC_CAL_CH1p2")
    7510                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    7511                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7512                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    7513              
    7514              $C$DW$819       .dwtag  DW_TAG_member
    7515                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$103)
    7516                      .dwattr $C$DW$819, DW_AT_name("OC_TOFF")
    7517                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_OC_TOFF")
    7518                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7519                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    7520              
    7521                      .dwendtag $C$DW$T$104
    7522              
    7523              $C$DW$T$110     .dwtag  DW_TAG_typedef
    7524                      .dwattr $C$DW$T$110, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    7525                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$104)
    7526                      .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    7527              
    7528              
    7529              $C$DW$T$105     .dwtag  DW_TAG_structure_type
    7530                      .dwattr $C$DW$T$105, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    7531                      .dwattr $C$DW$T$105, DW_AT_byte_size(0x0b)
    7532              $C$DW$820       .dwtag  DW_TAG_member
    7533                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$73)
    7534                      .dwattr $C$DW$820, DW_AT_name("FAULT")
    7535                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_FAULT")
    7536                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7537                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
    7538              
    7539              $C$DW$821       .dwtag  DW_TAG_member
    7540                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$73)
    7541                      .dwattr $C$DW$821, DW_AT_name("GVDD_UV")
    7542                      .dwattr $C$DW$821, DW_AT_TI_symbol_name("_GVDD_UV")
    7543                      .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7544                      .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
    7545              
    7546              $C$DW$822       .dwtag  DW_TAG_member
    7547                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$73)
    7548                      .dwattr $C$DW$822, DW_AT_name("PVDD_UV")
    7549                      .dwattr $C$DW$822, DW_AT_TI_symbol_name("_PVDD_UV")
    7550                      .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7551                      .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
    7552              
    7553              $C$DW$823       .dwtag  DW_TAG_member
    7554                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$73)
    7555                      .dwattr $C$DW$823, DW_AT_name("OTSD")
    7556                      .dwattr $C$DW$823, DW_AT_TI_symbol_name("_OTSD")
    7557                      .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7558                      .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
    7559              
    7560              $C$DW$824       .dwtag  DW_TAG_member
    7561                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$73)
TMS320C2000 Assembler PC v18.12.4 Tue Jan 31 14:49:20 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6E84BD55-4A6E-4AD4-B709-882166819E08} PAGE  146

    7562                      .dwattr $C$DW$824, DW_AT_name("OTW")
    7563                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_OTW")
    7564                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7565                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
    7566              
    7567              $C$DW$825       .dwtag  DW_TAG_member
    7568                      .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$73)
    7569                      .dwattr $C$DW$825, DW_AT_name("FETHA_OC")
    7570                      .dwattr $C$DW$825, DW_AT_TI_symbol_name("_FETHA_OC")
    7571                      .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7572                      .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
    7573              
    7574              $C$DW$826       .dwtag  DW_TAG_member
    7575                      .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$73)
    7576                      .dwattr $C$DW$826, DW_AT_name("FETLA_OC")
    7577                      .dwattr $C$DW$826, DW_AT_TI_symbol_name("_FETLA_OC")
    7578                      .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7579                      .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
    7580              
    7581              $C$DW$827       .dwtag  DW_TAG_member
    7582                      .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$73)
    7583                      .dwattr $C$DW$827, DW_AT_name("FETHB_OC")
    7584                      .dwattr $C$DW$827, DW_AT_TI_symbol_name("_FETHB_OC")
    7585                      .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7586                      .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
    7587              
    7588              $C$DW$828       .dwtag  DW_TAG_member
    7589                      .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$73)
    7590                      .dwattr $C$DW$828, DW_AT_name("FETLB_OC")
    7591                      .dwattr $C$DW$828, DW_AT_TI_symbol_name("_FETLB_OC")
    7592                      .dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7593                      .dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
    7594              
    7595              $C$DW$829       .dwtag  DW_TAG_member
    7596                      .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$73)
    7597                      .dwattr $C$DW$829, DW_AT_name("FETHC_OC")
    7598                      .dwattr $C$DW$829, DW_AT_TI_symbol_name("_FETHC_OC")
    7599                      .dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    7600                      .dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
    7601              
    7602              $C$DW$830       .dwtag  DW_TAG_member
    7603                      .dwattr $C$DW$830, DW_AT_type(*$C$DW$T$73)
    7604                      .dwattr $C$DW$830, DW_AT_name("FETLC_OC")
    7605                      .dwattr $C$DW$830, DW_AT_TI_symbol_name("_FETLC_OC")
    7606                      .dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7607                      .dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
    7608              
    7609                      .dwendtag $C$DW$T$105
    7610              
    7611              $C$DW$T$107     .dwtag  DW_TAG_typedef
