TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:36 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{320067CC-25B1-4107-9DEC-9DADEF9B9101} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                             PC v18.12.4.LTS *
       3              ;* Date/Time created: Wed Feb 22 13:06:36 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/GIANT/GIANT_TI_instaspin/motorware/motorware_1_01_00_18/sw/drivers/a
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v18.12.4.LTS Copyright (c) 1996-
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\GIANT\GIANT_TI_instaspin\motorware\motorware_1_01_00_18\sw\solut
      13              ;       C:\ti\ccs930\ccs\tools\compiler\ti-cgt-c2000_18.12.4.LTS\bin\opt2000.exe C:\\Users\\User\\AppData\\Lo

    3392              $C$DW$T$63      .dwtag  DW_TAG_typedef
    3393                      .dwattr $C$DW$T$63, DW_AT_name("ADC_TempSensorSrc_e")
    3394                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    3395                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    3396              
    3397              $C$DW$352       .dwtag  DW_TAG_TI_far_type
    3398                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$63)
    3399              
    3400              $C$DW$T$64      .dwtag  DW_TAG_const_type
    3401                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$352)
    3402              
    3403              
    3404              $C$DW$T$65      .dwtag  DW_TAG_enumeration_type
    3405                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x01)
    3406              $C$DW$353       .dwtag  DW_TAG_enumerator
    3407                      .dwattr $C$DW$353, DW_AT_name("ADC_VoltageRefSrc_Int")
    3408                      .dwattr $C$DW$353, DW_AT_const_value(0x00)
    3409              
    3410              $C$DW$354       .dwtag  DW_TAG_enumerator
    3411                      .dwattr $C$DW$354, DW_AT_name("ADC_VoltageRefSrc_Ext")
    3412                      .dwattr $C$DW$354, DW_AT_const_value(0x08)
    3413              
    3414                      .dwendtag $C$DW$T$65
    3415              
    3416              $C$DW$T$66      .dwtag  DW_TAG_typedef
    3417                      .dwattr $C$DW$T$66, DW_AT_name("ADC_VoltageRefSrc_e")
    3418                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    3419                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    3420              
    3421              $C$DW$355       .dwtag  DW_TAG_TI_far_type
    3422                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$66)
    3423              
    3424              $C$DW$T$67      .dwtag  DW_TAG_const_type
    3425                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$355)
    3426              
    3427              
    3428              $C$DW$T$68      .dwtag  DW_TAG_enumeration_type
    3429                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x01)
    3430              $C$DW$356       .dwtag  DW_TAG_enumerator
    3431                      .dwattr $C$DW$356, DW_AT_name("ADC_DivideSelect_ClkIn_by_1")
    3432                      .dwattr $C$DW$356, DW_AT_const_value(0x00)
    3433              
    3434              $C$DW$357       .dwtag  DW_TAG_enumerator
    3435                      .dwattr $C$DW$357, DW_AT_name("ADC_DivideSelect_ClkIn_by_2")
    3436                      .dwattr $C$DW$357, DW_AT_const_value(0x01)
    3437              
    3438              $C$DW$358       .dwtag  DW_TAG_enumerator
    3439                      .dwattr $C$DW$358, DW_AT_name("ADC_DivideSelect_ClkIn_by_4")
    3440                      .dwattr $C$DW$358, DW_AT_const_value(0x05)
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:36 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{320067CC-25B1-4107-9DEC-9DADEF9B9101} PAGE   65

    3441              
    3442                      .dwendtag $C$DW$T$68
    3443              
    3444              $C$DW$T$69      .dwtag  DW_TAG_typedef
    3445                      .dwattr $C$DW$T$69, DW_AT_name("ADC_DivideSelect_e")
    3446                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    3447                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    3448              
    3449              $C$DW$359       .dwtag  DW_TAG_TI_far_type
    3450                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$69)
    3451              
    3452              $C$DW$T$70      .dwtag  DW_TAG_const_type
    3453                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$359)
    3454              
    3455              
    3456              $C$DW$T$75      .dwtag  DW_TAG_enumeration_type
    3457                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x01)
    3458              $C$DW$360       .dwtag  DW_TAG_enumerator
    3459                      .dwattr $C$DW$360, DW_AT_name("ADC_NoIntTriggersSOC")
    3460                      .dwattr $C$DW$360, DW_AT_const_value(0x00)
    3461              
    3462              $C$DW$361       .dwtag  DW_TAG_enumerator
    3463                      .dwattr $C$DW$361, DW_AT_name("ADC_Int1TriggersSOC")
    3464                      .dwattr $C$DW$361, DW_AT_const_value(0x01)
    3465              
    3466              $C$DW$362       .dwtag  DW_TAG_enumerator
    3467                      .dwattr $C$DW$362, DW_AT_name("ADC_Int2TriggersSOC")
    3468                      .dwattr $C$DW$362, DW_AT_const_value(0x02)
    3469              
    3470                      .dwendtag $C$DW$T$75
    3471              
    3472              $C$DW$T$76      .dwtag  DW_TAG_typedef
    3473                      .dwattr $C$DW$T$76, DW_AT_name("ADC_IntTriggerSOC_e")
    3474                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    3475                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    3476              
    3477              $C$DW$363       .dwtag  DW_TAG_TI_far_type
    3478                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$76)
    3479              
    3480              $C$DW$T$77      .dwtag  DW_TAG_const_type
    3481                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$363)
    3482              
    3483              
    3484              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    3485                      .dwattr $C$DW$T$28, DW_AT_name("_ADC_Obj_")
    3486                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x6650)
    3487              $C$DW$364       .dwtag  DW_TAG_member
    3488                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$22)
    3489                      .dwattr $C$DW$364, DW_AT_name("ADCRESULT")
    3490                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_ADCRESULT")
    3491                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3492                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3493              
    3494              $C$DW$365       .dwtag  DW_TAG_member
    3495                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:36 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{320067CC-25B1-4107-9DEC-9DADEF9B9101} PAGE   66

    3496                      .dwattr $C$DW$365, DW_AT_name("resvd_1")
    3497                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_resvd_1")
    3498                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3499                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3500              
    3501              $C$DW$366       .dwtag  DW_TAG_member
    3502                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$21)
    3503                      .dwattr $C$DW$366, DW_AT_name("ADCCTL1")
    3504                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_ADCCTL1")
    3505                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    3506                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3507              
    3508              $C$DW$367       .dwtag  DW_TAG_member
    3509                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$21)
    3510                      .dwattr $C$DW$367, DW_AT_name("ADCCTL2")
    3511                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_ADCCTL2")
    3512                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    3513                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3514              
    3515              $C$DW$368       .dwtag  DW_TAG_member
    3516                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$24)
    3517                      .dwattr $C$DW$368, DW_AT_name("rsvd_2")
    3518                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_rsvd_2")
    3519                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    3520                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3521              
    3522              $C$DW$369       .dwtag  DW_TAG_member
    3523                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$21)
    3524                      .dwattr $C$DW$369, DW_AT_name("ADCINTFLG")
    3525                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_ADCINTFLG")
    3526                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    3527                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3528              
    3529              $C$DW$370       .dwtag  DW_TAG_member
    3530                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$21)
    3531                      .dwattr $C$DW$370, DW_AT_name("ADCINTFLGCLR")
    3532                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    3533                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    3534                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3535              
    3536              $C$DW$371       .dwtag  DW_TAG_member
    3537                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$21)
    3538                      .dwattr $C$DW$371, DW_AT_name("ADCINTOVF")
    3539                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_ADCINTOVF")
    3540                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    3541                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3542              
    3543              $C$DW$372       .dwtag  DW_TAG_member
    3544                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$21)
    3545                      .dwattr $C$DW$372, DW_AT_name("ADCINTOVFCLR")
    3546                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    3547                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    3548                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3549              
    3550              $C$DW$373       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:36 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{320067CC-25B1-4107-9DEC-9DADEF9B9101} PAGE   67

    3551                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$25)
    3552                      .dwattr $C$DW$373, DW_AT_name("INTSELxNy")
    3553                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_INTSELxNy")
    3554                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    3555                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3556              
    3557              $C$DW$374       .dwtag  DW_TAG_member
    3558                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$26)
    3559                      .dwattr $C$DW$374, DW_AT_name("rsvd_3")
    3560                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_rsvd_3")
    3561                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    3562                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3563              
    3564              $C$DW$375       .dwtag  DW_TAG_member
    3565                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$21)
    3566                      .dwattr $C$DW$375, DW_AT_name("SOCPRICTRL")
    3567                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_SOCPRICTRL")
    3568                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    3569                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3570              
    3571              $C$DW$376       .dwtag  DW_TAG_member
    3572                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$21)
    3573                      .dwattr $C$DW$376, DW_AT_name("rsvd_4")
    3574                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_rsvd_4")
    3575                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    3576                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3577              
    3578              $C$DW$377       .dwtag  DW_TAG_member
    3579                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$21)
    3580                      .dwattr $C$DW$377, DW_AT_name("ADCSAMPLEMODE")
    3581                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    3582                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    3583                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3584              
    3585              $C$DW$378       .dwtag  DW_TAG_member
    3586                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$21)
    3587                      .dwattr $C$DW$378, DW_AT_name("rsvd_5")
    3588                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_rsvd_5")
    3589                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    3590                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3591              
    3592              $C$DW$379       .dwtag  DW_TAG_member
    3593                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$21)
    3594                      .dwattr $C$DW$379, DW_AT_name("ADCINTSOCSEL1")
    3595                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    3596                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    3597                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3598              
    3599              $C$DW$380       .dwtag  DW_TAG_member
    3600                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$21)
    3601                      .dwattr $C$DW$380, DW_AT_name("ADCINTSOCSEL2")
    3602                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    3603                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    3604                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3605              
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:36 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{320067CC-25B1-4107-9DEC-9DADEF9B9101} PAGE   68

    3606              $C$DW$381       .dwtag  DW_TAG_member
    3607                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$24)
    3608                      .dwattr $C$DW$381, DW_AT_name("rsvd_6")
    3609                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_rsvd_6")
    3610                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    3611                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3612              
    3613              $C$DW$382       .dwtag  DW_TAG_member
    3614                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$21)
    3615                      .dwattr $C$DW$382, DW_AT_name("ADCSOCFLG1")
    3616                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    3617                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    3618                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3619              
    3620              $C$DW$383       .dwtag  DW_TAG_member
    3621                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$21)
    3622                      .dwattr $C$DW$383, DW_AT_name("rsvd_7")
    3623                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_rsvd_7")
    3624                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    3625                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3626              
    3627              $C$DW$384       .dwtag  DW_TAG_member
    3628                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$21)
    3629                      .dwattr $C$DW$384, DW_AT_name("ADCSOCFRC1")
    3630                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    3631                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    3632                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3633              
    3634              $C$DW$385       .dwtag  DW_TAG_member
    3635                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$21)
    3636                      .dwattr $C$DW$385, DW_AT_name("rsvd_8")
    3637                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_rsvd_8")
    3638                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    3639                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3640              
    3641              $C$DW$386       .dwtag  DW_TAG_member
    3642                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$21)
    3643                      .dwattr $C$DW$386, DW_AT_name("ADCSOCOVF1")
    3644                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    3645                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    3646                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3647              
    3648              $C$DW$387       .dwtag  DW_TAG_member
    3649                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$21)
    3650                      .dwattr $C$DW$387, DW_AT_name("rsvd_9")
    3651                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_rsvd_9")
    3652                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    3653                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3654              
    3655              $C$DW$388       .dwtag  DW_TAG_member
    3656                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$21)
    3657                      .dwattr $C$DW$388, DW_AT_name("ADCSOCOVFCLR1")
    3658                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    3659                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    3660                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:36 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{320067CC-25B1-4107-9DEC-9DADEF9B9101} PAGE   69

    3661              
    3662              $C$DW$389       .dwtag  DW_TAG_member
    3663                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$21)
    3664                      .dwattr $C$DW$389, DW_AT_name("rsvd_10")
    3665                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_rsvd_10")
    3666                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    3667                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3668              
    3669              $C$DW$390       .dwtag  DW_TAG_member
    3670                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$22)
    3671                      .dwattr $C$DW$390, DW_AT_name("ADCSOCxCTL")
    3672                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    3673                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    3674                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3675              
    3676              $C$DW$391       .dwtag  DW_TAG_member
    3677                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$22)
    3678                      .dwattr $C$DW$391, DW_AT_name("rsvd_11")
    3679                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_rsvd_11")
    3680                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    3681                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3682              
    3683              $C$DW$392       .dwtag  DW_TAG_member
    3684                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$21)
    3685                      .dwattr $C$DW$392, DW_AT_name("ADCREFTRIM")
    3686                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_ADCREFTRIM")
    3687                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    3688                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3689              
    3690              $C$DW$393       .dwtag  DW_TAG_member
    3691                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$21)
    3692                      .dwattr $C$DW$393, DW_AT_name("ADCOFFTRIM")
    3693                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    3694                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    3695                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3696              
    3697              $C$DW$394       .dwtag  DW_TAG_member
    3698                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$27)
    3699                      .dwattr $C$DW$394, DW_AT_name("resvd_12")
    3700                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_resvd_12")
    3701                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    3702                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3703              
    3704              $C$DW$395       .dwtag  DW_TAG_member
    3705                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$21)
    3706                      .dwattr $C$DW$395, DW_AT_name("ADCREV")
    3707                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_ADCREV")
    3708                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    3709                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3710              
    3711                      .dwendtag $C$DW$T$28
    3712              
    3713              $C$DW$T$78      .dwtag  DW_TAG_typedef
    3714                      .dwattr $C$DW$T$78, DW_AT_name("ADC_Obj")
    3715                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$28)
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:36 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{320067CC-25B1-4107-9DEC-9DADEF9B9101} PAGE   70

    3716                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    3717              
    3718              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    3719                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$28)
    3720                      .dwattr $C$DW$T$71, DW_AT_address_class(0x20)
    3721              
    3722              $C$DW$T$72      .dwtag  DW_TAG_typedef
    3723                      .dwattr $C$DW$T$72, DW_AT_name("ADC_Handle")
    3724                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    3725                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    3726              
    3727              $C$DW$396       .dwtag  DW_TAG_TI_far_type
    3728                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$72)
    3729              
    3730              $C$DW$T$79      .dwtag  DW_TAG_const_type
    3731                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$396)
    3732              
    3733              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3734                      .dwattr $C$DW$T$2, DW_AT_name("void")
    3735              
    3736              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3737                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3738                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3739              
    3740              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3741                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3742                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3743                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3744              
    3745              $C$DW$T$5       .dwtag  DW_TAG_base_type
    3746                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3747                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3748                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3749              
    3750              $C$DW$T$6       .dwtag  DW_TAG_base_type
    3751                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3752                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3753                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3754              
    3755              $C$DW$T$7       .dwtag  DW_TAG_base_type
    3756                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3757                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3758                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    3759              
    3760              $C$DW$T$8       .dwtag  DW_TAG_base_type
    3761                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3762                      .dwattr $C$DW$T$8, DW_AT_name("short")
    3763                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    3764              
    3765              $C$DW$T$9       .dwtag  DW_TAG_base_type
    3766                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3767                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3768                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    3769              
    3770              $C$DW$T$10      .dwtag  DW_TAG_base_type
