TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:34:21 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{5EB11464-FD7C-4C50-A338-EF162D57D836} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.0.LTS *
       3              ;* Date/Time created: Wed Feb 22 11:34:20 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/GIANT/GIANT_TI_instaspin/motorware/motorware_1_01_00_18/sw/drivers/a
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.0.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\GIANT\GIANT_TI_instaspin\motorware\motorware_1_01_00_18\sw\solut
      13              ;       C:\ti\ccs1200\ccs\tools\compiler\ti-cgt-c2000_22.6.0.LTS\bin\opt2000.exe C:\\Users\\GA5354\\AppData\\

    3388              $C$DW$T$63      .dwtag  DW_TAG_typedef
    3389                      .dwattr $C$DW$T$63, DW_AT_name("ADC_TempSensorSrc_e")
    3390                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    3391                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    3392              
    3393              $C$DW$352       .dwtag  DW_TAG_TI_far_type
    3394                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$63)
    3395              
    3396              $C$DW$T$64      .dwtag  DW_TAG_const_type
    3397                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$352)
    3398              
    3399              
    3400              $C$DW$T$65      .dwtag  DW_TAG_enumeration_type
    3401                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x01)
    3402              $C$DW$353       .dwtag  DW_TAG_enumerator
    3403                      .dwattr $C$DW$353, DW_AT_name("ADC_VoltageRefSrc_Int")
    3404                      .dwattr $C$DW$353, DW_AT_const_value(0x00)
    3405              
    3406              $C$DW$354       .dwtag  DW_TAG_enumerator
    3407                      .dwattr $C$DW$354, DW_AT_name("ADC_VoltageRefSrc_Ext")
    3408                      .dwattr $C$DW$354, DW_AT_const_value(0x08)
    3409              
    3410                      .dwendtag $C$DW$T$65
    3411              
    3412              $C$DW$T$66      .dwtag  DW_TAG_typedef
    3413                      .dwattr $C$DW$T$66, DW_AT_name("ADC_VoltageRefSrc_e")
    3414                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    3415                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    3416              
    3417              $C$DW$355       .dwtag  DW_TAG_TI_far_type
    3418                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$66)
    3419              
    3420              $C$DW$T$67      .dwtag  DW_TAG_const_type
    3421                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$355)
    3422              
    3423              
    3424              $C$DW$T$68      .dwtag  DW_TAG_enumeration_type
    3425                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x01)
    3426              $C$DW$356       .dwtag  DW_TAG_enumerator
    3427                      .dwattr $C$DW$356, DW_AT_name("ADC_DivideSelect_ClkIn_by_1")
    3428                      .dwattr $C$DW$356, DW_AT_const_value(0x00)
    3429              
    3430              $C$DW$357       .dwtag  DW_TAG_enumerator
    3431                      .dwattr $C$DW$357, DW_AT_name("ADC_DivideSelect_ClkIn_by_2")
    3432                      .dwattr $C$DW$357, DW_AT_const_value(0x01)
    3433              
    3434              $C$DW$358       .dwtag  DW_TAG_enumerator
    3435                      .dwattr $C$DW$358, DW_AT_name("ADC_DivideSelect_ClkIn_by_4")
    3436                      .dwattr $C$DW$358, DW_AT_const_value(0x05)
    3437              
    3438                      .dwendtag $C$DW$T$68
    3439              
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:34:21 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{5EB11464-FD7C-4C50-A338-EF162D57D836} PAGE   65

    3440              $C$DW$T$69      .dwtag  DW_TAG_typedef
    3441                      .dwattr $C$DW$T$69, DW_AT_name("ADC_DivideSelect_e")
    3442                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    3443                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    3444              
    3445              $C$DW$359       .dwtag  DW_TAG_TI_far_type
    3446                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$69)
    3447              
    3448              $C$DW$T$70      .dwtag  DW_TAG_const_type
    3449                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$359)
    3450              
    3451              
    3452              $C$DW$T$75      .dwtag  DW_TAG_enumeration_type
    3453                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x01)
    3454              $C$DW$360       .dwtag  DW_TAG_enumerator
    3455                      .dwattr $C$DW$360, DW_AT_name("ADC_NoIntTriggersSOC")
    3456                      .dwattr $C$DW$360, DW_AT_const_value(0x00)
    3457              
    3458              $C$DW$361       .dwtag  DW_TAG_enumerator
    3459                      .dwattr $C$DW$361, DW_AT_name("ADC_Int1TriggersSOC")
    3460                      .dwattr $C$DW$361, DW_AT_const_value(0x01)
    3461              
    3462              $C$DW$362       .dwtag  DW_TAG_enumerator
    3463                      .dwattr $C$DW$362, DW_AT_name("ADC_Int2TriggersSOC")
    3464                      .dwattr $C$DW$362, DW_AT_const_value(0x02)
    3465              
    3466                      .dwendtag $C$DW$T$75
    3467              
    3468              $C$DW$T$76      .dwtag  DW_TAG_typedef
    3469                      .dwattr $C$DW$T$76, DW_AT_name("ADC_IntTriggerSOC_e")
    3470                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    3471                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    3472              
    3473              $C$DW$363       .dwtag  DW_TAG_TI_far_type
    3474                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$76)
    3475              
    3476              $C$DW$T$77      .dwtag  DW_TAG_const_type
    3477                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$363)
    3478              
    3479              
    3480              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    3481                      .dwattr $C$DW$T$28, DW_AT_name("_ADC_Obj_")
    3482                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x6650)
    3483              $C$DW$364       .dwtag  DW_TAG_member
    3484                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$22)
    3485                      .dwattr $C$DW$364, DW_AT_name("ADCRESULT")
    3486                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_ADCRESULT")
    3487                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3488                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3489              
    3490              $C$DW$365       .dwtag  DW_TAG_member
    3491                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$23)
    3492                      .dwattr $C$DW$365, DW_AT_name("resvd_1")
    3493                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_resvd_1")
    3494                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:34:21 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{5EB11464-FD7C-4C50-A338-EF162D57D836} PAGE   66

    3495                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3496              
    3497              $C$DW$366       .dwtag  DW_TAG_member
    3498                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$21)
    3499                      .dwattr $C$DW$366, DW_AT_name("ADCCTL1")
    3500                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_ADCCTL1")
    3501                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    3502                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3503              
    3504              $C$DW$367       .dwtag  DW_TAG_member
    3505                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$21)
    3506                      .dwattr $C$DW$367, DW_AT_name("ADCCTL2")
    3507                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_ADCCTL2")
    3508                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    3509                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3510              
    3511              $C$DW$368       .dwtag  DW_TAG_member
    3512                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$24)
    3513                      .dwattr $C$DW$368, DW_AT_name("rsvd_2")
    3514                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_rsvd_2")
    3515                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    3516                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3517              
    3518              $C$DW$369       .dwtag  DW_TAG_member
    3519                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$21)
    3520                      .dwattr $C$DW$369, DW_AT_name("ADCINTFLG")
    3521                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_ADCINTFLG")
    3522                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    3523                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3524              
    3525              $C$DW$370       .dwtag  DW_TAG_member
    3526                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$21)
    3527                      .dwattr $C$DW$370, DW_AT_name("ADCINTFLGCLR")
    3528                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    3529                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    3530                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3531              
    3532              $C$DW$371       .dwtag  DW_TAG_member
    3533                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$21)
    3534                      .dwattr $C$DW$371, DW_AT_name("ADCINTOVF")
    3535                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_ADCINTOVF")
    3536                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    3537                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3538              
    3539              $C$DW$372       .dwtag  DW_TAG_member
    3540                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$21)
    3541                      .dwattr $C$DW$372, DW_AT_name("ADCINTOVFCLR")
    3542                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    3543                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    3544                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3545              
    3546              $C$DW$373       .dwtag  DW_TAG_member
    3547                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$25)
    3548                      .dwattr $C$DW$373, DW_AT_name("INTSELxNy")
    3549                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_INTSELxNy")
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:34:21 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{5EB11464-FD7C-4C50-A338-EF162D57D836} PAGE   67

    3550                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    3551                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3552              
    3553              $C$DW$374       .dwtag  DW_TAG_member
    3554                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$26)
    3555                      .dwattr $C$DW$374, DW_AT_name("rsvd_3")
    3556                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_rsvd_3")
    3557                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    3558                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3559              
    3560              $C$DW$375       .dwtag  DW_TAG_member
    3561                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$21)
    3562                      .dwattr $C$DW$375, DW_AT_name("SOCPRICTRL")
    3563                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_SOCPRICTRL")
    3564                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    3565                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3566              
    3567              $C$DW$376       .dwtag  DW_TAG_member
    3568                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$21)
    3569                      .dwattr $C$DW$376, DW_AT_name("rsvd_4")
    3570                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_rsvd_4")
    3571                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    3572                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3573              
    3574              $C$DW$377       .dwtag  DW_TAG_member
    3575                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$21)
    3576                      .dwattr $C$DW$377, DW_AT_name("ADCSAMPLEMODE")
    3577                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    3578                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    3579                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3580              
    3581              $C$DW$378       .dwtag  DW_TAG_member
    3582                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$21)
    3583                      .dwattr $C$DW$378, DW_AT_name("rsvd_5")
    3584                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_rsvd_5")
    3585                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    3586                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3587              
    3588              $C$DW$379       .dwtag  DW_TAG_member
    3589                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$21)
    3590                      .dwattr $C$DW$379, DW_AT_name("ADCINTSOCSEL1")
    3591                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    3592                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    3593                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3594              
    3595              $C$DW$380       .dwtag  DW_TAG_member
    3596                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$21)
    3597                      .dwattr $C$DW$380, DW_AT_name("ADCINTSOCSEL2")
    3598                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    3599                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    3600                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3601              
    3602              $C$DW$381       .dwtag  DW_TAG_member
    3603                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$24)
    3604                      .dwattr $C$DW$381, DW_AT_name("rsvd_6")
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:34:21 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{5EB11464-FD7C-4C50-A338-EF162D57D836} PAGE   68

    3605                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_rsvd_6")
    3606                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    3607                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3608              
    3609              $C$DW$382       .dwtag  DW_TAG_member
    3610                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$21)
    3611                      .dwattr $C$DW$382, DW_AT_name("ADCSOCFLG1")
    3612                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    3613                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    3614                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3615              
    3616              $C$DW$383       .dwtag  DW_TAG_member
    3617                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$21)
    3618                      .dwattr $C$DW$383, DW_AT_name("rsvd_7")
    3619                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_rsvd_7")
    3620                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    3621                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3622              
    3623              $C$DW$384       .dwtag  DW_TAG_member
    3624                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$21)
    3625                      .dwattr $C$DW$384, DW_AT_name("ADCSOCFRC1")
    3626                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    3627                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    3628                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3629              
    3630              $C$DW$385       .dwtag  DW_TAG_member
    3631                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$21)
    3632                      .dwattr $C$DW$385, DW_AT_name("rsvd_8")
    3633                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_rsvd_8")
    3634                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    3635                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3636              
    3637              $C$DW$386       .dwtag  DW_TAG_member
    3638                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$21)
    3639                      .dwattr $C$DW$386, DW_AT_name("ADCSOCOVF1")
    3640                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    3641                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    3642                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3643              
    3644              $C$DW$387       .dwtag  DW_TAG_member
    3645                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$21)
    3646                      .dwattr $C$DW$387, DW_AT_name("rsvd_9")
    3647                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_rsvd_9")
    3648                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    3649                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3650              
    3651              $C$DW$388       .dwtag  DW_TAG_member
    3652                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$21)
    3653                      .dwattr $C$DW$388, DW_AT_name("ADCSOCOVFCLR1")
    3654                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    3655                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    3656                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3657              
    3658              $C$DW$389       .dwtag  DW_TAG_member
    3659                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:34:21 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{5EB11464-FD7C-4C50-A338-EF162D57D836} PAGE   69

    3660                      .dwattr $C$DW$389, DW_AT_name("rsvd_10")
    3661                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_rsvd_10")
    3662                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    3663                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3664              
    3665              $C$DW$390       .dwtag  DW_TAG_member
    3666                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$22)
    3667                      .dwattr $C$DW$390, DW_AT_name("ADCSOCxCTL")
    3668                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    3669                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    3670                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3671              
    3672              $C$DW$391       .dwtag  DW_TAG_member
    3673                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$22)
    3674                      .dwattr $C$DW$391, DW_AT_name("rsvd_11")
    3675                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_rsvd_11")
    3676                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    3677                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3678              
    3679              $C$DW$392       .dwtag  DW_TAG_member
    3680                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$21)
    3681                      .dwattr $C$DW$392, DW_AT_name("ADCREFTRIM")
    3682                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_ADCREFTRIM")
    3683                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    3684                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3685              
    3686              $C$DW$393       .dwtag  DW_TAG_member
    3687                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$21)
    3688                      .dwattr $C$DW$393, DW_AT_name("ADCOFFTRIM")
    3689                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    3690                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    3691                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3692              
    3693              $C$DW$394       .dwtag  DW_TAG_member
    3694                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$27)
    3695                      .dwattr $C$DW$394, DW_AT_name("resvd_12")
    3696                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_resvd_12")
    3697                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    3698                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3699              
    3700              $C$DW$395       .dwtag  DW_TAG_member
    3701                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$21)
    3702                      .dwattr $C$DW$395, DW_AT_name("ADCREV")
    3703                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_ADCREV")
    3704                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    3705                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3706              
    3707                      .dwendtag $C$DW$T$28
    3708              
    3709              $C$DW$T$78      .dwtag  DW_TAG_typedef
    3710                      .dwattr $C$DW$T$78, DW_AT_name("ADC_Obj")
    3711                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$28)
    3712                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    3713              
    3714              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:34:21 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{5EB11464-FD7C-4C50-A338-EF162D57D836} PAGE   70

    3715                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$28)
    3716                      .dwattr $C$DW$T$71, DW_AT_address_class(0x20)
    3717              
    3718              $C$DW$T$72      .dwtag  DW_TAG_typedef
    3719                      .dwattr $C$DW$T$72, DW_AT_name("ADC_Handle")
    3720                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    3721                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    3722              
    3723              $C$DW$396       .dwtag  DW_TAG_TI_far_type
    3724                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$72)
    3725              
    3726              $C$DW$T$79      .dwtag  DW_TAG_const_type
    3727                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$396)
    3728              
    3729              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3730                      .dwattr $C$DW$T$2, DW_AT_name("void")
    3731              
    3732              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3733                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3734                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3735              
    3736              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3737                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3738                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3739                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3740              
    3741              $C$DW$T$5       .dwtag  DW_TAG_base_type
    3742                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3743                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3744                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3745              
    3746              $C$DW$T$6       .dwtag  DW_TAG_base_type
    3747                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3748                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3749                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3750              
    3751              $C$DW$T$7       .dwtag  DW_TAG_base_type
    3752                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3753                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3754                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    3755              
    3756              $C$DW$T$8       .dwtag  DW_TAG_base_type
    3757                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3758                      .dwattr $C$DW$T$8, DW_AT_name("short")
    3759                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    3760              
    3761              $C$DW$T$9       .dwtag  DW_TAG_base_type
    3762                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3763                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3764                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    3765              
    3766              $C$DW$T$10      .dwtag  DW_TAG_base_type
