TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:28 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{ACBAF943-9FA4-4A12-94B4-A2BF97C77D4E} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                             PC v18.12.4.LTS *
       3              ;* Date/Time created: Fri Feb 17 15:09:28 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/GIANT/GAINT_TI_instaspin/motorware/motorware_1_01_00_18/sw/drivers/c
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v18.12.4.LTS Copyright (c) 1996-
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\GIANT\GAINT_TI_instaspin\motorware\motorware_1_01_00_18\sw\solut
      13              ;       C:\ti\ccs930\ccs\tools\compiler\ti-cgt-c2000_18.12.4.LTS\bin\opt2000.exe C:\\Users\\User\\AppData\\Lo

    3799                      .dwattr $C$DW$268, DW_AT_name("CLK_Timer2PreScaler_by_1")
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:28 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{ACBAF943-9FA4-4A12-94B4-A2BF97C77D4E} PAGE   71

    3800                      .dwattr $C$DW$268, DW_AT_const_value(0x00)
    3801              
    3802              $C$DW$269       .dwtag  DW_TAG_enumerator
    3803                      .dwattr $C$DW$269, DW_AT_name("CLK_Timer2PreScaler_by_2")
    3804                      .dwattr $C$DW$269, DW_AT_const_value(0x20)
    3805              
    3806              $C$DW$270       .dwtag  DW_TAG_enumerator
    3807                      .dwattr $C$DW$270, DW_AT_name("CLK_Timer2PreScaler_by_4")
    3808                      .dwattr $C$DW$270, DW_AT_const_value(0x40)
    3809              
    3810              $C$DW$271       .dwtag  DW_TAG_enumerator
    3811                      .dwattr $C$DW$271, DW_AT_name("CLK_Timer2PreScaler_by_8")
    3812                      .dwattr $C$DW$271, DW_AT_const_value(0x60)
    3813              
    3814              $C$DW$272       .dwtag  DW_TAG_enumerator
    3815                      .dwattr $C$DW$272, DW_AT_name("CLK_Timer2PreScaler_by_16")
    3816                      .dwattr $C$DW$272, DW_AT_const_value(0x80)
    3817              
    3818                      .dwendtag $C$DW$T$49
    3819              
    3820              $C$DW$T$50      .dwtag  DW_TAG_typedef
    3821                      .dwattr $C$DW$T$50, DW_AT_name("CLK_Timer2PreScaler_e")
    3822                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    3823                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    3824              
    3825              $C$DW$273       .dwtag  DW_TAG_TI_far_type
    3826                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$50)
    3827              
    3828              $C$DW$T$51      .dwtag  DW_TAG_const_type
    3829                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$273)
    3830              
    3831              
    3832              $C$DW$T$52      .dwtag  DW_TAG_enumeration_type
    3833                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    3834              $C$DW$274       .dwtag  DW_TAG_enumerator
    3835                      .dwattr $C$DW$274, DW_AT_name("CLK_Timer2Src_SysClk")
    3836                      .dwattr $C$DW$274, DW_AT_const_value(0x00)
    3837              
    3838              $C$DW$275       .dwtag  DW_TAG_enumerator
    3839                      .dwattr $C$DW$275, DW_AT_name("CLK_Timer2Src_ExtOsc")
    3840                      .dwattr $C$DW$275, DW_AT_const_value(0x08)
    3841              
    3842              $C$DW$276       .dwtag  DW_TAG_enumerator
    3843                      .dwattr $C$DW$276, DW_AT_name("CLK_Timer2Src_IntOsc1")
    3844                      .dwattr $C$DW$276, DW_AT_const_value(0x10)
    3845              
    3846              $C$DW$277       .dwtag  DW_TAG_enumerator
    3847                      .dwattr $C$DW$277, DW_AT_name("CLK_Timer2Src_IntOsc2")
    3848                      .dwattr $C$DW$277, DW_AT_const_value(0x18)
    3849              
    3850                      .dwendtag $C$DW$T$52
    3851              
    3852              $C$DW$T$53      .dwtag  DW_TAG_typedef
    3853                      .dwattr $C$DW$T$53, DW_AT_name("CLK_Timer2Src_e")
    3854                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:28 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{ACBAF943-9FA4-4A12-94B4-A2BF97C77D4E} PAGE   72

    3855                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    3856              
    3857              $C$DW$278       .dwtag  DW_TAG_TI_far_type
    3858                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$53)
    3859              
    3860              $C$DW$T$54      .dwtag  DW_TAG_const_type
    3861                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$278)
    3862              
    3863              
    3864              $C$DW$T$55      .dwtag  DW_TAG_enumeration_type
    3865                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x01)
    3866              $C$DW$279       .dwtag  DW_TAG_enumerator
    3867                      .dwattr $C$DW$279, DW_AT_name("CLK_WdClkSrc_IntOsc1")
    3868                      .dwattr $C$DW$279, DW_AT_const_value(0x00)
    3869              
    3870              $C$DW$280       .dwtag  DW_TAG_enumerator
    3871                      .dwattr $C$DW$280, DW_AT_name("CLK_WdClkSrc_ExtOscOrIntOsc2")
    3872                      .dwattr $C$DW$280, DW_AT_const_value(0x04)
    3873              
    3874                      .dwendtag $C$DW$T$55
    3875              
    3876              $C$DW$T$56      .dwtag  DW_TAG_typedef
    3877                      .dwattr $C$DW$T$56, DW_AT_name("CLK_WdClkSrc_e")
    3878                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    3879                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    3880              
    3881              $C$DW$281       .dwtag  DW_TAG_TI_far_type
    3882                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$56)
    3883              
    3884              $C$DW$T$57      .dwtag  DW_TAG_const_type
    3885                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$281)
    3886              
    3887              
    3888              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    3889                      .dwattr $C$DW$T$24, DW_AT_name("_CLK_Obj_")
    3890                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x11)
    3891              $C$DW$282       .dwtag  DW_TAG_member
    3892                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$21)
    3893                      .dwattr $C$DW$282, DW_AT_name("XCLK")
    3894                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_XCLK")
    3895                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3896                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3897              
    3898              $C$DW$283       .dwtag  DW_TAG_member
    3899                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$21)
    3900                      .dwattr $C$DW$283, DW_AT_name("rsvd_1")
    3901                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_rsvd_1")
    3902                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3903                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3904              
    3905              $C$DW$284       .dwtag  DW_TAG_member
    3906                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$21)
    3907                      .dwattr $C$DW$284, DW_AT_name("CLKCTL")
    3908                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_CLKCTL")
    3909                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:28 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{ACBAF943-9FA4-4A12-94B4-A2BF97C77D4E} PAGE   73

    3910                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3911              
    3912              $C$DW$285       .dwtag  DW_TAG_member
    3913                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$22)
    3914                      .dwattr $C$DW$285, DW_AT_name("rsvd_2")
    3915                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_rsvd_2")
    3916                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3917                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3918              
    3919              $C$DW$286       .dwtag  DW_TAG_member
    3920                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$21)
    3921                      .dwattr $C$DW$286, DW_AT_name("LOSPCP")
    3922                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_LOSPCP")
    3923                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3924                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3925              
    3926              $C$DW$287       .dwtag  DW_TAG_member
    3927                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$21)
    3928                      .dwattr $C$DW$287, DW_AT_name("PCLKCR0")
    3929                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_PCLKCR0")
    3930                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3931                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3932              
    3933              $C$DW$288       .dwtag  DW_TAG_member
    3934                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$21)
    3935                      .dwattr $C$DW$288, DW_AT_name("PCLKCR1")
    3936                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_PCLKCR1")
    3937                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3938                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3939              
    3940              $C$DW$289       .dwtag  DW_TAG_member
    3941                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$23)
    3942                      .dwattr $C$DW$289, DW_AT_name("rsvd_3")
    3943                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_rsvd_3")
    3944                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3945                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3946              
    3947              $C$DW$290       .dwtag  DW_TAG_member
    3948                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$21)
    3949                      .dwattr $C$DW$290, DW_AT_name("PCLKCR3")
    3950                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_PCLKCR3")
    3951                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3952                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3953              
    3954                      .dwendtag $C$DW$T$24
    3955              
    3956              $C$DW$T$58      .dwtag  DW_TAG_typedef
    3957                      .dwattr $C$DW$T$58, DW_AT_name("CLK_Obj")
    3958                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$24)
    3959                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    3960              
    3961              $C$DW$T$59      .dwtag  DW_TAG_pointer_type
    3962                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$24)
    3963                      .dwattr $C$DW$T$59, DW_AT_address_class(0x20)
    3964              
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:28 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{ACBAF943-9FA4-4A12-94B4-A2BF97C77D4E} PAGE   74

    3965              $C$DW$T$60      .dwtag  DW_TAG_typedef
    3966                      .dwattr $C$DW$T$60, DW_AT_name("CLK_Handle")
    3967                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    3968                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    3969              
    3970              $C$DW$291       .dwtag  DW_TAG_TI_far_type
    3971                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$60)
    3972              
    3973              $C$DW$T$61      .dwtag  DW_TAG_const_type
    3974                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$291)
    3975              
    3976              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3977                      .dwattr $C$DW$T$2, DW_AT_name("void")
    3978              
    3979              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3980                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3981                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3982              
    3983              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3984                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3985                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3986                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3987              
    3988              $C$DW$T$5       .dwtag  DW_TAG_base_type
    3989                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3990                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3991                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3992              
    3993              $C$DW$T$6       .dwtag  DW_TAG_base_type
    3994                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3995                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3996                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3997              
    3998              $C$DW$T$7       .dwtag  DW_TAG_base_type
    3999                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    4000                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    4001                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    4002              
    4003              $C$DW$T$8       .dwtag  DW_TAG_base_type
    4004                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    4005                      .dwattr $C$DW$T$8, DW_AT_name("short")
    4006                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    4007              
    4008              $C$DW$T$9       .dwtag  DW_TAG_base_type
    4009                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    4010                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    4011                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    4012              
    4013              $C$DW$T$10      .dwtag  DW_TAG_base_type
