TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:41 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{37DBDC18-8316-4B16-94B2-B516506DF0E2} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                             PC v18.12.4.LTS *
       3              ;* Date/Time created: Tue Feb 21 14:51:40 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/GIANT/GAINT_TI_instaspin/motorware/motorware_1_01_00_18/sw/modules/c
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v18.12.4.LTS Copyright (c) 1996-
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\GIANT\GAINT_TI_instaspin\motorware\motorware_1_01_00_18\sw\solut
      13              
      14              ;**************************************************************
      15              ;* FUNCTION SYNONYMS                                          *

    7921                      .dwattr $C$DW$670, DW_AT_name("EST_State_RoverL")
    7922                      .dwattr $C$DW$670, DW_AT_const_value(0x02)
    7923              
    7924              $C$DW$671       .dwtag  DW_TAG_enumerator
    7925                      .dwattr $C$DW$671, DW_AT_name("EST_State_Rs")
    7926                      .dwattr $C$DW$671, DW_AT_const_value(0x03)
    7927              
    7928              $C$DW$672       .dwtag  DW_TAG_enumerator
    7929                      .dwattr $C$DW$672, DW_AT_name("EST_State_RampUp")
    7930                      .dwattr $C$DW$672, DW_AT_const_value(0x04)
    7931              
    7932              $C$DW$673       .dwtag  DW_TAG_enumerator
    7933                      .dwattr $C$DW$673, DW_AT_name("EST_State_IdRated")
    7934                      .dwattr $C$DW$673, DW_AT_const_value(0x05)
    7935              
    7936              $C$DW$674       .dwtag  DW_TAG_enumerator
    7937                      .dwattr $C$DW$674, DW_AT_name("EST_State_RatedFlux_OL")
    7938                      .dwattr $C$DW$674, DW_AT_const_value(0x06)
    7939              
    7940              $C$DW$675       .dwtag  DW_TAG_enumerator
    7941                      .dwattr $C$DW$675, DW_AT_name("EST_State_RatedFlux")
    7942                      .dwattr $C$DW$675, DW_AT_const_value(0x07)
    7943              
    7944              $C$DW$676       .dwtag  DW_TAG_enumerator
    7945                      .dwattr $C$DW$676, DW_AT_name("EST_State_RampDown")
    7946                      .dwattr $C$DW$676, DW_AT_const_value(0x08)
    7947              
    7948              $C$DW$677       .dwtag  DW_TAG_enumerator
    7949                      .dwattr $C$DW$677, DW_AT_name("EST_State_LockRotor")
    7950                      .dwattr $C$DW$677, DW_AT_const_value(0x09)
    7951              
    7952              $C$DW$678       .dwtag  DW_TAG_enumerator
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:41 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{37DBDC18-8316-4B16-94B2-B516506DF0E2} PAGE  152

    7953                      .dwattr $C$DW$678, DW_AT_name("EST_State_Ls")
    7954                      .dwattr $C$DW$678, DW_AT_const_value(0x0a)
    7955              
    7956              $C$DW$679       .dwtag  DW_TAG_enumerator
    7957                      .dwattr $C$DW$679, DW_AT_name("EST_State_Rr")
    7958                      .dwattr $C$DW$679, DW_AT_const_value(0x0b)
    7959              
    7960              $C$DW$680       .dwtag  DW_TAG_enumerator
    7961                      .dwattr $C$DW$680, DW_AT_name("EST_State_MotorIdentified")
    7962                      .dwattr $C$DW$680, DW_AT_const_value(0x0c)
    7963              
    7964              $C$DW$681       .dwtag  DW_TAG_enumerator
    7965                      .dwattr $C$DW$681, DW_AT_name("EST_State_OnLine")
    7966                      .dwattr $C$DW$681, DW_AT_const_value(0x0d)
    7967              
    7968              $C$DW$682       .dwtag  DW_TAG_enumerator
    7969                      .dwattr $C$DW$682, DW_AT_name("EST_numStates")
    7970                      .dwattr $C$DW$682, DW_AT_const_value(0x0e)
    7971              
    7972                      .dwendtag $C$DW$T$176
    7973              
    7974              $C$DW$T$177     .dwtag  DW_TAG_typedef
    7975                      .dwattr $C$DW$T$177, DW_AT_name("EST_State_e")
    7976                      .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$176)
    7977                      .dwattr $C$DW$T$177, DW_AT_language(DW_LANG_C)
    7978              
    7979              
    7980              $C$DW$T$181     .dwtag  DW_TAG_enumeration_type
    7981                      .dwattr $C$DW$T$181, DW_AT_byte_size(0x01)
    7982              $C$DW$683       .dwtag  DW_TAG_enumerator
    7983                      .dwattr $C$DW$683, DW_AT_name("CTRL_Type_PID_spd")
    7984                      .dwattr $C$DW$683, DW_AT_const_value(0x00)
    7985              
    7986              $C$DW$684       .dwtag  DW_TAG_enumerator
    7987                      .dwattr $C$DW$684, DW_AT_name("CTRL_Type_PID_Id")
    7988                      .dwattr $C$DW$684, DW_AT_const_value(0x01)
    7989              
    7990              $C$DW$685       .dwtag  DW_TAG_enumerator
    7991                      .dwattr $C$DW$685, DW_AT_name("CTRL_Type_PID_Iq")
    7992                      .dwattr $C$DW$685, DW_AT_const_value(0x02)
    7993              
    7994                      .dwendtag $C$DW$T$181
    7995              
    7996              $C$DW$T$182     .dwtag  DW_TAG_typedef
    7997                      .dwattr $C$DW$T$182, DW_AT_name("CTRL_Type_e")
    7998                      .dwattr $C$DW$T$182, DW_AT_type(*$C$DW$T$181)
    7999                      .dwattr $C$DW$T$182, DW_AT_language(DW_LANG_C)
    8000              
    8001              $C$DW$686       .dwtag  DW_TAG_TI_far_type
    8002                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$182)
    8003              
    8004              $C$DW$T$183     .dwtag  DW_TAG_const_type
    8005                      .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$686)
    8006              
    8007              
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:41 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{37DBDC18-8316-4B16-94B2-B516506DF0E2} PAGE  153

    8008              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    8009                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
    8010                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
    8011              $C$DW$687       .dwtag  DW_TAG_member
    8012                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$25)
    8013                      .dwattr $C$DW$687, DW_AT_name("ADCRESULT")
    8014                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_ADCRESULT")
    8015                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8016                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    8017              
    8018              $C$DW$688       .dwtag  DW_TAG_member
    8019                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$26)
    8020                      .dwattr $C$DW$688, DW_AT_name("resvd_1")
    8021                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_resvd_1")
    8022                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8023                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    8024              
    8025              $C$DW$689       .dwtag  DW_TAG_member
    8026                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$24)
    8027                      .dwattr $C$DW$689, DW_AT_name("ADCCTL1")
    8028                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_ADCCTL1")
    8029                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    8030                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    8031              
    8032              $C$DW$690       .dwtag  DW_TAG_member
    8033                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$24)
    8034                      .dwattr $C$DW$690, DW_AT_name("ADCCTL2")
    8035                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_ADCCTL2")
    8036                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    8037                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    8038              
    8039              $C$DW$691       .dwtag  DW_TAG_member
    8040                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$27)
    8041                      .dwattr $C$DW$691, DW_AT_name("rsvd_2")
    8042                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_rsvd_2")
    8043                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    8044                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    8045              
    8046              $C$DW$692       .dwtag  DW_TAG_member
    8047                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$24)
    8048                      .dwattr $C$DW$692, DW_AT_name("ADCINTFLG")
    8049                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_ADCINTFLG")
    8050                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    8051                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    8052              
    8053              $C$DW$693       .dwtag  DW_TAG_member
    8054                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$24)
    8055                      .dwattr $C$DW$693, DW_AT_name("ADCINTFLGCLR")
    8056                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    8057                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    8058                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    8059              
    8060              $C$DW$694       .dwtag  DW_TAG_member
    8061                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$24)
    8062                      .dwattr $C$DW$694, DW_AT_name("ADCINTOVF")
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:41 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{37DBDC18-8316-4B16-94B2-B516506DF0E2} PAGE  154

    8063                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_ADCINTOVF")
    8064                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    8065                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    8066              
    8067              $C$DW$695       .dwtag  DW_TAG_member
    8068                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$24)
    8069                      .dwattr $C$DW$695, DW_AT_name("ADCINTOVFCLR")
    8070                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    8071                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    8072                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    8073              
    8074              $C$DW$696       .dwtag  DW_TAG_member
    8075                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$28)
    8076                      .dwattr $C$DW$696, DW_AT_name("INTSELxNy")
    8077                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_INTSELxNy")
    8078                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    8079                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    8080              
    8081              $C$DW$697       .dwtag  DW_TAG_member
    8082                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$29)
    8083                      .dwattr $C$DW$697, DW_AT_name("rsvd_3")
    8084                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_rsvd_3")
    8085                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    8086                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    8087              
    8088              $C$DW$698       .dwtag  DW_TAG_member
    8089                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$24)
    8090                      .dwattr $C$DW$698, DW_AT_name("SOCPRICTRL")
    8091                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_SOCPRICTRL")
    8092                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    8093                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    8094              
    8095              $C$DW$699       .dwtag  DW_TAG_member
    8096                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$24)
    8097                      .dwattr $C$DW$699, DW_AT_name("rsvd_4")
    8098                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_rsvd_4")
    8099                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    8100                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    8101              
    8102              $C$DW$700       .dwtag  DW_TAG_member
    8103                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$24)
    8104                      .dwattr $C$DW$700, DW_AT_name("ADCSAMPLEMODE")
    8105                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    8106                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    8107                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    8108              
    8109              $C$DW$701       .dwtag  DW_TAG_member
    8110                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$24)
    8111                      .dwattr $C$DW$701, DW_AT_name("rsvd_5")
    8112                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_rsvd_5")
    8113                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    8114                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    8115              
    8116              $C$DW$702       .dwtag  DW_TAG_member
    8117                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:41 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{37DBDC18-8316-4B16-94B2-B516506DF0E2} PAGE  155

    8118                      .dwattr $C$DW$702, DW_AT_name("ADCINTSOCSEL1")
    8119                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    8120                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    8121                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    8122              
    8123              $C$DW$703       .dwtag  DW_TAG_member
    8124                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$24)
    8125                      .dwattr $C$DW$703, DW_AT_name("ADCINTSOCSEL2")
    8126                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    8127                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    8128                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    8129              
    8130              $C$DW$704       .dwtag  DW_TAG_member
    8131                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$27)
    8132                      .dwattr $C$DW$704, DW_AT_name("rsvd_6")
    8133                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_rsvd_6")
    8134                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    8135                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    8136              
    8137              $C$DW$705       .dwtag  DW_TAG_member
    8138                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$24)
    8139                      .dwattr $C$DW$705, DW_AT_name("ADCSOCFLG1")
    8140                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    8141                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    8142                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    8143              
    8144              $C$DW$706       .dwtag  DW_TAG_member
    8145                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$24)
    8146                      .dwattr $C$DW$706, DW_AT_name("rsvd_7")
    8147                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_rsvd_7")
    8148                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    8149                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    8150              
    8151              $C$DW$707       .dwtag  DW_TAG_member
    8152                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$24)
    8153                      .dwattr $C$DW$707, DW_AT_name("ADCSOCFRC1")
    8154                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    8155                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    8156                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    8157              
    8158              $C$DW$708       .dwtag  DW_TAG_member
    8159                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$24)
    8160                      .dwattr $C$DW$708, DW_AT_name("rsvd_8")
    8161                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_rsvd_8")
    8162                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    8163                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    8164              
    8165              $C$DW$709       .dwtag  DW_TAG_member
    8166                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$24)
    8167                      .dwattr $C$DW$709, DW_AT_name("ADCSOCOVF1")
    8168                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    8169                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    8170                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    8171              
    8172              $C$DW$710       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:41 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{37DBDC18-8316-4B16-94B2-B516506DF0E2} PAGE  156

    8173                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$24)
    8174                      .dwattr $C$DW$710, DW_AT_name("rsvd_9")
    8175                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_rsvd_9")
    8176                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    8177                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    8178              
    8179              $C$DW$711       .dwtag  DW_TAG_member
    8180                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$24)
    8181                      .dwattr $C$DW$711, DW_AT_name("ADCSOCOVFCLR1")
    8182                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    8183                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    8184                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    8185              
    8186              $C$DW$712       .dwtag  DW_TAG_member
    8187                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$24)
    8188                      .dwattr $C$DW$712, DW_AT_name("rsvd_10")
    8189                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_rsvd_10")
    8190                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    8191                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    8192              
    8193              $C$DW$713       .dwtag  DW_TAG_member
    8194                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$25)
    8195                      .dwattr $C$DW$713, DW_AT_name("ADCSOCxCTL")
    8196                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    8197                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    8198                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    8199              
    8200              $C$DW$714       .dwtag  DW_TAG_member
    8201                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$25)
    8202                      .dwattr $C$DW$714, DW_AT_name("rsvd_11")
    8203                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_rsvd_11")
    8204                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    8205                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    8206              
    8207              $C$DW$715       .dwtag  DW_TAG_member
    8208                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$24)
    8209                      .dwattr $C$DW$715, DW_AT_name("ADCREFTRIM")
    8210                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_ADCREFTRIM")
    8211                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    8212                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    8213              
    8214              $C$DW$716       .dwtag  DW_TAG_member
    8215                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$24)
    8216                      .dwattr $C$DW$716, DW_AT_name("ADCOFFTRIM")
    8217                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    8218                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    8219                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    8220              
    8221              $C$DW$717       .dwtag  DW_TAG_member
    8222                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$30)
    8223                      .dwattr $C$DW$717, DW_AT_name("resvd_12")
    8224                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_resvd_12")
    8225                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    8226                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    8227              
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:41 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{37DBDC18-8316-4B16-94B2-B516506DF0E2} PAGE  157

    8228              $C$DW$718       .dwtag  DW_TAG_member
    8229                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$24)
    8230                      .dwattr $C$DW$718, DW_AT_name("ADCREV")
    8231                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_ADCREV")
    8232                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    8233                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    8234              
    8235                      .dwendtag $C$DW$T$31
    8236              
    8237              $C$DW$T$94      .dwtag  DW_TAG_pointer_type
    8238                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$31)
    8239                      .dwattr $C$DW$T$94, DW_AT_address_class(0x20)
    8240              
    8241              $C$DW$T$95      .dwtag  DW_TAG_typedef
    8242                      .dwattr $C$DW$T$95, DW_AT_name("ADC_Handle")
    8243                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
    8244                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    8245              
    8246              
    8247              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    8248                      .dwattr $C$DW$T$35, DW_AT_name("_CLARKE_Obj_")
    8249                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x06)
    8250              $C$DW$719       .dwtag  DW_TAG_member
    8251                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$32)
    8252                      .dwattr $C$DW$719, DW_AT_name("alpha_sf")
    8253                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_alpha_sf")
    8254                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8255                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    8256              
    8257              $C$DW$720       .dwtag  DW_TAG_member
    8258                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$32)
    8259                      .dwattr $C$DW$720, DW_AT_name("beta_sf")
    8260                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_beta_sf")
    8261                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8262                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    8263              
    8264              $C$DW$721       .dwtag  DW_TAG_member
    8265                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$34)
    8266                      .dwattr $C$DW$721, DW_AT_name("numSensors")
    8267                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_numSensors")
    8268                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8269                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    8270              
    8271                      .dwendtag $C$DW$T$35
    8272              
    8273              $C$DW$T$46      .dwtag  DW_TAG_typedef
    8274                      .dwattr $C$DW$T$46, DW_AT_name("CLARKE_Obj")
    8275                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$35)
    8276                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    8277              
    8278              $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    8279                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$35)
    8280                      .dwattr $C$DW$T$44, DW_AT_address_class(0x20)
    8281              
    8282              $C$DW$T$45      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:41 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{37DBDC18-8316-4B16-94B2-B516506DF0E2} PAGE  158

    8283                      .dwattr $C$DW$T$45, DW_AT_name("CLARKE_Handle")
    8284                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    8285                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    8286              
    8287              
    8288              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    8289                      .dwattr $C$DW$T$37, DW_AT_name("_CLK_Obj_")
    8290                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x11)
    8291              $C$DW$722       .dwtag  DW_TAG_member
    8292                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$24)
    8293                      .dwattr $C$DW$722, DW_AT_name("XCLK")
    8294                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_XCLK")
    8295                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8296                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    8297              
    8298              $C$DW$723       .dwtag  DW_TAG_member
    8299                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$24)
    8300                      .dwattr $C$DW$723, DW_AT_name("rsvd_1")
    8301                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_rsvd_1")
    8302                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8303                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    8304              
    8305              $C$DW$724       .dwtag  DW_TAG_member
    8306                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$24)
    8307                      .dwattr $C$DW$724, DW_AT_name("CLKCTL")
    8308                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_CLKCTL")
    8309                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8310                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    8311              
    8312              $C$DW$725       .dwtag  DW_TAG_member
    8313                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$36)
    8314                      .dwattr $C$DW$725, DW_AT_name("rsvd_2")
    8315                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_rsvd_2")
    8316                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8317                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    8318              
    8319              $C$DW$726       .dwtag  DW_TAG_member
    8320                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$24)
    8321                      .dwattr $C$DW$726, DW_AT_name("LOSPCP")
    8322                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_LOSPCP")
    8323                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    8324                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    8325              
    8326              $C$DW$727       .dwtag  DW_TAG_member
    8327                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$24)
    8328                      .dwattr $C$DW$727, DW_AT_name("PCLKCR0")
    8329                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_PCLKCR0")
    8330                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8331                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    8332              
    8333              $C$DW$728       .dwtag  DW_TAG_member
    8334                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$24)
    8335                      .dwattr $C$DW$728, DW_AT_name("PCLKCR1")
    8336                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_PCLKCR1")
    8337                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:41 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{37DBDC18-8316-4B16-94B2-B516506DF0E2} PAGE  159

    8338                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    8339              
    8340              $C$DW$729       .dwtag  DW_TAG_member
    8341                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$27)
    8342                      .dwattr $C$DW$729, DW_AT_name("rsvd_3")
    8343                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_rsvd_3")
    8344                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8345                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    8346              
    8347              $C$DW$730       .dwtag  DW_TAG_member
    8348                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$24)
    8349                      .dwattr $C$DW$730, DW_AT_name("PCLKCR3")
    8350                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_PCLKCR3")
    8351                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8352                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    8353              
    8354                      .dwendtag $C$DW$T$37
    8355              
    8356              $C$DW$T$96      .dwtag  DW_TAG_pointer_type
    8357                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$37)
    8358                      .dwattr $C$DW$T$96, DW_AT_address_class(0x20)
    8359              
    8360              $C$DW$T$97      .dwtag  DW_TAG_typedef
    8361                      .dwattr $C$DW$T$97, DW_AT_name("CLK_Handle")
    8362                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
    8363                      .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    8364              
    8365              
    8366              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    8367                      .dwattr $C$DW$T$38, DW_AT_name("_CPU_Obj_")
    8368                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    8369              $C$DW$731       .dwtag  DW_TAG_member
    8370                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$34)
    8371                      .dwattr $C$DW$731, DW_AT_name("tmp")
    8372                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_tmp")
    8373                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8374                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    8375              
    8376                      .dwendtag $C$DW$T$38
    8377              
    8378              $C$DW$T$98      .dwtag  DW_TAG_pointer_type
    8379                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$38)
    8380                      .dwattr $C$DW$T$98, DW_AT_address_class(0x20)
    8381              
    8382              $C$DW$T$99      .dwtag  DW_TAG_typedef
    8383                      .dwattr $C$DW$T$99, DW_AT_name("CPU_Handle")
    8384                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
    8385                      .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    8386              
    8387              
    8388              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    8389                      .dwattr $C$DW$T$74, DW_AT_name("_CTRL_Obj_")
    8390                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x10a)
    8391              $C$DW$732       .dwtag  DW_TAG_member
    8392                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$39)
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:41 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{37DBDC18-8316-4B16-94B2-B516506DF0E2} PAGE  160

    8393                      .dwattr $C$DW$732, DW_AT_name("version")
    8394                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_version")
    8395                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8396                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    8397              
    8398              $C$DW$733       .dwtag  DW_TAG_member
    8399                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$41)
    8400                      .dwattr $C$DW$733, DW_AT_name("state")
    8401                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_state")
    8402                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8403                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    8404              
    8405              $C$DW$734       .dwtag  DW_TAG_member
    8406                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$41)
    8407                      .dwattr $C$DW$734, DW_AT_name("prevState")
    8408                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_prevState")
    8409                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8410                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    8411              
    8412              $C$DW$735       .dwtag  DW_TAG_member
    8413                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$43)
    8414                      .dwattr $C$DW$735, DW_AT_name("errorCode")
    8415                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_errorCode")
    8416                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8417                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    8418              
    8419              $C$DW$736       .dwtag  DW_TAG_member
    8420                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$45)
    8421                      .dwattr $C$DW$736, DW_AT_name("clarkeHandle_I")
    8422                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_clarkeHandle_I")
    8423                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8424                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    8425              
    8426              $C$DW$737       .dwtag  DW_TAG_member
    8427                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$46)
    8428                      .dwattr $C$DW$737, DW_AT_name("clarke_I")
    8429                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_clarke_I")
    8430                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8431                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    8432              
    8433              $C$DW$738       .dwtag  DW_TAG_member
    8434                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$45)
    8435                      .dwattr $C$DW$738, DW_AT_name("clarkeHandle_V")
    8436                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_clarkeHandle_V")
    8437                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8438                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    8439              
    8440              $C$DW$739       .dwtag  DW_TAG_member
    8441                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$46)
    8442                      .dwattr $C$DW$739, DW_AT_name("clarke_V")
    8443                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_clarke_V")
    8444                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8445                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    8446              
    8447              $C$DW$740       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:41 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{37DBDC18-8316-4B16-94B2-B516506DF0E2} PAGE  161

    8448                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$48)
    8449                      .dwattr $C$DW$740, DW_AT_name("estHandle")
    8450                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_estHandle")
    8451                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8452                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    8453              
    8454              $C$DW$741       .dwtag  DW_TAG_member
    8455                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$50)
    8456                      .dwattr $C$DW$741, DW_AT_name("parkHandle")
    8457                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_parkHandle")
    8458                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    8459                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    8460              
    8461              $C$DW$742       .dwtag  DW_TAG_member
    8462                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$51)
    8463                      .dwattr $C$DW$742, DW_AT_name("park")
    8464                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_park")
    8465                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8466                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    8467              
    8468              $C$DW$743       .dwtag  DW_TAG_member
    8469                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$53)
    8470                      .dwattr $C$DW$743, DW_AT_name("pidHandle_Id")
    8471                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_pidHandle_Id")
    8472                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8473                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    8474              
    8475              $C$DW$744       .dwtag  DW_TAG_member
    8476                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$54)
    8477                      .dwattr $C$DW$744, DW_AT_name("pid_Id")
    8478                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_pid_Id")
    8479                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    8480                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    8481              
    8482              $C$DW$745       .dwtag  DW_TAG_member
    8483                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$53)
    8484                      .dwattr $C$DW$745, DW_AT_name("pidHandle_Iq")
    8485                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_pidHandle_Iq")
    8486                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    8487                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    8488              
    8489              $C$DW$746       .dwtag  DW_TAG_member
    8490                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$54)
    8491                      .dwattr $C$DW$746, DW_AT_name("pid_Iq")
    8492                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_pid_Iq")
    8493                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    8494                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    8495              
    8496              $C$DW$747       .dwtag  DW_TAG_member
    8497                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$53)
    8498                      .dwattr $C$DW$747, DW_AT_name("pidHandle_spd")
    8499                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_pidHandle_spd")
    8500                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    8501                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    8502              
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:41 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{37DBDC18-8316-4B16-94B2-B516506DF0E2} PAGE  162

    8503              $C$DW$748       .dwtag  DW_TAG_member
    8504                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$54)
    8505                      .dwattr $C$DW$748, DW_AT_name("pid_spd")
    8506                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_pid_spd")
    8507                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    8508                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    8509              
    8510              $C$DW$749       .dwtag  DW_TAG_member
    8511                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$56)
    8512                      .dwattr $C$DW$749, DW_AT_name("iparkHandle")
    8513                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_iparkHandle")
    8514                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    8515                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    8516              
    8517              $C$DW$750       .dwtag  DW_TAG_member
    8518                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$57)
    8519                      .dwattr $C$DW$750, DW_AT_name("ipark")
    8520                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_ipark")
    8521                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    8522                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    8523              
    8524              $C$DW$751       .dwtag  DW_TAG_member
    8525                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$59)
    8526                      .dwattr $C$DW$751, DW_AT_name("svgenHandle")
    8527                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_svgenHandle")
    8528                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    8529                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    8530              
    8531              $C$DW$752       .dwtag  DW_TAG_member
    8532                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$60)
    8533                      .dwattr $C$DW$752, DW_AT_name("svgen")
    8534                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_svgen")
    8535                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    8536                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    8537              
    8538              $C$DW$753       .dwtag  DW_TAG_member
    8539                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$62)
    8540                      .dwattr $C$DW$753, DW_AT_name("trajHandle_Id")
    8541                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_trajHandle_Id")
    8542                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    8543                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    8544              
    8545              $C$DW$754       .dwtag  DW_TAG_member
    8546                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$63)
    8547                      .dwattr $C$DW$754, DW_AT_name("traj_Id")
    8548                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_traj_Id")
    8549                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    8550                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    8551              
    8552              $C$DW$755       .dwtag  DW_TAG_member
    8553                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$62)
    8554                      .dwattr $C$DW$755, DW_AT_name("trajHandle_spd")
    8555                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_trajHandle_spd")
    8556                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    8557                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:41 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{37DBDC18-8316-4B16-94B2-B516506DF0E2} PAGE  163

    8558              
    8559              $C$DW$756       .dwtag  DW_TAG_member
    8560                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$63)
    8561                      .dwattr $C$DW$756, DW_AT_name("traj_spd")
    8562                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_traj_spd")
    8563                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    8564                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    8565              
    8566              $C$DW$757       .dwtag  DW_TAG_member
    8567                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$62)
    8568                      .dwattr $C$DW$757, DW_AT_name("trajHandle_spdMax")
    8569                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    8570                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    8571                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    8572              
    8573              $C$DW$758       .dwtag  DW_TAG_member
    8574                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$63)
    8575                      .dwattr $C$DW$758, DW_AT_name("traj_spdMax")
    8576                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_traj_spdMax")
    8577                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    8578                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    8579              
    8580              $C$DW$759       .dwtag  DW_TAG_member
    8581                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$64)
    8582                      .dwattr $C$DW$759, DW_AT_name("motorParams")
    8583                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_motorParams")
    8584                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    8585                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    8586              
    8587              $C$DW$760       .dwtag  DW_TAG_member
    8588                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$68)
    8589                      .dwattr $C$DW$760, DW_AT_name("waitTimes")
    8590                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_waitTimes")
    8591                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    8592                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    8593              
    8594              $C$DW$761       .dwtag  DW_TAG_member
    8595                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$67)
    8596                      .dwattr $C$DW$761, DW_AT_name("counter_state")
    8597                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_counter_state")
    8598                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    8599                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    8600              
    8601              $C$DW$762       .dwtag  DW_TAG_member
    8602                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$70)
    8603                      .dwattr $C$DW$762, DW_AT_name("numIsrTicksPerCtrlTick")
    8604                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    8605                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    8606                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    8607              
    8608              $C$DW$763       .dwtag  DW_TAG_member
    8609                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$70)
    8610                      .dwattr $C$DW$763, DW_AT_name("numCtrlTicksPerCurrentTick")
    8611                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    8612                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:41 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{37DBDC18-8316-4B16-94B2-B516506DF0E2} PAGE  164

    8613                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    8614              
    8615              $C$DW$764       .dwtag  DW_TAG_member
    8616                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$70)
    8617                      .dwattr $C$DW$764, DW_AT_name("numCtrlTicksPerSpeedTick")
    8618                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    8619                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    8620                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    8621              
    8622              $C$DW$765       .dwtag  DW_TAG_member
    8623                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$70)
    8624                      .dwattr $C$DW$765, DW_AT_name("numCtrlTicksPerTrajTick")
    8625                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    8626                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    8627                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    8628              
    8629              $C$DW$766       .dwtag  DW_TAG_member
    8630                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$67)
    8631                      .dwattr $C$DW$766, DW_AT_name("ctrlFreq_Hz")
    8632                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    8633                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    8634                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    8635              
    8636              $C$DW$767       .dwtag  DW_TAG_member
    8637                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$67)
    8638                      .dwattr $C$DW$767, DW_AT_name("trajFreq_Hz")
    8639                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_trajFreq_Hz")
    8640                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    8641                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    8642              
    8643              $C$DW$768       .dwtag  DW_TAG_member
    8644                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$32)
    8645                      .dwattr $C$DW$768, DW_AT_name("trajPeriod_sec")
    8646                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_trajPeriod_sec")
    8647                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    8648                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    8649              
    8650              $C$DW$769       .dwtag  DW_TAG_member
    8651                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$71)
    8652                      .dwattr $C$DW$769, DW_AT_name("ctrlPeriod_sec")
    8653                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    8654                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    8655                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    8656              
    8657              $C$DW$770       .dwtag  DW_TAG_member
    8658                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$32)
    8659                      .dwattr $C$DW$770, DW_AT_name("maxVsMag_pu")
    8660                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_maxVsMag_pu")
    8661                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    8662                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    8663              
    8664              $C$DW$771       .dwtag  DW_TAG_member
    8665                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$72)
    8666                      .dwattr $C$DW$771, DW_AT_name("Iab_in")
    8667                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_Iab_in")
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:41 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{37DBDC18-8316-4B16-94B2-B516506DF0E2} PAGE  165

    8668                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    8669                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    8670              
    8671              $C$DW$772       .dwtag  DW_TAG_member
    8672                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$72)
    8673                      .dwattr $C$DW$772, DW_AT_name("Iab_filt")
    8674                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_Iab_filt")
    8675                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    8676                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    8677              
    8678              $C$DW$773       .dwtag  DW_TAG_member
    8679                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$72)
    8680                      .dwattr $C$DW$773, DW_AT_name("Idq_in")
    8681                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_Idq_in")
    8682                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    8683                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    8684              
    8685              $C$DW$774       .dwtag  DW_TAG_member
    8686                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$72)
    8687                      .dwattr $C$DW$774, DW_AT_name("Vab_in")
    8688                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_Vab_in")
    8689                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    8690                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    8691              
    8692              $C$DW$775       .dwtag  DW_TAG_member
    8693                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$32)
    8694                      .dwattr $C$DW$775, DW_AT_name("spd_out")
    8695                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_spd_out")
    8696                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    8697                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    8698              
    8699              $C$DW$776       .dwtag  DW_TAG_member
    8700                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$72)
    8701                      .dwattr $C$DW$776, DW_AT_name("Vab_out")
    8702                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_Vab_out")
    8703                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    8704                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    8705              
    8706              $C$DW$777       .dwtag  DW_TAG_member
    8707                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$72)
    8708                      .dwattr $C$DW$777, DW_AT_name("Vdq_out")
    8709                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_Vdq_out")
    8710                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    8711                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    8712              
    8713              $C$DW$778       .dwtag  DW_TAG_member
    8714                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$71)
    8715                      .dwattr $C$DW$778, DW_AT_name("Rhf")
    8716                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_Rhf")
    8717                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    8718                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    8719              
    8720              $C$DW$779       .dwtag  DW_TAG_member
    8721                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$71)
    8722                      .dwattr $C$DW$779, DW_AT_name("Lhf")
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:41 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{37DBDC18-8316-4B16-94B2-B516506DF0E2} PAGE  166

    8723                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_Lhf")
    8724                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    8725                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    8726              
    8727              $C$DW$780       .dwtag  DW_TAG_member
    8728                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$71)
    8729                      .dwattr $C$DW$780, DW_AT_name("RoverL")
    8730                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_RoverL")
    8731                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    8732                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    8733              
    8734              $C$DW$781       .dwtag  DW_TAG_member
    8735                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$32)
    8736                      .dwattr $C$DW$781, DW_AT_name("Kp_Id")
    8737                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_Kp_Id")
    8738                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    8739                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    8740              
    8741              $C$DW$782       .dwtag  DW_TAG_member
    8742                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$32)
    8743                      .dwattr $C$DW$782, DW_AT_name("Kp_Iq")
    8744                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_Kp_Iq")
    8745                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    8746                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    8747              
    8748              $C$DW$783       .dwtag  DW_TAG_member
    8749                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$32)
    8750                      .dwattr $C$DW$783, DW_AT_name("Kp_spd")
    8751                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_Kp_spd")
    8752                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    8753                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    8754              
    8755              $C$DW$784       .dwtag  DW_TAG_member
    8756                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$32)
    8757                      .dwattr $C$DW$784, DW_AT_name("Ki_Id")
    8758                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_Ki_Id")
    8759                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    8760                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    8761              
    8762              $C$DW$785       .dwtag  DW_TAG_member
    8763                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$32)
    8764                      .dwattr $C$DW$785, DW_AT_name("Ki_Iq")
    8765                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_Ki_Iq")
    8766                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    8767                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    8768              
    8769              $C$DW$786       .dwtag  DW_TAG_member
    8770                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$32)
    8771                      .dwattr $C$DW$786, DW_AT_name("Ki_spd")
    8772                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_Ki_spd")
    8773                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    8774                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    8775              
    8776              $C$DW$787       .dwtag  DW_TAG_member
    8777                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$32)
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:41 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{37DBDC18-8316-4B16-94B2-B516506DF0E2} PAGE  167

    8778                      .dwattr $C$DW$787, DW_AT_name("Kd_Id")
    8779                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_Kd_Id")
    8780                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    8781                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    8782              
    8783              $C$DW$788       .dwtag  DW_TAG_member
    8784                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$32)
    8785                      .dwattr $C$DW$788, DW_AT_name("Kd_Iq")
    8786                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_Kd_Iq")
    8787                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    8788                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    8789              
    8790              $C$DW$789       .dwtag  DW_TAG_member
    8791                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$32)
    8792                      .dwattr $C$DW$789, DW_AT_name("Kd_spd")
    8793                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_Kd_spd")
    8794                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    8795                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    8796              
    8797              $C$DW$790       .dwtag  DW_TAG_member
    8798                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$32)
    8799                      .dwattr $C$DW$790, DW_AT_name("Ui_Id")
    8800                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_Ui_Id")
    8801                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    8802                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    8803              
    8804              $C$DW$791       .dwtag  DW_TAG_member
    8805                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$32)
    8806                      .dwattr $C$DW$791, DW_AT_name("Ui_Iq")
    8807                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_Ui_Iq")
    8808                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    8809                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    8810              
    8811              $C$DW$792       .dwtag  DW_TAG_member
    8812                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$32)
    8813                      .dwattr $C$DW$792, DW_AT_name("Ui_spd")
    8814                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_Ui_spd")
    8815                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    8816                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    8817              
    8818              $C$DW$793       .dwtag  DW_TAG_member
    8819                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$72)
    8820                      .dwattr $C$DW$793, DW_AT_name("Idq_ref")
    8821                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_Idq_ref")
    8822                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    8823                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    8824              
    8825              $C$DW$794       .dwtag  DW_TAG_member
    8826                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$32)
    8827                      .dwattr $C$DW$794, DW_AT_name("IdRated")
    8828                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_IdRated")
    8829                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    8830                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    8831              
    8832              $C$DW$795       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:41 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{37DBDC18-8316-4B16-94B2-B516506DF0E2} PAGE  168

    8833                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$32)
    8834                      .dwattr $C$DW$795, DW_AT_name("spd_ref")
    8835                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_spd_ref")
    8836                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    8837                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    8838              
    8839              $C$DW$796       .dwtag  DW_TAG_member
    8840                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$32)
    8841                      .dwattr $C$DW$796, DW_AT_name("spd_max")
    8842                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_spd_max")
    8843                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    8844                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    8845              
    8846              $C$DW$797       .dwtag  DW_TAG_member
    8847                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$70)
    8848                      .dwattr $C$DW$797, DW_AT_name("counter_current")
    8849                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_counter_current")
    8850                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    8851                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    8852              
    8853              $C$DW$798       .dwtag  DW_TAG_member
    8854                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$70)
    8855                      .dwattr $C$DW$798, DW_AT_name("counter_isr")
    8856                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_counter_isr")
    8857                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    8858                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    8859              
    8860              $C$DW$799       .dwtag  DW_TAG_member
    8861                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$70)
    8862                      .dwattr $C$DW$799, DW_AT_name("counter_speed")
    8863                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_counter_speed")
    8864                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    8865                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    8866              
    8867              $C$DW$800       .dwtag  DW_TAG_member
    8868                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$70)
    8869                      .dwattr $C$DW$800, DW_AT_name("counter_traj")
    8870                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_counter_traj")
    8871                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    8872                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    8873              
    8874              $C$DW$801       .dwtag  DW_TAG_member
    8875                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$73)
    8876                      .dwattr $C$DW$801, DW_AT_name("flag_enableCtrl")
    8877                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_flag_enableCtrl")
    8878                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    8879                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    8880              
    8881              $C$DW$802       .dwtag  DW_TAG_member
    8882                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$73)
    8883                      .dwattr $C$DW$802, DW_AT_name("flag_enableDcBusComp")
    8884                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    8885                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    8886                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    8887              
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:41 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{37DBDC18-8316-4B16-94B2-B516506DF0E2} PAGE  169

    8888              $C$DW$803       .dwtag  DW_TAG_member
    8889                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$73)
    8890                      .dwattr $C$DW$803, DW_AT_name("flag_enablePowerWarp")
    8891                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    8892                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    8893                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    8894              
    8895              $C$DW$804       .dwtag  DW_TAG_member
    8896                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$73)
    8897                      .dwattr $C$DW$804, DW_AT_name("flag_enableOffset")
    8898                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_flag_enableOffset")
    8899                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    8900                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    8901              
    8902              $C$DW$805       .dwtag  DW_TAG_member
    8903                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$73)
    8904                      .dwattr $C$DW$805, DW_AT_name("flag_enableSpeedCtrl")
    8905                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    8906                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    8907                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    8908              
    8909              $C$DW$806       .dwtag  DW_TAG_member
    8910                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$73)
    8911                      .dwattr $C$DW$806, DW_AT_name("flag_enableUserMotorParams")
    8912                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    8913                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    8914                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    8915              
    8916              $C$DW$807       .dwtag  DW_TAG_member
    8917                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$72)
    8918                      .dwattr $C$DW$807, DW_AT_name("Idq_offset_pu")
    8919                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_Idq_offset_pu")
    8920                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    8921                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    8922              
    8923              $C$DW$808       .dwtag  DW_TAG_member
    8924                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$72)
    8925                      .dwattr $C$DW$808, DW_AT_name("Vdq_offset_pu")
    8926                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    8927                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    8928                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    8929              
    8930              $C$DW$809       .dwtag  DW_TAG_member
    8931                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$32)
    8932                      .dwattr $C$DW$809, DW_AT_name("angle_pu")
    8933                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_angle_pu")
    8934                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    8935                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    8936              
    8937              $C$DW$810       .dwtag  DW_TAG_member
    8938                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$32)
    8939                      .dwattr $C$DW$810, DW_AT_name("speed_ref_pu")
    8940                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_speed_ref_pu")
    8941                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    8942                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:41 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{37DBDC18-8316-4B16-94B2-B516506DF0E2} PAGE  170

    8943              
    8944              $C$DW$811       .dwtag  DW_TAG_member
    8945                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$32)
    8946                      .dwattr $C$DW$811, DW_AT_name("speed_fb_pu")
    8947                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_speed_fb_pu")
    8948                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    8949                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    8950              
    8951              $C$DW$812       .dwtag  DW_TAG_member
    8952                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$32)
    8953                      .dwattr $C$DW$812, DW_AT_name("speed_outMax_pu")
    8954                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_speed_outMax_pu")
    8955                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    8956                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    8957              
    8958              $C$DW$813       .dwtag  DW_TAG_member
    8959                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$73)
    8960                      .dwattr $C$DW$813, DW_AT_name("flag_enableCurrentCtrl")
    8961                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    8962                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    8963                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    8964              
    8965              $C$DW$814       .dwtag  DW_TAG_member
    8966                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$32)
    8967                      .dwattr $C$DW$814, DW_AT_name("torque_head_comm")
    8968                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_torque_head_comm")
    8969                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    8970                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    8971              
    8972                      .dwendtag $C$DW$T$74
    8973              
    8974              $C$DW$T$184     .dwtag  DW_TAG_typedef
    8975                      .dwattr $C$DW$T$184, DW_AT_name("CTRL_Obj")
    8976                      .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$74)
    8977                      .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
    8978              
    8979              $C$DW$T$171     .dwtag  DW_TAG_pointer_type
    8980                      .dwattr $C$DW$T$171, DW_AT_type(*$C$DW$T$74)
    8981                      .dwattr $C$DW$T$171, DW_AT_address_class(0x20)
    8982              
    8983              $C$DW$T$172     .dwtag  DW_TAG_typedef
    8984                      .dwattr $C$DW$T$172, DW_AT_name("CTRL_Handle")
    8985                      .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$171)
    8986                      .dwattr $C$DW$T$172, DW_AT_language(DW_LANG_C)
    8987              
    8988              $C$DW$815       .dwtag  DW_TAG_TI_far_type
    8989                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$172)
    8990              
    8991              $C$DW$T$185     .dwtag  DW_TAG_const_type
    8992                      .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$815)
    8993              
    8994              
    8995              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    8996                      .dwattr $C$DW$T$77, DW_AT_name("_CTRL_Version_")
    8997                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x04)
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:41 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{37DBDC18-8316-4B16-94B2-B516506DF0E2} PAGE  171

    8998              $C$DW$816       .dwtag  DW_TAG_member
    8999                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$23)
    9000                      .dwattr $C$DW$816, DW_AT_name("rsvd")
    9001                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_rsvd")
    9002                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9003                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    9004              
    9005              $C$DW$817       .dwtag  DW_TAG_member
    9006                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$76)
    9007                      .dwattr $C$DW$817, DW_AT_name("targetProc")
    9008                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_targetProc")
    9009                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9010                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    9011              
    9012              $C$DW$818       .dwtag  DW_TAG_member
    9013                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$23)
    9014                      .dwattr $C$DW$818, DW_AT_name("major")
    9015                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_major")
    9016                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9017                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    9018              
    9019              $C$DW$819       .dwtag  DW_TAG_member
    9020                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$23)
    9021                      .dwattr $C$DW$819, DW_AT_name("minor")
    9022                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_minor")
    9023                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9024                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    9025              
    9026                      .dwendtag $C$DW$T$77
    9027              
    9028              $C$DW$T$39      .dwtag  DW_TAG_typedef
    9029                      .dwattr $C$DW$T$39, DW_AT_name("CTRL_Version")
    9030                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$77)
    9031                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    9032              
    9033              
    9034              $C$DW$T$84      .dwtag  DW_TAG_structure_type
    9035                      .dwattr $C$DW$T$84, DW_AT_name("_DRV8301_Obj_")
    9036                      .dwattr $C$DW$T$84, DW_AT_byte_size(0x08)
    9037              $C$DW$820       .dwtag  DW_TAG_member
    9038                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$79)
    9039                      .dwattr $C$DW$820, DW_AT_name("spiHandle")
    9040                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_spiHandle")
    9041                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9042                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
    9043              
    9044              $C$DW$821       .dwtag  DW_TAG_member
    9045                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$81)
    9046                      .dwattr $C$DW$821, DW_AT_name("gpioHandle")
    9047                      .dwattr $C$DW$821, DW_AT_TI_symbol_name("_gpioHandle")
    9048                      .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9049                      .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
    9050              
    9051              $C$DW$822       .dwtag  DW_TAG_member
    9052                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$83)
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:41 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{37DBDC18-8316-4B16-94B2-B516506DF0E2} PAGE  172

    9053                      .dwattr $C$DW$822, DW_AT_name("gpioNumber")
    9054                      .dwattr $C$DW$822, DW_AT_TI_symbol_name("_gpioNumber")
    9055                      .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9056                      .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
    9057              
    9058              $C$DW$823       .dwtag  DW_TAG_member
    9059                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$73)
    9060                      .dwattr $C$DW$823, DW_AT_name("RxTimeOut")
    9061                      .dwattr $C$DW$823, DW_AT_TI_symbol_name("_RxTimeOut")
    9062                      .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9063                      .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
    9064              
    9065              $C$DW$824       .dwtag  DW_TAG_member
    9066                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$73)
    9067                      .dwattr $C$DW$824, DW_AT_name("enableTimeOut")
    9068                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_enableTimeOut")
    9069                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9070                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
    9071              
    9072                      .dwendtag $C$DW$T$84
    9073              
    9074              $C$DW$T$126     .dwtag  DW_TAG_typedef
    9075                      .dwattr $C$DW$T$126, DW_AT_name("DRV8301_Obj")
    9076                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$84)
    9077                      .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
    9078              
    9079              $C$DW$T$124     .dwtag  DW_TAG_pointer_type
    9080                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$84)
    9081                      .dwattr $C$DW$T$124, DW_AT_address_class(0x20)
    9082              
    9083              $C$DW$T$125     .dwtag  DW_TAG_typedef
    9084                      .dwattr $C$DW$T$125, DW_AT_name("DRV8301_Handle")
    9085                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
    9086                      .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    9087              
    9088              
    9089              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    9090                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    9091                      .dwattr $C$DW$T$19, DW_AT_declaration
    9092                      .dwendtag $C$DW$T$19
    9093              
    9094              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    9095                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$19)
    9096                      .dwattr $C$DW$T$47, DW_AT_address_class(0x20)
    9097              
    9098              $C$DW$T$48      .dwtag  DW_TAG_typedef
    9099                      .dwattr $C$DW$T$48, DW_AT_name("EST_Handle")
    9100                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    9101                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    9102              
    9103              
    9104              $C$DW$T$85      .dwtag  DW_TAG_structure_type
    9105                      .dwattr $C$DW$T$85, DW_AT_name("_FILTER_FO_")
    9106                      .dwattr $C$DW$T$85, DW_AT_byte_size(0x0a)
    9107              $C$DW$825       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:41 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{37DBDC18-8316-4B16-94B2-B516506DF0E2} PAGE  173

    9108                      .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$32)
    9109                      .dwattr $C$DW$825, DW_AT_name("a1")
    9110                      .dwattr $C$DW$825, DW_AT_TI_symbol_name("_a1")
    9111                      .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9112                      .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
    9113              
    9114              $C$DW$826       .dwtag  DW_TAG_member
    9115                      .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$32)
    9116                      .dwattr $C$DW$826, DW_AT_name("b0")
    9117                      .dwattr $C$DW$826, DW_AT_TI_symbol_name("_b0")
    9118                      .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9119                      .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
    9120              
    9121              $C$DW$827       .dwtag  DW_TAG_member
    9122                      .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$32)
    9123                      .dwattr $C$DW$827, DW_AT_name("b1")
    9124                      .dwattr $C$DW$827, DW_AT_TI_symbol_name("_b1")
    9125                      .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9126                      .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
    9127              
    9128              $C$DW$828       .dwtag  DW_TAG_member
    9129                      .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$32)
    9130                      .dwattr $C$DW$828, DW_AT_name("x1")
    9131                      .dwattr $C$DW$828, DW_AT_TI_symbol_name("_x1")
    9132                      .dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9133                      .dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
    9134              
    9135              $C$DW$829       .dwtag  DW_TAG_member
    9136                      .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$32)
    9137                      .dwattr $C$DW$829, DW_AT_name("y1")
    9138                      .dwattr $C$DW$829, DW_AT_TI_symbol_name("_y1")
    9139                      .dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9140                      .dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
    9141              
    9142                      .dwendtag $C$DW$T$85
    9143              
    9144              $C$DW$T$137     .dwtag  DW_TAG_typedef
    9145                      .dwattr $C$DW$T$137, DW_AT_name("FILTER_FO_Obj")
    9146                      .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$85)
    9147                      .dwattr $C$DW$T$137, DW_AT_language(DW_LANG_C)
    9148              
    9149              $C$DW$T$187     .dwtag  DW_TAG_pointer_type
    9150                      .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$137)
    9151                      .dwattr $C$DW$T$187, DW_AT_address_class(0x20)
    9152              
    9153              
    9154              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    9155                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
    9156                      .dwattr $C$DW$T$20, DW_AT_declaration
    9157                      .dwendtag $C$DW$T$20
    9158              
    9159              $C$DW$T$138     .dwtag  DW_TAG_pointer_type
    9160                      .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$20)
    9161                      .dwattr $C$DW$T$138, DW_AT_address_class(0x20)
    9162              
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:41 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{37DBDC18-8316-4B16-94B2-B516506DF0E2} PAGE  174

    9163              $C$DW$T$139     .dwtag  DW_TAG_typedef
    9164                      .dwattr $C$DW$T$139, DW_AT_name("FILTER_FO_Handle")
    9165                      .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$138)
    9166                      .dwattr $C$DW$T$139, DW_AT_language(DW_LANG_C)
    9167              
    9168              
    9169              $C$DW$T$86      .dwtag  DW_TAG_structure_type
    9170                      .dwattr $C$DW$T$86, DW_AT_name("_FLASH_Obj_")
    9171                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x08)
    9172              $C$DW$830       .dwtag  DW_TAG_member
    9173                      .dwattr $C$DW$830, DW_AT_type(*$C$DW$T$24)
    9174                      .dwattr $C$DW$830, DW_AT_name("FOPT")
    9175                      .dwattr $C$DW$830, DW_AT_TI_symbol_name("_FOPT")
    9176                      .dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9177                      .dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
    9178              
    9179              $C$DW$831       .dwtag  DW_TAG_member
    9180                      .dwattr $C$DW$831, DW_AT_type(*$C$DW$T$24)
    9181                      .dwattr $C$DW$831, DW_AT_name("rsvd_1")
    9182                      .dwattr $C$DW$831, DW_AT_TI_symbol_name("_rsvd_1")
    9183                      .dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9184                      .dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
    9185              
    9186              $C$DW$832       .dwtag  DW_TAG_member
    9187                      .dwattr $C$DW$832, DW_AT_type(*$C$DW$T$24)
    9188                      .dwattr $C$DW$832, DW_AT_name("FPWR")
    9189                      .dwattr $C$DW$832, DW_AT_TI_symbol_name("_FPWR")
    9190                      .dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9191                      .dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
    9192              
    9193              $C$DW$833       .dwtag  DW_TAG_member
    9194                      .dwattr $C$DW$833, DW_AT_type(*$C$DW$T$24)
    9195                      .dwattr $C$DW$833, DW_AT_name("FSTATUS")
    9196                      .dwattr $C$DW$833, DW_AT_TI_symbol_name("_FSTATUS")
    9197                      .dwattr $C$DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9198                      .dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
    9199              
    9200              $C$DW$834       .dwtag  DW_TAG_member
    9201                      .dwattr $C$DW$834, DW_AT_type(*$C$DW$T$24)
    9202                      .dwattr $C$DW$834, DW_AT_name("FSTDBYWAIT")
    9203                      .dwattr $C$DW$834, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    9204                      .dwattr $C$DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9205                      .dwattr $C$DW$834, DW_AT_accessibility(DW_ACCESS_public)
    9206              
    9207              $C$DW$835       .dwtag  DW_TAG_member
    9208                      .dwattr $C$DW$835, DW_AT_type(*$C$DW$T$24)
    9209                      .dwattr $C$DW$835, DW_AT_name("FACTIVEWAIT")
    9210                      .dwattr $C$DW$835, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    9211                      .dwattr $C$DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9212                      .dwattr $C$DW$835, DW_AT_accessibility(DW_ACCESS_public)
    9213              
    9214              $C$DW$836       .dwtag  DW_TAG_member
    9215                      .dwattr $C$DW$836, DW_AT_type(*$C$DW$T$24)
    9216                      .dwattr $C$DW$836, DW_AT_name("FBANKWAIT")
    9217                      .dwattr $C$DW$836, DW_AT_TI_symbol_name("_FBANKWAIT")
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:41 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{37DBDC18-8316-4B16-94B2-B516506DF0E2} PAGE  175

    9218                      .dwattr $C$DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9219                      .dwattr $C$DW$836, DW_AT_accessibility(DW_ACCESS_public)
    9220              
    9221              $C$DW$837       .dwtag  DW_TAG_member
    9222                      .dwattr $C$DW$837, DW_AT_type(*$C$DW$T$24)
    9223                      .dwattr $C$DW$837, DW_AT_name("FOTPWAIT")
    9224                      .dwattr $C$DW$837, DW_AT_TI_symbol_name("_FOTPWAIT")
    9225                      .dwattr $C$DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    9226                      .dwattr $C$DW$837, DW_AT_accessibility(DW_ACCESS_public)
    9227              
    9228                      .dwendtag $C$DW$T$86
    9229              
    9230              $C$DW$T$100     .dwtag  DW_TAG_pointer_type
    9231                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$86)
    9232                      .dwattr $C$DW$T$100, DW_AT_address_class(0x20)
    9233              
    9234              $C$DW$T$101     .dwtag  DW_TAG_typedef
    9235                      .dwattr $C$DW$T$101, DW_AT_name("FLASH_Handle")
    9236                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$100)
    9237                      .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    9238              
    9239              
    9240              $C$DW$T$91      .dwtag  DW_TAG_structure_type
    9241                      .dwattr $C$DW$T$91, DW_AT_name("_GPIO_Obj_")
    9242                      .dwattr $C$DW$T$91, DW_AT_byte_size(0x6a)
    9243              $C$DW$838       .dwtag  DW_TAG_member
    9244                      .dwattr $C$DW$838, DW_AT_type(*$C$DW$T$88)
    9245                      .dwattr $C$DW$838, DW_AT_name("GPACTRL")
    9246                      .dwattr $C$DW$838, DW_AT_TI_symbol_name("_GPACTRL")
    9247                      .dwattr $C$DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9248                      .dwattr $C$DW$838, DW_AT_accessibility(DW_ACCESS_public)
    9249              
    9250              $C$DW$839       .dwtag  DW_TAG_member
    9251                      .dwattr $C$DW$839, DW_AT_type(*$C$DW$T$88)
    9252                      .dwattr $C$DW$839, DW_AT_name("GPAQSEL1")
    9253                      .dwattr $C$DW$839, DW_AT_TI_symbol_name("_GPAQSEL1")
    9254                      .dwattr $C$DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9255                      .dwattr $C$DW$839, DW_AT_accessibility(DW_ACCESS_public)
    9256              
    9257              $C$DW$840       .dwtag  DW_TAG_member
    9258                      .dwattr $C$DW$840, DW_AT_type(*$C$DW$T$88)
    9259                      .dwattr $C$DW$840, DW_AT_name("GPAQSEL2")
    9260                      .dwattr $C$DW$840, DW_AT_TI_symbol_name("_GPAQSEL2")
    9261                      .dwattr $C$DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9262                      .dwattr $C$DW$840, DW_AT_accessibility(DW_ACCESS_public)
    9263              
    9264              $C$DW$841       .dwtag  DW_TAG_member
    9265                      .dwattr $C$DW$841, DW_AT_type(*$C$DW$T$88)
    9266                      .dwattr $C$DW$841, DW_AT_name("GPAMUX1")
    9267                      .dwattr $C$DW$841, DW_AT_TI_symbol_name("_GPAMUX1")
    9268                      .dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9269                      .dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
    9270              
    9271              $C$DW$842       .dwtag  DW_TAG_member
    9272                      .dwattr $C$DW$842, DW_AT_type(*$C$DW$T$88)
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:41 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{37DBDC18-8316-4B16-94B2-B516506DF0E2} PAGE  176

    9273                      .dwattr $C$DW$842, DW_AT_name("GPAMUX2")
    9274                      .dwattr $C$DW$842, DW_AT_TI_symbol_name("_GPAMUX2")
    9275                      .dwattr $C$DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9276                      .dwattr $C$DW$842, DW_AT_accessibility(DW_ACCESS_public)
    9277              
    9278              $C$DW$843       .dwtag  DW_TAG_member
    9279                      .dwattr $C$DW$843, DW_AT_type(*$C$DW$T$88)
