TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F169EDD6-E2A2-400A-8386-A823CBD75D49} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.0.LTS *
       3              ;* Date/Time created: Tue Apr 18 11:09:45 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/GIANT/GIANT_TI_instaspin/TI_instaspin_indoor_smart_trainer/motorware
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.0.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\GIANT\GIANT_TI_instaspin\TI_instaspin_indoor_smart_trainer\motor
      13              
      14              ;**************************************************************
      15              ;* FUNCTION SYNONYMS                                          *

    7908                      .dwattr $C$DW$669, DW_AT_name("EST_State_Idle")
    7909                      .dwattr $C$DW$669, DW_AT_const_value(0x01)
    7910              
    7911              $C$DW$670       .dwtag  DW_TAG_enumerator
    7912                      .dwattr $C$DW$670, DW_AT_name("EST_State_RoverL")
    7913                      .dwattr $C$DW$670, DW_AT_const_value(0x02)
    7914              
    7915              $C$DW$671       .dwtag  DW_TAG_enumerator
    7916                      .dwattr $C$DW$671, DW_AT_name("EST_State_Rs")
    7917                      .dwattr $C$DW$671, DW_AT_const_value(0x03)
    7918              
    7919              $C$DW$672       .dwtag  DW_TAG_enumerator
    7920                      .dwattr $C$DW$672, DW_AT_name("EST_State_RampUp")
    7921                      .dwattr $C$DW$672, DW_AT_const_value(0x04)
    7922              
    7923              $C$DW$673       .dwtag  DW_TAG_enumerator
    7924                      .dwattr $C$DW$673, DW_AT_name("EST_State_IdRated")
    7925                      .dwattr $C$DW$673, DW_AT_const_value(0x05)
    7926              
    7927              $C$DW$674       .dwtag  DW_TAG_enumerator
    7928                      .dwattr $C$DW$674, DW_AT_name("EST_State_RatedFlux_OL")
    7929                      .dwattr $C$DW$674, DW_AT_const_value(0x06)
    7930              
    7931              $C$DW$675       .dwtag  DW_TAG_enumerator
    7932                      .dwattr $C$DW$675, DW_AT_name("EST_State_RatedFlux")
    7933                      .dwattr $C$DW$675, DW_AT_const_value(0x07)
    7934              
    7935              $C$DW$676       .dwtag  DW_TAG_enumerator
    7936                      .dwattr $C$DW$676, DW_AT_name("EST_State_RampDown")
    7937                      .dwattr $C$DW$676, DW_AT_const_value(0x08)
    7938              
    7939              $C$DW$677       .dwtag  DW_TAG_enumerator
    7940                      .dwattr $C$DW$677, DW_AT_name("EST_State_LockRotor")
    7941                      .dwattr $C$DW$677, DW_AT_const_value(0x09)
    7942              
    7943              $C$DW$678       .dwtag  DW_TAG_enumerator
    7944                      .dwattr $C$DW$678, DW_AT_name("EST_State_Ls")
    7945                      .dwattr $C$DW$678, DW_AT_const_value(0x0a)
    7946              
    7947              $C$DW$679       .dwtag  DW_TAG_enumerator
    7948                      .dwattr $C$DW$679, DW_AT_name("EST_State_Rr")
    7949                      .dwattr $C$DW$679, DW_AT_const_value(0x0b)
    7950              
    7951              $C$DW$680       .dwtag  DW_TAG_enumerator
    7952                      .dwattr $C$DW$680, DW_AT_name("EST_State_MotorIdentified")
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F169EDD6-E2A2-400A-8386-A823CBD75D49} PAGE  152

    7953                      .dwattr $C$DW$680, DW_AT_const_value(0x0c)
    7954              
    7955              $C$DW$681       .dwtag  DW_TAG_enumerator
    7956                      .dwattr $C$DW$681, DW_AT_name("EST_State_OnLine")
    7957                      .dwattr $C$DW$681, DW_AT_const_value(0x0d)
    7958              
    7959              $C$DW$682       .dwtag  DW_TAG_enumerator
    7960                      .dwattr $C$DW$682, DW_AT_name("EST_numStates")
    7961                      .dwattr $C$DW$682, DW_AT_const_value(0x0e)
    7962              
    7963                      .dwendtag $C$DW$T$176
    7964              
    7965              $C$DW$T$177     .dwtag  DW_TAG_typedef
    7966                      .dwattr $C$DW$T$177, DW_AT_name("EST_State_e")
    7967                      .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$176)
    7968                      .dwattr $C$DW$T$177, DW_AT_language(DW_LANG_C)
    7969              
    7970              
    7971              $C$DW$T$181     .dwtag  DW_TAG_enumeration_type
    7972                      .dwattr $C$DW$T$181, DW_AT_byte_size(0x01)
    7973              $C$DW$683       .dwtag  DW_TAG_enumerator
    7974                      .dwattr $C$DW$683, DW_AT_name("CTRL_Type_PID_spd")
    7975                      .dwattr $C$DW$683, DW_AT_const_value(0x00)
    7976              
    7977              $C$DW$684       .dwtag  DW_TAG_enumerator
    7978                      .dwattr $C$DW$684, DW_AT_name("CTRL_Type_PID_Id")
    7979                      .dwattr $C$DW$684, DW_AT_const_value(0x01)
    7980              
    7981              $C$DW$685       .dwtag  DW_TAG_enumerator
    7982                      .dwattr $C$DW$685, DW_AT_name("CTRL_Type_PID_Iq")
    7983                      .dwattr $C$DW$685, DW_AT_const_value(0x02)
    7984              
    7985                      .dwendtag $C$DW$T$181
    7986              
    7987              $C$DW$T$182     .dwtag  DW_TAG_typedef
    7988                      .dwattr $C$DW$T$182, DW_AT_name("CTRL_Type_e")
    7989                      .dwattr $C$DW$T$182, DW_AT_type(*$C$DW$T$181)
    7990                      .dwattr $C$DW$T$182, DW_AT_language(DW_LANG_C)
    7991              
    7992              $C$DW$686       .dwtag  DW_TAG_TI_far_type
    7993                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$182)
    7994              
    7995              $C$DW$T$183     .dwtag  DW_TAG_const_type
    7996                      .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$686)
    7997              
    7998              
    7999              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    8000                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
    8001                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
    8002              $C$DW$687       .dwtag  DW_TAG_member
    8003                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$25)
    8004                      .dwattr $C$DW$687, DW_AT_name("ADCRESULT")
    8005                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_ADCRESULT")
    8006                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8007                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F169EDD6-E2A2-400A-8386-A823CBD75D49} PAGE  153

    8008              
    8009              $C$DW$688       .dwtag  DW_TAG_member
    8010                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$26)
    8011                      .dwattr $C$DW$688, DW_AT_name("resvd_1")
    8012                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_resvd_1")
    8013                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8014                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    8015              
    8016              $C$DW$689       .dwtag  DW_TAG_member
    8017                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$24)
    8018                      .dwattr $C$DW$689, DW_AT_name("ADCCTL1")
    8019                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_ADCCTL1")
    8020                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    8021                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    8022              
    8023              $C$DW$690       .dwtag  DW_TAG_member
    8024                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$24)
    8025                      .dwattr $C$DW$690, DW_AT_name("ADCCTL2")
    8026                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_ADCCTL2")
    8027                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    8028                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    8029              
    8030              $C$DW$691       .dwtag  DW_TAG_member
    8031                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$27)
    8032                      .dwattr $C$DW$691, DW_AT_name("rsvd_2")
    8033                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_rsvd_2")
    8034                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    8035                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    8036              
    8037              $C$DW$692       .dwtag  DW_TAG_member
    8038                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$24)
    8039                      .dwattr $C$DW$692, DW_AT_name("ADCINTFLG")
    8040                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_ADCINTFLG")
    8041                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    8042                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    8043              
    8044              $C$DW$693       .dwtag  DW_TAG_member
    8045                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$24)
    8046                      .dwattr $C$DW$693, DW_AT_name("ADCINTFLGCLR")
    8047                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    8048                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    8049                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    8050              
    8051              $C$DW$694       .dwtag  DW_TAG_member
    8052                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$24)
    8053                      .dwattr $C$DW$694, DW_AT_name("ADCINTOVF")
    8054                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_ADCINTOVF")
    8055                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    8056                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    8057              
    8058              $C$DW$695       .dwtag  DW_TAG_member
    8059                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$24)
    8060                      .dwattr $C$DW$695, DW_AT_name("ADCINTOVFCLR")
    8061                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    8062                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F169EDD6-E2A2-400A-8386-A823CBD75D49} PAGE  154

    8063                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    8064              
    8065              $C$DW$696       .dwtag  DW_TAG_member
    8066                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$28)
    8067                      .dwattr $C$DW$696, DW_AT_name("INTSELxNy")
    8068                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_INTSELxNy")
    8069                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    8070                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    8071              
    8072              $C$DW$697       .dwtag  DW_TAG_member
    8073                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$29)
    8074                      .dwattr $C$DW$697, DW_AT_name("rsvd_3")
    8075                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_rsvd_3")
    8076                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    8077                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    8078              
    8079              $C$DW$698       .dwtag  DW_TAG_member
    8080                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$24)
    8081                      .dwattr $C$DW$698, DW_AT_name("SOCPRICTRL")
    8082                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_SOCPRICTRL")
    8083                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    8084                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    8085              
    8086              $C$DW$699       .dwtag  DW_TAG_member
    8087                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$24)
    8088                      .dwattr $C$DW$699, DW_AT_name("rsvd_4")
    8089                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_rsvd_4")
    8090                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    8091                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    8092              
    8093              $C$DW$700       .dwtag  DW_TAG_member
    8094                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$24)
    8095                      .dwattr $C$DW$700, DW_AT_name("ADCSAMPLEMODE")
    8096                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    8097                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    8098                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    8099              
    8100              $C$DW$701       .dwtag  DW_TAG_member
    8101                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$24)
    8102                      .dwattr $C$DW$701, DW_AT_name("rsvd_5")
    8103                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_rsvd_5")
    8104                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    8105                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    8106              
    8107              $C$DW$702       .dwtag  DW_TAG_member
    8108                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$24)
    8109                      .dwattr $C$DW$702, DW_AT_name("ADCINTSOCSEL1")
    8110                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    8111                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    8112                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    8113              
    8114              $C$DW$703       .dwtag  DW_TAG_member
    8115                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$24)
    8116                      .dwattr $C$DW$703, DW_AT_name("ADCINTSOCSEL2")
    8117                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F169EDD6-E2A2-400A-8386-A823CBD75D49} PAGE  155

    8118                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    8119                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    8120              
    8121              $C$DW$704       .dwtag  DW_TAG_member
    8122                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$27)
    8123                      .dwattr $C$DW$704, DW_AT_name("rsvd_6")
    8124                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_rsvd_6")
    8125                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    8126                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    8127              
    8128              $C$DW$705       .dwtag  DW_TAG_member
    8129                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$24)
    8130                      .dwattr $C$DW$705, DW_AT_name("ADCSOCFLG1")
    8131                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    8132                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    8133                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    8134              
    8135              $C$DW$706       .dwtag  DW_TAG_member
    8136                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$24)
    8137                      .dwattr $C$DW$706, DW_AT_name("rsvd_7")
    8138                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_rsvd_7")
    8139                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    8140                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    8141              
    8142              $C$DW$707       .dwtag  DW_TAG_member
    8143                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$24)
    8144                      .dwattr $C$DW$707, DW_AT_name("ADCSOCFRC1")
    8145                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    8146                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    8147                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    8148              
    8149              $C$DW$708       .dwtag  DW_TAG_member
    8150                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$24)
    8151                      .dwattr $C$DW$708, DW_AT_name("rsvd_8")
    8152                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_rsvd_8")
    8153                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    8154                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    8155              
    8156              $C$DW$709       .dwtag  DW_TAG_member
    8157                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$24)
    8158                      .dwattr $C$DW$709, DW_AT_name("ADCSOCOVF1")
    8159                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    8160                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    8161                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    8162              
    8163              $C$DW$710       .dwtag  DW_TAG_member
    8164                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$24)
    8165                      .dwattr $C$DW$710, DW_AT_name("rsvd_9")
    8166                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_rsvd_9")
    8167                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    8168                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    8169              
    8170              $C$DW$711       .dwtag  DW_TAG_member
    8171                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$24)
    8172                      .dwattr $C$DW$711, DW_AT_name("ADCSOCOVFCLR1")
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F169EDD6-E2A2-400A-8386-A823CBD75D49} PAGE  156

    8173                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    8174                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    8175                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    8176              
    8177              $C$DW$712       .dwtag  DW_TAG_member
    8178                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$24)
    8179                      .dwattr $C$DW$712, DW_AT_name("rsvd_10")
    8180                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_rsvd_10")
    8181                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    8182                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    8183              
    8184              $C$DW$713       .dwtag  DW_TAG_member
    8185                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$25)
    8186                      .dwattr $C$DW$713, DW_AT_name("ADCSOCxCTL")
    8187                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    8188                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    8189                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    8190              
    8191              $C$DW$714       .dwtag  DW_TAG_member
    8192                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$25)
    8193                      .dwattr $C$DW$714, DW_AT_name("rsvd_11")
    8194                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_rsvd_11")
    8195                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    8196                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    8197              
    8198              $C$DW$715       .dwtag  DW_TAG_member
    8199                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$24)
    8200                      .dwattr $C$DW$715, DW_AT_name("ADCREFTRIM")
    8201                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_ADCREFTRIM")
    8202                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    8203                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    8204              
    8205              $C$DW$716       .dwtag  DW_TAG_member
    8206                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$24)
    8207                      .dwattr $C$DW$716, DW_AT_name("ADCOFFTRIM")
    8208                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    8209                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    8210                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    8211              
    8212              $C$DW$717       .dwtag  DW_TAG_member
    8213                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$30)
    8214                      .dwattr $C$DW$717, DW_AT_name("resvd_12")
    8215                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_resvd_12")
    8216                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    8217                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    8218              
    8219              $C$DW$718       .dwtag  DW_TAG_member
    8220                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$24)
    8221                      .dwattr $C$DW$718, DW_AT_name("ADCREV")
    8222                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_ADCREV")
    8223                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    8224                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    8225              
    8226                      .dwendtag $C$DW$T$31
    8227              
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F169EDD6-E2A2-400A-8386-A823CBD75D49} PAGE  157

    8228              $C$DW$T$94      .dwtag  DW_TAG_pointer_type
    8229                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$31)
    8230                      .dwattr $C$DW$T$94, DW_AT_address_class(0x20)
    8231              
    8232              $C$DW$T$95      .dwtag  DW_TAG_typedef
    8233                      .dwattr $C$DW$T$95, DW_AT_name("ADC_Handle")
    8234                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
    8235                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    8236              
    8237              
    8238              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    8239                      .dwattr $C$DW$T$35, DW_AT_name("_CLARKE_Obj_")
    8240                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x06)
    8241              $C$DW$719       .dwtag  DW_TAG_member
    8242                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$32)
    8243                      .dwattr $C$DW$719, DW_AT_name("alpha_sf")
    8244                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_alpha_sf")
    8245                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8246                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    8247              
    8248              $C$DW$720       .dwtag  DW_TAG_member
    8249                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$32)
    8250                      .dwattr $C$DW$720, DW_AT_name("beta_sf")
    8251                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_beta_sf")
    8252                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8253                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    8254              
    8255              $C$DW$721       .dwtag  DW_TAG_member
    8256                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$34)
    8257                      .dwattr $C$DW$721, DW_AT_name("numSensors")
    8258                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_numSensors")
    8259                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8260                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    8261              
    8262                      .dwendtag $C$DW$T$35
    8263              
    8264              $C$DW$T$46      .dwtag  DW_TAG_typedef
    8265                      .dwattr $C$DW$T$46, DW_AT_name("CLARKE_Obj")
    8266                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$35)
    8267                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    8268              
    8269              $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    8270                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$35)
    8271                      .dwattr $C$DW$T$44, DW_AT_address_class(0x20)
    8272              
    8273              $C$DW$T$45      .dwtag  DW_TAG_typedef
    8274                      .dwattr $C$DW$T$45, DW_AT_name("CLARKE_Handle")
    8275                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    8276                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    8277              
    8278              
    8279              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    8280                      .dwattr $C$DW$T$37, DW_AT_name("_CLK_Obj_")
    8281                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x11)
    8282              $C$DW$722       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F169EDD6-E2A2-400A-8386-A823CBD75D49} PAGE  158

    8283                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$24)
    8284                      .dwattr $C$DW$722, DW_AT_name("XCLK")
    8285                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_XCLK")
    8286                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8287                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    8288              
    8289              $C$DW$723       .dwtag  DW_TAG_member
    8290                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$24)
    8291                      .dwattr $C$DW$723, DW_AT_name("rsvd_1")
    8292                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_rsvd_1")
    8293                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8294                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    8295              
    8296              $C$DW$724       .dwtag  DW_TAG_member
    8297                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$24)
    8298                      .dwattr $C$DW$724, DW_AT_name("CLKCTL")
    8299                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_CLKCTL")
    8300                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8301                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    8302              
    8303              $C$DW$725       .dwtag  DW_TAG_member
    8304                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$36)
    8305                      .dwattr $C$DW$725, DW_AT_name("rsvd_2")
    8306                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_rsvd_2")
    8307                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8308                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    8309              
    8310              $C$DW$726       .dwtag  DW_TAG_member
    8311                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$24)
    8312                      .dwattr $C$DW$726, DW_AT_name("LOSPCP")
    8313                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_LOSPCP")
    8314                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    8315                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    8316              
    8317              $C$DW$727       .dwtag  DW_TAG_member
    8318                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$24)
    8319                      .dwattr $C$DW$727, DW_AT_name("PCLKCR0")
    8320                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_PCLKCR0")
    8321                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8322                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    8323              
    8324              $C$DW$728       .dwtag  DW_TAG_member
    8325                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$24)
    8326                      .dwattr $C$DW$728, DW_AT_name("PCLKCR1")
    8327                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_PCLKCR1")
    8328                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8329                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    8330              
    8331              $C$DW$729       .dwtag  DW_TAG_member
    8332                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$27)
    8333                      .dwattr $C$DW$729, DW_AT_name("rsvd_3")
    8334                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_rsvd_3")
    8335                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8336                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    8337              
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F169EDD6-E2A2-400A-8386-A823CBD75D49} PAGE  159

    8338              $C$DW$730       .dwtag  DW_TAG_member
    8339                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$24)
    8340                      .dwattr $C$DW$730, DW_AT_name("PCLKCR3")
    8341                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_PCLKCR3")
    8342                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8343                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    8344              
    8345                      .dwendtag $C$DW$T$37
    8346              
    8347              $C$DW$T$96      .dwtag  DW_TAG_pointer_type
    8348                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$37)
    8349                      .dwattr $C$DW$T$96, DW_AT_address_class(0x20)
    8350              
    8351              $C$DW$T$97      .dwtag  DW_TAG_typedef
    8352                      .dwattr $C$DW$T$97, DW_AT_name("CLK_Handle")
    8353                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
    8354                      .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    8355              
    8356              
    8357              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    8358                      .dwattr $C$DW$T$38, DW_AT_name("_CPU_Obj_")
    8359                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    8360              $C$DW$731       .dwtag  DW_TAG_member
    8361                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$34)
    8362                      .dwattr $C$DW$731, DW_AT_name("tmp")
    8363                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_tmp")
    8364                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8365                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    8366              
    8367                      .dwendtag $C$DW$T$38
    8368              
    8369              $C$DW$T$98      .dwtag  DW_TAG_pointer_type
    8370                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$38)
    8371                      .dwattr $C$DW$T$98, DW_AT_address_class(0x20)
    8372              
    8373              $C$DW$T$99      .dwtag  DW_TAG_typedef
    8374                      .dwattr $C$DW$T$99, DW_AT_name("CPU_Handle")
    8375                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
    8376                      .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    8377              
    8378              
    8379              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    8380                      .dwattr $C$DW$T$74, DW_AT_name("_CTRL_Obj_")
    8381                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x10a)
    8382              $C$DW$732       .dwtag  DW_TAG_member
    8383                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$39)
    8384                      .dwattr $C$DW$732, DW_AT_name("version")
    8385                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_version")
    8386                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8387                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    8388              
    8389              $C$DW$733       .dwtag  DW_TAG_member
    8390                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$41)
    8391                      .dwattr $C$DW$733, DW_AT_name("state")
    8392                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_state")
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F169EDD6-E2A2-400A-8386-A823CBD75D49} PAGE  160

    8393                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8394                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    8395              
    8396              $C$DW$734       .dwtag  DW_TAG_member
    8397                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$41)
    8398                      .dwattr $C$DW$734, DW_AT_name("prevState")
    8399                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_prevState")
    8400                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8401                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    8402              
    8403              $C$DW$735       .dwtag  DW_TAG_member
    8404                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$43)
    8405                      .dwattr $C$DW$735, DW_AT_name("errorCode")
    8406                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_errorCode")
    8407                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8408                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    8409              
    8410              $C$DW$736       .dwtag  DW_TAG_member
    8411                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$45)
    8412                      .dwattr $C$DW$736, DW_AT_name("clarkeHandle_I")
    8413                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_clarkeHandle_I")
    8414                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8415                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    8416              
    8417              $C$DW$737       .dwtag  DW_TAG_member
    8418                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$46)
    8419                      .dwattr $C$DW$737, DW_AT_name("clarke_I")
    8420                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_clarke_I")
    8421                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8422                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    8423              
    8424              $C$DW$738       .dwtag  DW_TAG_member
    8425                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$45)
    8426                      .dwattr $C$DW$738, DW_AT_name("clarkeHandle_V")
    8427                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_clarkeHandle_V")
    8428                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8429                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    8430              
    8431              $C$DW$739       .dwtag  DW_TAG_member
    8432                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$46)
    8433                      .dwattr $C$DW$739, DW_AT_name("clarke_V")
    8434                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_clarke_V")
    8435                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8436                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    8437              
    8438              $C$DW$740       .dwtag  DW_TAG_member
    8439                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$48)
    8440                      .dwattr $C$DW$740, DW_AT_name("estHandle")
    8441                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_estHandle")
    8442                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8443                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    8444              
    8445              $C$DW$741       .dwtag  DW_TAG_member
    8446                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$50)
    8447                      .dwattr $C$DW$741, DW_AT_name("parkHandle")
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F169EDD6-E2A2-400A-8386-A823CBD75D49} PAGE  161

    8448                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_parkHandle")
    8449                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    8450                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    8451              
    8452              $C$DW$742       .dwtag  DW_TAG_member
    8453                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$51)
    8454                      .dwattr $C$DW$742, DW_AT_name("park")
    8455                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_park")
    8456                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8457                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    8458              
    8459              $C$DW$743       .dwtag  DW_TAG_member
    8460                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$53)
    8461                      .dwattr $C$DW$743, DW_AT_name("pidHandle_Id")
    8462                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_pidHandle_Id")
    8463                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8464                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    8465              
    8466              $C$DW$744       .dwtag  DW_TAG_member
    8467                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$54)
    8468                      .dwattr $C$DW$744, DW_AT_name("pid_Id")
    8469                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_pid_Id")
    8470                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    8471                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    8472              
    8473              $C$DW$745       .dwtag  DW_TAG_member
    8474                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$53)
    8475                      .dwattr $C$DW$745, DW_AT_name("pidHandle_Iq")
    8476                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_pidHandle_Iq")
    8477                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    8478                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    8479              
    8480              $C$DW$746       .dwtag  DW_TAG_member
    8481                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$54)
    8482                      .dwattr $C$DW$746, DW_AT_name("pid_Iq")
    8483                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_pid_Iq")
    8484                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    8485                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    8486              
    8487              $C$DW$747       .dwtag  DW_TAG_member
    8488                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$53)
    8489                      .dwattr $C$DW$747, DW_AT_name("pidHandle_spd")
    8490                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_pidHandle_spd")
    8491                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    8492                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    8493              
    8494              $C$DW$748       .dwtag  DW_TAG_member
    8495                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$54)
    8496                      .dwattr $C$DW$748, DW_AT_name("pid_spd")
    8497                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_pid_spd")
    8498                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    8499                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    8500              
    8501              $C$DW$749       .dwtag  DW_TAG_member
    8502                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$56)
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F169EDD6-E2A2-400A-8386-A823CBD75D49} PAGE  162

    8503                      .dwattr $C$DW$749, DW_AT_name("iparkHandle")
    8504                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_iparkHandle")
    8505                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    8506                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    8507              
    8508              $C$DW$750       .dwtag  DW_TAG_member
    8509                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$57)
    8510                      .dwattr $C$DW$750, DW_AT_name("ipark")
    8511                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_ipark")
    8512                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    8513                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    8514              
    8515              $C$DW$751       .dwtag  DW_TAG_member
    8516                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$59)
    8517                      .dwattr $C$DW$751, DW_AT_name("svgenHandle")
    8518                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_svgenHandle")
    8519                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    8520                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    8521              
    8522              $C$DW$752       .dwtag  DW_TAG_member
    8523                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$60)
    8524                      .dwattr $C$DW$752, DW_AT_name("svgen")
    8525                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_svgen")
    8526                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    8527                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    8528              
    8529              $C$DW$753       .dwtag  DW_TAG_member
    8530                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$62)
    8531                      .dwattr $C$DW$753, DW_AT_name("trajHandle_Id")
    8532                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_trajHandle_Id")
    8533                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    8534                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    8535              
    8536              $C$DW$754       .dwtag  DW_TAG_member
    8537                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$63)
    8538                      .dwattr $C$DW$754, DW_AT_name("traj_Id")
    8539                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_traj_Id")
    8540                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    8541                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    8542              
    8543              $C$DW$755       .dwtag  DW_TAG_member
    8544                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$62)
    8545                      .dwattr $C$DW$755, DW_AT_name("trajHandle_spd")
    8546                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_trajHandle_spd")
    8547                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    8548                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    8549              
    8550              $C$DW$756       .dwtag  DW_TAG_member
    8551                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$63)
    8552                      .dwattr $C$DW$756, DW_AT_name("traj_spd")
    8553                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_traj_spd")
    8554                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    8555                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    8556              
    8557              $C$DW$757       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F169EDD6-E2A2-400A-8386-A823CBD75D49} PAGE  163

    8558                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$62)
    8559                      .dwattr $C$DW$757, DW_AT_name("trajHandle_spdMax")
    8560                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    8561                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    8562                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    8563              
    8564              $C$DW$758       .dwtag  DW_TAG_member
    8565                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$63)
    8566                      .dwattr $C$DW$758, DW_AT_name("traj_spdMax")
    8567                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_traj_spdMax")
    8568                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    8569                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    8570              
    8571              $C$DW$759       .dwtag  DW_TAG_member
    8572                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$64)
    8573                      .dwattr $C$DW$759, DW_AT_name("motorParams")
    8574                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_motorParams")
    8575                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    8576                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    8577              
    8578              $C$DW$760       .dwtag  DW_TAG_member
    8579                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$68)
    8580                      .dwattr $C$DW$760, DW_AT_name("waitTimes")
    8581                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_waitTimes")
    8582                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    8583                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    8584              
    8585              $C$DW$761       .dwtag  DW_TAG_member
    8586                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$67)
    8587                      .dwattr $C$DW$761, DW_AT_name("counter_state")
    8588                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_counter_state")
    8589                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    8590                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    8591              
    8592              $C$DW$762       .dwtag  DW_TAG_member
    8593                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$70)
    8594                      .dwattr $C$DW$762, DW_AT_name("numIsrTicksPerCtrlTick")
    8595                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    8596                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    8597                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    8598              
    8599              $C$DW$763       .dwtag  DW_TAG_member
    8600                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$70)
    8601                      .dwattr $C$DW$763, DW_AT_name("numCtrlTicksPerCurrentTick")
    8602                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    8603                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    8604                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    8605              
    8606              $C$DW$764       .dwtag  DW_TAG_member
    8607                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$70)
    8608                      .dwattr $C$DW$764, DW_AT_name("numCtrlTicksPerSpeedTick")
    8609                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    8610                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    8611                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    8612              
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F169EDD6-E2A2-400A-8386-A823CBD75D49} PAGE  164

    8613              $C$DW$765       .dwtag  DW_TAG_member
    8614                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$70)
    8615                      .dwattr $C$DW$765, DW_AT_name("numCtrlTicksPerTrajTick")
    8616                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    8617                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    8618                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    8619              
    8620              $C$DW$766       .dwtag  DW_TAG_member
    8621                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$67)
    8622                      .dwattr $C$DW$766, DW_AT_name("ctrlFreq_Hz")
    8623                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    8624                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    8625                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    8626              
    8627              $C$DW$767       .dwtag  DW_TAG_member
    8628                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$67)
    8629                      .dwattr $C$DW$767, DW_AT_name("trajFreq_Hz")
    8630                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_trajFreq_Hz")
    8631                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    8632                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    8633              
    8634              $C$DW$768       .dwtag  DW_TAG_member
    8635                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$32)
    8636                      .dwattr $C$DW$768, DW_AT_name("trajPeriod_sec")
    8637                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_trajPeriod_sec")
    8638                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    8639                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    8640              
    8641              $C$DW$769       .dwtag  DW_TAG_member
    8642                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$71)
    8643                      .dwattr $C$DW$769, DW_AT_name("ctrlPeriod_sec")
    8644                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    8645                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    8646                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    8647              
    8648              $C$DW$770       .dwtag  DW_TAG_member
    8649                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$32)
    8650                      .dwattr $C$DW$770, DW_AT_name("maxVsMag_pu")
    8651                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_maxVsMag_pu")
    8652                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    8653                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    8654              
    8655              $C$DW$771       .dwtag  DW_TAG_member
    8656                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$72)
    8657                      .dwattr $C$DW$771, DW_AT_name("Iab_in")
    8658                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_Iab_in")
    8659                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    8660                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    8661              
    8662              $C$DW$772       .dwtag  DW_TAG_member
    8663                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$72)
    8664                      .dwattr $C$DW$772, DW_AT_name("Iab_filt")
    8665                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_Iab_filt")
    8666                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    8667                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F169EDD6-E2A2-400A-8386-A823CBD75D49} PAGE  165

    8668              
    8669              $C$DW$773       .dwtag  DW_TAG_member
    8670                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$72)
    8671                      .dwattr $C$DW$773, DW_AT_name("Idq_in")
    8672                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_Idq_in")
    8673                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    8674                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    8675              
    8676              $C$DW$774       .dwtag  DW_TAG_member
    8677                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$72)
    8678                      .dwattr $C$DW$774, DW_AT_name("Vab_in")
    8679                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_Vab_in")
    8680                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    8681                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    8682              
    8683              $C$DW$775       .dwtag  DW_TAG_member
    8684                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$32)
    8685                      .dwattr $C$DW$775, DW_AT_name("spd_out")
    8686                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_spd_out")
    8687                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    8688                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    8689              
    8690              $C$DW$776       .dwtag  DW_TAG_member
    8691                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$72)
    8692                      .dwattr $C$DW$776, DW_AT_name("Vab_out")
    8693                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_Vab_out")
    8694                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    8695                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    8696              
    8697              $C$DW$777       .dwtag  DW_TAG_member
    8698                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$72)
    8699                      .dwattr $C$DW$777, DW_AT_name("Vdq_out")
    8700                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_Vdq_out")
    8701                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    8702                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    8703              
    8704              $C$DW$778       .dwtag  DW_TAG_member
    8705                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$71)
    8706                      .dwattr $C$DW$778, DW_AT_name("Rhf")
    8707                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_Rhf")
    8708                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    8709                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    8710              
    8711              $C$DW$779       .dwtag  DW_TAG_member
    8712                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$71)
    8713                      .dwattr $C$DW$779, DW_AT_name("Lhf")
    8714                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_Lhf")
    8715                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    8716                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    8717              
    8718              $C$DW$780       .dwtag  DW_TAG_member
    8719                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$71)
    8720                      .dwattr $C$DW$780, DW_AT_name("RoverL")
    8721                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_RoverL")
    8722                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F169EDD6-E2A2-400A-8386-A823CBD75D49} PAGE  166

    8723                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    8724              
    8725              $C$DW$781       .dwtag  DW_TAG_member
    8726                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$32)
    8727                      .dwattr $C$DW$781, DW_AT_name("Kp_Id")
    8728                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_Kp_Id")
    8729                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    8730                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    8731              
    8732              $C$DW$782       .dwtag  DW_TAG_member
    8733                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$32)
    8734                      .dwattr $C$DW$782, DW_AT_name("Kp_Iq")
    8735                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_Kp_Iq")
    8736                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    8737                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    8738              
    8739              $C$DW$783       .dwtag  DW_TAG_member
    8740                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$32)
    8741                      .dwattr $C$DW$783, DW_AT_name("Kp_spd")
    8742                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_Kp_spd")
    8743                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    8744                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    8745              
    8746              $C$DW$784       .dwtag  DW_TAG_member
    8747                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$32)
    8748                      .dwattr $C$DW$784, DW_AT_name("Ki_Id")
    8749                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_Ki_Id")
    8750                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    8751                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    8752              
    8753              $C$DW$785       .dwtag  DW_TAG_member
    8754                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$32)
    8755                      .dwattr $C$DW$785, DW_AT_name("Ki_Iq")
    8756                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_Ki_Iq")
    8757                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    8758                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    8759              
    8760              $C$DW$786       .dwtag  DW_TAG_member
    8761                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$32)
    8762                      .dwattr $C$DW$786, DW_AT_name("Ki_spd")
    8763                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_Ki_spd")
    8764                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    8765                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    8766              
    8767              $C$DW$787       .dwtag  DW_TAG_member
    8768                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$32)
    8769                      .dwattr $C$DW$787, DW_AT_name("Kd_Id")
    8770                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_Kd_Id")
    8771                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    8772                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    8773              
    8774              $C$DW$788       .dwtag  DW_TAG_member
    8775                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$32)
    8776                      .dwattr $C$DW$788, DW_AT_name("Kd_Iq")
    8777                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_Kd_Iq")
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F169EDD6-E2A2-400A-8386-A823CBD75D49} PAGE  167

    8778                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    8779                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    8780              
    8781              $C$DW$789       .dwtag  DW_TAG_member
    8782                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$32)
    8783                      .dwattr $C$DW$789, DW_AT_name("Kd_spd")
    8784                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_Kd_spd")
    8785                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    8786                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    8787              
    8788              $C$DW$790       .dwtag  DW_TAG_member
    8789                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$32)
    8790                      .dwattr $C$DW$790, DW_AT_name("Ui_Id")
    8791                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_Ui_Id")
    8792                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    8793                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    8794              
    8795              $C$DW$791       .dwtag  DW_TAG_member
    8796                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$32)
    8797                      .dwattr $C$DW$791, DW_AT_name("Ui_Iq")
    8798                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_Ui_Iq")
    8799                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    8800                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    8801              
    8802              $C$DW$792       .dwtag  DW_TAG_member
    8803                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$32)
    8804                      .dwattr $C$DW$792, DW_AT_name("Ui_spd")
    8805                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_Ui_spd")
    8806                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    8807                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    8808              
    8809              $C$DW$793       .dwtag  DW_TAG_member
    8810                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$72)
    8811                      .dwattr $C$DW$793, DW_AT_name("Idq_ref")
    8812                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_Idq_ref")
    8813                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    8814                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    8815              
    8816              $C$DW$794       .dwtag  DW_TAG_member
    8817                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$32)
    8818                      .dwattr $C$DW$794, DW_AT_name("IdRated")
    8819                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_IdRated")
    8820                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    8821                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    8822              
    8823              $C$DW$795       .dwtag  DW_TAG_member
    8824                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$32)
    8825                      .dwattr $C$DW$795, DW_AT_name("spd_ref")
    8826                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_spd_ref")
    8827                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    8828                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    8829              
    8830              $C$DW$796       .dwtag  DW_TAG_member
    8831                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$32)
    8832                      .dwattr $C$DW$796, DW_AT_name("spd_max")
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F169EDD6-E2A2-400A-8386-A823CBD75D49} PAGE  168

    8833                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_spd_max")
    8834                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    8835                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    8836              
    8837              $C$DW$797       .dwtag  DW_TAG_member
    8838                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$70)
    8839                      .dwattr $C$DW$797, DW_AT_name("counter_current")
    8840                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_counter_current")
    8841                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    8842                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    8843              
    8844              $C$DW$798       .dwtag  DW_TAG_member
    8845                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$70)
    8846                      .dwattr $C$DW$798, DW_AT_name("counter_isr")
    8847                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_counter_isr")
    8848                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    8849                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    8850              
    8851              $C$DW$799       .dwtag  DW_TAG_member
    8852                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$70)
    8853                      .dwattr $C$DW$799, DW_AT_name("counter_speed")
    8854                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_counter_speed")
    8855                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    8856                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    8857              
    8858              $C$DW$800       .dwtag  DW_TAG_member
    8859                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$70)
    8860                      .dwattr $C$DW$800, DW_AT_name("counter_traj")
    8861                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_counter_traj")
    8862                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    8863                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    8864              
    8865              $C$DW$801       .dwtag  DW_TAG_member
    8866                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$73)
    8867                      .dwattr $C$DW$801, DW_AT_name("flag_enableCtrl")
    8868                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_flag_enableCtrl")
    8869                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    8870                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    8871              
    8872              $C$DW$802       .dwtag  DW_TAG_member
    8873                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$73)
    8874                      .dwattr $C$DW$802, DW_AT_name("flag_enableDcBusComp")
    8875                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    8876                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    8877                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    8878              
    8879              $C$DW$803       .dwtag  DW_TAG_member
    8880                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$73)
    8881                      .dwattr $C$DW$803, DW_AT_name("flag_enablePowerWarp")
    8882                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    8883                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    8884                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    8885              
    8886              $C$DW$804       .dwtag  DW_TAG_member
    8887                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$73)
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F169EDD6-E2A2-400A-8386-A823CBD75D49} PAGE  169

    8888                      .dwattr $C$DW$804, DW_AT_name("flag_enableOffset")
    8889                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_flag_enableOffset")
    8890                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    8891                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    8892              
    8893              $C$DW$805       .dwtag  DW_TAG_member
    8894                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$73)
    8895                      .dwattr $C$DW$805, DW_AT_name("flag_enableSpeedCtrl")
    8896                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    8897                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    8898                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    8899              
    8900              $C$DW$806       .dwtag  DW_TAG_member
    8901                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$73)
    8902                      .dwattr $C$DW$806, DW_AT_name("flag_enableUserMotorParams")
    8903                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    8904                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    8905                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    8906              
    8907              $C$DW$807       .dwtag  DW_TAG_member
    8908                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$72)
    8909                      .dwattr $C$DW$807, DW_AT_name("Idq_offset_pu")
    8910                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_Idq_offset_pu")
    8911                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    8912                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    8913              
    8914              $C$DW$808       .dwtag  DW_TAG_member
    8915                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$72)
    8916                      .dwattr $C$DW$808, DW_AT_name("Vdq_offset_pu")
    8917                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    8918                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    8919                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    8920              
    8921              $C$DW$809       .dwtag  DW_TAG_member
    8922                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$32)
    8923                      .dwattr $C$DW$809, DW_AT_name("angle_pu")
    8924                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_angle_pu")
    8925                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    8926                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    8927              
    8928              $C$DW$810       .dwtag  DW_TAG_member
    8929                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$32)
    8930                      .dwattr $C$DW$810, DW_AT_name("speed_ref_pu")
    8931                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_speed_ref_pu")
    8932                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    8933                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    8934              
    8935              $C$DW$811       .dwtag  DW_TAG_member
    8936                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$32)
    8937                      .dwattr $C$DW$811, DW_AT_name("speed_fb_pu")
    8938                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_speed_fb_pu")
    8939                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    8940                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    8941              
    8942              $C$DW$812       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F169EDD6-E2A2-400A-8386-A823CBD75D49} PAGE  170

    8943                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$32)
    8944                      .dwattr $C$DW$812, DW_AT_name("speed_outMax_pu")
    8945                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_speed_outMax_pu")
    8946                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    8947                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    8948              
    8949              $C$DW$813       .dwtag  DW_TAG_member
    8950                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$73)
    8951                      .dwattr $C$DW$813, DW_AT_name("flag_enableCurrentCtrl")
    8952                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    8953                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    8954                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    8955              
    8956              $C$DW$814       .dwtag  DW_TAG_member
    8957                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$32)
    8958                      .dwattr $C$DW$814, DW_AT_name("torque_head_comm")
    8959                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_torque_head_comm")
    8960                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    8961                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    8962              
    8963                      .dwendtag $C$DW$T$74
    8964              
    8965              $C$DW$T$184     .dwtag  DW_TAG_typedef
    8966                      .dwattr $C$DW$T$184, DW_AT_name("CTRL_Obj")
    8967                      .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$74)
    8968                      .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
    8969              
    8970              $C$DW$T$171     .dwtag  DW_TAG_pointer_type
    8971                      .dwattr $C$DW$T$171, DW_AT_type(*$C$DW$T$74)
    8972                      .dwattr $C$DW$T$171, DW_AT_address_class(0x20)
    8973              
    8974              $C$DW$T$172     .dwtag  DW_TAG_typedef
    8975                      .dwattr $C$DW$T$172, DW_AT_name("CTRL_Handle")
    8976                      .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$171)
    8977                      .dwattr $C$DW$T$172, DW_AT_language(DW_LANG_C)
    8978              
    8979              $C$DW$815       .dwtag  DW_TAG_TI_far_type
    8980                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$172)
    8981              
    8982              $C$DW$T$185     .dwtag  DW_TAG_const_type
    8983                      .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$815)
    8984              
    8985              
    8986              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    8987                      .dwattr $C$DW$T$77, DW_AT_name("_CTRL_Version_")
    8988                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x04)
    8989              $C$DW$816       .dwtag  DW_TAG_member
    8990                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$23)
    8991                      .dwattr $C$DW$816, DW_AT_name("rsvd")
    8992                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_rsvd")
    8993                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8994                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    8995              
    8996              $C$DW$817       .dwtag  DW_TAG_member
    8997                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$76)
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F169EDD6-E2A2-400A-8386-A823CBD75D49} PAGE  171

    8998                      .dwattr $C$DW$817, DW_AT_name("targetProc")
    8999                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_targetProc")
    9000                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9001                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    9002              
    9003              $C$DW$818       .dwtag  DW_TAG_member
    9004                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$23)
    9005                      .dwattr $C$DW$818, DW_AT_name("major")
    9006                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_major")
    9007                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9008                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    9009              
    9010              $C$DW$819       .dwtag  DW_TAG_member
    9011                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$23)
    9012                      .dwattr $C$DW$819, DW_AT_name("minor")
    9013                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_minor")
    9014                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9015                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    9016              
    9017                      .dwendtag $C$DW$T$77
    9018              
    9019              $C$DW$T$39      .dwtag  DW_TAG_typedef
    9020                      .dwattr $C$DW$T$39, DW_AT_name("CTRL_Version")
    9021                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$77)
    9022                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    9023              
    9024              
    9025              $C$DW$T$84      .dwtag  DW_TAG_structure_type
    9026                      .dwattr $C$DW$T$84, DW_AT_name("_DRV8301_Obj_")
    9027                      .dwattr $C$DW$T$84, DW_AT_byte_size(0x08)
    9028              $C$DW$820       .dwtag  DW_TAG_member
    9029                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$79)
    9030                      .dwattr $C$DW$820, DW_AT_name("spiHandle")
    9031                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_spiHandle")
    9032                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9033                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
    9034              
    9035              $C$DW$821       .dwtag  DW_TAG_member
    9036                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$81)
    9037                      .dwattr $C$DW$821, DW_AT_name("gpioHandle")
    9038                      .dwattr $C$DW$821, DW_AT_TI_symbol_name("_gpioHandle")
    9039                      .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9040                      .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
    9041              
    9042              $C$DW$822       .dwtag  DW_TAG_member
    9043                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$83)
    9044                      .dwattr $C$DW$822, DW_AT_name("gpioNumber")
    9045                      .dwattr $C$DW$822, DW_AT_TI_symbol_name("_gpioNumber")
    9046                      .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9047                      .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
    9048              
    9049              $C$DW$823       .dwtag  DW_TAG_member
    9050                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$73)
    9051                      .dwattr $C$DW$823, DW_AT_name("RxTimeOut")
    9052                      .dwattr $C$DW$823, DW_AT_TI_symbol_name("_RxTimeOut")
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F169EDD6-E2A2-400A-8386-A823CBD75D49} PAGE  172

    9053                      .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9054                      .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
    9055              
    9056              $C$DW$824       .dwtag  DW_TAG_member
    9057                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$73)
    9058                      .dwattr $C$DW$824, DW_AT_name("enableTimeOut")
    9059                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_enableTimeOut")
    9060                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9061                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
    9062              
    9063                      .dwendtag $C$DW$T$84
    9064              
    9065              $C$DW$T$126     .dwtag  DW_TAG_typedef
    9066                      .dwattr $C$DW$T$126, DW_AT_name("DRV8301_Obj")
    9067                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$84)
    9068                      .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
    9069              
    9070              $C$DW$T$124     .dwtag  DW_TAG_pointer_type
    9071                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$84)
    9072                      .dwattr $C$DW$T$124, DW_AT_address_class(0x20)
    9073              
    9074              $C$DW$T$125     .dwtag  DW_TAG_typedef
    9075                      .dwattr $C$DW$T$125, DW_AT_name("DRV8301_Handle")
    9076                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
    9077                      .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    9078              
    9079              
    9080              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    9081                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    9082                      .dwattr $C$DW$T$19, DW_AT_declaration
    9083                      .dwendtag $C$DW$T$19
    9084              
    9085              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    9086                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$19)
    9087                      .dwattr $C$DW$T$47, DW_AT_address_class(0x20)
    9088              
    9089              $C$DW$T$48      .dwtag  DW_TAG_typedef
    9090                      .dwattr $C$DW$T$48, DW_AT_name("EST_Handle")
    9091                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    9092                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    9093              
    9094              
    9095              $C$DW$T$85      .dwtag  DW_TAG_structure_type
    9096                      .dwattr $C$DW$T$85, DW_AT_name("_FILTER_FO_")
    9097                      .dwattr $C$DW$T$85, DW_AT_byte_size(0x0a)
    9098              $C$DW$825       .dwtag  DW_TAG_member
    9099                      .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$32)
    9100                      .dwattr $C$DW$825, DW_AT_name("a1")
    9101                      .dwattr $C$DW$825, DW_AT_TI_symbol_name("_a1")
    9102                      .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9103                      .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
    9104              
    9105              $C$DW$826       .dwtag  DW_TAG_member
    9106                      .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$32)
    9107                      .dwattr $C$DW$826, DW_AT_name("b0")
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F169EDD6-E2A2-400A-8386-A823CBD75D49} PAGE  173

    9108                      .dwattr $C$DW$826, DW_AT_TI_symbol_name("_b0")
    9109                      .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9110                      .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
    9111              
    9112              $C$DW$827       .dwtag  DW_TAG_member
    9113                      .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$32)
    9114                      .dwattr $C$DW$827, DW_AT_name("b1")
    9115                      .dwattr $C$DW$827, DW_AT_TI_symbol_name("_b1")
    9116                      .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9117                      .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
    9118              
    9119              $C$DW$828       .dwtag  DW_TAG_member
    9120                      .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$32)
    9121                      .dwattr $C$DW$828, DW_AT_name("x1")
    9122                      .dwattr $C$DW$828, DW_AT_TI_symbol_name("_x1")
    9123                      .dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9124                      .dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
    9125              
    9126              $C$DW$829       .dwtag  DW_TAG_member
    9127                      .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$32)
    9128                      .dwattr $C$DW$829, DW_AT_name("y1")
    9129                      .dwattr $C$DW$829, DW_AT_TI_symbol_name("_y1")
    9130                      .dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9131                      .dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
    9132              
    9133                      .dwendtag $C$DW$T$85
    9134              
    9135              $C$DW$T$137     .dwtag  DW_TAG_typedef
    9136                      .dwattr $C$DW$T$137, DW_AT_name("FILTER_FO_Obj")
    9137                      .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$85)
    9138                      .dwattr $C$DW$T$137, DW_AT_language(DW_LANG_C)
    9139              
    9140              $C$DW$T$187     .dwtag  DW_TAG_pointer_type
    9141                      .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$137)
    9142                      .dwattr $C$DW$T$187, DW_AT_address_class(0x20)
    9143              
    9144              
    9145              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    9146                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
    9147                      .dwattr $C$DW$T$20, DW_AT_declaration
    9148                      .dwendtag $C$DW$T$20
    9149              
    9150              $C$DW$T$138     .dwtag  DW_TAG_pointer_type
    9151                      .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$20)
    9152                      .dwattr $C$DW$T$138, DW_AT_address_class(0x20)
    9153              
    9154              $C$DW$T$139     .dwtag  DW_TAG_typedef
    9155                      .dwattr $C$DW$T$139, DW_AT_name("FILTER_FO_Handle")
    9156                      .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$138)
    9157                      .dwattr $C$DW$T$139, DW_AT_language(DW_LANG_C)
    9158              
    9159              
    9160              $C$DW$T$86      .dwtag  DW_TAG_structure_type
    9161                      .dwattr $C$DW$T$86, DW_AT_name("_FLASH_Obj_")
    9162                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x08)
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F169EDD6-E2A2-400A-8386-A823CBD75D49} PAGE  174

    9163              $C$DW$830       .dwtag  DW_TAG_member
    9164                      .dwattr $C$DW$830, DW_AT_type(*$C$DW$T$24)
    9165                      .dwattr $C$DW$830, DW_AT_name("FOPT")
    9166                      .dwattr $C$DW$830, DW_AT_TI_symbol_name("_FOPT")
    9167                      .dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9168                      .dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
    9169              
    9170              $C$DW$831       .dwtag  DW_TAG_member
    9171                      .dwattr $C$DW$831, DW_AT_type(*$C$DW$T$24)
    9172                      .dwattr $C$DW$831, DW_AT_name("rsvd_1")
    9173                      .dwattr $C$DW$831, DW_AT_TI_symbol_name("_rsvd_1")
    9174                      .dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9175                      .dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
    9176              
    9177              $C$DW$832       .dwtag  DW_TAG_member
    9178                      .dwattr $C$DW$832, DW_AT_type(*$C$DW$T$24)
    9179                      .dwattr $C$DW$832, DW_AT_name("FPWR")
    9180                      .dwattr $C$DW$832, DW_AT_TI_symbol_name("_FPWR")
    9181                      .dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9182                      .dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
    9183              
    9184              $C$DW$833       .dwtag  DW_TAG_member
    9185                      .dwattr $C$DW$833, DW_AT_type(*$C$DW$T$24)
    9186                      .dwattr $C$DW$833, DW_AT_name("FSTATUS")
    9187                      .dwattr $C$DW$833, DW_AT_TI_symbol_name("_FSTATUS")
    9188                      .dwattr $C$DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9189                      .dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
    9190              
    9191              $C$DW$834       .dwtag  DW_TAG_member
    9192                      .dwattr $C$DW$834, DW_AT_type(*$C$DW$T$24)
    9193                      .dwattr $C$DW$834, DW_AT_name("FSTDBYWAIT")
    9194                      .dwattr $C$DW$834, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    9195                      .dwattr $C$DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9196                      .dwattr $C$DW$834, DW_AT_accessibility(DW_ACCESS_public)
    9197              
    9198              $C$DW$835       .dwtag  DW_TAG_member
    9199                      .dwattr $C$DW$835, DW_AT_type(*$C$DW$T$24)
    9200                      .dwattr $C$DW$835, DW_AT_name("FACTIVEWAIT")
    9201                      .dwattr $C$DW$835, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    9202                      .dwattr $C$DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9203                      .dwattr $C$DW$835, DW_AT_accessibility(DW_ACCESS_public)
    9204              
    9205              $C$DW$836       .dwtag  DW_TAG_member
    9206                      .dwattr $C$DW$836, DW_AT_type(*$C$DW$T$24)
    9207                      .dwattr $C$DW$836, DW_AT_name("FBANKWAIT")
    9208                      .dwattr $C$DW$836, DW_AT_TI_symbol_name("_FBANKWAIT")
    9209                      .dwattr $C$DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9210                      .dwattr $C$DW$836, DW_AT_accessibility(DW_ACCESS_public)
    9211              
    9212              $C$DW$837       .dwtag  DW_TAG_member
    9213                      .dwattr $C$DW$837, DW_AT_type(*$C$DW$T$24)
    9214                      .dwattr $C$DW$837, DW_AT_name("FOTPWAIT")
    9215                      .dwattr $C$DW$837, DW_AT_TI_symbol_name("_FOTPWAIT")
    9216                      .dwattr $C$DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    9217                      .dwattr $C$DW$837, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F169EDD6-E2A2-400A-8386-A823CBD75D49} PAGE  175

    9218              
    9219                      .dwendtag $C$DW$T$86
    9220              
    9221              $C$DW$T$100     .dwtag  DW_TAG_pointer_type
    9222                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$86)
    9223                      .dwattr $C$DW$T$100, DW_AT_address_class(0x20)
    9224              
    9225              $C$DW$T$101     .dwtag  DW_TAG_typedef
    9226                      .dwattr $C$DW$T$101, DW_AT_name("FLASH_Handle")
    9227                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$100)
    9228                      .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    9229              
    9230              
    9231              $C$DW$T$91      .dwtag  DW_TAG_structure_type
    9232                      .dwattr $C$DW$T$91, DW_AT_name("_GPIO_Obj_")
    9233                      .dwattr $C$DW$T$91, DW_AT_byte_size(0x6a)
    9234              $C$DW$838       .dwtag  DW_TAG_member
    9235                      .dwattr $C$DW$838, DW_AT_type(*$C$DW$T$88)
    9236                      .dwattr $C$DW$838, DW_AT_name("GPACTRL")
    9237                      .dwattr $C$DW$838, DW_AT_TI_symbol_name("_GPACTRL")
    9238                      .dwattr $C$DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9239                      .dwattr $C$DW$838, DW_AT_accessibility(DW_ACCESS_public)
    9240              
    9241              $C$DW$839       .dwtag  DW_TAG_member
    9242                      .dwattr $C$DW$839, DW_AT_type(*$C$DW$T$88)
    9243                      .dwattr $C$DW$839, DW_AT_name("GPAQSEL1")
    9244                      .dwattr $C$DW$839, DW_AT_TI_symbol_name("_GPAQSEL1")
    9245                      .dwattr $C$DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9246                      .dwattr $C$DW$839, DW_AT_accessibility(DW_ACCESS_public)
    9247              
    9248              $C$DW$840       .dwtag  DW_TAG_member
    9249                      .dwattr $C$DW$840, DW_AT_type(*$C$DW$T$88)
    9250                      .dwattr $C$DW$840, DW_AT_name("GPAQSEL2")
    9251                      .dwattr $C$DW$840, DW_AT_TI_symbol_name("_GPAQSEL2")
    9252                      .dwattr $C$DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9253                      .dwattr $C$DW$840, DW_AT_accessibility(DW_ACCESS_public)
    9254              
    9255              $C$DW$841       .dwtag  DW_TAG_member
    9256                      .dwattr $C$DW$841, DW_AT_type(*$C$DW$T$88)
    9257                      .dwattr $C$DW$841, DW_AT_name("GPAMUX1")
    9258                      .dwattr $C$DW$841, DW_AT_TI_symbol_name("_GPAMUX1")
    9259                      .dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9260                      .dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
    9261              
    9262              $C$DW$842       .dwtag  DW_TAG_member
    9263                      .dwattr $C$DW$842, DW_AT_type(*$C$DW$T$88)
    9264                      .dwattr $C$DW$842, DW_AT_name("GPAMUX2")
    9265                      .dwattr $C$DW$842, DW_AT_TI_symbol_name("_GPAMUX2")
    9266                      .dwattr $C$DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9267                      .dwattr $C$DW$842, DW_AT_accessibility(DW_ACCESS_public)
    9268              
    9269              $C$DW$843       .dwtag  DW_TAG_member
