TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:40 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{73E3E16F-CCF2-4EF0-B0D5-EFF645171469} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                             PC v18.12.4.LTS *
       3              ;* Date/Time created: Wed Feb 22 13:06:40 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/GIANT/GIANT_TI_instaspin/motorware/motorware_1_01_00_18/sw/drivers/d
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v18.12.4.LTS Copyright (c) 1996-
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\GIANT\GIANT_TI_instaspin\motorware\motorware_1_01_00_18\sw\solut
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    4177              $C$DW$382       .dwtag  DW_TAG_enumerator
    4178                      .dwattr $C$DW$382, DW_AT_name("DRV8301_RegName_Status_2")
    4179                      .dwattr $C$DW$382, DW_AT_const_value(0x800)
    4180              
    4181              $C$DW$383       .dwtag  DW_TAG_enumerator
    4182                      .dwattr $C$DW$383, DW_AT_name("DRV8301_RegName_Control_1")
    4183                      .dwattr $C$DW$383, DW_AT_const_value(0x1000)
    4184              
    4185              $C$DW$384       .dwtag  DW_TAG_enumerator
    4186                      .dwattr $C$DW$384, DW_AT_name("DRV8301_RegName_Control_2")
    4187                      .dwattr $C$DW$384, DW_AT_const_value(0x1800)
    4188              
    4189                      .dwendtag $C$DW$T$108
    4190              
    4191              $C$DW$T$109     .dwtag  DW_TAG_typedef
    4192                      .dwattr $C$DW$T$109, DW_AT_name("DRV8301_RegName_e")
    4193                      .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$108)
    4194                      .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    4195              
    4196              $C$DW$385       .dwtag  DW_TAG_TI_far_type
    4197                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$109)
    4198              
    4199              $C$DW$T$110     .dwtag  DW_TAG_const_type
    4200                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$385)
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:40 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{73E3E16F-CCF2-4EF0-B0D5-EFF645171469} PAGE   80

    4201              
    4202              
    4203              $C$DW$T$111     .dwtag  DW_TAG_enumeration_type
    4204                      .dwattr $C$DW$T$111, DW_AT_byte_size(0x01)
    4205              $C$DW$386       .dwtag  DW_TAG_enumerator
    4206                      .dwattr $C$DW$386, DW_AT_name("DRV8301_FaultType_NoFault")
    4207                      .dwattr $C$DW$386, DW_AT_const_value(0x00)
    4208              
    4209              $C$DW$387       .dwtag  DW_TAG_enumerator
    4210                      .dwattr $C$DW$387, DW_AT_name("DRV8301_FaultType_FETLC_OC")
    4211                      .dwattr $C$DW$387, DW_AT_const_value(0x01)
    4212              
    4213              $C$DW$388       .dwtag  DW_TAG_enumerator
    4214                      .dwattr $C$DW$388, DW_AT_name("DRV8301_FaultType_FETHC_OC")
    4215                      .dwattr $C$DW$388, DW_AT_const_value(0x02)
    4216              
    4217              $C$DW$389       .dwtag  DW_TAG_enumerator
    4218                      .dwattr $C$DW$389, DW_AT_name("DRV8301_FaultType_FETLB_OC")
    4219                      .dwattr $C$DW$389, DW_AT_const_value(0x04)
    4220              
    4221              $C$DW$390       .dwtag  DW_TAG_enumerator
    4222                      .dwattr $C$DW$390, DW_AT_name("DRV8301_FaultType_FETHB_OC")
    4223                      .dwattr $C$DW$390, DW_AT_const_value(0x08)
    4224              
    4225              $C$DW$391       .dwtag  DW_TAG_enumerator
    4226                      .dwattr $C$DW$391, DW_AT_name("DRV8301_FaultType_FETLA_OC")
    4227                      .dwattr $C$DW$391, DW_AT_const_value(0x10)
    4228              
    4229              $C$DW$392       .dwtag  DW_TAG_enumerator
    4230                      .dwattr $C$DW$392, DW_AT_name("DRV8301_FaultType_FETHA_OC")
    4231                      .dwattr $C$DW$392, DW_AT_const_value(0x20)
    4232              
    4233              $C$DW$393       .dwtag  DW_TAG_enumerator
    4234                      .dwattr $C$DW$393, DW_AT_name("DRV8301_FaultType_OTW")
    4235                      .dwattr $C$DW$393, DW_AT_const_value(0x40)
    4236              
    4237              $C$DW$394       .dwtag  DW_TAG_enumerator
    4238                      .dwattr $C$DW$394, DW_AT_name("DRV8301_FaultType_OTSD")
    4239                      .dwattr $C$DW$394, DW_AT_const_value(0x80)
    4240              
    4241              $C$DW$395       .dwtag  DW_TAG_enumerator
    4242                      .dwattr $C$DW$395, DW_AT_name("DRV8301_FaultType_PVDD_UV")
    4243                      .dwattr $C$DW$395, DW_AT_const_value(0x100)
    4244              
    4245              $C$DW$396       .dwtag  DW_TAG_enumerator
    4246                      .dwattr $C$DW$396, DW_AT_name("DRV8301_FaultType_GVDD_UV")
    4247                      .dwattr $C$DW$396, DW_AT_const_value(0x200)
    4248              
    4249              $C$DW$397       .dwtag  DW_TAG_enumerator
    4250                      .dwattr $C$DW$397, DW_AT_name("DRV8301_FaultType_GVDD_OV")
    4251                      .dwattr $C$DW$397, DW_AT_const_value(0x400)
    4252              
    4253                      .dwendtag $C$DW$T$111
    4254              
    4255              $C$DW$T$112     .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:40 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{73E3E16F-CCF2-4EF0-B0D5-EFF645171469} PAGE   81

    4256                      .dwattr $C$DW$T$112, DW_AT_name("DRV8301_FaultType_e")
    4257                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$111)
    4258                      .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    4259              
    4260              
    4261              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    4262                      .dwattr $C$DW$T$26, DW_AT_name("_DRV8301_Obj_")
    4263                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
    4264              $C$DW$398       .dwtag  DW_TAG_member
    4265                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$20)
    4266                      .dwattr $C$DW$398, DW_AT_name("spiHandle")
    4267                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_spiHandle")
    4268                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4269                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4270              
    4271              $C$DW$399       .dwtag  DW_TAG_member
    4272                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$22)
    4273                      .dwattr $C$DW$399, DW_AT_name("gpioHandle")
    4274                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_gpioHandle")
    4275                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4276                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    4277              
    4278              $C$DW$400       .dwtag  DW_TAG_member
    4279                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$24)
    4280                      .dwattr $C$DW$400, DW_AT_name("gpioNumber")
    4281                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_gpioNumber")
    4282                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4283                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4284              
    4285              $C$DW$401       .dwtag  DW_TAG_member
    4286                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$25)
    4287                      .dwattr $C$DW$401, DW_AT_name("RxTimeOut")
    4288                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_RxTimeOut")
    4289                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4290                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    4291              
    4292              $C$DW$402       .dwtag  DW_TAG_member
    4293                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$25)
    4294                      .dwattr $C$DW$402, DW_AT_name("enableTimeOut")
    4295                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_enableTimeOut")
    4296                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4297                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    4298              
    4299                      .dwendtag $C$DW$T$26
    4300              
    4301              $C$DW$T$115     .dwtag  DW_TAG_typedef
    4302                      .dwattr $C$DW$T$115, DW_AT_name("DRV8301_Obj")
    4303                      .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$26)
    4304                      .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
    4305              
    4306              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    4307                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$26)
    4308                      .dwattr $C$DW$T$71, DW_AT_address_class(0x20)
    4309              
    4310              $C$DW$T$72      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:40 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{73E3E16F-CCF2-4EF0-B0D5-EFF645171469} PAGE   82

    4311                      .dwattr $C$DW$T$72, DW_AT_name("DRV8301_Handle")
    4312                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    4313                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    4314              
    4315              $C$DW$403       .dwtag  DW_TAG_TI_far_type
    4316                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$72)
    4317              
    4318              $C$DW$T$116     .dwtag  DW_TAG_const_type
    4319                      .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$403)
    4320              
    4321              
    4322              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4323                      .dwattr $C$DW$T$37, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    4324                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x05)
    4325              $C$DW$404       .dwtag  DW_TAG_member
    4326                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$28)
    4327                      .dwattr $C$DW$404, DW_AT_name("DRV8301_CURRENT")
    4328                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    4329                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4330                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    4331              
    4332              $C$DW$405       .dwtag  DW_TAG_member
    4333                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$30)
    4334                      .dwattr $C$DW$405, DW_AT_name("DRV8301_RESET")
    4335                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_DRV8301_RESET")
    4336                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4337                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    4338              
    4339              $C$DW$406       .dwtag  DW_TAG_member
    4340                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$32)
    4341                      .dwattr $C$DW$406, DW_AT_name("PWM_MODE")
    4342                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_PWM_MODE")
    4343                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4344                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    4345              
    4346              $C$DW$407       .dwtag  DW_TAG_member
    4347                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$34)
    4348                      .dwattr $C$DW$407, DW_AT_name("OC_MODE")
    4349                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_OC_MODE")
    4350                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4351                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    4352              
    4353              $C$DW$408       .dwtag  DW_TAG_member
    4354                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$36)
    4355                      .dwattr $C$DW$408, DW_AT_name("OC_ADJ_SET")
    4356                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    4357                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4358                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    4359              
    4360                      .dwendtag $C$DW$T$37
    4361              
    4362              $C$DW$T$53      .dwtag  DW_TAG_typedef
    4363                      .dwattr $C$DW$T$53, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    4364                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$37)
    4365                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:40 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{73E3E16F-CCF2-4EF0-B0D5-EFF645171469} PAGE   83

    4366              
    4367              
    4368              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    4369                      .dwattr $C$DW$T$46, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    4370                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x04)
    4371              $C$DW$409       .dwtag  DW_TAG_member
    4372                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$39)
    4373                      .dwattr $C$DW$409, DW_AT_name("OCTW_SET")
    4374                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_OCTW_SET")
    4375                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4376                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    4377              
    4378              $C$DW$410       .dwtag  DW_TAG_member
    4379                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$41)
    4380                      .dwattr $C$DW$410, DW_AT_name("GAIN")
    4381                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_GAIN")
    4382                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4383                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    4384              
    4385              $C$DW$411       .dwtag  DW_TAG_member
    4386                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$43)
    4387                      .dwattr $C$DW$411, DW_AT_name("DC_CAL_CH1p2")
    4388                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    4389                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4390                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    4391              
    4392              $C$DW$412       .dwtag  DW_TAG_member
    4393                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$45)
    4394                      .dwattr $C$DW$412, DW_AT_name("OC_TOFF")
    4395                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_OC_TOFF")
    4396                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4397                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    4398              
    4399                      .dwendtag $C$DW$T$46
    4400              
    4401              $C$DW$T$54      .dwtag  DW_TAG_typedef
    4402                      .dwattr $C$DW$T$54, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    4403                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$46)
    4404                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    4405              
    4406              
    4407              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    4408                      .dwattr $C$DW$T$47, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    4409                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x0b)
    4410              $C$DW$413       .dwtag  DW_TAG_member
    4411                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$25)
    4412                      .dwattr $C$DW$413, DW_AT_name("FAULT")
    4413                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_FAULT")
    4414                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4415                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    4416              
    4417              $C$DW$414       .dwtag  DW_TAG_member
    4418                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$25)
    4419                      .dwattr $C$DW$414, DW_AT_name("GVDD_UV")
    4420                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_GVDD_UV")
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:40 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{73E3E16F-CCF2-4EF0-B0D5-EFF645171469} PAGE   84

    4421                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4422                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    4423              
    4424              $C$DW$415       .dwtag  DW_TAG_member
    4425                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$25)
    4426                      .dwattr $C$DW$415, DW_AT_name("PVDD_UV")
    4427                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_PVDD_UV")
    4428                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4429                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    4430              
    4431              $C$DW$416       .dwtag  DW_TAG_member
    4432                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$25)
    4433                      .dwattr $C$DW$416, DW_AT_name("OTSD")
    4434                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_OTSD")
    4435                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4436                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    4437              
    4438              $C$DW$417       .dwtag  DW_TAG_member
    4439                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$25)
    4440                      .dwattr $C$DW$417, DW_AT_name("OTW")
    4441                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_OTW")
    4442                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4443                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    4444              
    4445              $C$DW$418       .dwtag  DW_TAG_member
    4446                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$25)
    4447                      .dwattr $C$DW$418, DW_AT_name("FETHA_OC")
    4448                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_FETHA_OC")
    4449                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4450                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    4451              
    4452              $C$DW$419       .dwtag  DW_TAG_member
    4453                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$25)
    4454                      .dwattr $C$DW$419, DW_AT_name("FETLA_OC")
    4455                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_FETLA_OC")
    4456                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4457                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    4458              
    4459              $C$DW$420       .dwtag  DW_TAG_member
    4460                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$25)
    4461                      .dwattr $C$DW$420, DW_AT_name("FETHB_OC")
    4462                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_FETHB_OC")
    4463                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4464                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    4465              
    4466              $C$DW$421       .dwtag  DW_TAG_member
    4467                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$25)
    4468                      .dwattr $C$DW$421, DW_AT_name("FETLB_OC")
    4469                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_FETLB_OC")
    4470                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4471                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    4472              
    4473              $C$DW$422       .dwtag  DW_TAG_member
    4474                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$25)
    4475                      .dwattr $C$DW$422, DW_AT_name("FETHC_OC")
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:40 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{73E3E16F-CCF2-4EF0-B0D5-EFF645171469} PAGE   85

    4476                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_FETHC_OC")
    4477                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4478                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4479              
    4480              $C$DW$423       .dwtag  DW_TAG_member
    4481                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$25)
    4482                      .dwattr $C$DW$423, DW_AT_name("FETLC_OC")
    4483                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_FETLC_OC")
    4484                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4485                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    4486              
    4487                      .dwendtag $C$DW$T$47
    4488              
    4489              $C$DW$T$51      .dwtag  DW_TAG_typedef
    4490                      .dwattr $C$DW$T$51, DW_AT_name("DRV_SPI_8301_Stat1_t_")
    4491                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$47)
    4492                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    4493              
    4494              
    4495              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    4496                      .dwattr $C$DW$T$50, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
    4497                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x02)
    4498              $C$DW$424       .dwtag  DW_TAG_member
    4499                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$25)
    4500                      .dwattr $C$DW$424, DW_AT_name("GVDD_OV")
    4501                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_GVDD_OV")
    4502                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4503                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    4504              
    4505              $C$DW$425       .dwtag  DW_TAG_member
    4506                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$49)
    4507                      .dwattr $C$DW$425, DW_AT_name("DeviceID")
    4508                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_DeviceID")
    4509                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4510                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    4511              
    4512                      .dwendtag $C$DW$T$50
    4513              
    4514              $C$DW$T$52      .dwtag  DW_TAG_typedef
    4515                      .dwattr $C$DW$T$52, DW_AT_name("DRV_SPI_8301_Stat2_t_")
    4516                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$50)
    4517                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    4518              
    4519              
    4520              $C$DW$T$55      .dwtag  DW_TAG_structure_type
    4521                      .dwattr $C$DW$T$55, DW_AT_name("_DRV_SPI_8301_Vars_t_")
    4522                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x18)
    4523              $C$DW$426       .dwtag  DW_TAG_member
    4524                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$51)
    4525                      .dwattr $C$DW$426, DW_AT_name("Stat_Reg_1")
    4526                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_Stat_Reg_1")
    4527                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4528                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4529              
    4530              $C$DW$427       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:40 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{73E3E16F-CCF2-4EF0-B0D5-EFF645171469} PAGE   86

    4531                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$52)
    4532                      .dwattr $C$DW$427, DW_AT_name("Stat_Reg_2")
    4533                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_Stat_Reg_2")
    4534                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4535                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4536              
    4537              $C$DW$428       .dwtag  DW_TAG_member
    4538                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$53)
    4539                      .dwattr $C$DW$428, DW_AT_name("Ctrl_Reg_1")
    4540                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
    4541                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4542                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4543              
    4544              $C$DW$429       .dwtag  DW_TAG_member
    4545                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$54)
    4546                      .dwattr $C$DW$429, DW_AT_name("Ctrl_Reg_2")
    4547                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
    4548                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4549                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4550              
    4551              $C$DW$430       .dwtag  DW_TAG_member
    4552                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$25)
    4553                      .dwattr $C$DW$430, DW_AT_name("SndCmd")
    4554                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_SndCmd")
    4555                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4556                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4557              
    4558              $C$DW$431       .dwtag  DW_TAG_member
    4559                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$25)
    4560                      .dwattr $C$DW$431, DW_AT_name("RcvCmd")
    4561                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_RcvCmd")
    4562                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    4563                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4564              
    4565                      .dwendtag $C$DW$T$55
    4566              
    4567              $C$DW$T$122     .dwtag  DW_TAG_typedef
    4568                      .dwattr $C$DW$T$122, DW_AT_name("DRV_SPI_8301_Vars_t")
    4569                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$55)
    4570                      .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
    4571              
    4572              $C$DW$T$123     .dwtag  DW_TAG_pointer_type
    4573                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$122)
    4574                      .dwattr $C$DW$T$123, DW_AT_address_class(0x20)
    4575              
    4576              $C$DW$432       .dwtag  DW_TAG_TI_far_type
    4577                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$123)
    4578              
    4579              $C$DW$T$124     .dwtag  DW_TAG_const_type
    4580                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$432)
    4581              
    4582              
    4583              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    4584                      .dwattr $C$DW$T$66, DW_AT_name("_GPIO_Obj_")
    4585                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x6a)
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:40 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{73E3E16F-CCF2-4EF0-B0D5-EFF645171469} PAGE   87

    4586              $C$DW$433       .dwtag  DW_TAG_member
    4587                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$58)
    4588                      .dwattr $C$DW$433, DW_AT_name("GPACTRL")
    4589                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_GPACTRL")
    4590                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4591                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    4592              
    4593              $C$DW$434       .dwtag  DW_TAG_member
    4594                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$58)
    4595                      .dwattr $C$DW$434, DW_AT_name("GPAQSEL1")
    4596                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_GPAQSEL1")
    4597                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4598                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4599              
    4600              $C$DW$435       .dwtag  DW_TAG_member
    4601                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$58)
    4602                      .dwattr $C$DW$435, DW_AT_name("GPAQSEL2")
    4603                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_GPAQSEL2")
    4604                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4605                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4606              
    4607              $C$DW$436       .dwtag  DW_TAG_member
    4608                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$58)
    4609                      .dwattr $C$DW$436, DW_AT_name("GPAMUX1")
    4610                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_GPAMUX1")
    4611                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4612                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4613              
    4614              $C$DW$437       .dwtag  DW_TAG_member
    4615                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$58)
    4616                      .dwattr $C$DW$437, DW_AT_name("GPAMUX2")
    4617                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_GPAMUX2")
    4618                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4619                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4620              
    4621              $C$DW$438       .dwtag  DW_TAG_member
    4622                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$58)
    4623                      .dwattr $C$DW$438, DW_AT_name("GPADIR")
    4624                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_GPADIR")
    4625                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4626                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4627              
    4628              $C$DW$439       .dwtag  DW_TAG_member
    4629                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$58)
    4630                      .dwattr $C$DW$439, DW_AT_name("GPAPUD")
    4631                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_GPAPUD")
    4632                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4633                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4634              
    4635              $C$DW$440       .dwtag  DW_TAG_member
    4636                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$60)
    4637                      .dwattr $C$DW$440, DW_AT_name("rsvd_1")
    4638                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_rsvd_1")
    4639                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4640                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:40 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{73E3E16F-CCF2-4EF0-B0D5-EFF645171469} PAGE   88

    4641              
    4642              $C$DW$441       .dwtag  DW_TAG_member
    4643                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$58)
    4644                      .dwattr $C$DW$441, DW_AT_name("GPBCTRL")
    4645                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_GPBCTRL")
    4646                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4647                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4648              
    4649              $C$DW$442       .dwtag  DW_TAG_member
    4650                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$58)
    4651                      .dwattr $C$DW$442, DW_AT_name("GPBQSEL1")
    4652                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_GPBQSEL1")
    4653                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4654                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4655              
    4656              $C$DW$443       .dwtag  DW_TAG_member
    4657                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$58)
    4658                      .dwattr $C$DW$443, DW_AT_name("GPBQSEL2")
    4659                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_GPBQSEL2")
    4660                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4661                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4662              
    4663              $C$DW$444       .dwtag  DW_TAG_member
    4664                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$58)
    4665                      .dwattr $C$DW$444, DW_AT_name("GPBMUX1")
    4666                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_GPBMUX1")
    4667                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4668                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4669              
    4670              $C$DW$445       .dwtag  DW_TAG_member
    4671                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$58)
    4672                      .dwattr $C$DW$445, DW_AT_name("GPBMUX2")
    4673                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_GPBMUX2")
    4674                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4675                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4676              
    4677              $C$DW$446       .dwtag  DW_TAG_member
    4678                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$58)
    4679                      .dwattr $C$DW$446, DW_AT_name("GPBDIR")
    4680                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_GPBDIR")
    4681                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4682                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4683              
    4684              $C$DW$447       .dwtag  DW_TAG_member
    4685                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$58)
    4686                      .dwattr $C$DW$447, DW_AT_name("GPBPUD")
    4687                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_GPBPUD")
    4688                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4689                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4690              
    4691              $C$DW$448       .dwtag  DW_TAG_member
    4692                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$61)
    4693                      .dwattr $C$DW$448, DW_AT_name("rsvd_4")
    4694                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_rsvd_4")
    4695                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:40 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{73E3E16F-CCF2-4EF0-B0D5-EFF645171469} PAGE   89

    4696                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4697              
    4698              $C$DW$449       .dwtag  DW_TAG_member
    4699                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$58)
    4700                      .dwattr $C$DW$449, DW_AT_name("AIOMUX1")
    4701                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_AIOMUX1")
    4702                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4703                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4704              
    4705              $C$DW$450       .dwtag  DW_TAG_member
    4706                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$60)
    4707                      .dwattr $C$DW$450, DW_AT_name("rsvd_5")
    4708                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_rsvd_5")
    4709                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4710                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4711              
    4712              $C$DW$451       .dwtag  DW_TAG_member
    4713                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$58)
    4714                      .dwattr $C$DW$451, DW_AT_name("AIODIR")
    4715                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_AIODIR")
    4716                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4717                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4718              
    4719              $C$DW$452       .dwtag  DW_TAG_member
    4720                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$62)
    4721                      .dwattr $C$DW$452, DW_AT_name("rsvd_6")
    4722                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_rsvd_6")
    4723                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4724                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4725              
    4726              $C$DW$453       .dwtag  DW_TAG_member
    4727                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$58)
    4728                      .dwattr $C$DW$453, DW_AT_name("GPADAT")
    4729                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_GPADAT")
    4730                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4731                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4732              
    4733              $C$DW$454       .dwtag  DW_TAG_member
    4734                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$58)
    4735                      .dwattr $C$DW$454, DW_AT_name("GPASET")
    4736                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_GPASET")
    4737                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4738                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4739              
    4740              $C$DW$455       .dwtag  DW_TAG_member
    4741                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$58)
    4742                      .dwattr $C$DW$455, DW_AT_name("GPACLEAR")
    4743                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_GPACLEAR")
    4744                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4745                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4746              
    4747              $C$DW$456       .dwtag  DW_TAG_member
    4748                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$58)
    4749                      .dwattr $C$DW$456, DW_AT_name("GPATOGGLE")
    4750                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_GPATOGGLE")
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:40 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{73E3E16F-CCF2-4EF0-B0D5-EFF645171469} PAGE   90

    4751                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4752                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4753              
    4754              $C$DW$457       .dwtag  DW_TAG_member
    4755                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$58)
    4756                      .dwattr $C$DW$457, DW_AT_name("GPBDAT")
    4757                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_GPBDAT")
    4758                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4759                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4760              
    4761              $C$DW$458       .dwtag  DW_TAG_member
    4762                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$58)
    4763                      .dwattr $C$DW$458, DW_AT_name("GPBSET")
    4764                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_GPBSET")
    4765                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    4766                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4767              
    4768              $C$DW$459       .dwtag  DW_TAG_member
    4769                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$58)
    4770                      .dwattr $C$DW$459, DW_AT_name("GPBCLEAR")
    4771                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_GPBCLEAR")
    4772                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    4773                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4774              
    4775              $C$DW$460       .dwtag  DW_TAG_member
    4776                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$58)
    4777                      .dwattr $C$DW$460, DW_AT_name("GPBTOGGLE")
    4778                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_GPBTOGGLE")
    4779                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    4780                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4781              
    4782              $C$DW$461       .dwtag  DW_TAG_member
    4783                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$63)
    4784                      .dwattr $C$DW$461, DW_AT_name("rsvd_7")
    4785                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_rsvd_7")
    4786                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    4787                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4788              
    4789              $C$DW$462       .dwtag  DW_TAG_member
    4790                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$58)
    4791                      .dwattr $C$DW$462, DW_AT_name("AIODAT")
    4792                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_AIODAT")
    4793                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    4794                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4795              
    4796              $C$DW$463       .dwtag  DW_TAG_member
    4797                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$58)
    4798                      .dwattr $C$DW$463, DW_AT_name("AIOSET")
    4799                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_AIOSET")
    4800                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    4801                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4802              
    4803              $C$DW$464       .dwtag  DW_TAG_member
    4804                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$58)
    4805                      .dwattr $C$DW$464, DW_AT_name("AIOCLEAR")
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:40 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{73E3E16F-CCF2-4EF0-B0D5-EFF645171469} PAGE   91

    4806                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_AIOCLEAR")
    4807                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    4808                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4809              
    4810              $C$DW$465       .dwtag  DW_TAG_member
    4811                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$58)
    4812                      .dwattr $C$DW$465, DW_AT_name("AIOTOGGLE")
    4813                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_AIOTOGGLE")
    4814                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    4815                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4816              
    4817              $C$DW$466       .dwtag  DW_TAG_member
    4818                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$64)
    4819                      .dwattr $C$DW$466, DW_AT_name("GPIOXINTnSEL")
    4820                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    4821                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    4822                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4823              
    4824              $C$DW$467       .dwtag  DW_TAG_member
    4825                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$65)
    4826                      .dwattr $C$DW$467, DW_AT_name("rsvd_8")
    4827                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_rsvd_8")
    4828                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    4829                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4830              
    4831              $C$DW$468       .dwtag  DW_TAG_member
    4832                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$58)
    4833                      .dwattr $C$DW$468, DW_AT_name("GPIOLPMSEL")
    4834                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    4835                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    4836                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4837              
    4838                      .dwendtag $C$DW$T$66
    4839              
    4840              $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    4841                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$66)
    4842                      .dwattr $C$DW$T$21, DW_AT_address_class(0x20)
    4843              
    4844              $C$DW$T$22      .dwtag  DW_TAG_typedef
    4845                      .dwattr $C$DW$T$22, DW_AT_name("GPIO_Handle")
    4846                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    4847                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    4848              
    4849              $C$DW$469       .dwtag  DW_TAG_TI_far_type
    4850                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$22)
    4851              
    4852              $C$DW$T$127     .dwtag  DW_TAG_const_type
    4853                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$469)
    4854              
    4855              
    4856              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    4857                      .dwattr $C$DW$T$67, DW_AT_name("_SPI_Obj_")
    4858                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x10)
    4859              $C$DW$470       .dwtag  DW_TAG_member
    4860                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$59)
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:40 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{73E3E16F-CCF2-4EF0-B0D5-EFF645171469} PAGE   92

    4861                      .dwattr $C$DW$470, DW_AT_name("SPICCR")
    4862                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_SPICCR")
    4863                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4864                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4865              
    4866              $C$DW$471       .dwtag  DW_TAG_member
    4867                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$59)
    4868                      .dwattr $C$DW$471, DW_AT_name("SPICTL")
    4869                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_SPICTL")
    4870                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4871                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    4872              
    4873              $C$DW$472       .dwtag  DW_TAG_member
    4874                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$59)
    4875                      .dwattr $C$DW$472, DW_AT_name("SPIST")
    4876                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_SPIST")
    4877                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4878                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    4879              
    4880              $C$DW$473       .dwtag  DW_TAG_member
    4881                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$59)
    4882                      .dwattr $C$DW$473, DW_AT_name("rsvd_1")
    4883                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_rsvd_1")
    4884                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4885                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    4886              
    4887              $C$DW$474       .dwtag  DW_TAG_member
    4888                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$59)
    4889                      .dwattr $C$DW$474, DW_AT_name("SPIBRR")
    4890                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_SPIBRR")
    4891                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4892                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    4893              
    4894              $C$DW$475       .dwtag  DW_TAG_member
    4895                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$59)
    4896                      .dwattr $C$DW$475, DW_AT_name("rsvd_2")
    4897                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_rsvd_2")
    4898                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4899                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    4900              
    4901              $C$DW$476       .dwtag  DW_TAG_member
    4902                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$59)
    4903                      .dwattr $C$DW$476, DW_AT_name("SPIEMU")
    4904                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_SPIEMU")
    4905                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4906                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    4907              
    4908              $C$DW$477       .dwtag  DW_TAG_member
    4909                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$59)
    4910                      .dwattr $C$DW$477, DW_AT_name("SPIRXBUF")
    4911                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_SPIRXBUF")
    4912                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4913                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    4914              
    4915              $C$DW$478       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:40 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{73E3E16F-CCF2-4EF0-B0D5-EFF645171469} PAGE   93

    4916                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$59)
    4917                      .dwattr $C$DW$478, DW_AT_name("SPITXBUF")
    4918                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_SPITXBUF")
    4919                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4920                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    4921              
    4922              $C$DW$479       .dwtag  DW_TAG_member
    4923                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$59)
    4924                      .dwattr $C$DW$479, DW_AT_name("SPIDAT")
    4925                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_SPIDAT")
    4926                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4927                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    4928              
    4929              $C$DW$480       .dwtag  DW_TAG_member
    4930                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$59)
    4931                      .dwattr $C$DW$480, DW_AT_name("SPIFFTX")
    4932                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_SPIFFTX")
    4933                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4934                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    4935              
    4936              $C$DW$481       .dwtag  DW_TAG_member
    4937                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$59)
    4938                      .dwattr $C$DW$481, DW_AT_name("SPIFFRX")
    4939                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_SPIFFRX")
    4940                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4941                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    4942              
    4943              $C$DW$482       .dwtag  DW_TAG_member
    4944                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$59)
    4945                      .dwattr $C$DW$482, DW_AT_name("SPIFFCT")
    4946                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_SPIFFCT")
    4947                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4948                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    4949              
    4950              $C$DW$483       .dwtag  DW_TAG_member
    4951                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$60)
    4952                      .dwattr $C$DW$483, DW_AT_name("rsvd_3")
    4953                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_rsvd_3")
    4954                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4955                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    4956              
    4957              $C$DW$484       .dwtag  DW_TAG_member
    4958                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$59)
    4959                      .dwattr $C$DW$484, DW_AT_name("SPIPRI")
    4960                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_SPIPRI")
    4961                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    4962                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    4963              
    4964                      .dwendtag $C$DW$T$67
    4965              
    4966              $C$DW$T$129     .dwtag  DW_TAG_typedef
    4967                      .dwattr $C$DW$T$129, DW_AT_name("SPI_Obj")
    4968                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$67)
    4969                      .dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
    4970              
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:40 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{73E3E16F-CCF2-4EF0-B0D5-EFF645171469} PAGE   94

    4971              $C$DW$T$19      .dwtag  DW_TAG_pointer_type
    4972                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$67)
    4973                      .dwattr $C$DW$T$19, DW_AT_address_class(0x20)
    4974              
    4975              $C$DW$T$20      .dwtag  DW_TAG_typedef
    4976                      .dwattr $C$DW$T$20, DW_AT_name("SPI_Handle")
    4977                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    4978                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    4979              
    4980              $C$DW$485       .dwtag  DW_TAG_TI_far_type
    4981                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$20)
    4982              
    4983              $C$DW$T$130     .dwtag  DW_TAG_const_type
    4984                      .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$485)
    4985              
    4986              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    4987                      .dwattr $C$DW$T$2, DW_AT_name("void")
    4988              
    4989              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    4990                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    4991                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    4992              
    4993              $C$DW$486       .dwtag  DW_TAG_TI_far_type
    4994                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$3)
    4995              
    4996              $C$DW$T$132     .dwtag  DW_TAG_const_type
    4997                      .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$486)
    4998              
    4999              $C$DW$T$4       .dwtag  DW_TAG_base_type
    5000                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    5001                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    5002                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    5003              
    5004              $C$DW$T$5       .dwtag  DW_TAG_base_type
    5005                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    5006                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    5007                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    5008              
    5009              $C$DW$T$6       .dwtag  DW_TAG_base_type
    5010                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    5011                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    5012                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    5013              
    5014              $C$DW$T$7       .dwtag  DW_TAG_base_type
    5015                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    5016                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    5017                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    5018              
    5019              $C$DW$T$8       .dwtag  DW_TAG_base_type
    5020                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    5021                      .dwattr $C$DW$T$8, DW_AT_name("short")
    5022                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    5023              
    5024              $C$DW$T$9       .dwtag  DW_TAG_base_type
