TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:32 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{44235224-4361-4E86-969A-E96B7C1820D8} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                             PC v18.12.4.LTS *
       3              ;* Date/Time created: Fri Feb 17 15:09:32 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/GIANT/GAINT_TI_instaspin/motorware/motorware_1_01_00_18/sw/drivers/g
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v18.12.4.LTS Copyright (c) 1996-
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\GIANT\GAINT_TI_instaspin\motorware\motorware_1_01_00_18\sw\solut
      13              ;       C:\ti\ccs930\ccs\tools\compiler\ti-cgt-c2000_18.12.4.LTS\bin\opt2000.exe C:\\Users\\User\\AppData\\Lo

    2855              $C$DW$378       .dwtag  DW_TAG_enumerator
    2856                      .dwattr $C$DW$378, DW_AT_name("GPIO_56_Mode_SPICLKA")
    2857                      .dwattr $C$DW$378, DW_AT_const_value(0x01)
    2858              
    2859              $C$DW$379       .dwtag  DW_TAG_enumerator
    2860                      .dwattr $C$DW$379, DW_AT_name("GPIO_56_Mode_EQEP2I")
    2861                      .dwattr $C$DW$379, DW_AT_const_value(0x02)
    2862              
    2863              $C$DW$380       .dwtag  DW_TAG_enumerator
    2864                      .dwattr $C$DW$380, DW_AT_name("GPIO_56_Mode_HRCAP3")
    2865                      .dwattr $C$DW$380, DW_AT_const_value(0x03)
    2866              
    2867              $C$DW$381       .dwtag  DW_TAG_enumerator
    2868                      .dwattr $C$DW$381, DW_AT_name("GPIO_57_Mode_GeneralPurpose")
    2869                      .dwattr $C$DW$381, DW_AT_const_value(0x00)
    2870              
    2871              $C$DW$382       .dwtag  DW_TAG_enumerator
    2872                      .dwattr $C$DW$382, DW_AT_name("GPIO_57_Mode_SPISTEA_NOT")
    2873                      .dwattr $C$DW$382, DW_AT_const_value(0x01)
    2874              
    2875              $C$DW$383       .dwtag  DW_TAG_enumerator
    2876                      .dwattr $C$DW$383, DW_AT_name("GPIO_57_Mode_EQEP2S")
    2877                      .dwattr $C$DW$383, DW_AT_const_value(0x02)
    2878              
    2879              $C$DW$384       .dwtag  DW_TAG_enumerator
    2880                      .dwattr $C$DW$384, DW_AT_name("GPIO_57_Mode_HRCAP4")
    2881                      .dwattr $C$DW$384, DW_AT_const_value(0x03)
    2882              
    2883              $C$DW$385       .dwtag  DW_TAG_enumerator
    2884                      .dwattr $C$DW$385, DW_AT_name("GPIO_58_Mode_GeneralPurpose")
    2885                      .dwattr $C$DW$385, DW_AT_const_value(0x00)
    2886              
    2887              $C$DW$386       .dwtag  DW_TAG_enumerator
    2888                      .dwattr $C$DW$386, DW_AT_name("GPIO_58_Mode_MCLKRA")
    2889                      .dwattr $C$DW$386, DW_AT_const_value(0x01)
    2890              
    2891              $C$DW$387       .dwtag  DW_TAG_enumerator
    2892                      .dwattr $C$DW$387, DW_AT_name("GPIO_58_Mode_SCITXDB")
    2893                      .dwattr $C$DW$387, DW_AT_const_value(0x02)
    2894              
    2895              $C$DW$388       .dwtag  DW_TAG_enumerator
    2896                      .dwattr $C$DW$388, DW_AT_name("GPIO_58_Mode_EPWM7A")
    2897                      .dwattr $C$DW$388, DW_AT_const_value(0x03)
    2898              
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:32 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{44235224-4361-4E86-969A-E96B7C1820D8} PAGE   54

    2899                      .dwendtag $C$DW$T$47
    2900              
    2901              $C$DW$T$48      .dwtag  DW_TAG_typedef
    2902                      .dwattr $C$DW$T$48, DW_AT_name("GPIO_Mode_e")
    2903                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    2904                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    2905              
    2906              $C$DW$389       .dwtag  DW_TAG_TI_far_type
    2907                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$48)
    2908              
    2909              $C$DW$T$49      .dwtag  DW_TAG_const_type
    2910                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$389)
    2911              
    2912              
    2913              $C$DW$T$50      .dwtag  DW_TAG_enumeration_type
    2914                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    2915              $C$DW$390       .dwtag  DW_TAG_enumerator
    2916                      .dwattr $C$DW$390, DW_AT_name("GPIO_Qual_Sync")
    2917                      .dwattr $C$DW$390, DW_AT_const_value(0x00)
    2918              
    2919              $C$DW$391       .dwtag  DW_TAG_enumerator
    2920                      .dwattr $C$DW$391, DW_AT_name("GPIO_Qual_Sample_3")
    2921                      .dwattr $C$DW$391, DW_AT_const_value(0x01)
    2922              
    2923              $C$DW$392       .dwtag  DW_TAG_enumerator
    2924                      .dwattr $C$DW$392, DW_AT_name("GPIO_Qual_Sample_6")
    2925                      .dwattr $C$DW$392, DW_AT_const_value(0x02)
    2926              
    2927              $C$DW$393       .dwtag  DW_TAG_enumerator
    2928                      .dwattr $C$DW$393, DW_AT_name("GPIO_Qual_ASync")
    2929                      .dwattr $C$DW$393, DW_AT_const_value(0x03)
    2930              
    2931                      .dwendtag $C$DW$T$50
    2932              
    2933              $C$DW$T$51      .dwtag  DW_TAG_typedef
    2934                      .dwattr $C$DW$T$51, DW_AT_name("GPIO_Qual_e")
    2935                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    2936                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    2937              
    2938              $C$DW$394       .dwtag  DW_TAG_TI_far_type
    2939                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$51)
    2940              
    2941              $C$DW$T$52      .dwtag  DW_TAG_const_type
    2942                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$394)
    2943              
    2944              
    2945              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2946                      .dwattr $C$DW$T$31, DW_AT_name("_GPIO_Obj_")
    2947                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6a)
    2948              $C$DW$395       .dwtag  DW_TAG_member
    2949                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$21)
    2950                      .dwattr $C$DW$395, DW_AT_name("GPACTRL")
    2951                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_GPACTRL")
    2952                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2953                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:32 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{44235224-4361-4E86-969A-E96B7C1820D8} PAGE   55

    2954              
    2955              $C$DW$396       .dwtag  DW_TAG_member
    2956                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$21)
    2957                      .dwattr $C$DW$396, DW_AT_name("GPAQSEL1")
    2958                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_GPAQSEL1")
    2959                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2960                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    2961              
    2962              $C$DW$397       .dwtag  DW_TAG_member
    2963                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$21)
    2964                      .dwattr $C$DW$397, DW_AT_name("GPAQSEL2")
    2965                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_GPAQSEL2")
    2966                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2967                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    2968              
    2969              $C$DW$398       .dwtag  DW_TAG_member
    2970                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$21)
    2971                      .dwattr $C$DW$398, DW_AT_name("GPAMUX1")
    2972                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_GPAMUX1")
    2973                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2974                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    2975              
    2976              $C$DW$399       .dwtag  DW_TAG_member
    2977                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$21)
    2978                      .dwattr $C$DW$399, DW_AT_name("GPAMUX2")
    2979                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_GPAMUX2")
    2980                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2981                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    2982              
    2983              $C$DW$400       .dwtag  DW_TAG_member
    2984                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$21)
    2985                      .dwattr $C$DW$400, DW_AT_name("GPADIR")
    2986                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_GPADIR")
    2987                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2988                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    2989              
    2990              $C$DW$401       .dwtag  DW_TAG_member
    2991                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$21)
    2992                      .dwattr $C$DW$401, DW_AT_name("GPAPUD")
    2993                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_GPAPUD")
    2994                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2995                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    2996              
    2997              $C$DW$402       .dwtag  DW_TAG_member
    2998                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$25)
    2999                      .dwattr $C$DW$402, DW_AT_name("rsvd_1")
    3000                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_rsvd_1")
    3001                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3002                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3003              
    3004              $C$DW$403       .dwtag  DW_TAG_member
    3005                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$21)
    3006                      .dwattr $C$DW$403, DW_AT_name("GPBCTRL")
    3007                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_GPBCTRL")
    3008                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:32 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{44235224-4361-4E86-969A-E96B7C1820D8} PAGE   56

    3009                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3010              
    3011              $C$DW$404       .dwtag  DW_TAG_member
    3012                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$21)
    3013                      .dwattr $C$DW$404, DW_AT_name("GPBQSEL1")
    3014                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_GPBQSEL1")
    3015                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3016                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3017              
    3018              $C$DW$405       .dwtag  DW_TAG_member
    3019                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$21)
    3020                      .dwattr $C$DW$405, DW_AT_name("GPBQSEL2")
    3021                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_GPBQSEL2")
    3022                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3023                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3024              
    3025              $C$DW$406       .dwtag  DW_TAG_member
    3026                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$21)
    3027                      .dwattr $C$DW$406, DW_AT_name("GPBMUX1")
    3028                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_GPBMUX1")
    3029                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3030                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3031              
    3032              $C$DW$407       .dwtag  DW_TAG_member
    3033                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$21)
    3034                      .dwattr $C$DW$407, DW_AT_name("GPBMUX2")
    3035                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_GPBMUX2")
    3036                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3037                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    3038              
    3039              $C$DW$408       .dwtag  DW_TAG_member
    3040                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$21)
    3041                      .dwattr $C$DW$408, DW_AT_name("GPBDIR")
    3042                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_GPBDIR")
    3043                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3044                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3045              
    3046              $C$DW$409       .dwtag  DW_TAG_member
    3047                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$21)
    3048                      .dwattr $C$DW$409, DW_AT_name("GPBPUD")
    3049                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_GPBPUD")
    3050                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3051                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3052              
    3053              $C$DW$410       .dwtag  DW_TAG_member
    3054                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$26)
    3055                      .dwattr $C$DW$410, DW_AT_name("rsvd_4")
    3056                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_rsvd_4")
    3057                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3058                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3059              
    3060              $C$DW$411       .dwtag  DW_TAG_member
    3061                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$21)
    3062                      .dwattr $C$DW$411, DW_AT_name("AIOMUX1")
    3063                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_AIOMUX1")
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:32 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{44235224-4361-4E86-969A-E96B7C1820D8} PAGE   57

    3064                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    3065                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3066              
    3067              $C$DW$412       .dwtag  DW_TAG_member
    3068                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$25)
    3069                      .dwattr $C$DW$412, DW_AT_name("rsvd_5")
    3070                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_rsvd_5")
    3071                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3072                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3073              
    3074              $C$DW$413       .dwtag  DW_TAG_member
    3075                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$21)
    3076                      .dwattr $C$DW$413, DW_AT_name("AIODIR")
    3077                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_AIODIR")
    3078                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    3079                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3080              
    3081              $C$DW$414       .dwtag  DW_TAG_member
    3082                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$27)
    3083                      .dwattr $C$DW$414, DW_AT_name("rsvd_6")
    3084                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_rsvd_6")
    3085                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3086                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3087              
    3088              $C$DW$415       .dwtag  DW_TAG_member
    3089                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$21)
    3090                      .dwattr $C$DW$415, DW_AT_name("GPADAT")
    3091                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_GPADAT")
    3092                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3093                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3094              
    3095              $C$DW$416       .dwtag  DW_TAG_member
    3096                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$21)
    3097                      .dwattr $C$DW$416, DW_AT_name("GPASET")
    3098                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_GPASET")
    3099                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    3100                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3101              
    3102              $C$DW$417       .dwtag  DW_TAG_member
    3103                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$21)
    3104                      .dwattr $C$DW$417, DW_AT_name("GPACLEAR")
    3105                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_GPACLEAR")
    3106                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3107                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3108              
    3109              $C$DW$418       .dwtag  DW_TAG_member
    3110                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$21)
    3111                      .dwattr $C$DW$418, DW_AT_name("GPATOGGLE")
    3112                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_GPATOGGLE")
    3113                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3114                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3115              
    3116              $C$DW$419       .dwtag  DW_TAG_member
    3117                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$21)
    3118                      .dwattr $C$DW$419, DW_AT_name("GPBDAT")
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:32 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{44235224-4361-4E86-969A-E96B7C1820D8} PAGE   58

    3119                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_GPBDAT")
    3120                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    3121                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3122              
    3123              $C$DW$420       .dwtag  DW_TAG_member
    3124                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$21)
    3125                      .dwattr $C$DW$420, DW_AT_name("GPBSET")
    3126                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_GPBSET")
    3127                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    3128                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3129              
    3130              $C$DW$421       .dwtag  DW_TAG_member
    3131                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$21)
    3132                      .dwattr $C$DW$421, DW_AT_name("GPBCLEAR")
    3133                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_GPBCLEAR")
    3134                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    3135                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3136              
    3137              $C$DW$422       .dwtag  DW_TAG_member
    3138                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$21)
    3139                      .dwattr $C$DW$422, DW_AT_name("GPBTOGGLE")
    3140                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_GPBTOGGLE")
    3141                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    3142                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3143              
    3144              $C$DW$423       .dwtag  DW_TAG_member
    3145                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$28)
    3146                      .dwattr $C$DW$423, DW_AT_name("rsvd_7")
    3147                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_rsvd_7")
    3148                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    3149                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3150              
    3151              $C$DW$424       .dwtag  DW_TAG_member
    3152                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$21)
    3153                      .dwattr $C$DW$424, DW_AT_name("AIODAT")
    3154                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_AIODAT")
    3155                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3156                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3157              
    3158              $C$DW$425       .dwtag  DW_TAG_member
    3159                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$21)
    3160                      .dwattr $C$DW$425, DW_AT_name("AIOSET")
    3161                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_AIOSET")
    3162                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    3163                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    3164              
    3165              $C$DW$426       .dwtag  DW_TAG_member
    3166                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$21)
    3167                      .dwattr $C$DW$426, DW_AT_name("AIOCLEAR")
    3168                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_AIOCLEAR")
    3169                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3170                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    3171              
    3172              $C$DW$427       .dwtag  DW_TAG_member
    3173                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:32 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{44235224-4361-4E86-969A-E96B7C1820D8} PAGE   59

    3174                      .dwattr $C$DW$427, DW_AT_name("AIOTOGGLE")
    3175                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_AIOTOGGLE")
    3176                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3177                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    3178              
    3179              $C$DW$428       .dwtag  DW_TAG_member
    3180                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$29)
    3181                      .dwattr $C$DW$428, DW_AT_name("GPIOXINTnSEL")
    3182                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    3183                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3184                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    3185              
    3186              $C$DW$429       .dwtag  DW_TAG_member
    3187                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$30)
    3188                      .dwattr $C$DW$429, DW_AT_name("rsvd_8")
    3189                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_rsvd_8")
    3190                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    3191                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    3192              
    3193              $C$DW$430       .dwtag  DW_TAG_member
    3194                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$21)
    3195                      .dwattr $C$DW$430, DW_AT_name("GPIOLPMSEL")
    3196                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    3197                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    3198                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    3199              
    3200                      .dwendtag $C$DW$T$31
    3201              
    3202              $C$DW$T$53      .dwtag  DW_TAG_typedef
    3203                      .dwattr $C$DW$T$53, DW_AT_name("GPIO_Obj")
    3204                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$31)
    3205                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    3206              
    3207              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    3208                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$31)
    3209                      .dwattr $C$DW$T$54, DW_AT_address_class(0x20)
    3210              
    3211              $C$DW$T$55      .dwtag  DW_TAG_typedef
    3212                      .dwattr $C$DW$T$55, DW_AT_name("GPIO_Handle")
    3213                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    3214                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    3215              
    3216              $C$DW$431       .dwtag  DW_TAG_TI_far_type
    3217                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$55)
    3218              
    3219              $C$DW$T$56      .dwtag  DW_TAG_const_type
    3220                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$431)
    3221              
    3222              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3223                      .dwattr $C$DW$T$2, DW_AT_name("void")
    3224              
    3225              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3226                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3227                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3228              
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:32 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{44235224-4361-4E86-969A-E96B7C1820D8} PAGE   60

    3229              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3230                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3231                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3232                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3233              
    3234              $C$DW$T$5       .dwtag  DW_TAG_base_type
    3235                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3236                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3237                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3238              
    3239              $C$DW$T$6       .dwtag  DW_TAG_base_type
    3240                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3241                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3242                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3243              
    3244              $C$DW$T$7       .dwtag  DW_TAG_base_type
    3245                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3246                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3247                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    3248              
    3249              $C$DW$T$8       .dwtag  DW_TAG_base_type
    3250                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3251                      .dwattr $C$DW$T$8, DW_AT_name("short")
    3252                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    3253              
    3254              $C$DW$T$9       .dwtag  DW_TAG_base_type
    3255                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3256                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3257                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    3258              
    3259              $C$DW$T$10      .dwtag  DW_TAG_base_type
