TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:34:31 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{6DA7DAC6-2868-4E23-B53B-8B51420AAAC1} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.0.LTS *
       3              ;* Date/Time created: Wed Feb 22 11:34:31 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/GIANT/GIANT_TI_instaspin/motorware/motorware_1_01_00_18/sw/drivers/g
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.0.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\GIANT\GIANT_TI_instaspin\motorware\motorware_1_01_00_18\sw\solut
      13              ;       C:\ti\ccs1200\ccs\tools\compiler\ti-cgt-c2000_22.6.0.LTS\bin\opt2000.exe C:\\Users\\GA5354\\AppData\\

    2845              $C$DW$378       .dwtag  DW_TAG_enumerator
    2846                      .dwattr $C$DW$378, DW_AT_name("GPIO_56_Mode_SPICLKA")
    2847                      .dwattr $C$DW$378, DW_AT_const_value(0x01)
    2848              
    2849              $C$DW$379       .dwtag  DW_TAG_enumerator
    2850                      .dwattr $C$DW$379, DW_AT_name("GPIO_56_Mode_EQEP2I")
    2851                      .dwattr $C$DW$379, DW_AT_const_value(0x02)
    2852              
    2853              $C$DW$380       .dwtag  DW_TAG_enumerator
    2854                      .dwattr $C$DW$380, DW_AT_name("GPIO_56_Mode_HRCAP3")
    2855                      .dwattr $C$DW$380, DW_AT_const_value(0x03)
    2856              
    2857              $C$DW$381       .dwtag  DW_TAG_enumerator
    2858                      .dwattr $C$DW$381, DW_AT_name("GPIO_57_Mode_GeneralPurpose")
    2859                      .dwattr $C$DW$381, DW_AT_const_value(0x00)
    2860              
    2861              $C$DW$382       .dwtag  DW_TAG_enumerator
    2862                      .dwattr $C$DW$382, DW_AT_name("GPIO_57_Mode_SPISTEA_NOT")
    2863                      .dwattr $C$DW$382, DW_AT_const_value(0x01)
    2864              
    2865              $C$DW$383       .dwtag  DW_TAG_enumerator
    2866                      .dwattr $C$DW$383, DW_AT_name("GPIO_57_Mode_EQEP2S")
    2867                      .dwattr $C$DW$383, DW_AT_const_value(0x02)
    2868              
    2869              $C$DW$384       .dwtag  DW_TAG_enumerator
    2870                      .dwattr $C$DW$384, DW_AT_name("GPIO_57_Mode_HRCAP4")
    2871                      .dwattr $C$DW$384, DW_AT_const_value(0x03)
    2872              
    2873              $C$DW$385       .dwtag  DW_TAG_enumerator
    2874                      .dwattr $C$DW$385, DW_AT_name("GPIO_58_Mode_GeneralPurpose")
    2875                      .dwattr $C$DW$385, DW_AT_const_value(0x00)
    2876              
    2877              $C$DW$386       .dwtag  DW_TAG_enumerator
    2878                      .dwattr $C$DW$386, DW_AT_name("GPIO_58_Mode_MCLKRA")
    2879                      .dwattr $C$DW$386, DW_AT_const_value(0x01)
    2880              
    2881              $C$DW$387       .dwtag  DW_TAG_enumerator
    2882                      .dwattr $C$DW$387, DW_AT_name("GPIO_58_Mode_SCITXDB")
    2883                      .dwattr $C$DW$387, DW_AT_const_value(0x02)
    2884              
    2885              $C$DW$388       .dwtag  DW_TAG_enumerator
    2886                      .dwattr $C$DW$388, DW_AT_name("GPIO_58_Mode_EPWM7A")
    2887                      .dwattr $C$DW$388, DW_AT_const_value(0x03)
    2888              
    2889                      .dwendtag $C$DW$T$47
    2890              
    2891              $C$DW$T$48      .dwtag  DW_TAG_typedef
    2892                      .dwattr $C$DW$T$48, DW_AT_name("GPIO_Mode_e")
    2893                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    2894                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    2895              
    2896              $C$DW$389       .dwtag  DW_TAG_TI_far_type
    2897                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$48)
    2898              
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:34:31 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{6DA7DAC6-2868-4E23-B53B-8B51420AAAC1} PAGE   54

    2899              $C$DW$T$49      .dwtag  DW_TAG_const_type
    2900                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$389)
    2901              
    2902              
    2903              $C$DW$T$50      .dwtag  DW_TAG_enumeration_type
    2904                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    2905              $C$DW$390       .dwtag  DW_TAG_enumerator
    2906                      .dwattr $C$DW$390, DW_AT_name("GPIO_Qual_Sync")
    2907                      .dwattr $C$DW$390, DW_AT_const_value(0x00)
    2908              
    2909              $C$DW$391       .dwtag  DW_TAG_enumerator
    2910                      .dwattr $C$DW$391, DW_AT_name("GPIO_Qual_Sample_3")
    2911                      .dwattr $C$DW$391, DW_AT_const_value(0x01)
    2912              
    2913              $C$DW$392       .dwtag  DW_TAG_enumerator
    2914                      .dwattr $C$DW$392, DW_AT_name("GPIO_Qual_Sample_6")
    2915                      .dwattr $C$DW$392, DW_AT_const_value(0x02)
    2916              
    2917              $C$DW$393       .dwtag  DW_TAG_enumerator
    2918                      .dwattr $C$DW$393, DW_AT_name("GPIO_Qual_ASync")
    2919                      .dwattr $C$DW$393, DW_AT_const_value(0x03)
    2920              
    2921                      .dwendtag $C$DW$T$50
    2922              
    2923              $C$DW$T$51      .dwtag  DW_TAG_typedef
    2924                      .dwattr $C$DW$T$51, DW_AT_name("GPIO_Qual_e")
    2925                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    2926                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    2927              
    2928              $C$DW$394       .dwtag  DW_TAG_TI_far_type
    2929                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$51)
    2930              
    2931              $C$DW$T$52      .dwtag  DW_TAG_const_type
    2932                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$394)
    2933              
    2934              
    2935              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2936                      .dwattr $C$DW$T$31, DW_AT_name("_GPIO_Obj_")
    2937                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6a)
    2938              $C$DW$395       .dwtag  DW_TAG_member
    2939                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$21)
    2940                      .dwattr $C$DW$395, DW_AT_name("GPACTRL")
    2941                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_GPACTRL")
    2942                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2943                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    2944              
    2945              $C$DW$396       .dwtag  DW_TAG_member
    2946                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$21)
    2947                      .dwattr $C$DW$396, DW_AT_name("GPAQSEL1")
    2948                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_GPAQSEL1")
    2949                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2950                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    2951              
    2952              $C$DW$397       .dwtag  DW_TAG_member
    2953                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:34:31 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{6DA7DAC6-2868-4E23-B53B-8B51420AAAC1} PAGE   55

    2954                      .dwattr $C$DW$397, DW_AT_name("GPAQSEL2")
    2955                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_GPAQSEL2")
    2956                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2957                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    2958              
    2959              $C$DW$398       .dwtag  DW_TAG_member
    2960                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$21)
    2961                      .dwattr $C$DW$398, DW_AT_name("GPAMUX1")
    2962                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_GPAMUX1")
    2963                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2964                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    2965              
    2966              $C$DW$399       .dwtag  DW_TAG_member
    2967                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$21)
    2968                      .dwattr $C$DW$399, DW_AT_name("GPAMUX2")
    2969                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_GPAMUX2")
    2970                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2971                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    2972              
    2973              $C$DW$400       .dwtag  DW_TAG_member
    2974                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$21)
    2975                      .dwattr $C$DW$400, DW_AT_name("GPADIR")
    2976                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_GPADIR")
    2977                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2978                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    2979              
    2980              $C$DW$401       .dwtag  DW_TAG_member
    2981                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$21)
    2982                      .dwattr $C$DW$401, DW_AT_name("GPAPUD")
    2983                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_GPAPUD")
    2984                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2985                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    2986              
    2987              $C$DW$402       .dwtag  DW_TAG_member
    2988                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$25)
    2989                      .dwattr $C$DW$402, DW_AT_name("rsvd_1")
    2990                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_rsvd_1")
    2991                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2992                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    2993              
    2994              $C$DW$403       .dwtag  DW_TAG_member
    2995                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$21)
    2996                      .dwattr $C$DW$403, DW_AT_name("GPBCTRL")
    2997                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_GPBCTRL")
    2998                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2999                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3000              
    3001              $C$DW$404       .dwtag  DW_TAG_member
    3002                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$21)
    3003                      .dwattr $C$DW$404, DW_AT_name("GPBQSEL1")
    3004                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_GPBQSEL1")
    3005                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3006                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3007              
    3008              $C$DW$405       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:34:31 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{6DA7DAC6-2868-4E23-B53B-8B51420AAAC1} PAGE   56

    3009                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$21)
    3010                      .dwattr $C$DW$405, DW_AT_name("GPBQSEL2")
    3011                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_GPBQSEL2")
    3012                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3013                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3014              
    3015              $C$DW$406       .dwtag  DW_TAG_member
    3016                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$21)
    3017                      .dwattr $C$DW$406, DW_AT_name("GPBMUX1")
    3018                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_GPBMUX1")
    3019                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3020                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3021              
    3022              $C$DW$407       .dwtag  DW_TAG_member
    3023                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$21)
    3024                      .dwattr $C$DW$407, DW_AT_name("GPBMUX2")
    3025                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_GPBMUX2")
    3026                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3027                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    3028              
    3029              $C$DW$408       .dwtag  DW_TAG_member
    3030                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$21)
    3031                      .dwattr $C$DW$408, DW_AT_name("GPBDIR")
    3032                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_GPBDIR")
    3033                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3034                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3035              
    3036              $C$DW$409       .dwtag  DW_TAG_member
    3037                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$21)
    3038                      .dwattr $C$DW$409, DW_AT_name("GPBPUD")
    3039                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_GPBPUD")
    3040                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3041                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3042              
    3043              $C$DW$410       .dwtag  DW_TAG_member
    3044                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$26)
    3045                      .dwattr $C$DW$410, DW_AT_name("rsvd_4")
    3046                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_rsvd_4")
    3047                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3048                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3049              
    3050              $C$DW$411       .dwtag  DW_TAG_member
    3051                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$21)
    3052                      .dwattr $C$DW$411, DW_AT_name("AIOMUX1")
    3053                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_AIOMUX1")
    3054                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    3055                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3056              
    3057              $C$DW$412       .dwtag  DW_TAG_member
    3058                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$25)
    3059                      .dwattr $C$DW$412, DW_AT_name("rsvd_5")
    3060                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_rsvd_5")
    3061                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3062                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3063              
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:34:31 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{6DA7DAC6-2868-4E23-B53B-8B51420AAAC1} PAGE   57

    3064              $C$DW$413       .dwtag  DW_TAG_member
    3065                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$21)
    3066                      .dwattr $C$DW$413, DW_AT_name("AIODIR")
    3067                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_AIODIR")
    3068                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    3069                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3070              
    3071              $C$DW$414       .dwtag  DW_TAG_member
    3072                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$27)
    3073                      .dwattr $C$DW$414, DW_AT_name("rsvd_6")
    3074                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_rsvd_6")
    3075                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3076                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3077              
    3078              $C$DW$415       .dwtag  DW_TAG_member
    3079                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$21)
    3080                      .dwattr $C$DW$415, DW_AT_name("GPADAT")
    3081                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_GPADAT")
    3082                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3083                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3084              
    3085              $C$DW$416       .dwtag  DW_TAG_member
    3086                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$21)
    3087                      .dwattr $C$DW$416, DW_AT_name("GPASET")
    3088                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_GPASET")
    3089                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    3090                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3091              
    3092              $C$DW$417       .dwtag  DW_TAG_member
    3093                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$21)
    3094                      .dwattr $C$DW$417, DW_AT_name("GPACLEAR")
    3095                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_GPACLEAR")
    3096                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3097                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3098              
    3099              $C$DW$418       .dwtag  DW_TAG_member
    3100                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$21)
    3101                      .dwattr $C$DW$418, DW_AT_name("GPATOGGLE")
    3102                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_GPATOGGLE")
    3103                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3104                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3105              
    3106              $C$DW$419       .dwtag  DW_TAG_member
    3107                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$21)
    3108                      .dwattr $C$DW$419, DW_AT_name("GPBDAT")
    3109                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_GPBDAT")
    3110                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    3111                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3112              
    3113              $C$DW$420       .dwtag  DW_TAG_member
    3114                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$21)
    3115                      .dwattr $C$DW$420, DW_AT_name("GPBSET")
    3116                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_GPBSET")
    3117                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    3118                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:34:31 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{6DA7DAC6-2868-4E23-B53B-8B51420AAAC1} PAGE   58

    3119              
    3120              $C$DW$421       .dwtag  DW_TAG_member
    3121                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$21)
    3122                      .dwattr $C$DW$421, DW_AT_name("GPBCLEAR")
    3123                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_GPBCLEAR")
    3124                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    3125                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3126              
    3127              $C$DW$422       .dwtag  DW_TAG_member
    3128                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$21)
    3129                      .dwattr $C$DW$422, DW_AT_name("GPBTOGGLE")
    3130                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_GPBTOGGLE")
    3131                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    3132                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3133              
    3134              $C$DW$423       .dwtag  DW_TAG_member
    3135                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$28)
    3136                      .dwattr $C$DW$423, DW_AT_name("rsvd_7")
    3137                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_rsvd_7")
    3138                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    3139                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3140              
    3141              $C$DW$424       .dwtag  DW_TAG_member
    3142                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$21)
    3143                      .dwattr $C$DW$424, DW_AT_name("AIODAT")
    3144                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_AIODAT")
    3145                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3146                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3147              
    3148              $C$DW$425       .dwtag  DW_TAG_member
    3149                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$21)
    3150                      .dwattr $C$DW$425, DW_AT_name("AIOSET")
    3151                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_AIOSET")
    3152                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    3153                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    3154              
    3155              $C$DW$426       .dwtag  DW_TAG_member
    3156                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$21)
    3157                      .dwattr $C$DW$426, DW_AT_name("AIOCLEAR")
    3158                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_AIOCLEAR")
    3159                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3160                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    3161              
    3162              $C$DW$427       .dwtag  DW_TAG_member
    3163                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$21)
    3164                      .dwattr $C$DW$427, DW_AT_name("AIOTOGGLE")
    3165                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_AIOTOGGLE")
    3166                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3167                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    3168              
    3169              $C$DW$428       .dwtag  DW_TAG_member
    3170                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$29)
    3171                      .dwattr $C$DW$428, DW_AT_name("GPIOXINTnSEL")
    3172                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    3173                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:34:31 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{6DA7DAC6-2868-4E23-B53B-8B51420AAAC1} PAGE   59

    3174                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    3175              
    3176              $C$DW$429       .dwtag  DW_TAG_member
    3177                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$30)
    3178                      .dwattr $C$DW$429, DW_AT_name("rsvd_8")
    3179                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_rsvd_8")
    3180                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    3181                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    3182              
    3183              $C$DW$430       .dwtag  DW_TAG_member
    3184                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$21)
    3185                      .dwattr $C$DW$430, DW_AT_name("GPIOLPMSEL")
    3186                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    3187                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    3188                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    3189              
    3190                      .dwendtag $C$DW$T$31
    3191              
    3192              $C$DW$T$53      .dwtag  DW_TAG_typedef
    3193                      .dwattr $C$DW$T$53, DW_AT_name("GPIO_Obj")
    3194                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$31)
    3195                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    3196              
    3197              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    3198                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$31)
    3199                      .dwattr $C$DW$T$54, DW_AT_address_class(0x20)
    3200              
    3201              $C$DW$T$55      .dwtag  DW_TAG_typedef
    3202                      .dwattr $C$DW$T$55, DW_AT_name("GPIO_Handle")
    3203                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    3204                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    3205              
    3206              $C$DW$431       .dwtag  DW_TAG_TI_far_type
    3207                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$55)
    3208              
    3209              $C$DW$T$56      .dwtag  DW_TAG_const_type
    3210                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$431)
    3211              
    3212              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3213                      .dwattr $C$DW$T$2, DW_AT_name("void")
    3214              
    3215              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3216                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3217                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3218              
    3219              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3220                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3221                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3222                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3223              
    3224              $C$DW$T$5       .dwtag  DW_TAG_base_type
    3225                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3226                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3227                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3228              
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:34:31 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{6DA7DAC6-2868-4E23-B53B-8B51420AAAC1} PAGE   60

    3229              $C$DW$T$6       .dwtag  DW_TAG_base_type
    3230                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3231                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3232                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3233              
    3234              $C$DW$T$7       .dwtag  DW_TAG_base_type
    3235                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3236                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3237                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    3238              
    3239              $C$DW$T$8       .dwtag  DW_TAG_base_type
    3240                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3241                      .dwattr $C$DW$T$8, DW_AT_name("short")
    3242                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    3243              
    3244              $C$DW$T$9       .dwtag  DW_TAG_base_type
    3245                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3246                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3247                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    3248              
    3249              $C$DW$T$10      .dwtag  DW_TAG_base_type
