TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:27:52 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{BD983F0B-D345-44B2-A024-E48789788D11} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.0.LTS *
       3              ;* Date/Time created: Fri Apr 14 02:27:51 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/GIANT/GIANT_TI_instaspin/TI_instaspin_indoor_smart_trainer/motorware
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.0.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\GIANT\GIANT_TI_instaspin\TI_instaspin_indoor_smart_trainer\motor
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("OFFSET_setBeta")

   15995                      .dwattr $C$DW$2168, DW_AT_name("SCI_NumStopBits_Two")
   15996                      .dwattr $C$DW$2168, DW_AT_const_value(0x80)
   15997              
   15998                      .dwendtag $C$DW$T$346
   15999              
   16000              $C$DW$T$347     .dwtag  DW_TAG_typedef
   16001                      .dwattr $C$DW$T$347, DW_AT_name("SCI_NumStopBits_e")
   16002                      .dwattr $C$DW$T$347, DW_AT_type(*$C$DW$T$346)
   16003                      .dwattr $C$DW$T$347, DW_AT_language(DW_LANG_C)
   16004              
   16005              $C$DW$2169      .dwtag  DW_TAG_TI_far_type
   16006                      .dwattr $C$DW$2169, DW_AT_type(*$C$DW$T$347)
   16007              
   16008              $C$DW$T$348     .dwtag  DW_TAG_const_type
   16009                      .dwattr $C$DW$T$348, DW_AT_type(*$C$DW$2169)
   16010              
   16011              
   16012              $C$DW$T$349     .dwtag  DW_TAG_enumeration_type
   16013                      .dwattr $C$DW$T$349, DW_AT_byte_size(0x01)
   16014              $C$DW$2170      .dwtag  DW_TAG_enumerator
   16015                      .dwattr $C$DW$2170, DW_AT_name("SCI_Priority_Immediate")
   16016                      .dwattr $C$DW$2170, DW_AT_const_value(0x00)
   16017              
   16018              $C$DW$2171      .dwtag  DW_TAG_enumerator
   16019                      .dwattr $C$DW$2171, DW_AT_name("SCI_Priority_FreeRun")
   16020                      .dwattr $C$DW$2171, DW_AT_const_value(0x08)
   16021              
   16022              $C$DW$2172      .dwtag  DW_TAG_enumerator
   16023                      .dwattr $C$DW$2172, DW_AT_name("SCI_Priority_AfterRxRxSeq")
   16024                      .dwattr $C$DW$2172, DW_AT_const_value(0x10)
   16025              
   16026                      .dwendtag $C$DW$T$349
   16027              
   16028              $C$DW$T$350     .dwtag  DW_TAG_typedef
   16029                      .dwattr $C$DW$T$350, DW_AT_name("SCI_Priority_e")
   16030                      .dwattr $C$DW$T$350, DW_AT_type(*$C$DW$T$349)
   16031                      .dwattr $C$DW$T$350, DW_AT_language(DW_LANG_C)
   16032              
   16033              $C$DW$2173      .dwtag  DW_TAG_TI_far_type
   16034                      .dwattr $C$DW$2173, DW_AT_type(*$C$DW$T$350)
   16035              
   16036              $C$DW$T$351     .dwtag  DW_TAG_const_type
   16037                      .dwattr $C$DW$T$351, DW_AT_type(*$C$DW$2173)
   16038              
   16039              
   16040              $C$DW$T$352     .dwtag  DW_TAG_enumeration_type
   16041                      .dwattr $C$DW$T$352, DW_AT_byte_size(0x01)
   16042              $C$DW$2174      .dwtag  DW_TAG_enumerator
   16043                      .dwattr $C$DW$2174, DW_AT_name("TIMER_EmulationMode_StopAfterNextDecrement")
   16044                      .dwattr $C$DW$2174, DW_AT_const_value(0x00)
   16045              
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:27:52 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{BD983F0B-D345-44B2-A024-E48789788D11} PAGE  304

   16046              $C$DW$2175      .dwtag  DW_TAG_enumerator
   16047                      .dwattr $C$DW$2175, DW_AT_name("TIMER_EmulationMode_StopAtZero")
   16048                      .dwattr $C$DW$2175, DW_AT_const_value(0x400)
   16049              
   16050              $C$DW$2176      .dwtag  DW_TAG_enumerator
   16051                      .dwattr $C$DW$2176, DW_AT_name("TIMER_EmulationMode_RunFree")
   16052                      .dwattr $C$DW$2176, DW_AT_const_value(0x800)
   16053              
   16054                      .dwendtag $C$DW$T$352
   16055              
   16056              $C$DW$T$353     .dwtag  DW_TAG_typedef
   16057                      .dwattr $C$DW$T$353, DW_AT_name("TIMER_EmulationMode_e")
   16058                      .dwattr $C$DW$T$353, DW_AT_type(*$C$DW$T$352)
   16059                      .dwattr $C$DW$T$353, DW_AT_language(DW_LANG_C)
   16060              
   16061              $C$DW$2177      .dwtag  DW_TAG_TI_far_type
   16062                      .dwattr $C$DW$2177, DW_AT_type(*$C$DW$T$353)
   16063              
   16064              $C$DW$T$354     .dwtag  DW_TAG_const_type
   16065                      .dwattr $C$DW$T$354, DW_AT_type(*$C$DW$2177)
   16066              
   16067              
   16068              $C$DW$T$355     .dwtag  DW_TAG_enumeration_type
   16069                      .dwattr $C$DW$T$355, DW_AT_byte_size(0x01)
   16070              $C$DW$2178      .dwtag  DW_TAG_enumerator
   16071                      .dwattr $C$DW$2178, DW_AT_name("HAL_SensorType_Current")
   16072                      .dwattr $C$DW$2178, DW_AT_const_value(0x00)
   16073              
   16074              $C$DW$2179      .dwtag  DW_TAG_enumerator
   16075                      .dwattr $C$DW$2179, DW_AT_name("HAL_SensorType_Voltage")
   16076                      .dwattr $C$DW$2179, DW_AT_const_value(0x01)
   16077              
   16078                      .dwendtag $C$DW$T$355
   16079              
   16080              $C$DW$T$356     .dwtag  DW_TAG_typedef
   16081                      .dwattr $C$DW$T$356, DW_AT_name("HAL_SensorType_e")
   16082                      .dwattr $C$DW$T$356, DW_AT_type(*$C$DW$T$355)
   16083                      .dwattr $C$DW$T$356, DW_AT_language(DW_LANG_C)
   16084              
   16085              
   16086              $C$DW$T$30      .dwtag  DW_TAG_structure_type
   16087                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
   16088                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
   16089              $C$DW$2180      .dwtag  DW_TAG_member
   16090                      .dwattr $C$DW$2180, DW_AT_type(*$C$DW$T$24)
   16091                      .dwattr $C$DW$2180, DW_AT_name("ADCRESULT")
   16092                      .dwattr $C$DW$2180, DW_AT_TI_symbol_name("_ADCRESULT")
   16093                      .dwattr $C$DW$2180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16094                      .dwattr $C$DW$2180, DW_AT_accessibility(DW_ACCESS_public)
   16095              
   16096              $C$DW$2181      .dwtag  DW_TAG_member
   16097                      .dwattr $C$DW$2181, DW_AT_type(*$C$DW$T$25)
   16098                      .dwattr $C$DW$2181, DW_AT_name("resvd_1")
   16099                      .dwattr $C$DW$2181, DW_AT_TI_symbol_name("_resvd_1")
   16100                      .dwattr $C$DW$2181, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:27:52 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{BD983F0B-D345-44B2-A024-E48789788D11} PAGE  305

   16101                      .dwattr $C$DW$2181, DW_AT_accessibility(DW_ACCESS_public)
   16102              
   16103              $C$DW$2182      .dwtag  DW_TAG_member
   16104                      .dwattr $C$DW$2182, DW_AT_type(*$C$DW$T$23)
   16105                      .dwattr $C$DW$2182, DW_AT_name("ADCCTL1")
   16106                      .dwattr $C$DW$2182, DW_AT_TI_symbol_name("_ADCCTL1")
   16107                      .dwattr $C$DW$2182, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
   16108                      .dwattr $C$DW$2182, DW_AT_accessibility(DW_ACCESS_public)
   16109              
   16110              $C$DW$2183      .dwtag  DW_TAG_member
   16111                      .dwattr $C$DW$2183, DW_AT_type(*$C$DW$T$23)
   16112                      .dwattr $C$DW$2183, DW_AT_name("ADCCTL2")
   16113                      .dwattr $C$DW$2183, DW_AT_TI_symbol_name("_ADCCTL2")
   16114                      .dwattr $C$DW$2183, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
   16115                      .dwattr $C$DW$2183, DW_AT_accessibility(DW_ACCESS_public)
   16116              
   16117              $C$DW$2184      .dwtag  DW_TAG_member
   16118                      .dwattr $C$DW$2184, DW_AT_type(*$C$DW$T$26)
   16119                      .dwattr $C$DW$2184, DW_AT_name("rsvd_2")
   16120                      .dwattr $C$DW$2184, DW_AT_TI_symbol_name("_rsvd_2")
   16121                      .dwattr $C$DW$2184, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
   16122                      .dwattr $C$DW$2184, DW_AT_accessibility(DW_ACCESS_public)
   16123              
   16124              $C$DW$2185      .dwtag  DW_TAG_member
   16125                      .dwattr $C$DW$2185, DW_AT_type(*$C$DW$T$23)
   16126                      .dwattr $C$DW$2185, DW_AT_name("ADCINTFLG")
   16127                      .dwattr $C$DW$2185, DW_AT_TI_symbol_name("_ADCINTFLG")
   16128                      .dwattr $C$DW$2185, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
   16129                      .dwattr $C$DW$2185, DW_AT_accessibility(DW_ACCESS_public)
   16130              
   16131              $C$DW$2186      .dwtag  DW_TAG_member
   16132                      .dwattr $C$DW$2186, DW_AT_type(*$C$DW$T$23)
   16133                      .dwattr $C$DW$2186, DW_AT_name("ADCINTFLGCLR")
   16134                      .dwattr $C$DW$2186, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
   16135                      .dwattr $C$DW$2186, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
   16136                      .dwattr $C$DW$2186, DW_AT_accessibility(DW_ACCESS_public)
   16137              
   16138              $C$DW$2187      .dwtag  DW_TAG_member
   16139                      .dwattr $C$DW$2187, DW_AT_type(*$C$DW$T$23)
   16140                      .dwattr $C$DW$2187, DW_AT_name("ADCINTOVF")
   16141                      .dwattr $C$DW$2187, DW_AT_TI_symbol_name("_ADCINTOVF")
   16142                      .dwattr $C$DW$2187, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
   16143                      .dwattr $C$DW$2187, DW_AT_accessibility(DW_ACCESS_public)
   16144              
   16145              $C$DW$2188      .dwtag  DW_TAG_member
   16146                      .dwattr $C$DW$2188, DW_AT_type(*$C$DW$T$23)
   16147                      .dwattr $C$DW$2188, DW_AT_name("ADCINTOVFCLR")
   16148                      .dwattr $C$DW$2188, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
   16149                      .dwattr $C$DW$2188, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
   16150                      .dwattr $C$DW$2188, DW_AT_accessibility(DW_ACCESS_public)
   16151              
   16152              $C$DW$2189      .dwtag  DW_TAG_member
   16153                      .dwattr $C$DW$2189, DW_AT_type(*$C$DW$T$27)
   16154                      .dwattr $C$DW$2189, DW_AT_name("INTSELxNy")
   16155                      .dwattr $C$DW$2189, DW_AT_TI_symbol_name("_INTSELxNy")
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:27:52 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{BD983F0B-D345-44B2-A024-E48789788D11} PAGE  306

   16156                      .dwattr $C$DW$2189, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
   16157                      .dwattr $C$DW$2189, DW_AT_accessibility(DW_ACCESS_public)
   16158              
   16159              $C$DW$2190      .dwtag  DW_TAG_member
   16160                      .dwattr $C$DW$2190, DW_AT_type(*$C$DW$T$28)
   16161                      .dwattr $C$DW$2190, DW_AT_name("rsvd_3")
   16162                      .dwattr $C$DW$2190, DW_AT_TI_symbol_name("_rsvd_3")
   16163                      .dwattr $C$DW$2190, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
   16164                      .dwattr $C$DW$2190, DW_AT_accessibility(DW_ACCESS_public)
   16165              
   16166              $C$DW$2191      .dwtag  DW_TAG_member
   16167                      .dwattr $C$DW$2191, DW_AT_type(*$C$DW$T$23)
   16168                      .dwattr $C$DW$2191, DW_AT_name("SOCPRICTRL")
   16169                      .dwattr $C$DW$2191, DW_AT_TI_symbol_name("_SOCPRICTRL")
   16170                      .dwattr $C$DW$2191, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
   16171                      .dwattr $C$DW$2191, DW_AT_accessibility(DW_ACCESS_public)
   16172              
   16173              $C$DW$2192      .dwtag  DW_TAG_member
   16174                      .dwattr $C$DW$2192, DW_AT_type(*$C$DW$T$23)
   16175                      .dwattr $C$DW$2192, DW_AT_name("rsvd_4")
   16176                      .dwattr $C$DW$2192, DW_AT_TI_symbol_name("_rsvd_4")
   16177                      .dwattr $C$DW$2192, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
   16178                      .dwattr $C$DW$2192, DW_AT_accessibility(DW_ACCESS_public)
   16179              
   16180              $C$DW$2193      .dwtag  DW_TAG_member
   16181                      .dwattr $C$DW$2193, DW_AT_type(*$C$DW$T$23)
   16182                      .dwattr $C$DW$2193, DW_AT_name("ADCSAMPLEMODE")
   16183                      .dwattr $C$DW$2193, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
   16184                      .dwattr $C$DW$2193, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
   16185                      .dwattr $C$DW$2193, DW_AT_accessibility(DW_ACCESS_public)
   16186              
   16187              $C$DW$2194      .dwtag  DW_TAG_member
   16188                      .dwattr $C$DW$2194, DW_AT_type(*$C$DW$T$23)
   16189                      .dwattr $C$DW$2194, DW_AT_name("rsvd_5")
   16190                      .dwattr $C$DW$2194, DW_AT_TI_symbol_name("_rsvd_5")
   16191                      .dwattr $C$DW$2194, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
   16192                      .dwattr $C$DW$2194, DW_AT_accessibility(DW_ACCESS_public)
   16193              
   16194              $C$DW$2195      .dwtag  DW_TAG_member
   16195                      .dwattr $C$DW$2195, DW_AT_type(*$C$DW$T$23)
   16196                      .dwattr $C$DW$2195, DW_AT_name("ADCINTSOCSEL1")
   16197                      .dwattr $C$DW$2195, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
   16198                      .dwattr $C$DW$2195, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
   16199                      .dwattr $C$DW$2195, DW_AT_accessibility(DW_ACCESS_public)
   16200              
   16201              $C$DW$2196      .dwtag  DW_TAG_member
   16202                      .dwattr $C$DW$2196, DW_AT_type(*$C$DW$T$23)
   16203                      .dwattr $C$DW$2196, DW_AT_name("ADCINTSOCSEL2")
   16204                      .dwattr $C$DW$2196, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
   16205                      .dwattr $C$DW$2196, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
   16206                      .dwattr $C$DW$2196, DW_AT_accessibility(DW_ACCESS_public)
   16207              
   16208              $C$DW$2197      .dwtag  DW_TAG_member
   16209                      .dwattr $C$DW$2197, DW_AT_type(*$C$DW$T$26)
   16210                      .dwattr $C$DW$2197, DW_AT_name("rsvd_6")
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:27:52 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{BD983F0B-D345-44B2-A024-E48789788D11} PAGE  307

   16211                      .dwattr $C$DW$2197, DW_AT_TI_symbol_name("_rsvd_6")
   16212                      .dwattr $C$DW$2197, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
   16213                      .dwattr $C$DW$2197, DW_AT_accessibility(DW_ACCESS_public)
   16214              
   16215              $C$DW$2198      .dwtag  DW_TAG_member
   16216                      .dwattr $C$DW$2198, DW_AT_type(*$C$DW$T$23)
   16217                      .dwattr $C$DW$2198, DW_AT_name("ADCSOCFLG1")
   16218                      .dwattr $C$DW$2198, DW_AT_TI_symbol_name("_ADCSOCFLG1")
   16219                      .dwattr $C$DW$2198, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
   16220                      .dwattr $C$DW$2198, DW_AT_accessibility(DW_ACCESS_public)
   16221              
   16222              $C$DW$2199      .dwtag  DW_TAG_member
   16223                      .dwattr $C$DW$2199, DW_AT_type(*$C$DW$T$23)
   16224                      .dwattr $C$DW$2199, DW_AT_name("rsvd_7")
   16225                      .dwattr $C$DW$2199, DW_AT_TI_symbol_name("_rsvd_7")
   16226                      .dwattr $C$DW$2199, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   16227                      .dwattr $C$DW$2199, DW_AT_accessibility(DW_ACCESS_public)
   16228              
   16229              $C$DW$2200      .dwtag  DW_TAG_member
   16230                      .dwattr $C$DW$2200, DW_AT_type(*$C$DW$T$23)
   16231                      .dwattr $C$DW$2200, DW_AT_name("ADCSOCFRC1")
   16232                      .dwattr $C$DW$2200, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   16233                      .dwattr $C$DW$2200, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   16234                      .dwattr $C$DW$2200, DW_AT_accessibility(DW_ACCESS_public)
   16235              
   16236              $C$DW$2201      .dwtag  DW_TAG_member
   16237                      .dwattr $C$DW$2201, DW_AT_type(*$C$DW$T$23)
   16238                      .dwattr $C$DW$2201, DW_AT_name("rsvd_8")
   16239                      .dwattr $C$DW$2201, DW_AT_TI_symbol_name("_rsvd_8")
   16240                      .dwattr $C$DW$2201, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   16241                      .dwattr $C$DW$2201, DW_AT_accessibility(DW_ACCESS_public)
   16242              
   16243              $C$DW$2202      .dwtag  DW_TAG_member
   16244                      .dwattr $C$DW$2202, DW_AT_type(*$C$DW$T$23)
   16245                      .dwattr $C$DW$2202, DW_AT_name("ADCSOCOVF1")
   16246                      .dwattr $C$DW$2202, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   16247                      .dwattr $C$DW$2202, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   16248                      .dwattr $C$DW$2202, DW_AT_accessibility(DW_ACCESS_public)
   16249              
   16250              $C$DW$2203      .dwtag  DW_TAG_member
   16251                      .dwattr $C$DW$2203, DW_AT_type(*$C$DW$T$23)
   16252                      .dwattr $C$DW$2203, DW_AT_name("rsvd_9")
   16253                      .dwattr $C$DW$2203, DW_AT_TI_symbol_name("_rsvd_9")
   16254                      .dwattr $C$DW$2203, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
   16255                      .dwattr $C$DW$2203, DW_AT_accessibility(DW_ACCESS_public)
   16256              
   16257              $C$DW$2204      .dwtag  DW_TAG_member
   16258                      .dwattr $C$DW$2204, DW_AT_type(*$C$DW$T$23)
   16259                      .dwattr $C$DW$2204, DW_AT_name("ADCSOCOVFCLR1")
   16260                      .dwattr $C$DW$2204, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
   16261                      .dwattr $C$DW$2204, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
   16262                      .dwattr $C$DW$2204, DW_AT_accessibility(DW_ACCESS_public)
   16263              
   16264              $C$DW$2205      .dwtag  DW_TAG_member
   16265                      .dwattr $C$DW$2205, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:27:52 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{BD983F0B-D345-44B2-A024-E48789788D11} PAGE  308

   16266                      .dwattr $C$DW$2205, DW_AT_name("rsvd_10")
   16267                      .dwattr $C$DW$2205, DW_AT_TI_symbol_name("_rsvd_10")
   16268                      .dwattr $C$DW$2205, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   16269                      .dwattr $C$DW$2205, DW_AT_accessibility(DW_ACCESS_public)
   16270              
   16271              $C$DW$2206      .dwtag  DW_TAG_member
   16272                      .dwattr $C$DW$2206, DW_AT_type(*$C$DW$T$24)
   16273                      .dwattr $C$DW$2206, DW_AT_name("ADCSOCxCTL")
   16274                      .dwattr $C$DW$2206, DW_AT_TI_symbol_name("_ADCSOCxCTL")
   16275                      .dwattr $C$DW$2206, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   16276                      .dwattr $C$DW$2206, DW_AT_accessibility(DW_ACCESS_public)
   16277              
   16278              $C$DW$2207      .dwtag  DW_TAG_member
   16279                      .dwattr $C$DW$2207, DW_AT_type(*$C$DW$T$24)
   16280                      .dwattr $C$DW$2207, DW_AT_name("rsvd_11")
   16281                      .dwattr $C$DW$2207, DW_AT_TI_symbol_name("_rsvd_11")
   16282                      .dwattr $C$DW$2207, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   16283                      .dwattr $C$DW$2207, DW_AT_accessibility(DW_ACCESS_public)
   16284              
   16285              $C$DW$2208      .dwtag  DW_TAG_member
   16286                      .dwattr $C$DW$2208, DW_AT_type(*$C$DW$T$23)
   16287                      .dwattr $C$DW$2208, DW_AT_name("ADCREFTRIM")
   16288                      .dwattr $C$DW$2208, DW_AT_TI_symbol_name("_ADCREFTRIM")
   16289                      .dwattr $C$DW$2208, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   16290                      .dwattr $C$DW$2208, DW_AT_accessibility(DW_ACCESS_public)
   16291              
   16292              $C$DW$2209      .dwtag  DW_TAG_member
   16293                      .dwattr $C$DW$2209, DW_AT_type(*$C$DW$T$23)
   16294                      .dwattr $C$DW$2209, DW_AT_name("ADCOFFTRIM")
   16295                      .dwattr $C$DW$2209, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   16296                      .dwattr $C$DW$2209, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   16297                      .dwattr $C$DW$2209, DW_AT_accessibility(DW_ACCESS_public)
   16298              
   16299              $C$DW$2210      .dwtag  DW_TAG_member
   16300                      .dwattr $C$DW$2210, DW_AT_type(*$C$DW$T$29)
   16301                      .dwattr $C$DW$2210, DW_AT_name("resvd_12")
   16302                      .dwattr $C$DW$2210, DW_AT_TI_symbol_name("_resvd_12")
   16303                      .dwattr $C$DW$2210, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   16304                      .dwattr $C$DW$2210, DW_AT_accessibility(DW_ACCESS_public)
   16305              
   16306              $C$DW$2211      .dwtag  DW_TAG_member
   16307                      .dwattr $C$DW$2211, DW_AT_type(*$C$DW$T$23)
   16308                      .dwattr $C$DW$2211, DW_AT_name("ADCREV")
   16309                      .dwattr $C$DW$2211, DW_AT_TI_symbol_name("_ADCREV")
   16310                      .dwattr $C$DW$2211, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   16311                      .dwattr $C$DW$2211, DW_AT_accessibility(DW_ACCESS_public)
   16312              
   16313                      .dwendtag $C$DW$T$30
   16314              
   16315              $C$DW$T$358     .dwtag  DW_TAG_typedef
   16316                      .dwattr $C$DW$T$358, DW_AT_name("ADC_Obj")
   16317                      .dwattr $C$DW$T$358, DW_AT_type(*$C$DW$T$30)
   16318                      .dwattr $C$DW$T$358, DW_AT_language(DW_LANG_C)
   16319              
   16320              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:27:52 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{BD983F0B-D345-44B2-A024-E48789788D11} PAGE  309

   16321                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$30)
   16322                      .dwattr $C$DW$T$88, DW_AT_address_class(0x20)
   16323              
   16324              $C$DW$T$89      .dwtag  DW_TAG_typedef
   16325                      .dwattr $C$DW$T$89, DW_AT_name("ADC_Handle")
   16326                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
   16327                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
   16328              
   16329              
   16330              $C$DW$T$32      .dwtag  DW_TAG_structure_type
   16331                      .dwattr $C$DW$T$32, DW_AT_name("_CLK_Obj_")
   16332                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x11)
   16333              $C$DW$2212      .dwtag  DW_TAG_member
   16334                      .dwattr $C$DW$2212, DW_AT_type(*$C$DW$T$23)
   16335                      .dwattr $C$DW$2212, DW_AT_name("XCLK")
   16336                      .dwattr $C$DW$2212, DW_AT_TI_symbol_name("_XCLK")
   16337                      .dwattr $C$DW$2212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16338                      .dwattr $C$DW$2212, DW_AT_accessibility(DW_ACCESS_public)
   16339              
   16340              $C$DW$2213      .dwtag  DW_TAG_member
   16341                      .dwattr $C$DW$2213, DW_AT_type(*$C$DW$T$23)
   16342                      .dwattr $C$DW$2213, DW_AT_name("rsvd_1")
   16343                      .dwattr $C$DW$2213, DW_AT_TI_symbol_name("_rsvd_1")
   16344                      .dwattr $C$DW$2213, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16345                      .dwattr $C$DW$2213, DW_AT_accessibility(DW_ACCESS_public)
   16346              
   16347              $C$DW$2214      .dwtag  DW_TAG_member
   16348                      .dwattr $C$DW$2214, DW_AT_type(*$C$DW$T$23)
   16349                      .dwattr $C$DW$2214, DW_AT_name("CLKCTL")
   16350                      .dwattr $C$DW$2214, DW_AT_TI_symbol_name("_CLKCTL")
   16351                      .dwattr $C$DW$2214, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16352                      .dwattr $C$DW$2214, DW_AT_accessibility(DW_ACCESS_public)
   16353              
   16354              $C$DW$2215      .dwtag  DW_TAG_member
   16355                      .dwattr $C$DW$2215, DW_AT_type(*$C$DW$T$31)
   16356                      .dwattr $C$DW$2215, DW_AT_name("rsvd_2")
   16357                      .dwattr $C$DW$2215, DW_AT_TI_symbol_name("_rsvd_2")
   16358                      .dwattr $C$DW$2215, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   16359                      .dwattr $C$DW$2215, DW_AT_accessibility(DW_ACCESS_public)
   16360              
   16361              $C$DW$2216      .dwtag  DW_TAG_member
   16362                      .dwattr $C$DW$2216, DW_AT_type(*$C$DW$T$23)
   16363                      .dwattr $C$DW$2216, DW_AT_name("LOSPCP")
   16364                      .dwattr $C$DW$2216, DW_AT_TI_symbol_name("_LOSPCP")
   16365                      .dwattr $C$DW$2216, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   16366                      .dwattr $C$DW$2216, DW_AT_accessibility(DW_ACCESS_public)
   16367              
   16368              $C$DW$2217      .dwtag  DW_TAG_member
   16369                      .dwattr $C$DW$2217, DW_AT_type(*$C$DW$T$23)
   16370                      .dwattr $C$DW$2217, DW_AT_name("PCLKCR0")
   16371                      .dwattr $C$DW$2217, DW_AT_TI_symbol_name("_PCLKCR0")
   16372                      .dwattr $C$DW$2217, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   16373                      .dwattr $C$DW$2217, DW_AT_accessibility(DW_ACCESS_public)
   16374              
   16375              $C$DW$2218      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:27:52 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{BD983F0B-D345-44B2-A024-E48789788D11} PAGE  310

   16376                      .dwattr $C$DW$2218, DW_AT_type(*$C$DW$T$23)
   16377                      .dwattr $C$DW$2218, DW_AT_name("PCLKCR1")
   16378                      .dwattr $C$DW$2218, DW_AT_TI_symbol_name("_PCLKCR1")
   16379                      .dwattr $C$DW$2218, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   16380                      .dwattr $C$DW$2218, DW_AT_accessibility(DW_ACCESS_public)
   16381              
   16382              $C$DW$2219      .dwtag  DW_TAG_member
   16383                      .dwattr $C$DW$2219, DW_AT_type(*$C$DW$T$26)
   16384                      .dwattr $C$DW$2219, DW_AT_name("rsvd_3")
   16385                      .dwattr $C$DW$2219, DW_AT_TI_symbol_name("_rsvd_3")
   16386                      .dwattr $C$DW$2219, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   16387                      .dwattr $C$DW$2219, DW_AT_accessibility(DW_ACCESS_public)
   16388              
   16389              $C$DW$2220      .dwtag  DW_TAG_member
   16390                      .dwattr $C$DW$2220, DW_AT_type(*$C$DW$T$23)
   16391                      .dwattr $C$DW$2220, DW_AT_name("PCLKCR3")
   16392                      .dwattr $C$DW$2220, DW_AT_TI_symbol_name("_PCLKCR3")
   16393                      .dwattr $C$DW$2220, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   16394                      .dwattr $C$DW$2220, DW_AT_accessibility(DW_ACCESS_public)
   16395              
   16396                      .dwendtag $C$DW$T$32
   16397              
   16398              $C$DW$T$90      .dwtag  DW_TAG_pointer_type
   16399                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$32)
   16400                      .dwattr $C$DW$T$90, DW_AT_address_class(0x20)
   16401              
   16402              $C$DW$T$91      .dwtag  DW_TAG_typedef
   16403                      .dwattr $C$DW$T$91, DW_AT_name("CLK_Handle")
   16404                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
   16405                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
   16406              
   16407              
   16408              $C$DW$T$35      .dwtag  DW_TAG_structure_type
   16409                      .dwattr $C$DW$T$35, DW_AT_name("_CPU_Obj_")
   16410                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
   16411              $C$DW$2221      .dwtag  DW_TAG_member
   16412                      .dwattr $C$DW$2221, DW_AT_type(*$C$DW$T$34)
   16413                      .dwattr $C$DW$2221, DW_AT_name("tmp")
   16414                      .dwattr $C$DW$2221, DW_AT_TI_symbol_name("_tmp")
   16415                      .dwattr $C$DW$2221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16416                      .dwattr $C$DW$2221, DW_AT_accessibility(DW_ACCESS_public)
   16417              
   16418                      .dwendtag $C$DW$T$35
   16419              
   16420              $C$DW$T$367     .dwtag  DW_TAG_typedef
   16421                      .dwattr $C$DW$T$367, DW_AT_name("CPU_Obj")
   16422                      .dwattr $C$DW$T$367, DW_AT_type(*$C$DW$T$35)
   16423                      .dwattr $C$DW$T$367, DW_AT_language(DW_LANG_C)
   16424              
   16425              $C$DW$T$92      .dwtag  DW_TAG_pointer_type
   16426                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$35)
   16427                      .dwattr $C$DW$T$92, DW_AT_address_class(0x20)
   16428              
   16429              $C$DW$T$93      .dwtag  DW_TAG_typedef
   16430                      .dwattr $C$DW$T$93, DW_AT_name("CPU_Handle")
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:27:52 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{BD983F0B-D345-44B2-A024-E48789788D11} PAGE  311

   16431                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
   16432                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
   16433              
   16434              
   16435              $C$DW$T$43      .dwtag  DW_TAG_structure_type
   16436                      .dwattr $C$DW$T$43, DW_AT_name("_DRV8301_Obj_")
   16437                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x08)
   16438              $C$DW$2222      .dwtag  DW_TAG_member
   16439                      .dwattr $C$DW$2222, DW_AT_type(*$C$DW$T$37)
   16440                      .dwattr $C$DW$2222, DW_AT_name("spiHandle")
   16441                      .dwattr $C$DW$2222, DW_AT_TI_symbol_name("_spiHandle")
   16442                      .dwattr $C$DW$2222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16443                      .dwattr $C$DW$2222, DW_AT_accessibility(DW_ACCESS_public)
   16444              
   16445              $C$DW$2223      .dwtag  DW_TAG_member
   16446                      .dwattr $C$DW$2223, DW_AT_type(*$C$DW$T$39)
   16447                      .dwattr $C$DW$2223, DW_AT_name("gpioHandle")
   16448                      .dwattr $C$DW$2223, DW_AT_TI_symbol_name("_gpioHandle")
   16449                      .dwattr $C$DW$2223, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16450                      .dwattr $C$DW$2223, DW_AT_accessibility(DW_ACCESS_public)
   16451              
   16452              $C$DW$2224      .dwtag  DW_TAG_member
   16453                      .dwattr $C$DW$2224, DW_AT_type(*$C$DW$T$41)
   16454                      .dwattr $C$DW$2224, DW_AT_name("gpioNumber")
   16455                      .dwattr $C$DW$2224, DW_AT_TI_symbol_name("_gpioNumber")
   16456                      .dwattr $C$DW$2224, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16457                      .dwattr $C$DW$2224, DW_AT_accessibility(DW_ACCESS_public)
   16458              
   16459              $C$DW$2225      .dwtag  DW_TAG_member
   16460                      .dwattr $C$DW$2225, DW_AT_type(*$C$DW$T$42)
   16461                      .dwattr $C$DW$2225, DW_AT_name("RxTimeOut")
   16462                      .dwattr $C$DW$2225, DW_AT_TI_symbol_name("_RxTimeOut")
   16463                      .dwattr $C$DW$2225, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   16464                      .dwattr $C$DW$2225, DW_AT_accessibility(DW_ACCESS_public)
   16465              
   16466              $C$DW$2226      .dwtag  DW_TAG_member
   16467                      .dwattr $C$DW$2226, DW_AT_type(*$C$DW$T$42)
   16468                      .dwattr $C$DW$2226, DW_AT_name("enableTimeOut")
   16469                      .dwattr $C$DW$2226, DW_AT_TI_symbol_name("_enableTimeOut")
   16470                      .dwattr $C$DW$2226, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   16471                      .dwattr $C$DW$2226, DW_AT_accessibility(DW_ACCESS_public)
   16472              
   16473                      .dwendtag $C$DW$T$43
   16474              
   16475              $C$DW$T$120     .dwtag  DW_TAG_typedef
   16476                      .dwattr $C$DW$T$120, DW_AT_name("DRV8301_Obj")
   16477                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$43)
   16478                      .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
   16479              
   16480              $C$DW$T$118     .dwtag  DW_TAG_pointer_type
   16481                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$43)
   16482                      .dwattr $C$DW$T$118, DW_AT_address_class(0x20)
   16483              
   16484              $C$DW$T$119     .dwtag  DW_TAG_typedef
   16485                      .dwattr $C$DW$T$119, DW_AT_name("DRV8301_Handle")
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:27:52 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{BD983F0B-D345-44B2-A024-E48789788D11} PAGE  312

   16486                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
   16487                      .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
   16488              
   16489              
   16490              $C$DW$T$54      .dwtag  DW_TAG_structure_type
   16491                      .dwattr $C$DW$T$54, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
   16492                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x05)
   16493              $C$DW$2227      .dwtag  DW_TAG_member
   16494                      .dwattr $C$DW$2227, DW_AT_type(*$C$DW$T$45)
   16495                      .dwattr $C$DW$2227, DW_AT_name("DRV8301_CURRENT")
   16496                      .dwattr $C$DW$2227, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
   16497                      .dwattr $C$DW$2227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16498                      .dwattr $C$DW$2227, DW_AT_accessibility(DW_ACCESS_public)
   16499              
   16500              $C$DW$2228      .dwtag  DW_TAG_member
   16501                      .dwattr $C$DW$2228, DW_AT_type(*$C$DW$T$47)
   16502                      .dwattr $C$DW$2228, DW_AT_name("DRV8301_RESET")
   16503                      .dwattr $C$DW$2228, DW_AT_TI_symbol_name("_DRV8301_RESET")
   16504                      .dwattr $C$DW$2228, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16505                      .dwattr $C$DW$2228, DW_AT_accessibility(DW_ACCESS_public)
   16506              
   16507              $C$DW$2229      .dwtag  DW_TAG_member
   16508                      .dwattr $C$DW$2229, DW_AT_type(*$C$DW$T$49)
   16509                      .dwattr $C$DW$2229, DW_AT_name("PWM_MODE")
   16510                      .dwattr $C$DW$2229, DW_AT_TI_symbol_name("_PWM_MODE")
   16511                      .dwattr $C$DW$2229, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16512                      .dwattr $C$DW$2229, DW_AT_accessibility(DW_ACCESS_public)
   16513              
   16514              $C$DW$2230      .dwtag  DW_TAG_member
   16515                      .dwattr $C$DW$2230, DW_AT_type(*$C$DW$T$51)
   16516                      .dwattr $C$DW$2230, DW_AT_name("OC_MODE")
   16517                      .dwattr $C$DW$2230, DW_AT_TI_symbol_name("_OC_MODE")
   16518                      .dwattr $C$DW$2230, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   16519                      .dwattr $C$DW$2230, DW_AT_accessibility(DW_ACCESS_public)
   16520              
   16521              $C$DW$2231      .dwtag  DW_TAG_member
   16522                      .dwattr $C$DW$2231, DW_AT_type(*$C$DW$T$53)
   16523                      .dwattr $C$DW$2231, DW_AT_name("OC_ADJ_SET")
   16524                      .dwattr $C$DW$2231, DW_AT_TI_symbol_name("_OC_ADJ_SET")
   16525                      .dwattr $C$DW$2231, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16526                      .dwattr $C$DW$2231, DW_AT_accessibility(DW_ACCESS_public)
   16527              
   16528                      .dwendtag $C$DW$T$54
   16529              
   16530              $C$DW$T$68      .dwtag  DW_TAG_typedef
   16531                      .dwattr $C$DW$T$68, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
   16532                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$54)
   16533                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
   16534              
   16535              
   16536              $C$DW$T$63      .dwtag  DW_TAG_structure_type
   16537                      .dwattr $C$DW$T$63, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
   16538                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
   16539              $C$DW$2232      .dwtag  DW_TAG_member
   16540                      .dwattr $C$DW$2232, DW_AT_type(*$C$DW$T$56)
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:27:52 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{BD983F0B-D345-44B2-A024-E48789788D11} PAGE  313

   16541                      .dwattr $C$DW$2232, DW_AT_name("OCTW_SET")
   16542                      .dwattr $C$DW$2232, DW_AT_TI_symbol_name("_OCTW_SET")
   16543                      .dwattr $C$DW$2232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16544                      .dwattr $C$DW$2232, DW_AT_accessibility(DW_ACCESS_public)
   16545              
   16546              $C$DW$2233      .dwtag  DW_TAG_member
   16547                      .dwattr $C$DW$2233, DW_AT_type(*$C$DW$T$58)
   16548                      .dwattr $C$DW$2233, DW_AT_name("GAIN")
   16549                      .dwattr $C$DW$2233, DW_AT_TI_symbol_name("_GAIN")
   16550                      .dwattr $C$DW$2233, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16551                      .dwattr $C$DW$2233, DW_AT_accessibility(DW_ACCESS_public)
   16552              
   16553              $C$DW$2234      .dwtag  DW_TAG_member
   16554                      .dwattr $C$DW$2234, DW_AT_type(*$C$DW$T$60)
   16555                      .dwattr $C$DW$2234, DW_AT_name("DC_CAL_CH1p2")
   16556                      .dwattr $C$DW$2234, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
   16557                      .dwattr $C$DW$2234, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16558                      .dwattr $C$DW$2234, DW_AT_accessibility(DW_ACCESS_public)
   16559              
   16560              $C$DW$2235      .dwtag  DW_TAG_member
   16561                      .dwattr $C$DW$2235, DW_AT_type(*$C$DW$T$62)
   16562                      .dwattr $C$DW$2235, DW_AT_name("OC_TOFF")
   16563                      .dwattr $C$DW$2235, DW_AT_TI_symbol_name("_OC_TOFF")
   16564                      .dwattr $C$DW$2235, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   16565                      .dwattr $C$DW$2235, DW_AT_accessibility(DW_ACCESS_public)
   16566              
   16567                      .dwendtag $C$DW$T$63
   16568              
   16569              $C$DW$T$69      .dwtag  DW_TAG_typedef
   16570                      .dwattr $C$DW$T$69, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
   16571                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$63)
   16572                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
   16573              
   16574              
   16575              $C$DW$T$64      .dwtag  DW_TAG_structure_type
   16576                      .dwattr $C$DW$T$64, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
   16577                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x0b)
   16578              $C$DW$2236      .dwtag  DW_TAG_member
   16579                      .dwattr $C$DW$2236, DW_AT_type(*$C$DW$T$42)
   16580                      .dwattr $C$DW$2236, DW_AT_name("FAULT")
   16581                      .dwattr $C$DW$2236, DW_AT_TI_symbol_name("_FAULT")
   16582                      .dwattr $C$DW$2236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16583                      .dwattr $C$DW$2236, DW_AT_accessibility(DW_ACCESS_public)
   16584              
   16585              $C$DW$2237      .dwtag  DW_TAG_member
   16586                      .dwattr $C$DW$2237, DW_AT_type(*$C$DW$T$42)
   16587                      .dwattr $C$DW$2237, DW_AT_name("GVDD_UV")
   16588                      .dwattr $C$DW$2237, DW_AT_TI_symbol_name("_GVDD_UV")
   16589                      .dwattr $C$DW$2237, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16590                      .dwattr $C$DW$2237, DW_AT_accessibility(DW_ACCESS_public)
   16591              
   16592              $C$DW$2238      .dwtag  DW_TAG_member
   16593                      .dwattr $C$DW$2238, DW_AT_type(*$C$DW$T$42)
   16594                      .dwattr $C$DW$2238, DW_AT_name("PVDD_UV")
   16595                      .dwattr $C$DW$2238, DW_AT_TI_symbol_name("_PVDD_UV")
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:27:52 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{BD983F0B-D345-44B2-A024-E48789788D11} PAGE  314

   16596                      .dwattr $C$DW$2238, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16597                      .dwattr $C$DW$2238, DW_AT_accessibility(DW_ACCESS_public)
   16598              
   16599              $C$DW$2239      .dwtag  DW_TAG_member
   16600                      .dwattr $C$DW$2239, DW_AT_type(*$C$DW$T$42)
   16601                      .dwattr $C$DW$2239, DW_AT_name("OTSD")
   16602                      .dwattr $C$DW$2239, DW_AT_TI_symbol_name("_OTSD")
   16603                      .dwattr $C$DW$2239, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   16604                      .dwattr $C$DW$2239, DW_AT_accessibility(DW_ACCESS_public)
   16605              
   16606              $C$DW$2240      .dwtag  DW_TAG_member
   16607                      .dwattr $C$DW$2240, DW_AT_type(*$C$DW$T$42)
   16608                      .dwattr $C$DW$2240, DW_AT_name("OTW")
   16609                      .dwattr $C$DW$2240, DW_AT_TI_symbol_name("_OTW")
   16610                      .dwattr $C$DW$2240, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16611                      .dwattr $C$DW$2240, DW_AT_accessibility(DW_ACCESS_public)
   16612              
   16613              $C$DW$2241      .dwtag  DW_TAG_member
   16614                      .dwattr $C$DW$2241, DW_AT_type(*$C$DW$T$42)
   16615                      .dwattr $C$DW$2241, DW_AT_name("FETHA_OC")
   16616                      .dwattr $C$DW$2241, DW_AT_TI_symbol_name("_FETHA_OC")
   16617                      .dwattr $C$DW$2241, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   16618                      .dwattr $C$DW$2241, DW_AT_accessibility(DW_ACCESS_public)
   16619              
   16620              $C$DW$2242      .dwtag  DW_TAG_member
   16621                      .dwattr $C$DW$2242, DW_AT_type(*$C$DW$T$42)
   16622                      .dwattr $C$DW$2242, DW_AT_name("FETLA_OC")
   16623                      .dwattr $C$DW$2242, DW_AT_TI_symbol_name("_FETLA_OC")
   16624                      .dwattr $C$DW$2242, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   16625                      .dwattr $C$DW$2242, DW_AT_accessibility(DW_ACCESS_public)
   16626              
   16627              $C$DW$2243      .dwtag  DW_TAG_member
   16628                      .dwattr $C$DW$2243, DW_AT_type(*$C$DW$T$42)
   16629                      .dwattr $C$DW$2243, DW_AT_name("FETHB_OC")
   16630                      .dwattr $C$DW$2243, DW_AT_TI_symbol_name("_FETHB_OC")
   16631                      .dwattr $C$DW$2243, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   16632                      .dwattr $C$DW$2243, DW_AT_accessibility(DW_ACCESS_public)
   16633              
   16634              $C$DW$2244      .dwtag  DW_TAG_member
   16635                      .dwattr $C$DW$2244, DW_AT_type(*$C$DW$T$42)
   16636                      .dwattr $C$DW$2244, DW_AT_name("FETLB_OC")
   16637                      .dwattr $C$DW$2244, DW_AT_TI_symbol_name("_FETLB_OC")
   16638                      .dwattr $C$DW$2244, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   16639                      .dwattr $C$DW$2244, DW_AT_accessibility(DW_ACCESS_public)
   16640              
   16641              $C$DW$2245      .dwtag  DW_TAG_member
   16642                      .dwattr $C$DW$2245, DW_AT_type(*$C$DW$T$42)
   16643                      .dwattr $C$DW$2245, DW_AT_name("FETHC_OC")
   16644                      .dwattr $C$DW$2245, DW_AT_TI_symbol_name("_FETHC_OC")
   16645                      .dwattr $C$DW$2245, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   16646                      .dwattr $C$DW$2245, DW_AT_accessibility(DW_ACCESS_public)
   16647              
   16648              $C$DW$2246      .dwtag  DW_TAG_member
   16649                      .dwattr $C$DW$2246, DW_AT_type(*$C$DW$T$42)
   16650                      .dwattr $C$DW$2246, DW_AT_name("FETLC_OC")
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:27:52 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{BD983F0B-D345-44B2-A024-E48789788D11} PAGE  315

   16651                      .dwattr $C$DW$2246, DW_AT_TI_symbol_name("_FETLC_OC")
   16652                      .dwattr $C$DW$2246, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   16653                      .dwattr $C$DW$2246, DW_AT_accessibility(DW_ACCESS_public)
   16654              
   16655                      .dwendtag $C$DW$T$64
   16656              
   16657              $C$DW$T$66      .dwtag  DW_TAG_typedef
   16658                      .dwattr $C$DW$T$66, DW_AT_name("DRV_SPI_8301_Stat1_t_")
   16659                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$64)
   16660                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
   16661              
   16662              
   16663              $C$DW$T$65      .dwtag  DW_TAG_structure_type
   16664                      .dwattr $C$DW$T$65, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
   16665                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x02)
   16666              $C$DW$2247      .dwtag  DW_TAG_member
   16667                      .dwattr $C$DW$2247, DW_AT_type(*$C$DW$T$42)
   16668                      .dwattr $C$DW$2247, DW_AT_name("GVDD_OV")
   16669                      .dwattr $C$DW$2247, DW_AT_TI_symbol_name("_GVDD_OV")
   16670                      .dwattr $C$DW$2247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16671                      .dwattr $C$DW$2247, DW_AT_accessibility(DW_ACCESS_public)
   16672              
   16673              $C$DW$2248      .dwtag  DW_TAG_member
   16674                      .dwattr $C$DW$2248, DW_AT_type(*$C$DW$T$22)
   16675                      .dwattr $C$DW$2248, DW_AT_name("DeviceID")
   16676                      .dwattr $C$DW$2248, DW_AT_TI_symbol_name("_DeviceID")
   16677                      .dwattr $C$DW$2248, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16678                      .dwattr $C$DW$2248, DW_AT_accessibility(DW_ACCESS_public)
   16679              
   16680                      .dwendtag $C$DW$T$65
   16681              
   16682              $C$DW$T$67      .dwtag  DW_TAG_typedef
   16683                      .dwattr $C$DW$T$67, DW_AT_name("DRV_SPI_8301_Stat2_t_")
   16684                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$65)
   16685                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
   16686              
   16687              
   16688              $C$DW$T$70      .dwtag  DW_TAG_structure_type
   16689                      .dwattr $C$DW$T$70, DW_AT_name("_DRV_SPI_8301_Vars_t_")
   16690                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x18)
   16691              $C$DW$2249      .dwtag  DW_TAG_member
   16692                      .dwattr $C$DW$2249, DW_AT_type(*$C$DW$T$66)
   16693                      .dwattr $C$DW$2249, DW_AT_name("Stat_Reg_1")
   16694                      .dwattr $C$DW$2249, DW_AT_TI_symbol_name("_Stat_Reg_1")
   16695                      .dwattr $C$DW$2249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16696                      .dwattr $C$DW$2249, DW_AT_accessibility(DW_ACCESS_public)
   16697              
   16698              $C$DW$2250      .dwtag  DW_TAG_member
   16699                      .dwattr $C$DW$2250, DW_AT_type(*$C$DW$T$67)
   16700                      .dwattr $C$DW$2250, DW_AT_name("Stat_Reg_2")
   16701                      .dwattr $C$DW$2250, DW_AT_TI_symbol_name("_Stat_Reg_2")
   16702                      .dwattr $C$DW$2250, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   16703                      .dwattr $C$DW$2250, DW_AT_accessibility(DW_ACCESS_public)
   16704              
   16705              $C$DW$2251      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:27:52 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{BD983F0B-D345-44B2-A024-E48789788D11} PAGE  316

   16706                      .dwattr $C$DW$2251, DW_AT_type(*$C$DW$T$68)
   16707                      .dwattr $C$DW$2251, DW_AT_name("Ctrl_Reg_1")
   16708                      .dwattr $C$DW$2251, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
   16709                      .dwattr $C$DW$2251, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   16710                      .dwattr $C$DW$2251, DW_AT_accessibility(DW_ACCESS_public)
   16711              
   16712              $C$DW$2252      .dwtag  DW_TAG_member
   16713                      .dwattr $C$DW$2252, DW_AT_type(*$C$DW$T$69)
   16714                      .dwattr $C$DW$2252, DW_AT_name("Ctrl_Reg_2")
   16715                      .dwattr $C$DW$2252, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
   16716                      .dwattr $C$DW$2252, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   16717                      .dwattr $C$DW$2252, DW_AT_accessibility(DW_ACCESS_public)
   16718              
   16719              $C$DW$2253      .dwtag  DW_TAG_member
   16720                      .dwattr $C$DW$2253, DW_AT_type(*$C$DW$T$42)
   16721                      .dwattr $C$DW$2253, DW_AT_name("SndCmd")
   16722                      .dwattr $C$DW$2253, DW_AT_TI_symbol_name("_SndCmd")
   16723                      .dwattr $C$DW$2253, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   16724                      .dwattr $C$DW$2253, DW_AT_accessibility(DW_ACCESS_public)
   16725              
   16726              $C$DW$2254      .dwtag  DW_TAG_member
   16727                      .dwattr $C$DW$2254, DW_AT_type(*$C$DW$T$42)
   16728                      .dwattr $C$DW$2254, DW_AT_name("RcvCmd")
   16729                      .dwattr $C$DW$2254, DW_AT_TI_symbol_name("_RcvCmd")
   16730                      .dwattr $C$DW$2254, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
   16731                      .dwattr $C$DW$2254, DW_AT_accessibility(DW_ACCESS_public)
   16732              
   16733                      .dwendtag $C$DW$T$70
   16734              
   16735              $C$DW$T$374     .dwtag  DW_TAG_typedef
   16736                      .dwattr $C$DW$T$374, DW_AT_name("DRV_SPI_8301_Vars_t")
   16737                      .dwattr $C$DW$T$374, DW_AT_type(*$C$DW$T$70)
   16738                      .dwattr $C$DW$T$374, DW_AT_language(DW_LANG_C)
   16739              
   16740              $C$DW$T$375     .dwtag  DW_TAG_pointer_type
   16741                      .dwattr $C$DW$T$375, DW_AT_type(*$C$DW$T$374)
   16742                      .dwattr $C$DW$T$375, DW_AT_address_class(0x20)
   16743              
   16744              
   16745              $C$DW$T$72      .dwtag  DW_TAG_structure_type
   16746                      .dwattr $C$DW$T$72, DW_AT_name("_FILTER_FO_")
   16747                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x0a)
   16748              $C$DW$2255      .dwtag  DW_TAG_member
   16749                      .dwattr $C$DW$2255, DW_AT_type(*$C$DW$T$71)
   16750                      .dwattr $C$DW$2255, DW_AT_name("a1")
   16751                      .dwattr $C$DW$2255, DW_AT_TI_symbol_name("_a1")
   16752                      .dwattr $C$DW$2255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16753                      .dwattr $C$DW$2255, DW_AT_accessibility(DW_ACCESS_public)
   16754              
   16755              $C$DW$2256      .dwtag  DW_TAG_member
   16756                      .dwattr $C$DW$2256, DW_AT_type(*$C$DW$T$71)
   16757                      .dwattr $C$DW$2256, DW_AT_name("b0")
   16758                      .dwattr $C$DW$2256, DW_AT_TI_symbol_name("_b0")
   16759                      .dwattr $C$DW$2256, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16760                      .dwattr $C$DW$2256, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:27:52 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{BD983F0B-D345-44B2-A024-E48789788D11} PAGE  317

   16761              
   16762              $C$DW$2257      .dwtag  DW_TAG_member
   16763                      .dwattr $C$DW$2257, DW_AT_type(*$C$DW$T$71)
   16764                      .dwattr $C$DW$2257, DW_AT_name("b1")
   16765                      .dwattr $C$DW$2257, DW_AT_TI_symbol_name("_b1")
   16766                      .dwattr $C$DW$2257, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16767                      .dwattr $C$DW$2257, DW_AT_accessibility(DW_ACCESS_public)
   16768              
   16769              $C$DW$2258      .dwtag  DW_TAG_member
   16770                      .dwattr $C$DW$2258, DW_AT_type(*$C$DW$T$71)
   16771                      .dwattr $C$DW$2258, DW_AT_name("x1")
   16772                      .dwattr $C$DW$2258, DW_AT_TI_symbol_name("_x1")
   16773                      .dwattr $C$DW$2258, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   16774                      .dwattr $C$DW$2258, DW_AT_accessibility(DW_ACCESS_public)
   16775              
   16776              $C$DW$2259      .dwtag  DW_TAG_member
   16777                      .dwattr $C$DW$2259, DW_AT_type(*$C$DW$T$71)
   16778                      .dwattr $C$DW$2259, DW_AT_name("y1")
   16779                      .dwattr $C$DW$2259, DW_AT_TI_symbol_name("_y1")
   16780                      .dwattr $C$DW$2259, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   16781                      .dwattr $C$DW$2259, DW_AT_accessibility(DW_ACCESS_public)
   16782              
   16783                      .dwendtag $C$DW$T$72
   16784              
   16785              $C$DW$T$126     .dwtag  DW_TAG_typedef
   16786                      .dwattr $C$DW$T$126, DW_AT_name("FILTER_FO_Obj")
   16787                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$72)
   16788                      .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
   16789              
   16790              
   16791              $C$DW$T$19      .dwtag  DW_TAG_structure_type
   16792                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
   16793                      .dwattr $C$DW$T$19, DW_AT_declaration
   16794                      .dwendtag $C$DW$T$19
   16795              
   16796              $C$DW$T$127     .dwtag  DW_TAG_pointer_type
   16797                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$19)
   16798                      .dwattr $C$DW$T$127, DW_AT_address_class(0x20)
   16799              
   16800              $C$DW$T$128     .dwtag  DW_TAG_typedef
   16801                      .dwattr $C$DW$T$128, DW_AT_name("FILTER_FO_Handle")
   16802                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$127)
   16803                      .dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
   16804              
   16805              
   16806              $C$DW$T$73      .dwtag  DW_TAG_structure_type
   16807                      .dwattr $C$DW$T$73, DW_AT_name("_FLASH_Obj_")
   16808                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x08)
   16809              $C$DW$2260      .dwtag  DW_TAG_member
   16810                      .dwattr $C$DW$2260, DW_AT_type(*$C$DW$T$23)
   16811                      .dwattr $C$DW$2260, DW_AT_name("FOPT")
   16812                      .dwattr $C$DW$2260, DW_AT_TI_symbol_name("_FOPT")
   16813                      .dwattr $C$DW$2260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16814                      .dwattr $C$DW$2260, DW_AT_accessibility(DW_ACCESS_public)
   16815              
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:27:52 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{BD983F0B-D345-44B2-A024-E48789788D11} PAGE  318

   16816              $C$DW$2261      .dwtag  DW_TAG_member
   16817                      .dwattr $C$DW$2261, DW_AT_type(*$C$DW$T$23)
   16818                      .dwattr $C$DW$2261, DW_AT_name("rsvd_1")
   16819                      .dwattr $C$DW$2261, DW_AT_TI_symbol_name("_rsvd_1")
   16820                      .dwattr $C$DW$2261, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16821                      .dwattr $C$DW$2261, DW_AT_accessibility(DW_ACCESS_public)
   16822              
   16823              $C$DW$2262      .dwtag  DW_TAG_member
   16824                      .dwattr $C$DW$2262, DW_AT_type(*$C$DW$T$23)
   16825                      .dwattr $C$DW$2262, DW_AT_name("FPWR")
   16826                      .dwattr $C$DW$2262, DW_AT_TI_symbol_name("_FPWR")
   16827                      .dwattr $C$DW$2262, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16828                      .dwattr $C$DW$2262, DW_AT_accessibility(DW_ACCESS_public)
   16829              
   16830              $C$DW$2263      .dwtag  DW_TAG_member
   16831                      .dwattr $C$DW$2263, DW_AT_type(*$C$DW$T$23)
   16832                      .dwattr $C$DW$2263, DW_AT_name("FSTATUS")
   16833                      .dwattr $C$DW$2263, DW_AT_TI_symbol_name("_FSTATUS")
   16834                      .dwattr $C$DW$2263, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   16835                      .dwattr $C$DW$2263, DW_AT_accessibility(DW_ACCESS_public)
   16836              
   16837              $C$DW$2264      .dwtag  DW_TAG_member
   16838                      .dwattr $C$DW$2264, DW_AT_type(*$C$DW$T$23)
   16839                      .dwattr $C$DW$2264, DW_AT_name("FSTDBYWAIT")
   16840                      .dwattr $C$DW$2264, DW_AT_TI_symbol_name("_FSTDBYWAIT")
   16841                      .dwattr $C$DW$2264, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16842                      .dwattr $C$DW$2264, DW_AT_accessibility(DW_ACCESS_public)
   16843              
   16844              $C$DW$2265      .dwtag  DW_TAG_member
   16845                      .dwattr $C$DW$2265, DW_AT_type(*$C$DW$T$23)
   16846                      .dwattr $C$DW$2265, DW_AT_name("FACTIVEWAIT")
   16847                      .dwattr $C$DW$2265, DW_AT_TI_symbol_name("_FACTIVEWAIT")
   16848                      .dwattr $C$DW$2265, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   16849                      .dwattr $C$DW$2265, DW_AT_accessibility(DW_ACCESS_public)
   16850              
   16851              $C$DW$2266      .dwtag  DW_TAG_member
   16852                      .dwattr $C$DW$2266, DW_AT_type(*$C$DW$T$23)
   16853                      .dwattr $C$DW$2266, DW_AT_name("FBANKWAIT")
   16854                      .dwattr $C$DW$2266, DW_AT_TI_symbol_name("_FBANKWAIT")
   16855                      .dwattr $C$DW$2266, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   16856                      .dwattr $C$DW$2266, DW_AT_accessibility(DW_ACCESS_public)
   16857              
   16858              $C$DW$2267      .dwtag  DW_TAG_member
   16859                      .dwattr $C$DW$2267, DW_AT_type(*$C$DW$T$23)
   16860                      .dwattr $C$DW$2267, DW_AT_name("FOTPWAIT")
   16861                      .dwattr $C$DW$2267, DW_AT_TI_symbol_name("_FOTPWAIT")
   16862                      .dwattr $C$DW$2267, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   16863                      .dwattr $C$DW$2267, DW_AT_accessibility(DW_ACCESS_public)
   16864              
   16865                      .dwendtag $C$DW$T$73
   16866              
   16867              $C$DW$T$94      .dwtag  DW_TAG_pointer_type
   16868                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$73)
   16869                      .dwattr $C$DW$T$94, DW_AT_address_class(0x20)
   16870              
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:27:52 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{BD983F0B-D345-44B2-A024-E48789788D11} PAGE  319

   16871              $C$DW$T$95      .dwtag  DW_TAG_typedef
   16872                      .dwattr $C$DW$T$95, DW_AT_name("FLASH_Handle")
   16873                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
   16874                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
   16875              
   16876              
   16877              $C$DW$T$79      .dwtag  DW_TAG_structure_type
   16878                      .dwattr $C$DW$T$79, DW_AT_name("_GPIO_Obj_")
   16879                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x6a)
   16880              $C$DW$2268      .dwtag  DW_TAG_member
   16881                      .dwattr $C$DW$2268, DW_AT_type(*$C$DW$T$76)
   16882                      .dwattr $C$DW$2268, DW_AT_name("GPACTRL")
   16883                      .dwattr $C$DW$2268, DW_AT_TI_symbol_name("_GPACTRL")
   16884                      .dwattr $C$DW$2268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16885                      .dwattr $C$DW$2268, DW_AT_accessibility(DW_ACCESS_public)
   16886              
   16887              $C$DW$2269      .dwtag  DW_TAG_member
   16888                      .dwattr $C$DW$2269, DW_AT_type(*$C$DW$T$76)
   16889                      .dwattr $C$DW$2269, DW_AT_name("GPAQSEL1")
   16890                      .dwattr $C$DW$2269, DW_AT_TI_symbol_name("_GPAQSEL1")
   16891                      .dwattr $C$DW$2269, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16892                      .dwattr $C$DW$2269, DW_AT_accessibility(DW_ACCESS_public)
   16893              
   16894              $C$DW$2270      .dwtag  DW_TAG_member
   16895                      .dwattr $C$DW$2270, DW_AT_type(*$C$DW$T$76)
   16896                      .dwattr $C$DW$2270, DW_AT_name("GPAQSEL2")
   16897                      .dwattr $C$DW$2270, DW_AT_TI_symbol_name("_GPAQSEL2")
   16898                      .dwattr $C$DW$2270, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16899                      .dwattr $C$DW$2270, DW_AT_accessibility(DW_ACCESS_public)
   16900              
   16901              $C$DW$2271      .dwtag  DW_TAG_member
   16902                      .dwattr $C$DW$2271, DW_AT_type(*$C$DW$T$76)
   16903                      .dwattr $C$DW$2271, DW_AT_name("GPAMUX1")
   16904                      .dwattr $C$DW$2271, DW_AT_TI_symbol_name("_GPAMUX1")
   16905                      .dwattr $C$DW$2271, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   16906                      .dwattr $C$DW$2271, DW_AT_accessibility(DW_ACCESS_public)
   16907              
   16908              $C$DW$2272      .dwtag  DW_TAG_member
   16909                      .dwattr $C$DW$2272, DW_AT_type(*$C$DW$T$76)
   16910                      .dwattr $C$DW$2272, DW_AT_name("GPAMUX2")
   16911                      .dwattr $C$DW$2272, DW_AT_TI_symbol_name("_GPAMUX2")
   16912                      .dwattr $C$DW$2272, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   16913                      .dwattr $C$DW$2272, DW_AT_accessibility(DW_ACCESS_public)
   16914              
   16915              $C$DW$2273      .dwtag  DW_TAG_member
   16916                      .dwattr $C$DW$2273, DW_AT_type(*$C$DW$T$76)
   16917                      .dwattr $C$DW$2273, DW_AT_name("GPADIR")
   16918                      .dwattr $C$DW$2273, DW_AT_TI_symbol_name("_GPADIR")
   16919                      .dwattr $C$DW$2273, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   16920                      .dwattr $C$DW$2273, DW_AT_accessibility(DW_ACCESS_public)
   16921              
   16922              $C$DW$2274      .dwtag  DW_TAG_member
   16923                      .dwattr $C$DW$2274, DW_AT_type(*$C$DW$T$76)
   16924                      .dwattr $C$DW$2274, DW_AT_name("GPAPUD")
   16925                      .dwattr $C$DW$2274, DW_AT_TI_symbol_name("_GPAPUD")
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:27:52 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{BD983F0B-D345-44B2-A024-E48789788D11} PAGE  320

   16926                      .dwattr $C$DW$2274, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   16927                      .dwattr $C$DW$2274, DW_AT_accessibility(DW_ACCESS_public)
   16928              
   16929              $C$DW$2275      .dwtag  DW_TAG_member
   16930                      .dwattr $C$DW$2275, DW_AT_type(*$C$DW$T$26)
   16931                      .dwattr $C$DW$2275, DW_AT_name("rsvd_1")
   16932                      .dwattr $C$DW$2275, DW_AT_TI_symbol_name("_rsvd_1")
   16933                      .dwattr $C$DW$2275, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   16934                      .dwattr $C$DW$2275, DW_AT_accessibility(DW_ACCESS_public)
   16935              
   16936              $C$DW$2276      .dwtag  DW_TAG_member
   16937                      .dwattr $C$DW$2276, DW_AT_type(*$C$DW$T$76)
   16938                      .dwattr $C$DW$2276, DW_AT_name("GPBCTRL")
   16939                      .dwattr $C$DW$2276, DW_AT_TI_symbol_name("_GPBCTRL")
   16940                      .dwattr $C$DW$2276, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   16941                      .dwattr $C$DW$2276, DW_AT_accessibility(DW_ACCESS_public)
   16942              
   16943              $C$DW$2277      .dwtag  DW_TAG_member
   16944                      .dwattr $C$DW$2277, DW_AT_type(*$C$DW$T$76)
   16945                      .dwattr $C$DW$2277, DW_AT_name("GPBQSEL1")
   16946                      .dwattr $C$DW$2277, DW_AT_TI_symbol_name("_GPBQSEL1")
   16947                      .dwattr $C$DW$2277, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   16948                      .dwattr $C$DW$2277, DW_AT_accessibility(DW_ACCESS_public)
   16949              
   16950              $C$DW$2278      .dwtag  DW_TAG_member
   16951                      .dwattr $C$DW$2278, DW_AT_type(*$C$DW$T$76)
   16952                      .dwattr $C$DW$2278, DW_AT_name("GPBQSEL2")
   16953                      .dwattr $C$DW$2278, DW_AT_TI_symbol_name("_GPBQSEL2")
   16954                      .dwattr $C$DW$2278, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   16955                      .dwattr $C$DW$2278, DW_AT_accessibility(DW_ACCESS_public)
   16956              
   16957              $C$DW$2279      .dwtag  DW_TAG_member
   16958                      .dwattr $C$DW$2279, DW_AT_type(*$C$DW$T$76)
   16959                      .dwattr $C$DW$2279, DW_AT_name("GPBMUX1")
   16960                      .dwattr $C$DW$2279, DW_AT_TI_symbol_name("_GPBMUX1")
   16961                      .dwattr $C$DW$2279, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   16962                      .dwattr $C$DW$2279, DW_AT_accessibility(DW_ACCESS_public)
   16963              
   16964              $C$DW$2280      .dwtag  DW_TAG_member
   16965                      .dwattr $C$DW$2280, DW_AT_type(*$C$DW$T$76)
   16966                      .dwattr $C$DW$2280, DW_AT_name("GPBMUX2")
   16967                      .dwattr $C$DW$2280, DW_AT_TI_symbol_name("_GPBMUX2")
   16968                      .dwattr $C$DW$2280, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   16969                      .dwattr $C$DW$2280, DW_AT_accessibility(DW_ACCESS_public)
   16970              
   16971              $C$DW$2281      .dwtag  DW_TAG_member
   16972                      .dwattr $C$DW$2281, DW_AT_type(*$C$DW$T$76)
   16973                      .dwattr $C$DW$2281, DW_AT_name("GPBDIR")
   16974                      .dwattr $C$DW$2281, DW_AT_TI_symbol_name("_GPBDIR")
   16975                      .dwattr $C$DW$2281, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   16976                      .dwattr $C$DW$2281, DW_AT_accessibility(DW_ACCESS_public)
   16977              
   16978              $C$DW$2282      .dwtag  DW_TAG_member
   16979                      .dwattr $C$DW$2282, DW_AT_type(*$C$DW$T$76)
   16980                      .dwattr $C$DW$2282, DW_AT_name("GPBPUD")
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:27:52 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{BD983F0B-D345-44B2-A024-E48789788D11} PAGE  321

   16981                      .dwattr $C$DW$2282, DW_AT_TI_symbol_name("_GPBPUD")
   16982                      .dwattr $C$DW$2282, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   16983                      .dwattr $C$DW$2282, DW_AT_accessibility(DW_ACCESS_public)
   16984              
   16985              $C$DW$2283      .dwtag  DW_TAG_member
   16986                      .dwattr $C$DW$2283, DW_AT_type(*$C$DW$T$77)
   16987                      .dwattr $C$DW$2283, DW_AT_name("rsvd_4")
   16988                      .dwattr $C$DW$2283, DW_AT_TI_symbol_name("_rsvd_4")
   16989                      .dwattr $C$DW$2283, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   16990                      .dwattr $C$DW$2283, DW_AT_accessibility(DW_ACCESS_public)
   16991              
   16992              $C$DW$2284      .dwtag  DW_TAG_member
   16993                      .dwattr $C$DW$2284, DW_AT_type(*$C$DW$T$76)
   16994                      .dwattr $C$DW$2284, DW_AT_name("AIOMUX1")
   16995                      .dwattr $C$DW$2284, DW_AT_TI_symbol_name("_AIOMUX1")
   16996                      .dwattr $C$DW$2284, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   16997                      .dwattr $C$DW$2284, DW_AT_accessibility(DW_ACCESS_public)
   16998              
   16999              $C$DW$2285      .dwtag  DW_TAG_member
   17000                      .dwattr $C$DW$2285, DW_AT_type(*$C$DW$T$26)
   17001                      .dwattr $C$DW$2285, DW_AT_name("rsvd_5")
   17002                      .dwattr $C$DW$2285, DW_AT_TI_symbol_name("_rsvd_5")
   17003                      .dwattr $C$DW$2285, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   17004                      .dwattr $C$DW$2285, DW_AT_accessibility(DW_ACCESS_public)
   17005              
   17006              $C$DW$2286      .dwtag  DW_TAG_member
   17007                      .dwattr $C$DW$2286, DW_AT_type(*$C$DW$T$76)
   17008                      .dwattr $C$DW$2286, DW_AT_name("AIODIR")
   17009                      .dwattr $C$DW$2286, DW_AT_TI_symbol_name("_AIODIR")
   17010                      .dwattr $C$DW$2286, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   17011                      .dwattr $C$DW$2286, DW_AT_accessibility(DW_ACCESS_public)
   17012              
   17013              $C$DW$2287      .dwtag  DW_TAG_member
   17014                      .dwattr $C$DW$2287, DW_AT_type(*$C$DW$T$78)
   17015                      .dwattr $C$DW$2287, DW_AT_name("rsvd_6")
   17016                      .dwattr $C$DW$2287, DW_AT_TI_symbol_name("_rsvd_6")
   17017                      .dwattr $C$DW$2287, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   17018                      .dwattr $C$DW$2287, DW_AT_accessibility(DW_ACCESS_public)
   17019              
   17020              $C$DW$2288      .dwtag  DW_TAG_member
   17021                      .dwattr $C$DW$2288, DW_AT_type(*$C$DW$T$76)
   17022                      .dwattr $C$DW$2288, DW_AT_name("GPADAT")
   17023                      .dwattr $C$DW$2288, DW_AT_TI_symbol_name("_GPADAT")
   17024                      .dwattr $C$DW$2288, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   17025                      .dwattr $C$DW$2288, DW_AT_accessibility(DW_ACCESS_public)
   17026              
   17027              $C$DW$2289      .dwtag  DW_TAG_member
   17028                      .dwattr $C$DW$2289, DW_AT_type(*$C$DW$T$76)
   17029                      .dwattr $C$DW$2289, DW_AT_name("GPASET")
   17030                      .dwattr $C$DW$2289, DW_AT_TI_symbol_name("_GPASET")
   17031                      .dwattr $C$DW$2289, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   17032                      .dwattr $C$DW$2289, DW_AT_accessibility(DW_ACCESS_public)
   17033              
   17034              $C$DW$2290      .dwtag  DW_TAG_member
   17035                      .dwattr $C$DW$2290, DW_AT_type(*$C$DW$T$76)
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:27:52 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{BD983F0B-D345-44B2-A024-E48789788D11} PAGE  322

   17036                      .dwattr $C$DW$2290, DW_AT_name("GPACLEAR")
   17037                      .dwattr $C$DW$2290, DW_AT_TI_symbol_name("_GPACLEAR")
   17038                      .dwattr $C$DW$2290, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   17039                      .dwattr $C$DW$2290, DW_AT_accessibility(DW_ACCESS_public)
   17040              
   17041              $C$DW$2291      .dwtag  DW_TAG_member
   17042                      .dwattr $C$DW$2291, DW_AT_type(*$C$DW$T$76)
   17043                      .dwattr $C$DW$2291, DW_AT_name("GPATOGGLE")
   17044                      .dwattr $C$DW$2291, DW_AT_TI_symbol_name("_GPATOGGLE")
   17045                      .dwattr $C$DW$2291, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   17046                      .dwattr $C$DW$2291, DW_AT_accessibility(DW_ACCESS_public)
   17047              
   17048              $C$DW$2292      .dwtag  DW_TAG_member
   17049                      .dwattr $C$DW$2292, DW_AT_type(*$C$DW$T$76)
   17050                      .dwattr $C$DW$2292, DW_AT_name("GPBDAT")
   17051                      .dwattr $C$DW$2292, DW_AT_TI_symbol_name("_GPBDAT")
   17052                      .dwattr $C$DW$2292, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   17053                      .dwattr $C$DW$2292, DW_AT_accessibility(DW_ACCESS_public)
   17054              
   17055              $C$DW$2293      .dwtag  DW_TAG_member
   17056                      .dwattr $C$DW$2293, DW_AT_type(*$C$DW$T$76)
   17057                      .dwattr $C$DW$2293, DW_AT_name("GPBSET")
   17058                      .dwattr $C$DW$2293, DW_AT_TI_symbol_name("_GPBSET")
   17059                      .dwattr $C$DW$2293, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   17060                      .dwattr $C$DW$2293, DW_AT_accessibility(DW_ACCESS_public)
   17061              
   17062              $C$DW$2294      .dwtag  DW_TAG_member
   17063                      .dwattr $C$DW$2294, DW_AT_type(*$C$DW$T$76)
   17064                      .dwattr $C$DW$2294, DW_AT_name("GPBCLEAR")
   17065                      .dwattr $C$DW$2294, DW_AT_TI_symbol_name("_GPBCLEAR")
   17066                      .dwattr $C$DW$2294, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   17067                      .dwattr $C$DW$2294, DW_AT_accessibility(DW_ACCESS_public)
   17068              
   17069              $C$DW$2295      .dwtag  DW_TAG_member
   17070                      .dwattr $C$DW$2295, DW_AT_type(*$C$DW$T$76)
   17071                      .dwattr $C$DW$2295, DW_AT_name("GPBTOGGLE")
   17072                      .dwattr $C$DW$2295, DW_AT_TI_symbol_name("_GPBTOGGLE")
   17073                      .dwattr $C$DW$2295, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   17074                      .dwattr $C$DW$2295, DW_AT_accessibility(DW_ACCESS_public)
   17075              
   17076              $C$DW$2296      .dwtag  DW_TAG_member
   17077                      .dwattr $C$DW$2296, DW_AT_type(*$C$DW$T$31)
   17078                      .dwattr $C$DW$2296, DW_AT_name("rsvd_7")
   17079                      .dwattr $C$DW$2296, DW_AT_TI_symbol_name("_rsvd_7")
   17080                      .dwattr $C$DW$2296, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   17081                      .dwattr $C$DW$2296, DW_AT_accessibility(DW_ACCESS_public)
   17082              
   17083              $C$DW$2297      .dwtag  DW_TAG_member
   17084                      .dwattr $C$DW$2297, DW_AT_type(*$C$DW$T$76)
   17085                      .dwattr $C$DW$2297, DW_AT_name("AIODAT")
   17086                      .dwattr $C$DW$2297, DW_AT_TI_symbol_name("_AIODAT")
   17087                      .dwattr $C$DW$2297, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
   17088                      .dwattr $C$DW$2297, DW_AT_accessibility(DW_ACCESS_public)
   17089              
   17090              $C$DW$2298      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:27:52 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{BD983F0B-D345-44B2-A024-E48789788D11} PAGE  323

   17091                      .dwattr $C$DW$2298, DW_AT_type(*$C$DW$T$76)
   17092                      .dwattr $C$DW$2298, DW_AT_name("AIOSET")
   17093                      .dwattr $C$DW$2298, DW_AT_TI_symbol_name("_AIOSET")
   17094                      .dwattr $C$DW$2298, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   17095                      .dwattr $C$DW$2298, DW_AT_accessibility(DW_ACCESS_public)
   17096              
   17097              $C$DW$2299      .dwtag  DW_TAG_member
   17098                      .dwattr $C$DW$2299, DW_AT_type(*$C$DW$T$76)
   17099                      .dwattr $C$DW$2299, DW_AT_name("AIOCLEAR")
   17100                      .dwattr $C$DW$2299, DW_AT_TI_symbol_name("_AIOCLEAR")
   17101                      .dwattr $C$DW$2299, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   17102                      .dwattr $C$DW$2299, DW_AT_accessibility(DW_ACCESS_public)
   17103              
   17104              $C$DW$2300      .dwtag  DW_TAG_member
   17105                      .dwattr $C$DW$2300, DW_AT_type(*$C$DW$T$76)
   17106                      .dwattr $C$DW$2300, DW_AT_name("AIOTOGGLE")
   17107                      .dwattr $C$DW$2300, DW_AT_TI_symbol_name("_AIOTOGGLE")
   17108                      .dwattr $C$DW$2300, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   17109                      .dwattr $C$DW$2300, DW_AT_accessibility(DW_ACCESS_public)
   17110              
   17111              $C$DW$2301      .dwtag  DW_TAG_member
   17112                      .dwattr $C$DW$2301, DW_AT_type(*$C$DW$T$28)
   17113                      .dwattr $C$DW$2301, DW_AT_name("GPIOXINTnSEL")
   17114                      .dwattr $C$DW$2301, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
   17115                      .dwattr $C$DW$2301, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   17116                      .dwattr $C$DW$2301, DW_AT_accessibility(DW_ACCESS_public)
   17117              
   17118              $C$DW$2302      .dwtag  DW_TAG_member
   17119                      .dwattr $C$DW$2302, DW_AT_type(*$C$DW$T$27)
   17120                      .dwattr $C$DW$2302, DW_AT_name("rsvd_8")
   17121                      .dwattr $C$DW$2302, DW_AT_TI_symbol_name("_rsvd_8")
   17122                      .dwattr $C$DW$2302, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   17123                      .dwattr $C$DW$2302, DW_AT_accessibility(DW_ACCESS_public)
   17124              
   17125              $C$DW$2303      .dwtag  DW_TAG_member
   17126                      .dwattr $C$DW$2303, DW_AT_type(*$C$DW$T$76)
   17127                      .dwattr $C$DW$2303, DW_AT_name("GPIOLPMSEL")
   17128                      .dwattr $C$DW$2303, DW_AT_TI_symbol_name("_GPIOLPMSEL")
   17129                      .dwattr $C$DW$2303, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   17130                      .dwattr $C$DW$2303, DW_AT_accessibility(DW_ACCESS_public)
   17131              
   17132                      .dwendtag $C$DW$T$79
   17133              
   17134              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
   17135                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$79)
   17136                      .dwattr $C$DW$T$38, DW_AT_address_class(0x20)
   17137              
   17138              $C$DW$T$39      .dwtag  DW_TAG_typedef
   17139                      .dwattr $C$DW$T$39, DW_AT_name("GPIO_Handle")
   17140                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
   17141                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
   17142              
   17143              
   17144              $C$DW$T$81      .dwtag  DW_TAG_structure_type
   17145                      .dwattr $C$DW$T$81, DW_AT_name("_HAL_AdcData_t_")
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:27:52 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{BD983F0B-D345-44B2-A024-E48789788D11} PAGE  324

   17146                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x0e)
   17147              $C$DW$2304      .dwtag  DW_TAG_member
   17148                      .dwattr $C$DW$2304, DW_AT_type(*$C$DW$T$80)
   17149                      .dwattr $C$DW$2304, DW_AT_name("I")
   17150                      .dwattr $C$DW$2304, DW_AT_TI_symbol_name("_I")
   17151                      .dwattr $C$DW$2304, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   17152                      .dwattr $C$DW$2304, DW_AT_accessibility(DW_ACCESS_public)
   17153              
   17154              $C$DW$2305      .dwtag  DW_TAG_member
   17155                      .dwattr $C$DW$2305, DW_AT_type(*$C$DW$T$80)
   17156                      .dwattr $C$DW$2305, DW_AT_name("V")
   17157                      .dwattr $C$DW$2305, DW_AT_TI_symbol_name("_V")
   17158                      .dwattr $C$DW$2305, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   17159                      .dwattr $C$DW$2305, DW_AT_accessibility(DW_ACCESS_public)
   17160              
   17161              $C$DW$2306      .dwtag  DW_TAG_member
   17162                      .dwattr $C$DW$2306, DW_AT_type(*$C$DW$T$71)
   17163                      .dwattr $C$DW$2306, DW_AT_name("dcBus")
   17164                      .dwattr $C$DW$2306, DW_AT_TI_symbol_name("_dcBus")
   17165                      .dwattr $C$DW$2306, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   17166                      .dwattr $C$DW$2306, DW_AT_accessibility(DW_ACCESS_public)
   17167              
   17168                      .dwendtag $C$DW$T$81
   17169              
   17170              $C$DW$T$117     .dwtag  DW_TAG_typedef
   17171                      .dwattr $C$DW$T$117, DW_AT_name("HAL_AdcData_t")
   17172                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$81)
   17173                      .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
   17174              
   17175              
   17176              $C$DW$T$87      .dwtag  DW_TAG_structure_type
   17177                      .dwattr $C$DW$T$87, DW_AT_name("_HAL_DacData_t_")
   17178                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x22)
   17179              $C$DW$2307      .dwtag  DW_TAG_member
   17180                      .dwattr $C$DW$2307, DW_AT_type(*$C$DW$T$22)
   17181                      .dwattr $C$DW$2307, DW_AT_name("PeriodMax")
   17182                      .dwattr $C$DW$2307, DW_AT_TI_symbol_name("_PeriodMax")
   17183                      .dwattr $C$DW$2307, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   17184                      .dwattr $C$DW$2307, DW_AT_accessibility(DW_ACCESS_public)
   17185              
   17186              $C$DW$2308      .dwtag  DW_TAG_member
   17187                      .dwattr $C$DW$2308, DW_AT_type(*$C$DW$T$85)
   17188                      .dwattr $C$DW$2308, DW_AT_name("ptrData")
   17189                      .dwattr $C$DW$2308, DW_AT_TI_symbol_name("_ptrData")
   17190                      .dwattr $C$DW$2308, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   17191                      .dwattr $C$DW$2308, DW_AT_accessibility(DW_ACCESS_public)
   17192              
   17193              $C$DW$2309      .dwtag  DW_TAG_member
   17194                      .dwattr $C$DW$2309, DW_AT_type(*$C$DW$T$86)
   17195                      .dwattr $C$DW$2309, DW_AT_name("value")
   17196                      .dwattr $C$DW$2309, DW_AT_TI_symbol_name("_value")
   17197                      .dwattr $C$DW$2309, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   17198                      .dwattr $C$DW$2309, DW_AT_accessibility(DW_ACCESS_public)
   17199              
   17200              $C$DW$2310      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:27:52 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{BD983F0B-D345-44B2-A024-E48789788D11} PAGE  325

   17201                      .dwattr $C$DW$2310, DW_AT_type(*$C$DW$T$86)
   17202                      .dwattr $C$DW$2310, DW_AT_name("offset")
   17203                      .dwattr $C$DW$2310, DW_AT_TI_symbol_name("_offset")
   17204                      .dwattr $C$DW$2310, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   17205                      .dwattr $C$DW$2310, DW_AT_accessibility(DW_ACCESS_public)
   17206              
   17207              $C$DW$2311      .dwtag  DW_TAG_member
   17208                      .dwattr $C$DW$2311, DW_AT_type(*$C$DW$T$86)
   17209                      .dwattr $C$DW$2311, DW_AT_name("gain")
   17210                      .dwattr $C$DW$2311, DW_AT_TI_symbol_name("_gain")
   17211                      .dwattr $C$DW$2311, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   17212                      .dwattr $C$DW$2311, DW_AT_accessibility(DW_ACCESS_public)
   17213              
   17214                      .dwendtag $C$DW$T$87
   17215              
   17216              $C$DW$T$385     .dwtag  DW_TAG_typedef
   17217                      .dwattr $C$DW$T$385, DW_AT_name("HAL_DacData_t")
   17218                      .dwattr $C$DW$T$385, DW_AT_type(*$C$DW$T$87)
   17219                      .dwattr $C$DW$T$385, DW_AT_language(DW_LANG_C)
   17220              
   17221              $C$DW$T$386     .dwtag  DW_TAG_pointer_type
   17222                      .dwattr $C$DW$T$386, DW_AT_type(*$C$DW$T$385)
   17223                      .dwattr $C$DW$T$386, DW_AT_address_class(0x20)
   17224              
   17225              $C$DW$2312      .dwtag  DW_TAG_TI_far_type
   17226                      .dwattr $C$DW$2312, DW_AT_type(*$C$DW$T$386)
   17227              
   17228              $C$DW$T$387     .dwtag  DW_TAG_const_type
   17229                      .dwattr $C$DW$T$387, DW_AT_type(*$C$DW$2312)
   17230              
   17231              
   17232              $C$DW$T$123     .dwtag  DW_TAG_structure_type
   17233                      .dwattr $C$DW$T$123, DW_AT_name("_HAL_Obj_")
   17234                      .dwattr $C$DW$T$123, DW_AT_byte_size(0xac)
   17235              $C$DW$2313      .dwtag  DW_TAG_member
   17236                      .dwattr $C$DW$2313, DW_AT_type(*$C$DW$T$89)
   17237                      .dwattr $C$DW$2313, DW_AT_name("adcHandle")
   17238                      .dwattr $C$DW$2313, DW_AT_TI_symbol_name("_adcHandle")
   17239                      .dwattr $C$DW$2313, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   17240                      .dwattr $C$DW$2313, DW_AT_accessibility(DW_ACCESS_public)
   17241              
   17242              $C$DW$2314      .dwtag  DW_TAG_member
   17243                      .dwattr $C$DW$2314, DW_AT_type(*$C$DW$T$91)
   17244                      .dwattr $C$DW$2314, DW_AT_name("clkHandle")
   17245                      .dwattr $C$DW$2314, DW_AT_TI_symbol_name("_clkHandle")
   17246                      .dwattr $C$DW$2314, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   17247                      .dwattr $C$DW$2314, DW_AT_accessibility(DW_ACCESS_public)
   17248              
   17249              $C$DW$2315      .dwtag  DW_TAG_member
   17250                      .dwattr $C$DW$2315, DW_AT_type(*$C$DW$T$93)
   17251                      .dwattr $C$DW$2315, DW_AT_name("cpuHandle")
   17252                      .dwattr $C$DW$2315, DW_AT_TI_symbol_name("_cpuHandle")
   17253                      .dwattr $C$DW$2315, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   17254                      .dwattr $C$DW$2315, DW_AT_accessibility(DW_ACCESS_public)
   17255              
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:27:52 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{BD983F0B-D345-44B2-A024-E48789788D11} PAGE  326

   17256              $C$DW$2316      .dwtag  DW_TAG_member
   17257                      .dwattr $C$DW$2316, DW_AT_type(*$C$DW$T$95)
   17258                      .dwattr $C$DW$2316, DW_AT_name("flashHandle")
   17259                      .dwattr $C$DW$2316, DW_AT_TI_symbol_name("_flashHandle")
   17260                      .dwattr $C$DW$2316, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   17261                      .dwattr $C$DW$2316, DW_AT_accessibility(DW_ACCESS_public)
   17262              
   17263              $C$DW$2317      .dwtag  DW_TAG_member
   17264                      .dwattr $C$DW$2317, DW_AT_type(*$C$DW$T$39)
   17265                      .dwattr $C$DW$2317, DW_AT_name("gpioHandle")
   17266                      .dwattr $C$DW$2317, DW_AT_TI_symbol_name("_gpioHandle")
   17267                      .dwattr $C$DW$2317, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   17268                      .dwattr $C$DW$2317, DW_AT_accessibility(DW_ACCESS_public)
   17269              
   17270              $C$DW$2318      .dwtag  DW_TAG_member
   17271                      .dwattr $C$DW$2318, DW_AT_type(*$C$DW$T$98)
   17272                      .dwattr $C$DW$2318, DW_AT_name("offsetHandle_I")
   17273                      .dwattr $C$DW$2318, DW_AT_TI_symbol_name("_offsetHandle_I")
   17274                      .dwattr $C$DW$2318, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   17275                      .dwattr $C$DW$2318, DW_AT_accessibility(DW_ACCESS_public)
   17276              
   17277              $C$DW$2319      .dwtag  DW_TAG_member
   17278                      .dwattr $C$DW$2319, DW_AT_type(*$C$DW$T$100)
   17279                      .dwattr $C$DW$2319, DW_AT_name("offset_I")
   17280                      .dwattr $C$DW$2319, DW_AT_TI_symbol_name("_offset_I")
   17281                      .dwattr $C$DW$2319, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   17282                      .dwattr $C$DW$2319, DW_AT_accessibility(DW_ACCESS_public)
   17283              
   17284              $C$DW$2320      .dwtag  DW_TAG_member
   17285                      .dwattr $C$DW$2320, DW_AT_type(*$C$DW$T$98)
   17286                      .dwattr $C$DW$2320, DW_AT_name("offsetHandle_V")
   17287                      .dwattr $C$DW$2320, DW_AT_TI_symbol_name("_offsetHandle_V")
   17288                      .dwattr $C$DW$2320, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   17289                      .dwattr $C$DW$2320, DW_AT_accessibility(DW_ACCESS_public)
   17290              
   17291              $C$DW$2321      .dwtag  DW_TAG_member
   17292                      .dwattr $C$DW$2321, DW_AT_type(*$C$DW$T$100)
   17293                      .dwattr $C$DW$2321, DW_AT_name("offset_V")
   17294                      .dwattr $C$DW$2321, DW_AT_TI_symbol_name("_offset_V")
   17295                      .dwattr $C$DW$2321, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   17296                      .dwattr $C$DW$2321, DW_AT_accessibility(DW_ACCESS_public)
   17297              
   17298              $C$DW$2322      .dwtag  DW_TAG_member
   17299                      .dwattr $C$DW$2322, DW_AT_type(*$C$DW$T$102)
   17300                      .dwattr $C$DW$2322, DW_AT_name("oscHandle")
   17301                      .dwattr $C$DW$2322, DW_AT_TI_symbol_name("_oscHandle")
   17302                      .dwattr $C$DW$2322, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
   17303                      .dwattr $C$DW$2322, DW_AT_accessibility(DW_ACCESS_public)
   17304              
   17305              $C$DW$2323      .dwtag  DW_TAG_member
   17306                      .dwattr $C$DW$2323, DW_AT_type(*$C$DW$T$104)
   17307                      .dwattr $C$DW$2323, DW_AT_name("pieHandle")
   17308                      .dwattr $C$DW$2323, DW_AT_TI_symbol_name("_pieHandle")
   17309                      .dwattr $C$DW$2323, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
   17310                      .dwattr $C$DW$2323, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:27:52 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{BD983F0B-D345-44B2-A024-E48789788D11} PAGE  327

   17311              
   17312              $C$DW$2324      .dwtag  DW_TAG_member
   17313                      .dwattr $C$DW$2324, DW_AT_type(*$C$DW$T$106)
   17314                      .dwattr $C$DW$2324, DW_AT_name("pllHandle")
   17315                      .dwattr $C$DW$2324, DW_AT_TI_symbol_name("_pllHandle")
   17316                      .dwattr $C$DW$2324, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
   17317                      .dwattr $C$DW$2324, DW_AT_accessibility(DW_ACCESS_public)
   17318              
   17319              $C$DW$2325      .dwtag  DW_TAG_member
   17320                      .dwattr $C$DW$2325, DW_AT_type(*$C$DW$T$109)
   17321                      .dwattr $C$DW$2325, DW_AT_name("pwmHandle")
   17322                      .dwattr $C$DW$2325, DW_AT_TI_symbol_name("_pwmHandle")
   17323                      .dwattr $C$DW$2325, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
   17324                      .dwattr $C$DW$2325, DW_AT_accessibility(DW_ACCESS_public)
   17325              
   17326              $C$DW$2326      .dwtag  DW_TAG_member
   17327                      .dwattr $C$DW$2326, DW_AT_type(*$C$DW$T$109)
   17328                      .dwattr $C$DW$2326, DW_AT_name("pwmDacHandle")
   17329                      .dwattr $C$DW$2326, DW_AT_TI_symbol_name("_pwmDacHandle")
   17330                      .dwattr $C$DW$2326, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
   17331                      .dwattr $C$DW$2326, DW_AT_accessibility(DW_ACCESS_public)
   17332              
   17333              $C$DW$2327      .dwtag  DW_TAG_member
   17334                      .dwattr $C$DW$2327, DW_AT_type(*$C$DW$T$111)
   17335                      .dwattr $C$DW$2327, DW_AT_name("pwrHandle")
   17336                      .dwattr $C$DW$2327, DW_AT_TI_symbol_name("_pwrHandle")
   17337                      .dwattr $C$DW$2327, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
   17338                      .dwattr $C$DW$2327, DW_AT_accessibility(DW_ACCESS_public)
   17339              
   17340              $C$DW$2328      .dwtag  DW_TAG_member
   17341                      .dwattr $C$DW$2328, DW_AT_type(*$C$DW$T$114)
   17342                      .dwattr $C$DW$2328, DW_AT_name("timerHandle")
   17343                      .dwattr $C$DW$2328, DW_AT_TI_symbol_name("_timerHandle")
   17344                      .dwattr $C$DW$2328, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
   17345                      .dwattr $C$DW$2328, DW_AT_accessibility(DW_ACCESS_public)
   17346              
   17347              $C$DW$2329      .dwtag  DW_TAG_member
   17348                      .dwattr $C$DW$2329, DW_AT_type(*$C$DW$T$116)
   17349                      .dwattr $C$DW$2329, DW_AT_name("wdogHandle")
   17350                      .dwattr $C$DW$2329, DW_AT_TI_symbol_name("_wdogHandle")
   17351                      .dwattr $C$DW$2329, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
   17352                      .dwattr $C$DW$2329, DW_AT_accessibility(DW_ACCESS_public)
   17353              
   17354              $C$DW$2330      .dwtag  DW_TAG_member
   17355                      .dwattr $C$DW$2330, DW_AT_type(*$C$DW$T$117)
   17356                      .dwattr $C$DW$2330, DW_AT_name("adcBias")
   17357                      .dwattr $C$DW$2330, DW_AT_TI_symbol_name("_adcBias")
   17358                      .dwattr $C$DW$2330, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
   17359                      .dwattr $C$DW$2330, DW_AT_accessibility(DW_ACCESS_public)
   17360              
