TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{21AA29C7-F98B-4F4A-BDE6-D80B9CD4CCAC} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.0.LTS *
       3              ;* Date/Time created: Thu May 11 17:35:48 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/GIANT/GiantNEO/motorware/motorware_1_01_00_18/sw/modules/hal/boards/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.0.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\GIANT\GiantNEO\motorware\motorware_1_01_00_18\sw\solutions\insta
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("OFFSET_setBeta")

   16033              
   16034              $C$DW$T$347     .dwtag  DW_TAG_typedef
   16035                      .dwattr $C$DW$T$347, DW_AT_name("SCI_NumStopBits_e")
   16036                      .dwattr $C$DW$T$347, DW_AT_type(*$C$DW$T$346)
   16037                      .dwattr $C$DW$T$347, DW_AT_language(DW_LANG_C)
   16038              
   16039              $C$DW$2172      .dwtag  DW_TAG_TI_far_type
   16040                      .dwattr $C$DW$2172, DW_AT_type(*$C$DW$T$347)
   16041              
   16042              $C$DW$T$348     .dwtag  DW_TAG_const_type
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{21AA29C7-F98B-4F4A-BDE6-D80B9CD4CCAC} PAGE  304

   16043                      .dwattr $C$DW$T$348, DW_AT_type(*$C$DW$2172)
   16044              
   16045              
   16046              $C$DW$T$349     .dwtag  DW_TAG_enumeration_type
   16047                      .dwattr $C$DW$T$349, DW_AT_byte_size(0x01)
   16048              $C$DW$2173      .dwtag  DW_TAG_enumerator
   16049                      .dwattr $C$DW$2173, DW_AT_name("SCI_Priority_Immediate")
   16050                      .dwattr $C$DW$2173, DW_AT_const_value(0x00)
   16051              
   16052              $C$DW$2174      .dwtag  DW_TAG_enumerator
   16053                      .dwattr $C$DW$2174, DW_AT_name("SCI_Priority_FreeRun")
   16054                      .dwattr $C$DW$2174, DW_AT_const_value(0x08)
   16055              
   16056              $C$DW$2175      .dwtag  DW_TAG_enumerator
   16057                      .dwattr $C$DW$2175, DW_AT_name("SCI_Priority_AfterRxRxSeq")
   16058                      .dwattr $C$DW$2175, DW_AT_const_value(0x10)
   16059              
   16060                      .dwendtag $C$DW$T$349
   16061              
   16062              $C$DW$T$350     .dwtag  DW_TAG_typedef
   16063                      .dwattr $C$DW$T$350, DW_AT_name("SCI_Priority_e")
   16064                      .dwattr $C$DW$T$350, DW_AT_type(*$C$DW$T$349)
   16065                      .dwattr $C$DW$T$350, DW_AT_language(DW_LANG_C)
   16066              
   16067              $C$DW$2176      .dwtag  DW_TAG_TI_far_type
   16068                      .dwattr $C$DW$2176, DW_AT_type(*$C$DW$T$350)
   16069              
   16070              $C$DW$T$351     .dwtag  DW_TAG_const_type
   16071                      .dwattr $C$DW$T$351, DW_AT_type(*$C$DW$2176)
   16072              
   16073              
   16074              $C$DW$T$352     .dwtag  DW_TAG_enumeration_type
   16075                      .dwattr $C$DW$T$352, DW_AT_byte_size(0x01)
   16076              $C$DW$2177      .dwtag  DW_TAG_enumerator
   16077                      .dwattr $C$DW$2177, DW_AT_name("TIMER_EmulationMode_StopAfterNextDecrement")
   16078                      .dwattr $C$DW$2177, DW_AT_const_value(0x00)
   16079              
   16080              $C$DW$2178      .dwtag  DW_TAG_enumerator
   16081                      .dwattr $C$DW$2178, DW_AT_name("TIMER_EmulationMode_StopAtZero")
   16082                      .dwattr $C$DW$2178, DW_AT_const_value(0x400)
   16083              
   16084              $C$DW$2179      .dwtag  DW_TAG_enumerator
   16085                      .dwattr $C$DW$2179, DW_AT_name("TIMER_EmulationMode_RunFree")
   16086                      .dwattr $C$DW$2179, DW_AT_const_value(0x800)
   16087              
   16088                      .dwendtag $C$DW$T$352
   16089              
   16090              $C$DW$T$353     .dwtag  DW_TAG_typedef
   16091                      .dwattr $C$DW$T$353, DW_AT_name("TIMER_EmulationMode_e")
   16092                      .dwattr $C$DW$T$353, DW_AT_type(*$C$DW$T$352)
   16093                      .dwattr $C$DW$T$353, DW_AT_language(DW_LANG_C)
   16094              
   16095              $C$DW$2180      .dwtag  DW_TAG_TI_far_type
   16096                      .dwattr $C$DW$2180, DW_AT_type(*$C$DW$T$353)
   16097              
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{21AA29C7-F98B-4F4A-BDE6-D80B9CD4CCAC} PAGE  305

   16098              $C$DW$T$354     .dwtag  DW_TAG_const_type
   16099                      .dwattr $C$DW$T$354, DW_AT_type(*$C$DW$2180)
   16100              
   16101              
   16102              $C$DW$T$355     .dwtag  DW_TAG_enumeration_type
   16103                      .dwattr $C$DW$T$355, DW_AT_byte_size(0x01)
   16104              $C$DW$2181      .dwtag  DW_TAG_enumerator
   16105                      .dwattr $C$DW$2181, DW_AT_name("HAL_SensorType_Current")
   16106                      .dwattr $C$DW$2181, DW_AT_const_value(0x00)
   16107              
   16108              $C$DW$2182      .dwtag  DW_TAG_enumerator
   16109                      .dwattr $C$DW$2182, DW_AT_name("HAL_SensorType_Voltage")
   16110                      .dwattr $C$DW$2182, DW_AT_const_value(0x01)
   16111              
   16112                      .dwendtag $C$DW$T$355
   16113              
   16114              $C$DW$T$356     .dwtag  DW_TAG_typedef
   16115                      .dwattr $C$DW$T$356, DW_AT_name("HAL_SensorType_e")
   16116                      .dwattr $C$DW$T$356, DW_AT_type(*$C$DW$T$355)
   16117                      .dwattr $C$DW$T$356, DW_AT_language(DW_LANG_C)
   16118              
   16119              
   16120              $C$DW$T$30      .dwtag  DW_TAG_structure_type
   16121                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
   16122                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
   16123              $C$DW$2183      .dwtag  DW_TAG_member
   16124                      .dwattr $C$DW$2183, DW_AT_type(*$C$DW$T$24)
   16125                      .dwattr $C$DW$2183, DW_AT_name("ADCRESULT")
   16126                      .dwattr $C$DW$2183, DW_AT_TI_symbol_name("_ADCRESULT")
   16127                      .dwattr $C$DW$2183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16128                      .dwattr $C$DW$2183, DW_AT_accessibility(DW_ACCESS_public)
   16129              
   16130              $C$DW$2184      .dwtag  DW_TAG_member
   16131                      .dwattr $C$DW$2184, DW_AT_type(*$C$DW$T$25)
   16132                      .dwattr $C$DW$2184, DW_AT_name("resvd_1")
   16133                      .dwattr $C$DW$2184, DW_AT_TI_symbol_name("_resvd_1")
   16134                      .dwattr $C$DW$2184, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   16135                      .dwattr $C$DW$2184, DW_AT_accessibility(DW_ACCESS_public)
   16136              
   16137              $C$DW$2185      .dwtag  DW_TAG_member
   16138                      .dwattr $C$DW$2185, DW_AT_type(*$C$DW$T$23)
   16139                      .dwattr $C$DW$2185, DW_AT_name("ADCCTL1")
   16140                      .dwattr $C$DW$2185, DW_AT_TI_symbol_name("_ADCCTL1")
   16141                      .dwattr $C$DW$2185, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
   16142                      .dwattr $C$DW$2185, DW_AT_accessibility(DW_ACCESS_public)
   16143              
   16144              $C$DW$2186      .dwtag  DW_TAG_member
   16145                      .dwattr $C$DW$2186, DW_AT_type(*$C$DW$T$23)
   16146                      .dwattr $C$DW$2186, DW_AT_name("ADCCTL2")
   16147                      .dwattr $C$DW$2186, DW_AT_TI_symbol_name("_ADCCTL2")
   16148                      .dwattr $C$DW$2186, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
   16149                      .dwattr $C$DW$2186, DW_AT_accessibility(DW_ACCESS_public)
   16150              
   16151              $C$DW$2187      .dwtag  DW_TAG_member
   16152                      .dwattr $C$DW$2187, DW_AT_type(*$C$DW$T$26)
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{21AA29C7-F98B-4F4A-BDE6-D80B9CD4CCAC} PAGE  306

   16153                      .dwattr $C$DW$2187, DW_AT_name("rsvd_2")
   16154                      .dwattr $C$DW$2187, DW_AT_TI_symbol_name("_rsvd_2")
   16155                      .dwattr $C$DW$2187, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
   16156                      .dwattr $C$DW$2187, DW_AT_accessibility(DW_ACCESS_public)
   16157              
   16158              $C$DW$2188      .dwtag  DW_TAG_member
   16159                      .dwattr $C$DW$2188, DW_AT_type(*$C$DW$T$23)
   16160                      .dwattr $C$DW$2188, DW_AT_name("ADCINTFLG")
   16161                      .dwattr $C$DW$2188, DW_AT_TI_symbol_name("_ADCINTFLG")
   16162                      .dwattr $C$DW$2188, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
   16163                      .dwattr $C$DW$2188, DW_AT_accessibility(DW_ACCESS_public)
   16164              
   16165              $C$DW$2189      .dwtag  DW_TAG_member
   16166                      .dwattr $C$DW$2189, DW_AT_type(*$C$DW$T$23)
   16167                      .dwattr $C$DW$2189, DW_AT_name("ADCINTFLGCLR")
   16168                      .dwattr $C$DW$2189, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
   16169                      .dwattr $C$DW$2189, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
   16170                      .dwattr $C$DW$2189, DW_AT_accessibility(DW_ACCESS_public)
   16171              
   16172              $C$DW$2190      .dwtag  DW_TAG_member
   16173                      .dwattr $C$DW$2190, DW_AT_type(*$C$DW$T$23)
   16174                      .dwattr $C$DW$2190, DW_AT_name("ADCINTOVF")
   16175                      .dwattr $C$DW$2190, DW_AT_TI_symbol_name("_ADCINTOVF")
   16176                      .dwattr $C$DW$2190, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
   16177                      .dwattr $C$DW$2190, DW_AT_accessibility(DW_ACCESS_public)
   16178              
   16179              $C$DW$2191      .dwtag  DW_TAG_member
   16180                      .dwattr $C$DW$2191, DW_AT_type(*$C$DW$T$23)
   16181                      .dwattr $C$DW$2191, DW_AT_name("ADCINTOVFCLR")
   16182                      .dwattr $C$DW$2191, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
   16183                      .dwattr $C$DW$2191, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
   16184                      .dwattr $C$DW$2191, DW_AT_accessibility(DW_ACCESS_public)
   16185              
   16186              $C$DW$2192      .dwtag  DW_TAG_member
   16187                      .dwattr $C$DW$2192, DW_AT_type(*$C$DW$T$27)
   16188                      .dwattr $C$DW$2192, DW_AT_name("INTSELxNy")
   16189                      .dwattr $C$DW$2192, DW_AT_TI_symbol_name("_INTSELxNy")
   16190                      .dwattr $C$DW$2192, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
   16191                      .dwattr $C$DW$2192, DW_AT_accessibility(DW_ACCESS_public)
   16192              
   16193              $C$DW$2193      .dwtag  DW_TAG_member
   16194                      .dwattr $C$DW$2193, DW_AT_type(*$C$DW$T$28)
   16195                      .dwattr $C$DW$2193, DW_AT_name("rsvd_3")
   16196                      .dwattr $C$DW$2193, DW_AT_TI_symbol_name("_rsvd_3")
   16197                      .dwattr $C$DW$2193, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
   16198                      .dwattr $C$DW$2193, DW_AT_accessibility(DW_ACCESS_public)
   16199              
   16200              $C$DW$2194      .dwtag  DW_TAG_member
   16201                      .dwattr $C$DW$2194, DW_AT_type(*$C$DW$T$23)
   16202                      .dwattr $C$DW$2194, DW_AT_name("SOCPRICTRL")
   16203                      .dwattr $C$DW$2194, DW_AT_TI_symbol_name("_SOCPRICTRL")
   16204                      .dwattr $C$DW$2194, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
   16205                      .dwattr $C$DW$2194, DW_AT_accessibility(DW_ACCESS_public)
   16206              
   16207              $C$DW$2195      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{21AA29C7-F98B-4F4A-BDE6-D80B9CD4CCAC} PAGE  307

   16208                      .dwattr $C$DW$2195, DW_AT_type(*$C$DW$T$23)
   16209                      .dwattr $C$DW$2195, DW_AT_name("rsvd_4")
   16210                      .dwattr $C$DW$2195, DW_AT_TI_symbol_name("_rsvd_4")
   16211                      .dwattr $C$DW$2195, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
   16212                      .dwattr $C$DW$2195, DW_AT_accessibility(DW_ACCESS_public)
   16213              
   16214              $C$DW$2196      .dwtag  DW_TAG_member
   16215                      .dwattr $C$DW$2196, DW_AT_type(*$C$DW$T$23)
   16216                      .dwattr $C$DW$2196, DW_AT_name("ADCSAMPLEMODE")
   16217                      .dwattr $C$DW$2196, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
   16218                      .dwattr $C$DW$2196, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
   16219                      .dwattr $C$DW$2196, DW_AT_accessibility(DW_ACCESS_public)
   16220              
   16221              $C$DW$2197      .dwtag  DW_TAG_member
   16222                      .dwattr $C$DW$2197, DW_AT_type(*$C$DW$T$23)
   16223                      .dwattr $C$DW$2197, DW_AT_name("rsvd_5")
   16224                      .dwattr $C$DW$2197, DW_AT_TI_symbol_name("_rsvd_5")
   16225                      .dwattr $C$DW$2197, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
   16226                      .dwattr $C$DW$2197, DW_AT_accessibility(DW_ACCESS_public)
   16227              
   16228              $C$DW$2198      .dwtag  DW_TAG_member
   16229                      .dwattr $C$DW$2198, DW_AT_type(*$C$DW$T$23)
   16230                      .dwattr $C$DW$2198, DW_AT_name("ADCINTSOCSEL1")
   16231                      .dwattr $C$DW$2198, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
   16232                      .dwattr $C$DW$2198, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
   16233                      .dwattr $C$DW$2198, DW_AT_accessibility(DW_ACCESS_public)
   16234              
   16235              $C$DW$2199      .dwtag  DW_TAG_member
   16236                      .dwattr $C$DW$2199, DW_AT_type(*$C$DW$T$23)
   16237                      .dwattr $C$DW$2199, DW_AT_name("ADCINTSOCSEL2")
   16238                      .dwattr $C$DW$2199, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
   16239                      .dwattr $C$DW$2199, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
   16240                      .dwattr $C$DW$2199, DW_AT_accessibility(DW_ACCESS_public)
   16241              
   16242              $C$DW$2200      .dwtag  DW_TAG_member
   16243                      .dwattr $C$DW$2200, DW_AT_type(*$C$DW$T$26)
   16244                      .dwattr $C$DW$2200, DW_AT_name("rsvd_6")
   16245                      .dwattr $C$DW$2200, DW_AT_TI_symbol_name("_rsvd_6")
   16246                      .dwattr $C$DW$2200, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
   16247                      .dwattr $C$DW$2200, DW_AT_accessibility(DW_ACCESS_public)
   16248              
   16249              $C$DW$2201      .dwtag  DW_TAG_member
   16250                      .dwattr $C$DW$2201, DW_AT_type(*$C$DW$T$23)
   16251                      .dwattr $C$DW$2201, DW_AT_name("ADCSOCFLG1")
   16252                      .dwattr $C$DW$2201, DW_AT_TI_symbol_name("_ADCSOCFLG1")
   16253                      .dwattr $C$DW$2201, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
   16254                      .dwattr $C$DW$2201, DW_AT_accessibility(DW_ACCESS_public)
   16255              
   16256              $C$DW$2202      .dwtag  DW_TAG_member
   16257                      .dwattr $C$DW$2202, DW_AT_type(*$C$DW$T$23)
   16258                      .dwattr $C$DW$2202, DW_AT_name("rsvd_7")
   16259                      .dwattr $C$DW$2202, DW_AT_TI_symbol_name("_rsvd_7")
   16260                      .dwattr $C$DW$2202, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   16261                      .dwattr $C$DW$2202, DW_AT_accessibility(DW_ACCESS_public)
   16262              
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{21AA29C7-F98B-4F4A-BDE6-D80B9CD4CCAC} PAGE  308

   16263              $C$DW$2203      .dwtag  DW_TAG_member
   16264                      .dwattr $C$DW$2203, DW_AT_type(*$C$DW$T$23)
   16265                      .dwattr $C$DW$2203, DW_AT_name("ADCSOCFRC1")
   16266                      .dwattr $C$DW$2203, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   16267                      .dwattr $C$DW$2203, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   16268                      .dwattr $C$DW$2203, DW_AT_accessibility(DW_ACCESS_public)
   16269              
   16270              $C$DW$2204      .dwtag  DW_TAG_member
   16271                      .dwattr $C$DW$2204, DW_AT_type(*$C$DW$T$23)
   16272                      .dwattr $C$DW$2204, DW_AT_name("rsvd_8")
   16273                      .dwattr $C$DW$2204, DW_AT_TI_symbol_name("_rsvd_8")
   16274                      .dwattr $C$DW$2204, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   16275                      .dwattr $C$DW$2204, DW_AT_accessibility(DW_ACCESS_public)
   16276              
   16277              $C$DW$2205      .dwtag  DW_TAG_member
   16278                      .dwattr $C$DW$2205, DW_AT_type(*$C$DW$T$23)
   16279                      .dwattr $C$DW$2205, DW_AT_name("ADCSOCOVF1")
   16280                      .dwattr $C$DW$2205, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   16281                      .dwattr $C$DW$2205, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   16282                      .dwattr $C$DW$2205, DW_AT_accessibility(DW_ACCESS_public)
   16283              
   16284              $C$DW$2206      .dwtag  DW_TAG_member
   16285                      .dwattr $C$DW$2206, DW_AT_type(*$C$DW$T$23)
   16286                      .dwattr $C$DW$2206, DW_AT_name("rsvd_9")
   16287                      .dwattr $C$DW$2206, DW_AT_TI_symbol_name("_rsvd_9")
   16288                      .dwattr $C$DW$2206, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
   16289                      .dwattr $C$DW$2206, DW_AT_accessibility(DW_ACCESS_public)
   16290              
   16291              $C$DW$2207      .dwtag  DW_TAG_member
   16292                      .dwattr $C$DW$2207, DW_AT_type(*$C$DW$T$23)
   16293                      .dwattr $C$DW$2207, DW_AT_name("ADCSOCOVFCLR1")
   16294                      .dwattr $C$DW$2207, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
   16295                      .dwattr $C$DW$2207, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
   16296                      .dwattr $C$DW$2207, DW_AT_accessibility(DW_ACCESS_public)
   16297              
   16298              $C$DW$2208      .dwtag  DW_TAG_member
   16299                      .dwattr $C$DW$2208, DW_AT_type(*$C$DW$T$23)
   16300                      .dwattr $C$DW$2208, DW_AT_name("rsvd_10")
   16301                      .dwattr $C$DW$2208, DW_AT_TI_symbol_name("_rsvd_10")
   16302                      .dwattr $C$DW$2208, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   16303                      .dwattr $C$DW$2208, DW_AT_accessibility(DW_ACCESS_public)
   16304              
   16305              $C$DW$2209      .dwtag  DW_TAG_member
   16306                      .dwattr $C$DW$2209, DW_AT_type(*$C$DW$T$24)
   16307                      .dwattr $C$DW$2209, DW_AT_name("ADCSOCxCTL")
   16308                      .dwattr $C$DW$2209, DW_AT_TI_symbol_name("_ADCSOCxCTL")
   16309                      .dwattr $C$DW$2209, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   16310                      .dwattr $C$DW$2209, DW_AT_accessibility(DW_ACCESS_public)
   16311              
   16312              $C$DW$2210      .dwtag  DW_TAG_member
   16313                      .dwattr $C$DW$2210, DW_AT_type(*$C$DW$T$24)
   16314                      .dwattr $C$DW$2210, DW_AT_name("rsvd_11")
   16315                      .dwattr $C$DW$2210, DW_AT_TI_symbol_name("_rsvd_11")
   16316                      .dwattr $C$DW$2210, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   16317                      .dwattr $C$DW$2210, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{21AA29C7-F98B-4F4A-BDE6-D80B9CD4CCAC} PAGE  309

   16318              
   16319              $C$DW$2211      .dwtag  DW_TAG_member
   16320                      .dwattr $C$DW$2211, DW_AT_type(*$C$DW$T$23)
   16321                      .dwattr $C$DW$2211, DW_AT_name("ADCREFTRIM")
   16322                      .dwattr $C$DW$2211, DW_AT_TI_symbol_name("_ADCREFTRIM")
   16323                      .dwattr $C$DW$2211, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   16324                      .dwattr $C$DW$2211, DW_AT_accessibility(DW_ACCESS_public)
   16325              
   16326              $C$DW$2212      .dwtag  DW_TAG_member
   16327                      .dwattr $C$DW$2212, DW_AT_type(*$C$DW$T$23)
   16328                      .dwattr $C$DW$2212, DW_AT_name("ADCOFFTRIM")
   16329                      .dwattr $C$DW$2212, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   16330                      .dwattr $C$DW$2212, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   16331                      .dwattr $C$DW$2212, DW_AT_accessibility(DW_ACCESS_public)
   16332              
   16333              $C$DW$2213      .dwtag  DW_TAG_member
   16334                      .dwattr $C$DW$2213, DW_AT_type(*$C$DW$T$29)
   16335                      .dwattr $C$DW$2213, DW_AT_name("resvd_12")
   16336                      .dwattr $C$DW$2213, DW_AT_TI_symbol_name("_resvd_12")
   16337                      .dwattr $C$DW$2213, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   16338                      .dwattr $C$DW$2213, DW_AT_accessibility(DW_ACCESS_public)
   16339              
   16340              $C$DW$2214      .dwtag  DW_TAG_member
   16341                      .dwattr $C$DW$2214, DW_AT_type(*$C$DW$T$23)
   16342                      .dwattr $C$DW$2214, DW_AT_name("ADCREV")
   16343                      .dwattr $C$DW$2214, DW_AT_TI_symbol_name("_ADCREV")
   16344                      .dwattr $C$DW$2214, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   16345                      .dwattr $C$DW$2214, DW_AT_accessibility(DW_ACCESS_public)
   16346              
   16347                      .dwendtag $C$DW$T$30
   16348              
   16349              $C$DW$T$358     .dwtag  DW_TAG_typedef
   16350                      .dwattr $C$DW$T$358, DW_AT_name("ADC_Obj")
   16351                      .dwattr $C$DW$T$358, DW_AT_type(*$C$DW$T$30)
   16352                      .dwattr $C$DW$T$358, DW_AT_language(DW_LANG_C)
   16353              
   16354              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
   16355                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$30)
   16356                      .dwattr $C$DW$T$88, DW_AT_address_class(0x20)
   16357              
   16358              $C$DW$T$89      .dwtag  DW_TAG_typedef
   16359                      .dwattr $C$DW$T$89, DW_AT_name("ADC_Handle")
   16360                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
   16361                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
   16362              
   16363              
   16364              $C$DW$T$32      .dwtag  DW_TAG_structure_type
   16365                      .dwattr $C$DW$T$32, DW_AT_name("_CLK_Obj_")
   16366                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x11)
   16367              $C$DW$2215      .dwtag  DW_TAG_member
   16368                      .dwattr $C$DW$2215, DW_AT_type(*$C$DW$T$23)
   16369                      .dwattr $C$DW$2215, DW_AT_name("XCLK")
   16370                      .dwattr $C$DW$2215, DW_AT_TI_symbol_name("_XCLK")
   16371                      .dwattr $C$DW$2215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16372                      .dwattr $C$DW$2215, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{21AA29C7-F98B-4F4A-BDE6-D80B9CD4CCAC} PAGE  310

   16373              
   16374              $C$DW$2216      .dwtag  DW_TAG_member
   16375                      .dwattr $C$DW$2216, DW_AT_type(*$C$DW$T$23)
   16376                      .dwattr $C$DW$2216, DW_AT_name("rsvd_1")
   16377                      .dwattr $C$DW$2216, DW_AT_TI_symbol_name("_rsvd_1")
   16378                      .dwattr $C$DW$2216, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16379                      .dwattr $C$DW$2216, DW_AT_accessibility(DW_ACCESS_public)
   16380              
   16381              $C$DW$2217      .dwtag  DW_TAG_member
   16382                      .dwattr $C$DW$2217, DW_AT_type(*$C$DW$T$23)
   16383                      .dwattr $C$DW$2217, DW_AT_name("CLKCTL")
   16384                      .dwattr $C$DW$2217, DW_AT_TI_symbol_name("_CLKCTL")
   16385                      .dwattr $C$DW$2217, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16386                      .dwattr $C$DW$2217, DW_AT_accessibility(DW_ACCESS_public)
   16387              
   16388              $C$DW$2218      .dwtag  DW_TAG_member
   16389                      .dwattr $C$DW$2218, DW_AT_type(*$C$DW$T$31)
   16390                      .dwattr $C$DW$2218, DW_AT_name("rsvd_2")
   16391                      .dwattr $C$DW$2218, DW_AT_TI_symbol_name("_rsvd_2")
   16392                      .dwattr $C$DW$2218, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   16393                      .dwattr $C$DW$2218, DW_AT_accessibility(DW_ACCESS_public)
   16394              
   16395              $C$DW$2219      .dwtag  DW_TAG_member
   16396                      .dwattr $C$DW$2219, DW_AT_type(*$C$DW$T$23)
   16397                      .dwattr $C$DW$2219, DW_AT_name("LOSPCP")
   16398                      .dwattr $C$DW$2219, DW_AT_TI_symbol_name("_LOSPCP")
   16399                      .dwattr $C$DW$2219, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   16400                      .dwattr $C$DW$2219, DW_AT_accessibility(DW_ACCESS_public)
   16401              
   16402              $C$DW$2220      .dwtag  DW_TAG_member
   16403                      .dwattr $C$DW$2220, DW_AT_type(*$C$DW$T$23)
   16404                      .dwattr $C$DW$2220, DW_AT_name("PCLKCR0")
   16405                      .dwattr $C$DW$2220, DW_AT_TI_symbol_name("_PCLKCR0")
   16406                      .dwattr $C$DW$2220, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   16407                      .dwattr $C$DW$2220, DW_AT_accessibility(DW_ACCESS_public)
   16408              
   16409              $C$DW$2221      .dwtag  DW_TAG_member
   16410                      .dwattr $C$DW$2221, DW_AT_type(*$C$DW$T$23)
   16411                      .dwattr $C$DW$2221, DW_AT_name("PCLKCR1")
   16412                      .dwattr $C$DW$2221, DW_AT_TI_symbol_name("_PCLKCR1")
   16413                      .dwattr $C$DW$2221, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   16414                      .dwattr $C$DW$2221, DW_AT_accessibility(DW_ACCESS_public)
   16415              
   16416              $C$DW$2222      .dwtag  DW_TAG_member
   16417                      .dwattr $C$DW$2222, DW_AT_type(*$C$DW$T$26)
   16418                      .dwattr $C$DW$2222, DW_AT_name("rsvd_3")
   16419                      .dwattr $C$DW$2222, DW_AT_TI_symbol_name("_rsvd_3")
   16420                      .dwattr $C$DW$2222, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   16421                      .dwattr $C$DW$2222, DW_AT_accessibility(DW_ACCESS_public)
   16422              
   16423              $C$DW$2223      .dwtag  DW_TAG_member
   16424                      .dwattr $C$DW$2223, DW_AT_type(*$C$DW$T$23)
   16425                      .dwattr $C$DW$2223, DW_AT_name("PCLKCR3")
   16426                      .dwattr $C$DW$2223, DW_AT_TI_symbol_name("_PCLKCR3")
   16427                      .dwattr $C$DW$2223, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{21AA29C7-F98B-4F4A-BDE6-D80B9CD4CCAC} PAGE  311

   16428                      .dwattr $C$DW$2223, DW_AT_accessibility(DW_ACCESS_public)
   16429              
   16430                      .dwendtag $C$DW$T$32
   16431              
   16432              $C$DW$T$90      .dwtag  DW_TAG_pointer_type
   16433                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$32)
   16434                      .dwattr $C$DW$T$90, DW_AT_address_class(0x20)
   16435              
   16436              $C$DW$T$91      .dwtag  DW_TAG_typedef
   16437                      .dwattr $C$DW$T$91, DW_AT_name("CLK_Handle")
   16438                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
   16439                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
   16440              
   16441              
   16442              $C$DW$T$35      .dwtag  DW_TAG_structure_type
   16443                      .dwattr $C$DW$T$35, DW_AT_name("_CPU_Obj_")
   16444                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
   16445              $C$DW$2224      .dwtag  DW_TAG_member
   16446                      .dwattr $C$DW$2224, DW_AT_type(*$C$DW$T$34)
   16447                      .dwattr $C$DW$2224, DW_AT_name("tmp")
   16448                      .dwattr $C$DW$2224, DW_AT_TI_symbol_name("_tmp")
   16449                      .dwattr $C$DW$2224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16450                      .dwattr $C$DW$2224, DW_AT_accessibility(DW_ACCESS_public)
   16451              
   16452                      .dwendtag $C$DW$T$35
   16453              
   16454              $C$DW$T$367     .dwtag  DW_TAG_typedef
   16455                      .dwattr $C$DW$T$367, DW_AT_name("CPU_Obj")
   16456                      .dwattr $C$DW$T$367, DW_AT_type(*$C$DW$T$35)
   16457                      .dwattr $C$DW$T$367, DW_AT_language(DW_LANG_C)
   16458              
   16459              $C$DW$T$92      .dwtag  DW_TAG_pointer_type
   16460                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$35)
   16461                      .dwattr $C$DW$T$92, DW_AT_address_class(0x20)
   16462              
   16463              $C$DW$T$93      .dwtag  DW_TAG_typedef
   16464                      .dwattr $C$DW$T$93, DW_AT_name("CPU_Handle")
   16465                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
   16466                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
   16467              
   16468              
   16469              $C$DW$T$43      .dwtag  DW_TAG_structure_type
   16470                      .dwattr $C$DW$T$43, DW_AT_name("_DRV8301_Obj_")
   16471                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x08)
   16472              $C$DW$2225      .dwtag  DW_TAG_member
   16473                      .dwattr $C$DW$2225, DW_AT_type(*$C$DW$T$37)
   16474                      .dwattr $C$DW$2225, DW_AT_name("spiHandle")
   16475                      .dwattr $C$DW$2225, DW_AT_TI_symbol_name("_spiHandle")
   16476                      .dwattr $C$DW$2225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16477                      .dwattr $C$DW$2225, DW_AT_accessibility(DW_ACCESS_public)
   16478              
   16479              $C$DW$2226      .dwtag  DW_TAG_member
   16480                      .dwattr $C$DW$2226, DW_AT_type(*$C$DW$T$39)
   16481                      .dwattr $C$DW$2226, DW_AT_name("gpioHandle")
   16482                      .dwattr $C$DW$2226, DW_AT_TI_symbol_name("_gpioHandle")
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{21AA29C7-F98B-4F4A-BDE6-D80B9CD4CCAC} PAGE  312

   16483                      .dwattr $C$DW$2226, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16484                      .dwattr $C$DW$2226, DW_AT_accessibility(DW_ACCESS_public)
   16485              
   16486              $C$DW$2227      .dwtag  DW_TAG_member
   16487                      .dwattr $C$DW$2227, DW_AT_type(*$C$DW$T$41)
   16488                      .dwattr $C$DW$2227, DW_AT_name("gpioNumber")
   16489                      .dwattr $C$DW$2227, DW_AT_TI_symbol_name("_gpioNumber")
   16490                      .dwattr $C$DW$2227, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16491                      .dwattr $C$DW$2227, DW_AT_accessibility(DW_ACCESS_public)
   16492              
   16493              $C$DW$2228      .dwtag  DW_TAG_member
   16494                      .dwattr $C$DW$2228, DW_AT_type(*$C$DW$T$42)
   16495                      .dwattr $C$DW$2228, DW_AT_name("RxTimeOut")
   16496                      .dwattr $C$DW$2228, DW_AT_TI_symbol_name("_RxTimeOut")
   16497                      .dwattr $C$DW$2228, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   16498                      .dwattr $C$DW$2228, DW_AT_accessibility(DW_ACCESS_public)
   16499              
   16500              $C$DW$2229      .dwtag  DW_TAG_member
   16501                      .dwattr $C$DW$2229, DW_AT_type(*$C$DW$T$42)
   16502                      .dwattr $C$DW$2229, DW_AT_name("enableTimeOut")
   16503                      .dwattr $C$DW$2229, DW_AT_TI_symbol_name("_enableTimeOut")
   16504                      .dwattr $C$DW$2229, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   16505                      .dwattr $C$DW$2229, DW_AT_accessibility(DW_ACCESS_public)
   16506              
   16507                      .dwendtag $C$DW$T$43
   16508              
   16509              $C$DW$T$120     .dwtag  DW_TAG_typedef
   16510                      .dwattr $C$DW$T$120, DW_AT_name("DRV8301_Obj")
   16511                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$43)
   16512                      .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
   16513              
   16514              $C$DW$T$118     .dwtag  DW_TAG_pointer_type
   16515                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$43)
   16516                      .dwattr $C$DW$T$118, DW_AT_address_class(0x20)
   16517              
   16518              $C$DW$T$119     .dwtag  DW_TAG_typedef
   16519                      .dwattr $C$DW$T$119, DW_AT_name("DRV8301_Handle")
   16520                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
   16521                      .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
   16522              
   16523              
   16524              $C$DW$T$54      .dwtag  DW_TAG_structure_type
   16525                      .dwattr $C$DW$T$54, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
   16526                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x05)
   16527              $C$DW$2230      .dwtag  DW_TAG_member
   16528                      .dwattr $C$DW$2230, DW_AT_type(*$C$DW$T$45)
   16529                      .dwattr $C$DW$2230, DW_AT_name("DRV8301_CURRENT")
   16530                      .dwattr $C$DW$2230, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
   16531                      .dwattr $C$DW$2230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16532                      .dwattr $C$DW$2230, DW_AT_accessibility(DW_ACCESS_public)
   16533              
   16534              $C$DW$2231      .dwtag  DW_TAG_member
   16535                      .dwattr $C$DW$2231, DW_AT_type(*$C$DW$T$47)
   16536                      .dwattr $C$DW$2231, DW_AT_name("DRV8301_RESET")
   16537                      .dwattr $C$DW$2231, DW_AT_TI_symbol_name("_DRV8301_RESET")
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{21AA29C7-F98B-4F4A-BDE6-D80B9CD4CCAC} PAGE  313

   16538                      .dwattr $C$DW$2231, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16539                      .dwattr $C$DW$2231, DW_AT_accessibility(DW_ACCESS_public)
   16540              
   16541              $C$DW$2232      .dwtag  DW_TAG_member
   16542                      .dwattr $C$DW$2232, DW_AT_type(*$C$DW$T$49)
   16543                      .dwattr $C$DW$2232, DW_AT_name("PWM_MODE")
   16544                      .dwattr $C$DW$2232, DW_AT_TI_symbol_name("_PWM_MODE")
   16545                      .dwattr $C$DW$2232, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16546                      .dwattr $C$DW$2232, DW_AT_accessibility(DW_ACCESS_public)
   16547              
   16548              $C$DW$2233      .dwtag  DW_TAG_member
   16549                      .dwattr $C$DW$2233, DW_AT_type(*$C$DW$T$51)
   16550                      .dwattr $C$DW$2233, DW_AT_name("OC_MODE")
   16551                      .dwattr $C$DW$2233, DW_AT_TI_symbol_name("_OC_MODE")
   16552                      .dwattr $C$DW$2233, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   16553                      .dwattr $C$DW$2233, DW_AT_accessibility(DW_ACCESS_public)
   16554              
   16555              $C$DW$2234      .dwtag  DW_TAG_member
   16556                      .dwattr $C$DW$2234, DW_AT_type(*$C$DW$T$53)
   16557                      .dwattr $C$DW$2234, DW_AT_name("OC_ADJ_SET")
   16558                      .dwattr $C$DW$2234, DW_AT_TI_symbol_name("_OC_ADJ_SET")
   16559                      .dwattr $C$DW$2234, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16560                      .dwattr $C$DW$2234, DW_AT_accessibility(DW_ACCESS_public)
   16561              
   16562                      .dwendtag $C$DW$T$54
   16563              
   16564              $C$DW$T$68      .dwtag  DW_TAG_typedef
   16565                      .dwattr $C$DW$T$68, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
   16566                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$54)
   16567                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
   16568              
   16569              
   16570              $C$DW$T$63      .dwtag  DW_TAG_structure_type
   16571                      .dwattr $C$DW$T$63, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
   16572                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
   16573              $C$DW$2235      .dwtag  DW_TAG_member
   16574                      .dwattr $C$DW$2235, DW_AT_type(*$C$DW$T$56)
   16575                      .dwattr $C$DW$2235, DW_AT_name("OCTW_SET")
   16576                      .dwattr $C$DW$2235, DW_AT_TI_symbol_name("_OCTW_SET")
   16577                      .dwattr $C$DW$2235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16578                      .dwattr $C$DW$2235, DW_AT_accessibility(DW_ACCESS_public)
   16579              
   16580              $C$DW$2236      .dwtag  DW_TAG_member
   16581                      .dwattr $C$DW$2236, DW_AT_type(*$C$DW$T$58)
   16582                      .dwattr $C$DW$2236, DW_AT_name("GAIN")
   16583                      .dwattr $C$DW$2236, DW_AT_TI_symbol_name("_GAIN")
   16584                      .dwattr $C$DW$2236, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16585                      .dwattr $C$DW$2236, DW_AT_accessibility(DW_ACCESS_public)
   16586              
   16587              $C$DW$2237      .dwtag  DW_TAG_member
   16588                      .dwattr $C$DW$2237, DW_AT_type(*$C$DW$T$60)
   16589                      .dwattr $C$DW$2237, DW_AT_name("DC_CAL_CH1p2")
   16590                      .dwattr $C$DW$2237, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
   16591                      .dwattr $C$DW$2237, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16592                      .dwattr $C$DW$2237, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{21AA29C7-F98B-4F4A-BDE6-D80B9CD4CCAC} PAGE  314

   16593              
   16594              $C$DW$2238      .dwtag  DW_TAG_member
   16595                      .dwattr $C$DW$2238, DW_AT_type(*$C$DW$T$62)
   16596                      .dwattr $C$DW$2238, DW_AT_name("OC_TOFF")
   16597                      .dwattr $C$DW$2238, DW_AT_TI_symbol_name("_OC_TOFF")
   16598                      .dwattr $C$DW$2238, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   16599                      .dwattr $C$DW$2238, DW_AT_accessibility(DW_ACCESS_public)
   16600              
   16601                      .dwendtag $C$DW$T$63
   16602              
   16603              $C$DW$T$69      .dwtag  DW_TAG_typedef
   16604                      .dwattr $C$DW$T$69, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
   16605                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$63)
   16606                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
   16607              
   16608              
   16609              $C$DW$T$64      .dwtag  DW_TAG_structure_type
   16610                      .dwattr $C$DW$T$64, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
   16611                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x0b)
   16612              $C$DW$2239      .dwtag  DW_TAG_member
   16613                      .dwattr $C$DW$2239, DW_AT_type(*$C$DW$T$42)
   16614                      .dwattr $C$DW$2239, DW_AT_name("FAULT")
   16615                      .dwattr $C$DW$2239, DW_AT_TI_symbol_name("_FAULT")
   16616                      .dwattr $C$DW$2239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16617                      .dwattr $C$DW$2239, DW_AT_accessibility(DW_ACCESS_public)
   16618              
   16619              $C$DW$2240      .dwtag  DW_TAG_member
   16620                      .dwattr $C$DW$2240, DW_AT_type(*$C$DW$T$42)
   16621                      .dwattr $C$DW$2240, DW_AT_name("GVDD_UV")
   16622                      .dwattr $C$DW$2240, DW_AT_TI_symbol_name("_GVDD_UV")
   16623                      .dwattr $C$DW$2240, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16624                      .dwattr $C$DW$2240, DW_AT_accessibility(DW_ACCESS_public)
   16625              
   16626              $C$DW$2241      .dwtag  DW_TAG_member
   16627                      .dwattr $C$DW$2241, DW_AT_type(*$C$DW$T$42)
   16628                      .dwattr $C$DW$2241, DW_AT_name("PVDD_UV")
   16629                      .dwattr $C$DW$2241, DW_AT_TI_symbol_name("_PVDD_UV")
   16630                      .dwattr $C$DW$2241, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16631                      .dwattr $C$DW$2241, DW_AT_accessibility(DW_ACCESS_public)
   16632              
   16633              $C$DW$2242      .dwtag  DW_TAG_member
   16634                      .dwattr $C$DW$2242, DW_AT_type(*$C$DW$T$42)
   16635                      .dwattr $C$DW$2242, DW_AT_name("OTSD")
   16636                      .dwattr $C$DW$2242, DW_AT_TI_symbol_name("_OTSD")
   16637                      .dwattr $C$DW$2242, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   16638                      .dwattr $C$DW$2242, DW_AT_accessibility(DW_ACCESS_public)
   16639              
   16640              $C$DW$2243      .dwtag  DW_TAG_member
   16641                      .dwattr $C$DW$2243, DW_AT_type(*$C$DW$T$42)
   16642                      .dwattr $C$DW$2243, DW_AT_name("OTW")
   16643                      .dwattr $C$DW$2243, DW_AT_TI_symbol_name("_OTW")
   16644                      .dwattr $C$DW$2243, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16645                      .dwattr $C$DW$2243, DW_AT_accessibility(DW_ACCESS_public)
   16646              
   16647              $C$DW$2244      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{21AA29C7-F98B-4F4A-BDE6-D80B9CD4CCAC} PAGE  315

   16648                      .dwattr $C$DW$2244, DW_AT_type(*$C$DW$T$42)
   16649                      .dwattr $C$DW$2244, DW_AT_name("FETHA_OC")
   16650                      .dwattr $C$DW$2244, DW_AT_TI_symbol_name("_FETHA_OC")
   16651                      .dwattr $C$DW$2244, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   16652                      .dwattr $C$DW$2244, DW_AT_accessibility(DW_ACCESS_public)
   16653              
   16654              $C$DW$2245      .dwtag  DW_TAG_member
   16655                      .dwattr $C$DW$2245, DW_AT_type(*$C$DW$T$42)
   16656                      .dwattr $C$DW$2245, DW_AT_name("FETLA_OC")
   16657                      .dwattr $C$DW$2245, DW_AT_TI_symbol_name("_FETLA_OC")
   16658                      .dwattr $C$DW$2245, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   16659                      .dwattr $C$DW$2245, DW_AT_accessibility(DW_ACCESS_public)
   16660              
   16661              $C$DW$2246      .dwtag  DW_TAG_member
   16662                      .dwattr $C$DW$2246, DW_AT_type(*$C$DW$T$42)
   16663                      .dwattr $C$DW$2246, DW_AT_name("FETHB_OC")
   16664                      .dwattr $C$DW$2246, DW_AT_TI_symbol_name("_FETHB_OC")
   16665                      .dwattr $C$DW$2246, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   16666                      .dwattr $C$DW$2246, DW_AT_accessibility(DW_ACCESS_public)
   16667              
   16668              $C$DW$2247      .dwtag  DW_TAG_member
   16669                      .dwattr $C$DW$2247, DW_AT_type(*$C$DW$T$42)
   16670                      .dwattr $C$DW$2247, DW_AT_name("FETLB_OC")
   16671                      .dwattr $C$DW$2247, DW_AT_TI_symbol_name("_FETLB_OC")
   16672                      .dwattr $C$DW$2247, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   16673                      .dwattr $C$DW$2247, DW_AT_accessibility(DW_ACCESS_public)
   16674              
   16675              $C$DW$2248      .dwtag  DW_TAG_member
   16676                      .dwattr $C$DW$2248, DW_AT_type(*$C$DW$T$42)
   16677                      .dwattr $C$DW$2248, DW_AT_name("FETHC_OC")
   16678                      .dwattr $C$DW$2248, DW_AT_TI_symbol_name("_FETHC_OC")
   16679                      .dwattr $C$DW$2248, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   16680                      .dwattr $C$DW$2248, DW_AT_accessibility(DW_ACCESS_public)
   16681              
   16682              $C$DW$2249      .dwtag  DW_TAG_member
   16683                      .dwattr $C$DW$2249, DW_AT_type(*$C$DW$T$42)
   16684                      .dwattr $C$DW$2249, DW_AT_name("FETLC_OC")
   16685                      .dwattr $C$DW$2249, DW_AT_TI_symbol_name("_FETLC_OC")
   16686                      .dwattr $C$DW$2249, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   16687                      .dwattr $C$DW$2249, DW_AT_accessibility(DW_ACCESS_public)
   16688              
   16689                      .dwendtag $C$DW$T$64
   16690              
   16691              $C$DW$T$66      .dwtag  DW_TAG_typedef
   16692                      .dwattr $C$DW$T$66, DW_AT_name("DRV_SPI_8301_Stat1_t_")
   16693                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$64)
   16694                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
   16695              
   16696              
   16697              $C$DW$T$65      .dwtag  DW_TAG_structure_type
   16698                      .dwattr $C$DW$T$65, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
   16699                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x02)
   16700              $C$DW$2250      .dwtag  DW_TAG_member
   16701                      .dwattr $C$DW$2250, DW_AT_type(*$C$DW$T$42)
   16702                      .dwattr $C$DW$2250, DW_AT_name("GVDD_OV")
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{21AA29C7-F98B-4F4A-BDE6-D80B9CD4CCAC} PAGE  316

   16703                      .dwattr $C$DW$2250, DW_AT_TI_symbol_name("_GVDD_OV")
   16704                      .dwattr $C$DW$2250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16705                      .dwattr $C$DW$2250, DW_AT_accessibility(DW_ACCESS_public)
   16706              
   16707              $C$DW$2251      .dwtag  DW_TAG_member
   16708                      .dwattr $C$DW$2251, DW_AT_type(*$C$DW$T$22)
   16709                      .dwattr $C$DW$2251, DW_AT_name("DeviceID")
   16710                      .dwattr $C$DW$2251, DW_AT_TI_symbol_name("_DeviceID")
   16711                      .dwattr $C$DW$2251, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16712                      .dwattr $C$DW$2251, DW_AT_accessibility(DW_ACCESS_public)
   16713              
   16714                      .dwendtag $C$DW$T$65
   16715              
   16716              $C$DW$T$67      .dwtag  DW_TAG_typedef
   16717                      .dwattr $C$DW$T$67, DW_AT_name("DRV_SPI_8301_Stat2_t_")
   16718                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$65)
   16719                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
   16720              
   16721              
   16722              $C$DW$T$70      .dwtag  DW_TAG_structure_type
   16723                      .dwattr $C$DW$T$70, DW_AT_name("_DRV_SPI_8301_Vars_t_")
   16724                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x18)
   16725              $C$DW$2252      .dwtag  DW_TAG_member
   16726                      .dwattr $C$DW$2252, DW_AT_type(*$C$DW$T$66)
   16727                      .dwattr $C$DW$2252, DW_AT_name("Stat_Reg_1")
   16728                      .dwattr $C$DW$2252, DW_AT_TI_symbol_name("_Stat_Reg_1")
   16729                      .dwattr $C$DW$2252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16730                      .dwattr $C$DW$2252, DW_AT_accessibility(DW_ACCESS_public)
   16731              
   16732              $C$DW$2253      .dwtag  DW_TAG_member
   16733                      .dwattr $C$DW$2253, DW_AT_type(*$C$DW$T$67)
   16734                      .dwattr $C$DW$2253, DW_AT_name("Stat_Reg_2")
   16735                      .dwattr $C$DW$2253, DW_AT_TI_symbol_name("_Stat_Reg_2")
   16736                      .dwattr $C$DW$2253, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   16737                      .dwattr $C$DW$2253, DW_AT_accessibility(DW_ACCESS_public)
   16738              
   16739              $C$DW$2254      .dwtag  DW_TAG_member
   16740                      .dwattr $C$DW$2254, DW_AT_type(*$C$DW$T$68)
   16741                      .dwattr $C$DW$2254, DW_AT_name("Ctrl_Reg_1")
   16742                      .dwattr $C$DW$2254, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
   16743                      .dwattr $C$DW$2254, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   16744                      .dwattr $C$DW$2254, DW_AT_accessibility(DW_ACCESS_public)
   16745              
   16746              $C$DW$2255      .dwtag  DW_TAG_member
   16747                      .dwattr $C$DW$2255, DW_AT_type(*$C$DW$T$69)
   16748                      .dwattr $C$DW$2255, DW_AT_name("Ctrl_Reg_2")
   16749                      .dwattr $C$DW$2255, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
   16750                      .dwattr $C$DW$2255, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   16751                      .dwattr $C$DW$2255, DW_AT_accessibility(DW_ACCESS_public)
   16752              
   16753              $C$DW$2256      .dwtag  DW_TAG_member
   16754                      .dwattr $C$DW$2256, DW_AT_type(*$C$DW$T$42)
   16755                      .dwattr $C$DW$2256, DW_AT_name("SndCmd")
   16756                      .dwattr $C$DW$2256, DW_AT_TI_symbol_name("_SndCmd")
   16757                      .dwattr $C$DW$2256, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{21AA29C7-F98B-4F4A-BDE6-D80B9CD4CCAC} PAGE  317

   16758                      .dwattr $C$DW$2256, DW_AT_accessibility(DW_ACCESS_public)
   16759              
   16760              $C$DW$2257      .dwtag  DW_TAG_member
   16761                      .dwattr $C$DW$2257, DW_AT_type(*$C$DW$T$42)
   16762                      .dwattr $C$DW$2257, DW_AT_name("RcvCmd")
   16763                      .dwattr $C$DW$2257, DW_AT_TI_symbol_name("_RcvCmd")
   16764                      .dwattr $C$DW$2257, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
   16765                      .dwattr $C$DW$2257, DW_AT_accessibility(DW_ACCESS_public)
   16766              
   16767                      .dwendtag $C$DW$T$70
   16768              
   16769              $C$DW$T$374     .dwtag  DW_TAG_typedef
   16770                      .dwattr $C$DW$T$374, DW_AT_name("DRV_SPI_8301_Vars_t")
   16771                      .dwattr $C$DW$T$374, DW_AT_type(*$C$DW$T$70)
   16772                      .dwattr $C$DW$T$374, DW_AT_language(DW_LANG_C)
   16773              
   16774              $C$DW$T$375     .dwtag  DW_TAG_pointer_type
   16775                      .dwattr $C$DW$T$375, DW_AT_type(*$C$DW$T$374)
   16776                      .dwattr $C$DW$T$375, DW_AT_address_class(0x20)
   16777              
   16778              
   16779              $C$DW$T$72      .dwtag  DW_TAG_structure_type
   16780                      .dwattr $C$DW$T$72, DW_AT_name("_FILTER_FO_")
   16781                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x0a)
   16782              $C$DW$2258      .dwtag  DW_TAG_member
   16783                      .dwattr $C$DW$2258, DW_AT_type(*$C$DW$T$71)
   16784                      .dwattr $C$DW$2258, DW_AT_name("a1")
   16785                      .dwattr $C$DW$2258, DW_AT_TI_symbol_name("_a1")
   16786                      .dwattr $C$DW$2258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16787                      .dwattr $C$DW$2258, DW_AT_accessibility(DW_ACCESS_public)
   16788              
   16789              $C$DW$2259      .dwtag  DW_TAG_member
   16790                      .dwattr $C$DW$2259, DW_AT_type(*$C$DW$T$71)
   16791                      .dwattr $C$DW$2259, DW_AT_name("b0")
   16792                      .dwattr $C$DW$2259, DW_AT_TI_symbol_name("_b0")
   16793                      .dwattr $C$DW$2259, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16794                      .dwattr $C$DW$2259, DW_AT_accessibility(DW_ACCESS_public)
   16795              
   16796              $C$DW$2260      .dwtag  DW_TAG_member
   16797                      .dwattr $C$DW$2260, DW_AT_type(*$C$DW$T$71)
   16798                      .dwattr $C$DW$2260, DW_AT_name("b1")
   16799                      .dwattr $C$DW$2260, DW_AT_TI_symbol_name("_b1")
   16800                      .dwattr $C$DW$2260, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16801                      .dwattr $C$DW$2260, DW_AT_accessibility(DW_ACCESS_public)
   16802              
   16803              $C$DW$2261      .dwtag  DW_TAG_member
   16804                      .dwattr $C$DW$2261, DW_AT_type(*$C$DW$T$71)
   16805                      .dwattr $C$DW$2261, DW_AT_name("x1")
   16806                      .dwattr $C$DW$2261, DW_AT_TI_symbol_name("_x1")
   16807                      .dwattr $C$DW$2261, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   16808                      .dwattr $C$DW$2261, DW_AT_accessibility(DW_ACCESS_public)
   16809              
   16810              $C$DW$2262      .dwtag  DW_TAG_member
   16811                      .dwattr $C$DW$2262, DW_AT_type(*$C$DW$T$71)
   16812                      .dwattr $C$DW$2262, DW_AT_name("y1")
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{21AA29C7-F98B-4F4A-BDE6-D80B9CD4CCAC} PAGE  318

   16813                      .dwattr $C$DW$2262, DW_AT_TI_symbol_name("_y1")
   16814                      .dwattr $C$DW$2262, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   16815                      .dwattr $C$DW$2262, DW_AT_accessibility(DW_ACCESS_public)
   16816              
   16817                      .dwendtag $C$DW$T$72
   16818              
   16819              $C$DW$T$126     .dwtag  DW_TAG_typedef
   16820                      .dwattr $C$DW$T$126, DW_AT_name("FILTER_FO_Obj")
   16821                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$72)
   16822                      .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
   16823              
   16824              
   16825              $C$DW$T$19      .dwtag  DW_TAG_structure_type
   16826                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
   16827                      .dwattr $C$DW$T$19, DW_AT_declaration
   16828                      .dwendtag $C$DW$T$19
   16829              
   16830              $C$DW$T$127     .dwtag  DW_TAG_pointer_type
   16831                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$19)
   16832                      .dwattr $C$DW$T$127, DW_AT_address_class(0x20)
   16833              
   16834              $C$DW$T$128     .dwtag  DW_TAG_typedef
   16835                      .dwattr $C$DW$T$128, DW_AT_name("FILTER_FO_Handle")
   16836                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$127)
   16837                      .dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
   16838              
   16839              
   16840              $C$DW$T$73      .dwtag  DW_TAG_structure_type
   16841                      .dwattr $C$DW$T$73, DW_AT_name("_FLASH_Obj_")
   16842                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x08)
   16843              $C$DW$2263      .dwtag  DW_TAG_member
   16844                      .dwattr $C$DW$2263, DW_AT_type(*$C$DW$T$23)
   16845                      .dwattr $C$DW$2263, DW_AT_name("FOPT")
   16846                      .dwattr $C$DW$2263, DW_AT_TI_symbol_name("_FOPT")
   16847                      .dwattr $C$DW$2263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16848                      .dwattr $C$DW$2263, DW_AT_accessibility(DW_ACCESS_public)
   16849              
   16850              $C$DW$2264      .dwtag  DW_TAG_member
   16851                      .dwattr $C$DW$2264, DW_AT_type(*$C$DW$T$23)
   16852                      .dwattr $C$DW$2264, DW_AT_name("rsvd_1")
   16853                      .dwattr $C$DW$2264, DW_AT_TI_symbol_name("_rsvd_1")
   16854                      .dwattr $C$DW$2264, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16855                      .dwattr $C$DW$2264, DW_AT_accessibility(DW_ACCESS_public)
   16856              
   16857              $C$DW$2265      .dwtag  DW_TAG_member
   16858                      .dwattr $C$DW$2265, DW_AT_type(*$C$DW$T$23)
   16859                      .dwattr $C$DW$2265, DW_AT_name("FPWR")
   16860                      .dwattr $C$DW$2265, DW_AT_TI_symbol_name("_FPWR")
   16861                      .dwattr $C$DW$2265, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16862                      .dwattr $C$DW$2265, DW_AT_accessibility(DW_ACCESS_public)
   16863              
   16864              $C$DW$2266      .dwtag  DW_TAG_member
   16865                      .dwattr $C$DW$2266, DW_AT_type(*$C$DW$T$23)
   16866                      .dwattr $C$DW$2266, DW_AT_name("FSTATUS")
   16867                      .dwattr $C$DW$2266, DW_AT_TI_symbol_name("_FSTATUS")
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{21AA29C7-F98B-4F4A-BDE6-D80B9CD4CCAC} PAGE  319

   16868                      .dwattr $C$DW$2266, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   16869                      .dwattr $C$DW$2266, DW_AT_accessibility(DW_ACCESS_public)
   16870              
   16871              $C$DW$2267      .dwtag  DW_TAG_member
   16872                      .dwattr $C$DW$2267, DW_AT_type(*$C$DW$T$23)
   16873                      .dwattr $C$DW$2267, DW_AT_name("FSTDBYWAIT")
   16874                      .dwattr $C$DW$2267, DW_AT_TI_symbol_name("_FSTDBYWAIT")
   16875                      .dwattr $C$DW$2267, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16876                      .dwattr $C$DW$2267, DW_AT_accessibility(DW_ACCESS_public)
   16877              
   16878              $C$DW$2268      .dwtag  DW_TAG_member
   16879                      .dwattr $C$DW$2268, DW_AT_type(*$C$DW$T$23)
   16880                      .dwattr $C$DW$2268, DW_AT_name("FACTIVEWAIT")
   16881                      .dwattr $C$DW$2268, DW_AT_TI_symbol_name("_FACTIVEWAIT")
   16882                      .dwattr $C$DW$2268, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   16883                      .dwattr $C$DW$2268, DW_AT_accessibility(DW_ACCESS_public)
   16884              
   16885              $C$DW$2269      .dwtag  DW_TAG_member
   16886                      .dwattr $C$DW$2269, DW_AT_type(*$C$DW$T$23)
   16887                      .dwattr $C$DW$2269, DW_AT_name("FBANKWAIT")
   16888                      .dwattr $C$DW$2269, DW_AT_TI_symbol_name("_FBANKWAIT")
   16889                      .dwattr $C$DW$2269, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   16890                      .dwattr $C$DW$2269, DW_AT_accessibility(DW_ACCESS_public)
   16891              
   16892              $C$DW$2270      .dwtag  DW_TAG_member
   16893                      .dwattr $C$DW$2270, DW_AT_type(*$C$DW$T$23)
   16894                      .dwattr $C$DW$2270, DW_AT_name("FOTPWAIT")
   16895                      .dwattr $C$DW$2270, DW_AT_TI_symbol_name("_FOTPWAIT")
   16896                      .dwattr $C$DW$2270, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   16897                      .dwattr $C$DW$2270, DW_AT_accessibility(DW_ACCESS_public)
   16898              
   16899                      .dwendtag $C$DW$T$73
   16900              
   16901              $C$DW$T$94      .dwtag  DW_TAG_pointer_type
   16902                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$73)
   16903                      .dwattr $C$DW$T$94, DW_AT_address_class(0x20)
   16904              
   16905              $C$DW$T$95      .dwtag  DW_TAG_typedef
   16906                      .dwattr $C$DW$T$95, DW_AT_name("FLASH_Handle")
   16907                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
   16908                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
   16909              
   16910              
   16911              $C$DW$T$79      .dwtag  DW_TAG_structure_type
   16912                      .dwattr $C$DW$T$79, DW_AT_name("_GPIO_Obj_")
   16913                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x6a)
   16914              $C$DW$2271      .dwtag  DW_TAG_member
   16915                      .dwattr $C$DW$2271, DW_AT_type(*$C$DW$T$76)
   16916                      .dwattr $C$DW$2271, DW_AT_name("GPACTRL")
   16917                      .dwattr $C$DW$2271, DW_AT_TI_symbol_name("_GPACTRL")
   16918                      .dwattr $C$DW$2271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16919                      .dwattr $C$DW$2271, DW_AT_accessibility(DW_ACCESS_public)
   16920              
   16921              $C$DW$2272      .dwtag  DW_TAG_member
   16922                      .dwattr $C$DW$2272, DW_AT_type(*$C$DW$T$76)
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{21AA29C7-F98B-4F4A-BDE6-D80B9CD4CCAC} PAGE  320

   16923                      .dwattr $C$DW$2272, DW_AT_name("GPAQSEL1")
   16924                      .dwattr $C$DW$2272, DW_AT_TI_symbol_name("_GPAQSEL1")
   16925                      .dwattr $C$DW$2272, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16926                      .dwattr $C$DW$2272, DW_AT_accessibility(DW_ACCESS_public)
   16927              
   16928              $C$DW$2273      .dwtag  DW_TAG_member
   16929                      .dwattr $C$DW$2273, DW_AT_type(*$C$DW$T$76)
   16930                      .dwattr $C$DW$2273, DW_AT_name("GPAQSEL2")
   16931                      .dwattr $C$DW$2273, DW_AT_TI_symbol_name("_GPAQSEL2")
   16932                      .dwattr $C$DW$2273, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16933                      .dwattr $C$DW$2273, DW_AT_accessibility(DW_ACCESS_public)
   16934              
   16935              $C$DW$2274      .dwtag  DW_TAG_member
   16936                      .dwattr $C$DW$2274, DW_AT_type(*$C$DW$T$76)
   16937                      .dwattr $C$DW$2274, DW_AT_name("GPAMUX1")
   16938                      .dwattr $C$DW$2274, DW_AT_TI_symbol_name("_GPAMUX1")
   16939                      .dwattr $C$DW$2274, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   16940                      .dwattr $C$DW$2274, DW_AT_accessibility(DW_ACCESS_public)
   16941              
   16942              $C$DW$2275      .dwtag  DW_TAG_member
   16943                      .dwattr $C$DW$2275, DW_AT_type(*$C$DW$T$76)
   16944                      .dwattr $C$DW$2275, DW_AT_name("GPAMUX2")
   16945                      .dwattr $C$DW$2275, DW_AT_TI_symbol_name("_GPAMUX2")
   16946                      .dwattr $C$DW$2275, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   16947                      .dwattr $C$DW$2275, DW_AT_accessibility(DW_ACCESS_public)
   16948              
   16949              $C$DW$2276      .dwtag  DW_TAG_member
   16950                      .dwattr $C$DW$2276, DW_AT_type(*$C$DW$T$76)
   16951                      .dwattr $C$DW$2276, DW_AT_name("GPADIR")
   16952                      .dwattr $C$DW$2276, DW_AT_TI_symbol_name("_GPADIR")
   16953                      .dwattr $C$DW$2276, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   16954                      .dwattr $C$DW$2276, DW_AT_accessibility(DW_ACCESS_public)
   16955              
   16956              $C$DW$2277      .dwtag  DW_TAG_member
   16957                      .dwattr $C$DW$2277, DW_AT_type(*$C$DW$T$76)
   16958                      .dwattr $C$DW$2277, DW_AT_name("GPAPUD")
   16959                      .dwattr $C$DW$2277, DW_AT_TI_symbol_name("_GPAPUD")
   16960                      .dwattr $C$DW$2277, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   16961                      .dwattr $C$DW$2277, DW_AT_accessibility(DW_ACCESS_public)
   16962              
   16963              $C$DW$2278      .dwtag  DW_TAG_member
   16964                      .dwattr $C$DW$2278, DW_AT_type(*$C$DW$T$26)
   16965                      .dwattr $C$DW$2278, DW_AT_name("rsvd_1")
   16966                      .dwattr $C$DW$2278, DW_AT_TI_symbol_name("_rsvd_1")
   16967                      .dwattr $C$DW$2278, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   16968                      .dwattr $C$DW$2278, DW_AT_accessibility(DW_ACCESS_public)
   16969              
   16970              $C$DW$2279      .dwtag  DW_TAG_member
   16971                      .dwattr $C$DW$2279, DW_AT_type(*$C$DW$T$76)
   16972                      .dwattr $C$DW$2279, DW_AT_name("GPBCTRL")
   16973                      .dwattr $C$DW$2279, DW_AT_TI_symbol_name("_GPBCTRL")
   16974                      .dwattr $C$DW$2279, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   16975                      .dwattr $C$DW$2279, DW_AT_accessibility(DW_ACCESS_public)
   16976              
   16977              $C$DW$2280      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{21AA29C7-F98B-4F4A-BDE6-D80B9CD4CCAC} PAGE  321

   16978                      .dwattr $C$DW$2280, DW_AT_type(*$C$DW$T$76)
   16979                      .dwattr $C$DW$2280, DW_AT_name("GPBQSEL1")
   16980                      .dwattr $C$DW$2280, DW_AT_TI_symbol_name("_GPBQSEL1")
   16981                      .dwattr $C$DW$2280, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   16982                      .dwattr $C$DW$2280, DW_AT_accessibility(DW_ACCESS_public)
   16983              
   16984              $C$DW$2281      .dwtag  DW_TAG_member
   16985                      .dwattr $C$DW$2281, DW_AT_type(*$C$DW$T$76)
   16986                      .dwattr $C$DW$2281, DW_AT_name("GPBQSEL2")
   16987                      .dwattr $C$DW$2281, DW_AT_TI_symbol_name("_GPBQSEL2")
   16988                      .dwattr $C$DW$2281, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   16989                      .dwattr $C$DW$2281, DW_AT_accessibility(DW_ACCESS_public)
   16990              
   16991              $C$DW$2282      .dwtag  DW_TAG_member
   16992                      .dwattr $C$DW$2282, DW_AT_type(*$C$DW$T$76)
   16993                      .dwattr $C$DW$2282, DW_AT_name("GPBMUX1")
   16994                      .dwattr $C$DW$2282, DW_AT_TI_symbol_name("_GPBMUX1")
   16995                      .dwattr $C$DW$2282, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   16996                      .dwattr $C$DW$2282, DW_AT_accessibility(DW_ACCESS_public)
   16997              
   16998              $C$DW$2283      .dwtag  DW_TAG_member
   16999                      .dwattr $C$DW$2283, DW_AT_type(*$C$DW$T$76)
   17000                      .dwattr $C$DW$2283, DW_AT_name("GPBMUX2")
   17001                      .dwattr $C$DW$2283, DW_AT_TI_symbol_name("_GPBMUX2")
   17002                      .dwattr $C$DW$2283, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   17003                      .dwattr $C$DW$2283, DW_AT_accessibility(DW_ACCESS_public)
   17004              
   17005              $C$DW$2284      .dwtag  DW_TAG_member
   17006                      .dwattr $C$DW$2284, DW_AT_type(*$C$DW$T$76)
   17007                      .dwattr $C$DW$2284, DW_AT_name("GPBDIR")
   17008                      .dwattr $C$DW$2284, DW_AT_TI_symbol_name("_GPBDIR")
   17009                      .dwattr $C$DW$2284, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   17010                      .dwattr $C$DW$2284, DW_AT_accessibility(DW_ACCESS_public)
   17011              
   17012              $C$DW$2285      .dwtag  DW_TAG_member
   17013                      .dwattr $C$DW$2285, DW_AT_type(*$C$DW$T$76)
   17014                      .dwattr $C$DW$2285, DW_AT_name("GPBPUD")
   17015                      .dwattr $C$DW$2285, DW_AT_TI_symbol_name("_GPBPUD")
   17016                      .dwattr $C$DW$2285, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   17017                      .dwattr $C$DW$2285, DW_AT_accessibility(DW_ACCESS_public)
   17018              
   17019              $C$DW$2286      .dwtag  DW_TAG_member
   17020                      .dwattr $C$DW$2286, DW_AT_type(*$C$DW$T$77)
   17021                      .dwattr $C$DW$2286, DW_AT_name("rsvd_4")
   17022                      .dwattr $C$DW$2286, DW_AT_TI_symbol_name("_rsvd_4")
   17023                      .dwattr $C$DW$2286, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   17024                      .dwattr $C$DW$2286, DW_AT_accessibility(DW_ACCESS_public)
   17025              
   17026              $C$DW$2287      .dwtag  DW_TAG_member
   17027                      .dwattr $C$DW$2287, DW_AT_type(*$C$DW$T$76)
   17028                      .dwattr $C$DW$2287, DW_AT_name("AIOMUX1")
   17029                      .dwattr $C$DW$2287, DW_AT_TI_symbol_name("_AIOMUX1")
   17030                      .dwattr $C$DW$2287, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   17031                      .dwattr $C$DW$2287, DW_AT_accessibility(DW_ACCESS_public)
   17032              
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{21AA29C7-F98B-4F4A-BDE6-D80B9CD4CCAC} PAGE  322

   17033              $C$DW$2288      .dwtag  DW_TAG_member
   17034                      .dwattr $C$DW$2288, DW_AT_type(*$C$DW$T$26)
   17035                      .dwattr $C$DW$2288, DW_AT_name("rsvd_5")
   17036                      .dwattr $C$DW$2288, DW_AT_TI_symbol_name("_rsvd_5")
   17037                      .dwattr $C$DW$2288, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   17038                      .dwattr $C$DW$2288, DW_AT_accessibility(DW_ACCESS_public)
   17039              
   17040              $C$DW$2289      .dwtag  DW_TAG_member
   17041                      .dwattr $C$DW$2289, DW_AT_type(*$C$DW$T$76)
   17042                      .dwattr $C$DW$2289, DW_AT_name("AIODIR")
   17043                      .dwattr $C$DW$2289, DW_AT_TI_symbol_name("_AIODIR")
   17044                      .dwattr $C$DW$2289, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   17045                      .dwattr $C$DW$2289, DW_AT_accessibility(DW_ACCESS_public)
   17046              
   17047              $C$DW$2290      .dwtag  DW_TAG_member
   17048                      .dwattr $C$DW$2290, DW_AT_type(*$C$DW$T$78)
   17049                      .dwattr $C$DW$2290, DW_AT_name("rsvd_6")
   17050                      .dwattr $C$DW$2290, DW_AT_TI_symbol_name("_rsvd_6")
   17051                      .dwattr $C$DW$2290, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   17052                      .dwattr $C$DW$2290, DW_AT_accessibility(DW_ACCESS_public)
   17053              
   17054              $C$DW$2291      .dwtag  DW_TAG_member
   17055                      .dwattr $C$DW$2291, DW_AT_type(*$C$DW$T$76)
   17056                      .dwattr $C$DW$2291, DW_AT_name("GPADAT")
   17057                      .dwattr $C$DW$2291, DW_AT_TI_symbol_name("_GPADAT")
   17058                      .dwattr $C$DW$2291, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   17059                      .dwattr $C$DW$2291, DW_AT_accessibility(DW_ACCESS_public)
   17060              
   17061              $C$DW$2292      .dwtag  DW_TAG_member
   17062                      .dwattr $C$DW$2292, DW_AT_type(*$C$DW$T$76)
   17063                      .dwattr $C$DW$2292, DW_AT_name("GPASET")
   17064                      .dwattr $C$DW$2292, DW_AT_TI_symbol_name("_GPASET")
   17065                      .dwattr $C$DW$2292, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   17066                      .dwattr $C$DW$2292, DW_AT_accessibility(DW_ACCESS_public)
   17067              
   17068              $C$DW$2293      .dwtag  DW_TAG_member
   17069                      .dwattr $C$DW$2293, DW_AT_type(*$C$DW$T$76)
   17070                      .dwattr $C$DW$2293, DW_AT_name("GPACLEAR")
   17071                      .dwattr $C$DW$2293, DW_AT_TI_symbol_name("_GPACLEAR")
   17072                      .dwattr $C$DW$2293, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   17073                      .dwattr $C$DW$2293, DW_AT_accessibility(DW_ACCESS_public)
   17074              
   17075              $C$DW$2294      .dwtag  DW_TAG_member
   17076                      .dwattr $C$DW$2294, DW_AT_type(*$C$DW$T$76)
   17077                      .dwattr $C$DW$2294, DW_AT_name("GPATOGGLE")
   17078                      .dwattr $C$DW$2294, DW_AT_TI_symbol_name("_GPATOGGLE")
   17079                      .dwattr $C$DW$2294, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   17080                      .dwattr $C$DW$2294, DW_AT_accessibility(DW_ACCESS_public)
   17081              
   17082              $C$DW$2295      .dwtag  DW_TAG_member
   17083                      .dwattr $C$DW$2295, DW_AT_type(*$C$DW$T$76)
   17084                      .dwattr $C$DW$2295, DW_AT_name("GPBDAT")
   17085                      .dwattr $C$DW$2295, DW_AT_TI_symbol_name("_GPBDAT")
   17086                      .dwattr $C$DW$2295, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   17087                      .dwattr $C$DW$2295, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{21AA29C7-F98B-4F4A-BDE6-D80B9CD4CCAC} PAGE  323

   17088              
   17089              $C$DW$2296      .dwtag  DW_TAG_member
   17090                      .dwattr $C$DW$2296, DW_AT_type(*$C$DW$T$76)
   17091                      .dwattr $C$DW$2296, DW_AT_name("GPBSET")
   17092                      .dwattr $C$DW$2296, DW_AT_TI_symbol_name("_GPBSET")
   17093                      .dwattr $C$DW$2296, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   17094                      .dwattr $C$DW$2296, DW_AT_accessibility(DW_ACCESS_public)
   17095              
   17096              $C$DW$2297      .dwtag  DW_TAG_member
   17097                      .dwattr $C$DW$2297, DW_AT_type(*$C$DW$T$76)
   17098                      .dwattr $C$DW$2297, DW_AT_name("GPBCLEAR")
   17099                      .dwattr $C$DW$2297, DW_AT_TI_symbol_name("_GPBCLEAR")
   17100                      .dwattr $C$DW$2297, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   17101                      .dwattr $C$DW$2297, DW_AT_accessibility(DW_ACCESS_public)
   17102              
   17103              $C$DW$2298      .dwtag  DW_TAG_member
   17104                      .dwattr $C$DW$2298, DW_AT_type(*$C$DW$T$76)
   17105                      .dwattr $C$DW$2298, DW_AT_name("GPBTOGGLE")
   17106                      .dwattr $C$DW$2298, DW_AT_TI_symbol_name("_GPBTOGGLE")
   17107                      .dwattr $C$DW$2298, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   17108                      .dwattr $C$DW$2298, DW_AT_accessibility(DW_ACCESS_public)
   17109              
   17110              $C$DW$2299      .dwtag  DW_TAG_member
   17111                      .dwattr $C$DW$2299, DW_AT_type(*$C$DW$T$31)
   17112                      .dwattr $C$DW$2299, DW_AT_name("rsvd_7")
   17113                      .dwattr $C$DW$2299, DW_AT_TI_symbol_name("_rsvd_7")
   17114                      .dwattr $C$DW$2299, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   17115                      .dwattr $C$DW$2299, DW_AT_accessibility(DW_ACCESS_public)
   17116              
   17117              $C$DW$2300      .dwtag  DW_TAG_member
   17118                      .dwattr $C$DW$2300, DW_AT_type(*$C$DW$T$76)
   17119                      .dwattr $C$DW$2300, DW_AT_name("AIODAT")
   17120                      .dwattr $C$DW$2300, DW_AT_TI_symbol_name("_AIODAT")
   17121                      .dwattr $C$DW$2300, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
   17122                      .dwattr $C$DW$2300, DW_AT_accessibility(DW_ACCESS_public)
   17123              
   17124              $C$DW$2301      .dwtag  DW_TAG_member
   17125                      .dwattr $C$DW$2301, DW_AT_type(*$C$DW$T$76)
   17126                      .dwattr $C$DW$2301, DW_AT_name("AIOSET")
   17127                      .dwattr $C$DW$2301, DW_AT_TI_symbol_name("_AIOSET")
   17128                      .dwattr $C$DW$2301, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   17129                      .dwattr $C$DW$2301, DW_AT_accessibility(DW_ACCESS_public)
   17130              
   17131              $C$DW$2302      .dwtag  DW_TAG_member
   17132                      .dwattr $C$DW$2302, DW_AT_type(*$C$DW$T$76)
   17133                      .dwattr $C$DW$2302, DW_AT_name("AIOCLEAR")
   17134                      .dwattr $C$DW$2302, DW_AT_TI_symbol_name("_AIOCLEAR")
   17135                      .dwattr $C$DW$2302, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   17136                      .dwattr $C$DW$2302, DW_AT_accessibility(DW_ACCESS_public)
   17137              
   17138              $C$DW$2303      .dwtag  DW_TAG_member
   17139                      .dwattr $C$DW$2303, DW_AT_type(*$C$DW$T$76)
   17140                      .dwattr $C$DW$2303, DW_AT_name("AIOTOGGLE")
   17141                      .dwattr $C$DW$2303, DW_AT_TI_symbol_name("_AIOTOGGLE")
   17142                      .dwattr $C$DW$2303, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{21AA29C7-F98B-4F4A-BDE6-D80B9CD4CCAC} PAGE  324

   17143                      .dwattr $C$DW$2303, DW_AT_accessibility(DW_ACCESS_public)
   17144              
   17145              $C$DW$2304      .dwtag  DW_TAG_member
   17146                      .dwattr $C$DW$2304, DW_AT_type(*$C$DW$T$28)
   17147                      .dwattr $C$DW$2304, DW_AT_name("GPIOXINTnSEL")
   17148                      .dwattr $C$DW$2304, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
   17149                      .dwattr $C$DW$2304, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   17150                      .dwattr $C$DW$2304, DW_AT_accessibility(DW_ACCESS_public)
   17151              
   17152              $C$DW$2305      .dwtag  DW_TAG_member
   17153                      .dwattr $C$DW$2305, DW_AT_type(*$C$DW$T$27)
   17154                      .dwattr $C$DW$2305, DW_AT_name("rsvd_8")
   17155                      .dwattr $C$DW$2305, DW_AT_TI_symbol_name("_rsvd_8")
   17156                      .dwattr $C$DW$2305, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   17157                      .dwattr $C$DW$2305, DW_AT_accessibility(DW_ACCESS_public)
   17158              
   17159              $C$DW$2306      .dwtag  DW_TAG_member
   17160                      .dwattr $C$DW$2306, DW_AT_type(*$C$DW$T$76)
   17161                      .dwattr $C$DW$2306, DW_AT_name("GPIOLPMSEL")
   17162                      .dwattr $C$DW$2306, DW_AT_TI_symbol_name("_GPIOLPMSEL")
   17163                      .dwattr $C$DW$2306, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   17164                      .dwattr $C$DW$2306, DW_AT_accessibility(DW_ACCESS_public)
   17165              
   17166                      .dwendtag $C$DW$T$79
   17167              
   17168              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
   17169                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$79)
   17170                      .dwattr $C$DW$T$38, DW_AT_address_class(0x20)
   17171              
   17172              $C$DW$T$39      .dwtag  DW_TAG_typedef
   17173                      .dwattr $C$DW$T$39, DW_AT_name("GPIO_Handle")
   17174                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
   17175                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
   17176              
   17177              
   17178              $C$DW$T$81      .dwtag  DW_TAG_structure_type
   17179                      .dwattr $C$DW$T$81, DW_AT_name("_HAL_AdcData_t_")
   17180                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x0e)
   17181              $C$DW$2307      .dwtag  DW_TAG_member
   17182                      .dwattr $C$DW$2307, DW_AT_type(*$C$DW$T$80)
   17183                      .dwattr $C$DW$2307, DW_AT_name("I")
   17184                      .dwattr $C$DW$2307, DW_AT_TI_symbol_name("_I")
   17185                      .dwattr $C$DW$2307, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   17186                      .dwattr $C$DW$2307, DW_AT_accessibility(DW_ACCESS_public)
   17187              
   17188              $C$DW$2308      .dwtag  DW_TAG_member
   17189                      .dwattr $C$DW$2308, DW_AT_type(*$C$DW$T$80)
   17190                      .dwattr $C$DW$2308, DW_AT_name("V")
   17191                      .dwattr $C$DW$2308, DW_AT_TI_symbol_name("_V")
   17192                      .dwattr $C$DW$2308, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   17193                      .dwattr $C$DW$2308, DW_AT_accessibility(DW_ACCESS_public)
   17194              
   17195              $C$DW$2309      .dwtag  DW_TAG_member
   17196                      .dwattr $C$DW$2309, DW_AT_type(*$C$DW$T$71)
   17197                      .dwattr $C$DW$2309, DW_AT_name("dcBus")
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{21AA29C7-F98B-4F4A-BDE6-D80B9CD4CCAC} PAGE  325

   17198                      .dwattr $C$DW$2309, DW_AT_TI_symbol_name("_dcBus")
   17199                      .dwattr $C$DW$2309, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   17200                      .dwattr $C$DW$2309, DW_AT_accessibility(DW_ACCESS_public)
   17201              
   17202                      .dwendtag $C$DW$T$81
   17203              
   17204              $C$DW$T$117     .dwtag  DW_TAG_typedef
   17205                      .dwattr $C$DW$T$117, DW_AT_name("HAL_AdcData_t")
   17206                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$81)
   17207                      .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
   17208              
   17209              
   17210              $C$DW$T$87      .dwtag  DW_TAG_structure_type
   17211                      .dwattr $C$DW$T$87, DW_AT_name("_HAL_DacData_t_")
   17212                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x22)
   17213              $C$DW$2310      .dwtag  DW_TAG_member
   17214                      .dwattr $C$DW$2310, DW_AT_type(*$C$DW$T$22)
   17215                      .dwattr $C$DW$2310, DW_AT_name("PeriodMax")
   17216                      .dwattr $C$DW$2310, DW_AT_TI_symbol_name("_PeriodMax")
   17217                      .dwattr $C$DW$2310, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   17218                      .dwattr $C$DW$2310, DW_AT_accessibility(DW_ACCESS_public)
   17219              
   17220              $C$DW$2311      .dwtag  DW_TAG_member
   17221                      .dwattr $C$DW$2311, DW_AT_type(*$C$DW$T$85)
   17222                      .dwattr $C$DW$2311, DW_AT_name("ptrData")
   17223                      .dwattr $C$DW$2311, DW_AT_TI_symbol_name("_ptrData")
   17224                      .dwattr $C$DW$2311, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   17225                      .dwattr $C$DW$2311, DW_AT_accessibility(DW_ACCESS_public)
   17226              
   17227              $C$DW$2312      .dwtag  DW_TAG_member
   17228                      .dwattr $C$DW$2312, DW_AT_type(*$C$DW$T$86)
   17229                      .dwattr $C$DW$2312, DW_AT_name("value")
   17230                      .dwattr $C$DW$2312, DW_AT_TI_symbol_name("_value")
   17231                      .dwattr $C$DW$2312, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   17232                      .dwattr $C$DW$2312, DW_AT_accessibility(DW_ACCESS_public)
   17233              
   17234              $C$DW$2313      .dwtag  DW_TAG_member
   17235                      .dwattr $C$DW$2313, DW_AT_type(*$C$DW$T$86)
   17236                      .dwattr $C$DW$2313, DW_AT_name("offset")
   17237                      .dwattr $C$DW$2313, DW_AT_TI_symbol_name("_offset")
   17238                      .dwattr $C$DW$2313, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   17239                      .dwattr $C$DW$2313, DW_AT_accessibility(DW_ACCESS_public)
   17240              
   17241              $C$DW$2314      .dwtag  DW_TAG_member
   17242                      .dwattr $C$DW$2314, DW_AT_type(*$C$DW$T$86)
   17243                      .dwattr $C$DW$2314, DW_AT_name("gain")
   17244                      .dwattr $C$DW$2314, DW_AT_TI_symbol_name("_gain")
   17245                      .dwattr $C$DW$2314, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   17246                      .dwattr $C$DW$2314, DW_AT_accessibility(DW_ACCESS_public)
   17247              
   17248                      .dwendtag $C$DW$T$87
   17249              
   17250              $C$DW$T$385     .dwtag  DW_TAG_typedef
   17251                      .dwattr $C$DW$T$385, DW_AT_name("HAL_DacData_t")
   17252                      .dwattr $C$DW$T$385, DW_AT_type(*$C$DW$T$87)
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{21AA29C7-F98B-4F4A-BDE6-D80B9CD4CCAC} PAGE  326

   17253                      .dwattr $C$DW$T$385, DW_AT_language(DW_LANG_C)
   17254              
   17255              $C$DW$T$386     .dwtag  DW_TAG_pointer_type
   17256                      .dwattr $C$DW$T$386, DW_AT_type(*$C$DW$T$385)
   17257                      .dwattr $C$DW$T$386, DW_AT_address_class(0x20)
   17258              
   17259              $C$DW$2315      .dwtag  DW_TAG_TI_far_type
   17260                      .dwattr $C$DW$2315, DW_AT_type(*$C$DW$T$386)
   17261              
   17262              $C$DW$T$387     .dwtag  DW_TAG_const_type
   17263                      .dwattr $C$DW$T$387, DW_AT_type(*$C$DW$2315)
   17264              
   17265              
   17266              $C$DW$T$123     .dwtag  DW_TAG_structure_type
   17267                      .dwattr $C$DW$T$123, DW_AT_name("_HAL_Obj_")
   17268                      .dwattr $C$DW$T$123, DW_AT_byte_size(0xac)
   17269              $C$DW$2316      .dwtag  DW_TAG_member
   17270                      .dwattr $C$DW$2316, DW_AT_type(*$C$DW$T$89)
   17271                      .dwattr $C$DW$2316, DW_AT_name("adcHandle")
   17272                      .dwattr $C$DW$2316, DW_AT_TI_symbol_name("_adcHandle")
   17273                      .dwattr $C$DW$2316, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   17274                      .dwattr $C$DW$2316, DW_AT_accessibility(DW_ACCESS_public)
   17275              
   17276              $C$DW$2317      .dwtag  DW_TAG_member
   17277                      .dwattr $C$DW$2317, DW_AT_type(*$C$DW$T$91)
   17278                      .dwattr $C$DW$2317, DW_AT_name("clkHandle")
   17279                      .dwattr $C$DW$2317, DW_AT_TI_symbol_name("_clkHandle")
   17280                      .dwattr $C$DW$2317, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   17281                      .dwattr $C$DW$2317, DW_AT_accessibility(DW_ACCESS_public)
   17282              
   17283              $C$DW$2318      .dwtag  DW_TAG_member
   17284                      .dwattr $C$DW$2318, DW_AT_type(*$C$DW$T$93)
   17285                      .dwattr $C$DW$2318, DW_AT_name("cpuHandle")
   17286                      .dwattr $C$DW$2318, DW_AT_TI_symbol_name("_cpuHandle")
   17287                      .dwattr $C$DW$2318, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   17288                      .dwattr $C$DW$2318, DW_AT_accessibility(DW_ACCESS_public)
   17289              
   17290              $C$DW$2319      .dwtag  DW_TAG_member
   17291                      .dwattr $C$DW$2319, DW_AT_type(*$C$DW$T$95)
   17292                      .dwattr $C$DW$2319, DW_AT_name("flashHandle")
   17293                      .dwattr $C$DW$2319, DW_AT_TI_symbol_name("_flashHandle")
   17294                      .dwattr $C$DW$2319, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   17295                      .dwattr $C$DW$2319, DW_AT_accessibility(DW_ACCESS_public)
   17296              
   17297              $C$DW$2320      .dwtag  DW_TAG_member
   17298                      .dwattr $C$DW$2320, DW_AT_type(*$C$DW$T$39)
   17299                      .dwattr $C$DW$2320, DW_AT_name("gpioHandle")
   17300                      .dwattr $C$DW$2320, DW_AT_TI_symbol_name("_gpioHandle")
   17301                      .dwattr $C$DW$2320, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   17302                      .dwattr $C$DW$2320, DW_AT_accessibility(DW_ACCESS_public)
   17303              
   17304              $C$DW$2321      .dwtag  DW_TAG_member
   17305                      .dwattr $C$DW$2321, DW_AT_type(*$C$DW$T$98)
   17306                      .dwattr $C$DW$2321, DW_AT_name("offsetHandle_I")
   17307                      .dwattr $C$DW$2321, DW_AT_TI_symbol_name("_offsetHandle_I")
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{21AA29C7-F98B-4F4A-BDE6-D80B9CD4CCAC} PAGE  327

   17308                      .dwattr $C$DW$2321, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   17309                      .dwattr $C$DW$2321, DW_AT_accessibility(DW_ACCESS_public)
   17310              
   17311              $C$DW$2322      .dwtag  DW_TAG_member
   17312                      .dwattr $C$DW$2322, DW_AT_type(*$C$DW$T$100)
   17313                      .dwattr $C$DW$2322, DW_AT_name("offset_I")
   17314                      .dwattr $C$DW$2322, DW_AT_TI_symbol_name("_offset_I")
   17315                      .dwattr $C$DW$2322, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   17316                      .dwattr $C$DW$2322, DW_AT_accessibility(DW_ACCESS_public)
   17317              
   17318              $C$DW$2323      .dwtag  DW_TAG_member
   17319                      .dwattr $C$DW$2323, DW_AT_type(*$C$DW$T$98)
   17320                      .dwattr $C$DW$2323, DW_AT_name("offsetHandle_V")
   17321                      .dwattr $C$DW$2323, DW_AT_TI_symbol_name("_offsetHandle_V")
   17322                      .dwattr $C$DW$2323, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   17323                      .dwattr $C$DW$2323, DW_AT_accessibility(DW_ACCESS_public)
   17324              
   17325              $C$DW$2324      .dwtag  DW_TAG_member
   17326                      .dwattr $C$DW$2324, DW_AT_type(*$C$DW$T$100)
   17327                      .dwattr $C$DW$2324, DW_AT_name("offset_V")
   17328                      .dwattr $C$DW$2324, DW_AT_TI_symbol_name("_offset_V")
   17329                      .dwattr $C$DW$2324, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   17330                      .dwattr $C$DW$2324, DW_AT_accessibility(DW_ACCESS_public)
   17331              
   17332              $C$DW$2325      .dwtag  DW_TAG_member
   17333                      .dwattr $C$DW$2325, DW_AT_type(*$C$DW$T$102)
   17334                      .dwattr $C$DW$2325, DW_AT_name("oscHandle")
   17335                      .dwattr $C$DW$2325, DW_AT_TI_symbol_name("_oscHandle")
   17336                      .dwattr $C$DW$2325, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
   17337                      .dwattr $C$DW$2325, DW_AT_accessibility(DW_ACCESS_public)
   17338              
   17339              $C$DW$2326      .dwtag  DW_TAG_member
   17340                      .dwattr $C$DW$2326, DW_AT_type(*$C$DW$T$104)
   17341                      .dwattr $C$DW$2326, DW_AT_name("pieHandle")
   17342                      .dwattr $C$DW$2326, DW_AT_TI_symbol_name("_pieHandle")
   17343                      .dwattr $C$DW$2326, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
   17344                      .dwattr $C$DW$2326, DW_AT_accessibility(DW_ACCESS_public)
   17345              
   17346              $C$DW$2327      .dwtag  DW_TAG_member
   17347                      .dwattr $C$DW$2327, DW_AT_type(*$C$DW$T$106)
   17348                      .dwattr $C$DW$2327, DW_AT_name("pllHandle")
   17349                      .dwattr $C$DW$2327, DW_AT_TI_symbol_name("_pllHandle")
   17350                      .dwattr $C$DW$2327, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
   17351                      .dwattr $C$DW$2327, DW_AT_accessibility(DW_ACCESS_public)
   17352              
   17353              $C$DW$2328      .dwtag  DW_TAG_member
   17354                      .dwattr $C$DW$2328, DW_AT_type(*$C$DW$T$109)
   17355                      .dwattr $C$DW$2328, DW_AT_name("pwmHandle")
   17356                      .dwattr $C$DW$2328, DW_AT_TI_symbol_name("_pwmHandle")
   17357                      .dwattr $C$DW$2328, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
   17358                      .dwattr $C$DW$2328, DW_AT_accessibility(DW_ACCESS_public)
   17359              
   17360              $C$DW$2329      .dwtag  DW_TAG_member
   17361                      .dwattr $C$DW$2329, DW_AT_type(*$C$DW$T$109)
   17362                      .dwattr $C$DW$2329, DW_AT_name("pwmDacHandle")
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{21AA29C7-F98B-4F4A-BDE6-D80B9CD4CCAC} PAGE  328

   17363                      .dwattr $C$DW$2329, DW_AT_TI_symbol_name("_pwmDacHandle")
   17364                      .dwattr $C$DW$2329, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
   17365                      .dwattr $C$DW$2329, DW_AT_accessibility(DW_ACCESS_public)
   17366              
   17367              $C$DW$2330      .dwtag  DW_TAG_member
   17368                      .dwattr $C$DW$2330, DW_AT_type(*$C$DW$T$111)
   17369                      .dwattr $C$DW$2330, DW_AT_name("pwrHandle")
   17370                      .dwattr $C$DW$2330, DW_AT_TI_symbol_name("_pwrHandle")
   17371                      .dwattr $C$DW$2330, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
   17372                      .dwattr $C$DW$2330, DW_AT_accessibility(DW_ACCESS_public)
   17373              
   17374              $C$DW$2331      .dwtag  DW_TAG_member
   17375                      .dwattr $C$DW$2331, DW_AT_type(*$C$DW$T$114)
   17376                      .dwattr $C$DW$2331, DW_AT_name("timerHandle")
   17377                      .dwattr $C$DW$2331, DW_AT_TI_symbol_name("_timerHandle")
   17378                      .dwattr $C$DW$2331, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
   17379                      .dwattr $C$DW$2331, DW_AT_accessibility(DW_ACCESS_public)
   17380              
   17381              $C$DW$2332      .dwtag  DW_TAG_member
   17382                      .dwattr $C$DW$2332, DW_AT_type(*$C$DW$T$116)
   17383                      .dwattr $C$DW$2332, DW_AT_name("wdogHandle")
   17384                      .dwattr $C$DW$2332, DW_AT_TI_symbol_name("_wdogHandle")
   17385                      .dwattr $C$DW$2332, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
   17386                      .dwattr $C$DW$2332, DW_AT_accessibility(DW_ACCESS_public)
   17387              
   17388              $C$DW$2333      .dwtag  DW_TAG_member
   17389                      .dwattr $C$DW$2333, DW_AT_type(*$C$DW$T$117)
   17390                      .dwattr $C$DW$2333, DW_AT_name("adcBias")
   17391                      .dwattr $C$DW$2333, DW_AT_TI_symbol_name("_adcBias")
   17392                      .dwattr $C$DW$2333, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
   17393                      .dwattr $C$DW$2333, DW_AT_accessibility(DW_ACCESS_public)
   17394              
