TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{84A79833-BD82-482D-BA2B-5527AFD5BD9A} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                             PC v18.12.4.LTS *
       3              ;* Date/Time created: Fri Feb 17 15:09:33 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/GIANT/GAINT_TI_instaspin/motorware/motorware_1_01_00_18/sw/modules/h
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v18.12.4.LTS Copyright (c) 1996-
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\GIANT\GAINT_TI_instaspin\motorware\motorware_1_01_00_18\sw\solut
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("OFFSET_setBeta")

   16000                      .dwattr $C$DW$2168, DW_AT_name("SCI_NumStopBits_Two")
   16001                      .dwattr $C$DW$2168, DW_AT_const_value(0x80)
   16002              
   16003                      .dwendtag $C$DW$T$346
   16004              
   16005              $C$DW$T$347     .dwtag  DW_TAG_typedef
   16006                      .dwattr $C$DW$T$347, DW_AT_name("SCI_NumStopBits_e")
   16007                      .dwattr $C$DW$T$347, DW_AT_type(*$C$DW$T$346)
   16008                      .dwattr $C$DW$T$347, DW_AT_language(DW_LANG_C)
   16009              
   16010              $C$DW$2169      .dwtag  DW_TAG_TI_far_type
   16011                      .dwattr $C$DW$2169, DW_AT_type(*$C$DW$T$347)
   16012              
   16013              $C$DW$T$348     .dwtag  DW_TAG_const_type
   16014                      .dwattr $C$DW$T$348, DW_AT_type(*$C$DW$2169)
   16015              
   16016              
   16017              $C$DW$T$349     .dwtag  DW_TAG_enumeration_type
   16018                      .dwattr $C$DW$T$349, DW_AT_byte_size(0x01)
   16019              $C$DW$2170      .dwtag  DW_TAG_enumerator
   16020                      .dwattr $C$DW$2170, DW_AT_name("SCI_Priority_Immediate")
   16021                      .dwattr $C$DW$2170, DW_AT_const_value(0x00)
   16022              
   16023              $C$DW$2171      .dwtag  DW_TAG_enumerator
   16024                      .dwattr $C$DW$2171, DW_AT_name("SCI_Priority_FreeRun")
   16025                      .dwattr $C$DW$2171, DW_AT_const_value(0x08)
   16026              
   16027              $C$DW$2172      .dwtag  DW_TAG_enumerator
   16028                      .dwattr $C$DW$2172, DW_AT_name("SCI_Priority_AfterRxRxSeq")
   16029                      .dwattr $C$DW$2172, DW_AT_const_value(0x10)
   16030              
   16031                      .dwendtag $C$DW$T$349
   16032              
   16033              $C$DW$T$350     .dwtag  DW_TAG_typedef
   16034                      .dwattr $C$DW$T$350, DW_AT_name("SCI_Priority_e")
   16035                      .dwattr $C$DW$T$350, DW_AT_type(*$C$DW$T$349)
   16036                      .dwattr $C$DW$T$350, DW_AT_language(DW_LANG_C)
   16037              
   16038              $C$DW$2173      .dwtag  DW_TAG_TI_far_type
   16039                      .dwattr $C$DW$2173, DW_AT_type(*$C$DW$T$350)
   16040              
   16041              $C$DW$T$351     .dwtag  DW_TAG_const_type
   16042                      .dwattr $C$DW$T$351, DW_AT_type(*$C$DW$2173)
   16043              
   16044              
   16045              $C$DW$T$352     .dwtag  DW_TAG_enumeration_type
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{84A79833-BD82-482D-BA2B-5527AFD5BD9A} PAGE  304

   16046                      .dwattr $C$DW$T$352, DW_AT_byte_size(0x01)
   16047              $C$DW$2174      .dwtag  DW_TAG_enumerator
   16048                      .dwattr $C$DW$2174, DW_AT_name("TIMER_EmulationMode_StopAfterNextDecrement")
   16049                      .dwattr $C$DW$2174, DW_AT_const_value(0x00)
   16050              
   16051              $C$DW$2175      .dwtag  DW_TAG_enumerator
   16052                      .dwattr $C$DW$2175, DW_AT_name("TIMER_EmulationMode_StopAtZero")
   16053                      .dwattr $C$DW$2175, DW_AT_const_value(0x400)
   16054              
   16055              $C$DW$2176      .dwtag  DW_TAG_enumerator
   16056                      .dwattr $C$DW$2176, DW_AT_name("TIMER_EmulationMode_RunFree")
   16057                      .dwattr $C$DW$2176, DW_AT_const_value(0x800)
   16058              
   16059                      .dwendtag $C$DW$T$352
   16060              
   16061              $C$DW$T$353     .dwtag  DW_TAG_typedef
   16062                      .dwattr $C$DW$T$353, DW_AT_name("TIMER_EmulationMode_e")
   16063                      .dwattr $C$DW$T$353, DW_AT_type(*$C$DW$T$352)
   16064                      .dwattr $C$DW$T$353, DW_AT_language(DW_LANG_C)
   16065              
   16066              $C$DW$2177      .dwtag  DW_TAG_TI_far_type
   16067                      .dwattr $C$DW$2177, DW_AT_type(*$C$DW$T$353)
   16068              
   16069              $C$DW$T$354     .dwtag  DW_TAG_const_type
   16070                      .dwattr $C$DW$T$354, DW_AT_type(*$C$DW$2177)
   16071              
   16072              
   16073              $C$DW$T$355     .dwtag  DW_TAG_enumeration_type
   16074                      .dwattr $C$DW$T$355, DW_AT_byte_size(0x01)
   16075              $C$DW$2178      .dwtag  DW_TAG_enumerator
   16076                      .dwattr $C$DW$2178, DW_AT_name("HAL_SensorType_Current")
   16077                      .dwattr $C$DW$2178, DW_AT_const_value(0x00)
   16078              
   16079              $C$DW$2179      .dwtag  DW_TAG_enumerator
   16080                      .dwattr $C$DW$2179, DW_AT_name("HAL_SensorType_Voltage")
   16081                      .dwattr $C$DW$2179, DW_AT_const_value(0x01)
   16082              
   16083                      .dwendtag $C$DW$T$355
   16084              
   16085              $C$DW$T$356     .dwtag  DW_TAG_typedef
   16086                      .dwattr $C$DW$T$356, DW_AT_name("HAL_SensorType_e")
   16087                      .dwattr $C$DW$T$356, DW_AT_type(*$C$DW$T$355)
   16088                      .dwattr $C$DW$T$356, DW_AT_language(DW_LANG_C)
   16089              
   16090              
   16091              $C$DW$T$30      .dwtag  DW_TAG_structure_type
   16092                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
   16093                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
   16094              $C$DW$2180      .dwtag  DW_TAG_member
   16095                      .dwattr $C$DW$2180, DW_AT_type(*$C$DW$T$24)
   16096                      .dwattr $C$DW$2180, DW_AT_name("ADCRESULT")
   16097                      .dwattr $C$DW$2180, DW_AT_TI_symbol_name("_ADCRESULT")
   16098                      .dwattr $C$DW$2180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16099                      .dwattr $C$DW$2180, DW_AT_accessibility(DW_ACCESS_public)
   16100              
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{84A79833-BD82-482D-BA2B-5527AFD5BD9A} PAGE  305

   16101              $C$DW$2181      .dwtag  DW_TAG_member
   16102                      .dwattr $C$DW$2181, DW_AT_type(*$C$DW$T$25)
   16103                      .dwattr $C$DW$2181, DW_AT_name("resvd_1")
   16104                      .dwattr $C$DW$2181, DW_AT_TI_symbol_name("_resvd_1")
   16105                      .dwattr $C$DW$2181, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   16106                      .dwattr $C$DW$2181, DW_AT_accessibility(DW_ACCESS_public)
   16107              
   16108              $C$DW$2182      .dwtag  DW_TAG_member
   16109                      .dwattr $C$DW$2182, DW_AT_type(*$C$DW$T$23)
   16110                      .dwattr $C$DW$2182, DW_AT_name("ADCCTL1")
   16111                      .dwattr $C$DW$2182, DW_AT_TI_symbol_name("_ADCCTL1")
   16112                      .dwattr $C$DW$2182, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
   16113                      .dwattr $C$DW$2182, DW_AT_accessibility(DW_ACCESS_public)
   16114              
   16115              $C$DW$2183      .dwtag  DW_TAG_member
   16116                      .dwattr $C$DW$2183, DW_AT_type(*$C$DW$T$23)
   16117                      .dwattr $C$DW$2183, DW_AT_name("ADCCTL2")
   16118                      .dwattr $C$DW$2183, DW_AT_TI_symbol_name("_ADCCTL2")
   16119                      .dwattr $C$DW$2183, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
   16120                      .dwattr $C$DW$2183, DW_AT_accessibility(DW_ACCESS_public)
   16121              
   16122              $C$DW$2184      .dwtag  DW_TAG_member
   16123                      .dwattr $C$DW$2184, DW_AT_type(*$C$DW$T$26)
   16124                      .dwattr $C$DW$2184, DW_AT_name("rsvd_2")
   16125                      .dwattr $C$DW$2184, DW_AT_TI_symbol_name("_rsvd_2")
   16126                      .dwattr $C$DW$2184, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
   16127                      .dwattr $C$DW$2184, DW_AT_accessibility(DW_ACCESS_public)
   16128              
   16129              $C$DW$2185      .dwtag  DW_TAG_member
   16130                      .dwattr $C$DW$2185, DW_AT_type(*$C$DW$T$23)
   16131                      .dwattr $C$DW$2185, DW_AT_name("ADCINTFLG")
   16132                      .dwattr $C$DW$2185, DW_AT_TI_symbol_name("_ADCINTFLG")
   16133                      .dwattr $C$DW$2185, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
   16134                      .dwattr $C$DW$2185, DW_AT_accessibility(DW_ACCESS_public)
   16135              
   16136              $C$DW$2186      .dwtag  DW_TAG_member
   16137                      .dwattr $C$DW$2186, DW_AT_type(*$C$DW$T$23)
   16138                      .dwattr $C$DW$2186, DW_AT_name("ADCINTFLGCLR")
   16139                      .dwattr $C$DW$2186, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
   16140                      .dwattr $C$DW$2186, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
   16141                      .dwattr $C$DW$2186, DW_AT_accessibility(DW_ACCESS_public)
   16142              
   16143              $C$DW$2187      .dwtag  DW_TAG_member
   16144                      .dwattr $C$DW$2187, DW_AT_type(*$C$DW$T$23)
   16145                      .dwattr $C$DW$2187, DW_AT_name("ADCINTOVF")
   16146                      .dwattr $C$DW$2187, DW_AT_TI_symbol_name("_ADCINTOVF")
   16147                      .dwattr $C$DW$2187, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
   16148                      .dwattr $C$DW$2187, DW_AT_accessibility(DW_ACCESS_public)
   16149              
   16150              $C$DW$2188      .dwtag  DW_TAG_member
   16151                      .dwattr $C$DW$2188, DW_AT_type(*$C$DW$T$23)
   16152                      .dwattr $C$DW$2188, DW_AT_name("ADCINTOVFCLR")
   16153                      .dwattr $C$DW$2188, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
   16154                      .dwattr $C$DW$2188, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
   16155                      .dwattr $C$DW$2188, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{84A79833-BD82-482D-BA2B-5527AFD5BD9A} PAGE  306

   16156              
   16157              $C$DW$2189      .dwtag  DW_TAG_member
   16158                      .dwattr $C$DW$2189, DW_AT_type(*$C$DW$T$27)
   16159                      .dwattr $C$DW$2189, DW_AT_name("INTSELxNy")
   16160                      .dwattr $C$DW$2189, DW_AT_TI_symbol_name("_INTSELxNy")
   16161                      .dwattr $C$DW$2189, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
   16162                      .dwattr $C$DW$2189, DW_AT_accessibility(DW_ACCESS_public)
   16163              
   16164              $C$DW$2190      .dwtag  DW_TAG_member
   16165                      .dwattr $C$DW$2190, DW_AT_type(*$C$DW$T$28)
   16166                      .dwattr $C$DW$2190, DW_AT_name("rsvd_3")
   16167                      .dwattr $C$DW$2190, DW_AT_TI_symbol_name("_rsvd_3")
   16168                      .dwattr $C$DW$2190, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
   16169                      .dwattr $C$DW$2190, DW_AT_accessibility(DW_ACCESS_public)
   16170              
   16171              $C$DW$2191      .dwtag  DW_TAG_member
   16172                      .dwattr $C$DW$2191, DW_AT_type(*$C$DW$T$23)
   16173                      .dwattr $C$DW$2191, DW_AT_name("SOCPRICTRL")
   16174                      .dwattr $C$DW$2191, DW_AT_TI_symbol_name("_SOCPRICTRL")
   16175                      .dwattr $C$DW$2191, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
   16176                      .dwattr $C$DW$2191, DW_AT_accessibility(DW_ACCESS_public)
   16177              
   16178              $C$DW$2192      .dwtag  DW_TAG_member
   16179                      .dwattr $C$DW$2192, DW_AT_type(*$C$DW$T$23)
   16180                      .dwattr $C$DW$2192, DW_AT_name("rsvd_4")
   16181                      .dwattr $C$DW$2192, DW_AT_TI_symbol_name("_rsvd_4")
   16182                      .dwattr $C$DW$2192, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
   16183                      .dwattr $C$DW$2192, DW_AT_accessibility(DW_ACCESS_public)
   16184              
   16185              $C$DW$2193      .dwtag  DW_TAG_member
   16186                      .dwattr $C$DW$2193, DW_AT_type(*$C$DW$T$23)
   16187                      .dwattr $C$DW$2193, DW_AT_name("ADCSAMPLEMODE")
   16188                      .dwattr $C$DW$2193, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
   16189                      .dwattr $C$DW$2193, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
   16190                      .dwattr $C$DW$2193, DW_AT_accessibility(DW_ACCESS_public)
   16191              
   16192              $C$DW$2194      .dwtag  DW_TAG_member
   16193                      .dwattr $C$DW$2194, DW_AT_type(*$C$DW$T$23)
   16194                      .dwattr $C$DW$2194, DW_AT_name("rsvd_5")
   16195                      .dwattr $C$DW$2194, DW_AT_TI_symbol_name("_rsvd_5")
   16196                      .dwattr $C$DW$2194, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
   16197                      .dwattr $C$DW$2194, DW_AT_accessibility(DW_ACCESS_public)
   16198              
   16199              $C$DW$2195      .dwtag  DW_TAG_member
   16200                      .dwattr $C$DW$2195, DW_AT_type(*$C$DW$T$23)
   16201                      .dwattr $C$DW$2195, DW_AT_name("ADCINTSOCSEL1")
   16202                      .dwattr $C$DW$2195, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
   16203                      .dwattr $C$DW$2195, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
   16204                      .dwattr $C$DW$2195, DW_AT_accessibility(DW_ACCESS_public)
   16205              
   16206              $C$DW$2196      .dwtag  DW_TAG_member
   16207                      .dwattr $C$DW$2196, DW_AT_type(*$C$DW$T$23)
   16208                      .dwattr $C$DW$2196, DW_AT_name("ADCINTSOCSEL2")
   16209                      .dwattr $C$DW$2196, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
   16210                      .dwattr $C$DW$2196, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{84A79833-BD82-482D-BA2B-5527AFD5BD9A} PAGE  307

   16211                      .dwattr $C$DW$2196, DW_AT_accessibility(DW_ACCESS_public)
   16212              
   16213              $C$DW$2197      .dwtag  DW_TAG_member
   16214                      .dwattr $C$DW$2197, DW_AT_type(*$C$DW$T$26)
   16215                      .dwattr $C$DW$2197, DW_AT_name("rsvd_6")
   16216                      .dwattr $C$DW$2197, DW_AT_TI_symbol_name("_rsvd_6")
   16217                      .dwattr $C$DW$2197, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
   16218                      .dwattr $C$DW$2197, DW_AT_accessibility(DW_ACCESS_public)
   16219              
   16220              $C$DW$2198      .dwtag  DW_TAG_member
   16221                      .dwattr $C$DW$2198, DW_AT_type(*$C$DW$T$23)
   16222                      .dwattr $C$DW$2198, DW_AT_name("ADCSOCFLG1")
   16223                      .dwattr $C$DW$2198, DW_AT_TI_symbol_name("_ADCSOCFLG1")
   16224                      .dwattr $C$DW$2198, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
   16225                      .dwattr $C$DW$2198, DW_AT_accessibility(DW_ACCESS_public)
   16226              
   16227              $C$DW$2199      .dwtag  DW_TAG_member
   16228                      .dwattr $C$DW$2199, DW_AT_type(*$C$DW$T$23)
   16229                      .dwattr $C$DW$2199, DW_AT_name("rsvd_7")
   16230                      .dwattr $C$DW$2199, DW_AT_TI_symbol_name("_rsvd_7")
   16231                      .dwattr $C$DW$2199, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   16232                      .dwattr $C$DW$2199, DW_AT_accessibility(DW_ACCESS_public)
   16233              
   16234              $C$DW$2200      .dwtag  DW_TAG_member
   16235                      .dwattr $C$DW$2200, DW_AT_type(*$C$DW$T$23)
   16236                      .dwattr $C$DW$2200, DW_AT_name("ADCSOCFRC1")
   16237                      .dwattr $C$DW$2200, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   16238                      .dwattr $C$DW$2200, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   16239                      .dwattr $C$DW$2200, DW_AT_accessibility(DW_ACCESS_public)
   16240              
   16241              $C$DW$2201      .dwtag  DW_TAG_member
   16242                      .dwattr $C$DW$2201, DW_AT_type(*$C$DW$T$23)
   16243                      .dwattr $C$DW$2201, DW_AT_name("rsvd_8")
   16244                      .dwattr $C$DW$2201, DW_AT_TI_symbol_name("_rsvd_8")
   16245                      .dwattr $C$DW$2201, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   16246                      .dwattr $C$DW$2201, DW_AT_accessibility(DW_ACCESS_public)
   16247              
   16248              $C$DW$2202      .dwtag  DW_TAG_member
   16249                      .dwattr $C$DW$2202, DW_AT_type(*$C$DW$T$23)
   16250                      .dwattr $C$DW$2202, DW_AT_name("ADCSOCOVF1")
   16251                      .dwattr $C$DW$2202, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   16252                      .dwattr $C$DW$2202, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   16253                      .dwattr $C$DW$2202, DW_AT_accessibility(DW_ACCESS_public)
   16254              
   16255              $C$DW$2203      .dwtag  DW_TAG_member
   16256                      .dwattr $C$DW$2203, DW_AT_type(*$C$DW$T$23)
   16257                      .dwattr $C$DW$2203, DW_AT_name("rsvd_9")
   16258                      .dwattr $C$DW$2203, DW_AT_TI_symbol_name("_rsvd_9")
   16259                      .dwattr $C$DW$2203, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
   16260                      .dwattr $C$DW$2203, DW_AT_accessibility(DW_ACCESS_public)
   16261              
   16262              $C$DW$2204      .dwtag  DW_TAG_member
   16263                      .dwattr $C$DW$2204, DW_AT_type(*$C$DW$T$23)
   16264                      .dwattr $C$DW$2204, DW_AT_name("ADCSOCOVFCLR1")
   16265                      .dwattr $C$DW$2204, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{84A79833-BD82-482D-BA2B-5527AFD5BD9A} PAGE  308

   16266                      .dwattr $C$DW$2204, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
   16267                      .dwattr $C$DW$2204, DW_AT_accessibility(DW_ACCESS_public)
   16268              
   16269              $C$DW$2205      .dwtag  DW_TAG_member
   16270                      .dwattr $C$DW$2205, DW_AT_type(*$C$DW$T$23)
   16271                      .dwattr $C$DW$2205, DW_AT_name("rsvd_10")
   16272                      .dwattr $C$DW$2205, DW_AT_TI_symbol_name("_rsvd_10")
   16273                      .dwattr $C$DW$2205, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   16274                      .dwattr $C$DW$2205, DW_AT_accessibility(DW_ACCESS_public)
   16275              
   16276              $C$DW$2206      .dwtag  DW_TAG_member
   16277                      .dwattr $C$DW$2206, DW_AT_type(*$C$DW$T$24)
   16278                      .dwattr $C$DW$2206, DW_AT_name("ADCSOCxCTL")
   16279                      .dwattr $C$DW$2206, DW_AT_TI_symbol_name("_ADCSOCxCTL")
   16280                      .dwattr $C$DW$2206, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   16281                      .dwattr $C$DW$2206, DW_AT_accessibility(DW_ACCESS_public)
   16282              
   16283              $C$DW$2207      .dwtag  DW_TAG_member
   16284                      .dwattr $C$DW$2207, DW_AT_type(*$C$DW$T$24)
   16285                      .dwattr $C$DW$2207, DW_AT_name("rsvd_11")
   16286                      .dwattr $C$DW$2207, DW_AT_TI_symbol_name("_rsvd_11")
   16287                      .dwattr $C$DW$2207, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   16288                      .dwattr $C$DW$2207, DW_AT_accessibility(DW_ACCESS_public)
   16289              
   16290              $C$DW$2208      .dwtag  DW_TAG_member
   16291                      .dwattr $C$DW$2208, DW_AT_type(*$C$DW$T$23)
   16292                      .dwattr $C$DW$2208, DW_AT_name("ADCREFTRIM")
   16293                      .dwattr $C$DW$2208, DW_AT_TI_symbol_name("_ADCREFTRIM")
   16294                      .dwattr $C$DW$2208, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   16295                      .dwattr $C$DW$2208, DW_AT_accessibility(DW_ACCESS_public)
   16296              
   16297              $C$DW$2209      .dwtag  DW_TAG_member
   16298                      .dwattr $C$DW$2209, DW_AT_type(*$C$DW$T$23)
   16299                      .dwattr $C$DW$2209, DW_AT_name("ADCOFFTRIM")
   16300                      .dwattr $C$DW$2209, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   16301                      .dwattr $C$DW$2209, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   16302                      .dwattr $C$DW$2209, DW_AT_accessibility(DW_ACCESS_public)
   16303              
   16304              $C$DW$2210      .dwtag  DW_TAG_member
   16305                      .dwattr $C$DW$2210, DW_AT_type(*$C$DW$T$29)
   16306                      .dwattr $C$DW$2210, DW_AT_name("resvd_12")
   16307                      .dwattr $C$DW$2210, DW_AT_TI_symbol_name("_resvd_12")
   16308                      .dwattr $C$DW$2210, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   16309                      .dwattr $C$DW$2210, DW_AT_accessibility(DW_ACCESS_public)
   16310              
   16311              $C$DW$2211      .dwtag  DW_TAG_member
   16312                      .dwattr $C$DW$2211, DW_AT_type(*$C$DW$T$23)
   16313                      .dwattr $C$DW$2211, DW_AT_name("ADCREV")
   16314                      .dwattr $C$DW$2211, DW_AT_TI_symbol_name("_ADCREV")
   16315                      .dwattr $C$DW$2211, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   16316                      .dwattr $C$DW$2211, DW_AT_accessibility(DW_ACCESS_public)
   16317              
   16318                      .dwendtag $C$DW$T$30
   16319              
   16320              $C$DW$T$358     .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{84A79833-BD82-482D-BA2B-5527AFD5BD9A} PAGE  309

   16321                      .dwattr $C$DW$T$358, DW_AT_name("ADC_Obj")
   16322                      .dwattr $C$DW$T$358, DW_AT_type(*$C$DW$T$30)
   16323                      .dwattr $C$DW$T$358, DW_AT_language(DW_LANG_C)
   16324              
   16325              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
   16326                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$30)
   16327                      .dwattr $C$DW$T$88, DW_AT_address_class(0x20)
   16328              
   16329              $C$DW$T$89      .dwtag  DW_TAG_typedef
   16330                      .dwattr $C$DW$T$89, DW_AT_name("ADC_Handle")
   16331                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
   16332                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
   16333              
   16334              
   16335              $C$DW$T$32      .dwtag  DW_TAG_structure_type
   16336                      .dwattr $C$DW$T$32, DW_AT_name("_CLK_Obj_")
   16337                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x11)
   16338              $C$DW$2212      .dwtag  DW_TAG_member
   16339                      .dwattr $C$DW$2212, DW_AT_type(*$C$DW$T$23)
   16340                      .dwattr $C$DW$2212, DW_AT_name("XCLK")
   16341                      .dwattr $C$DW$2212, DW_AT_TI_symbol_name("_XCLK")
   16342                      .dwattr $C$DW$2212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16343                      .dwattr $C$DW$2212, DW_AT_accessibility(DW_ACCESS_public)
   16344              
   16345              $C$DW$2213      .dwtag  DW_TAG_member
   16346                      .dwattr $C$DW$2213, DW_AT_type(*$C$DW$T$23)
   16347                      .dwattr $C$DW$2213, DW_AT_name("rsvd_1")
   16348                      .dwattr $C$DW$2213, DW_AT_TI_symbol_name("_rsvd_1")
   16349                      .dwattr $C$DW$2213, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16350                      .dwattr $C$DW$2213, DW_AT_accessibility(DW_ACCESS_public)
   16351              
   16352              $C$DW$2214      .dwtag  DW_TAG_member
   16353                      .dwattr $C$DW$2214, DW_AT_type(*$C$DW$T$23)
   16354                      .dwattr $C$DW$2214, DW_AT_name("CLKCTL")
   16355                      .dwattr $C$DW$2214, DW_AT_TI_symbol_name("_CLKCTL")
   16356                      .dwattr $C$DW$2214, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16357                      .dwattr $C$DW$2214, DW_AT_accessibility(DW_ACCESS_public)
   16358              
   16359              $C$DW$2215      .dwtag  DW_TAG_member
   16360                      .dwattr $C$DW$2215, DW_AT_type(*$C$DW$T$31)
   16361                      .dwattr $C$DW$2215, DW_AT_name("rsvd_2")
   16362                      .dwattr $C$DW$2215, DW_AT_TI_symbol_name("_rsvd_2")
   16363                      .dwattr $C$DW$2215, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   16364                      .dwattr $C$DW$2215, DW_AT_accessibility(DW_ACCESS_public)
   16365              
   16366              $C$DW$2216      .dwtag  DW_TAG_member
   16367                      .dwattr $C$DW$2216, DW_AT_type(*$C$DW$T$23)
   16368                      .dwattr $C$DW$2216, DW_AT_name("LOSPCP")
   16369                      .dwattr $C$DW$2216, DW_AT_TI_symbol_name("_LOSPCP")
   16370                      .dwattr $C$DW$2216, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   16371                      .dwattr $C$DW$2216, DW_AT_accessibility(DW_ACCESS_public)
   16372              
   16373              $C$DW$2217      .dwtag  DW_TAG_member
   16374                      .dwattr $C$DW$2217, DW_AT_type(*$C$DW$T$23)
   16375                      .dwattr $C$DW$2217, DW_AT_name("PCLKCR0")
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{84A79833-BD82-482D-BA2B-5527AFD5BD9A} PAGE  310

   16376                      .dwattr $C$DW$2217, DW_AT_TI_symbol_name("_PCLKCR0")
   16377                      .dwattr $C$DW$2217, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   16378                      .dwattr $C$DW$2217, DW_AT_accessibility(DW_ACCESS_public)
   16379              
   16380              $C$DW$2218      .dwtag  DW_TAG_member
   16381                      .dwattr $C$DW$2218, DW_AT_type(*$C$DW$T$23)
   16382                      .dwattr $C$DW$2218, DW_AT_name("PCLKCR1")
   16383                      .dwattr $C$DW$2218, DW_AT_TI_symbol_name("_PCLKCR1")
   16384                      .dwattr $C$DW$2218, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   16385                      .dwattr $C$DW$2218, DW_AT_accessibility(DW_ACCESS_public)
   16386              
   16387              $C$DW$2219      .dwtag  DW_TAG_member
   16388                      .dwattr $C$DW$2219, DW_AT_type(*$C$DW$T$26)
   16389                      .dwattr $C$DW$2219, DW_AT_name("rsvd_3")
   16390                      .dwattr $C$DW$2219, DW_AT_TI_symbol_name("_rsvd_3")
   16391                      .dwattr $C$DW$2219, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   16392                      .dwattr $C$DW$2219, DW_AT_accessibility(DW_ACCESS_public)
   16393              
   16394              $C$DW$2220      .dwtag  DW_TAG_member
   16395                      .dwattr $C$DW$2220, DW_AT_type(*$C$DW$T$23)
   16396                      .dwattr $C$DW$2220, DW_AT_name("PCLKCR3")
   16397                      .dwattr $C$DW$2220, DW_AT_TI_symbol_name("_PCLKCR3")
   16398                      .dwattr $C$DW$2220, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   16399                      .dwattr $C$DW$2220, DW_AT_accessibility(DW_ACCESS_public)
   16400              
   16401                      .dwendtag $C$DW$T$32
   16402              
   16403              $C$DW$T$90      .dwtag  DW_TAG_pointer_type
   16404                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$32)
   16405                      .dwattr $C$DW$T$90, DW_AT_address_class(0x20)
   16406              
   16407              $C$DW$T$91      .dwtag  DW_TAG_typedef
   16408                      .dwattr $C$DW$T$91, DW_AT_name("CLK_Handle")
   16409                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
   16410                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
   16411              
   16412              
   16413              $C$DW$T$35      .dwtag  DW_TAG_structure_type
   16414                      .dwattr $C$DW$T$35, DW_AT_name("_CPU_Obj_")
   16415                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
   16416              $C$DW$2221      .dwtag  DW_TAG_member
   16417                      .dwattr $C$DW$2221, DW_AT_type(*$C$DW$T$34)
   16418                      .dwattr $C$DW$2221, DW_AT_name("tmp")
   16419                      .dwattr $C$DW$2221, DW_AT_TI_symbol_name("_tmp")
   16420                      .dwattr $C$DW$2221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16421                      .dwattr $C$DW$2221, DW_AT_accessibility(DW_ACCESS_public)
   16422              
   16423                      .dwendtag $C$DW$T$35
   16424              
   16425              $C$DW$T$367     .dwtag  DW_TAG_typedef
   16426                      .dwattr $C$DW$T$367, DW_AT_name("CPU_Obj")
   16427                      .dwattr $C$DW$T$367, DW_AT_type(*$C$DW$T$35)
   16428                      .dwattr $C$DW$T$367, DW_AT_language(DW_LANG_C)
   16429              
   16430              $C$DW$T$92      .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{84A79833-BD82-482D-BA2B-5527AFD5BD9A} PAGE  311

   16431                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$35)
   16432                      .dwattr $C$DW$T$92, DW_AT_address_class(0x20)
   16433              
   16434              $C$DW$T$93      .dwtag  DW_TAG_typedef
   16435                      .dwattr $C$DW$T$93, DW_AT_name("CPU_Handle")
   16436                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
   16437                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
   16438              
   16439              
   16440              $C$DW$T$43      .dwtag  DW_TAG_structure_type
   16441                      .dwattr $C$DW$T$43, DW_AT_name("_DRV8301_Obj_")
   16442                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x08)
   16443              $C$DW$2222      .dwtag  DW_TAG_member
   16444                      .dwattr $C$DW$2222, DW_AT_type(*$C$DW$T$37)
   16445                      .dwattr $C$DW$2222, DW_AT_name("spiHandle")
   16446                      .dwattr $C$DW$2222, DW_AT_TI_symbol_name("_spiHandle")
   16447                      .dwattr $C$DW$2222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16448                      .dwattr $C$DW$2222, DW_AT_accessibility(DW_ACCESS_public)
   16449              
   16450              $C$DW$2223      .dwtag  DW_TAG_member
   16451                      .dwattr $C$DW$2223, DW_AT_type(*$C$DW$T$39)
   16452                      .dwattr $C$DW$2223, DW_AT_name("gpioHandle")
   16453                      .dwattr $C$DW$2223, DW_AT_TI_symbol_name("_gpioHandle")
   16454                      .dwattr $C$DW$2223, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16455                      .dwattr $C$DW$2223, DW_AT_accessibility(DW_ACCESS_public)
   16456              
   16457              $C$DW$2224      .dwtag  DW_TAG_member
   16458                      .dwattr $C$DW$2224, DW_AT_type(*$C$DW$T$41)
   16459                      .dwattr $C$DW$2224, DW_AT_name("gpioNumber")
   16460                      .dwattr $C$DW$2224, DW_AT_TI_symbol_name("_gpioNumber")
   16461                      .dwattr $C$DW$2224, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16462                      .dwattr $C$DW$2224, DW_AT_accessibility(DW_ACCESS_public)
   16463              
   16464              $C$DW$2225      .dwtag  DW_TAG_member
   16465                      .dwattr $C$DW$2225, DW_AT_type(*$C$DW$T$42)
   16466                      .dwattr $C$DW$2225, DW_AT_name("RxTimeOut")
   16467                      .dwattr $C$DW$2225, DW_AT_TI_symbol_name("_RxTimeOut")
   16468                      .dwattr $C$DW$2225, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   16469                      .dwattr $C$DW$2225, DW_AT_accessibility(DW_ACCESS_public)
   16470              
   16471              $C$DW$2226      .dwtag  DW_TAG_member
   16472                      .dwattr $C$DW$2226, DW_AT_type(*$C$DW$T$42)
   16473                      .dwattr $C$DW$2226, DW_AT_name("enableTimeOut")
   16474                      .dwattr $C$DW$2226, DW_AT_TI_symbol_name("_enableTimeOut")
   16475                      .dwattr $C$DW$2226, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   16476                      .dwattr $C$DW$2226, DW_AT_accessibility(DW_ACCESS_public)
   16477              
   16478                      .dwendtag $C$DW$T$43
   16479              
   16480              $C$DW$T$120     .dwtag  DW_TAG_typedef
   16481                      .dwattr $C$DW$T$120, DW_AT_name("DRV8301_Obj")
   16482                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$43)
   16483                      .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
   16484              
   16485              $C$DW$T$118     .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{84A79833-BD82-482D-BA2B-5527AFD5BD9A} PAGE  312

   16486                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$43)
   16487                      .dwattr $C$DW$T$118, DW_AT_address_class(0x20)
   16488              
   16489              $C$DW$T$119     .dwtag  DW_TAG_typedef
   16490                      .dwattr $C$DW$T$119, DW_AT_name("DRV8301_Handle")
   16491                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
   16492                      .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
   16493              
   16494              
   16495              $C$DW$T$54      .dwtag  DW_TAG_structure_type
   16496                      .dwattr $C$DW$T$54, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
   16497                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x05)
   16498              $C$DW$2227      .dwtag  DW_TAG_member
   16499                      .dwattr $C$DW$2227, DW_AT_type(*$C$DW$T$45)
   16500                      .dwattr $C$DW$2227, DW_AT_name("DRV8301_CURRENT")
   16501                      .dwattr $C$DW$2227, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
   16502                      .dwattr $C$DW$2227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16503                      .dwattr $C$DW$2227, DW_AT_accessibility(DW_ACCESS_public)
   16504              
   16505              $C$DW$2228      .dwtag  DW_TAG_member
   16506                      .dwattr $C$DW$2228, DW_AT_type(*$C$DW$T$47)
   16507                      .dwattr $C$DW$2228, DW_AT_name("DRV8301_RESET")
   16508                      .dwattr $C$DW$2228, DW_AT_TI_symbol_name("_DRV8301_RESET")
   16509                      .dwattr $C$DW$2228, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16510                      .dwattr $C$DW$2228, DW_AT_accessibility(DW_ACCESS_public)
   16511              
   16512              $C$DW$2229      .dwtag  DW_TAG_member
   16513                      .dwattr $C$DW$2229, DW_AT_type(*$C$DW$T$49)
   16514                      .dwattr $C$DW$2229, DW_AT_name("PWM_MODE")
   16515                      .dwattr $C$DW$2229, DW_AT_TI_symbol_name("_PWM_MODE")
   16516                      .dwattr $C$DW$2229, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16517                      .dwattr $C$DW$2229, DW_AT_accessibility(DW_ACCESS_public)
   16518              
   16519              $C$DW$2230      .dwtag  DW_TAG_member
   16520                      .dwattr $C$DW$2230, DW_AT_type(*$C$DW$T$51)
   16521                      .dwattr $C$DW$2230, DW_AT_name("OC_MODE")
   16522                      .dwattr $C$DW$2230, DW_AT_TI_symbol_name("_OC_MODE")
   16523                      .dwattr $C$DW$2230, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   16524                      .dwattr $C$DW$2230, DW_AT_accessibility(DW_ACCESS_public)
   16525              
   16526              $C$DW$2231      .dwtag  DW_TAG_member
   16527                      .dwattr $C$DW$2231, DW_AT_type(*$C$DW$T$53)
   16528                      .dwattr $C$DW$2231, DW_AT_name("OC_ADJ_SET")
   16529                      .dwattr $C$DW$2231, DW_AT_TI_symbol_name("_OC_ADJ_SET")
   16530                      .dwattr $C$DW$2231, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16531                      .dwattr $C$DW$2231, DW_AT_accessibility(DW_ACCESS_public)
   16532              
   16533                      .dwendtag $C$DW$T$54
   16534              
   16535              $C$DW$T$68      .dwtag  DW_TAG_typedef
   16536                      .dwattr $C$DW$T$68, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
   16537                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$54)
   16538                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
   16539              
   16540              
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{84A79833-BD82-482D-BA2B-5527AFD5BD9A} PAGE  313

   16541              $C$DW$T$63      .dwtag  DW_TAG_structure_type
   16542                      .dwattr $C$DW$T$63, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
   16543                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
   16544              $C$DW$2232      .dwtag  DW_TAG_member
   16545                      .dwattr $C$DW$2232, DW_AT_type(*$C$DW$T$56)
   16546                      .dwattr $C$DW$2232, DW_AT_name("OCTW_SET")
   16547                      .dwattr $C$DW$2232, DW_AT_TI_symbol_name("_OCTW_SET")
   16548                      .dwattr $C$DW$2232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16549                      .dwattr $C$DW$2232, DW_AT_accessibility(DW_ACCESS_public)
   16550              
   16551              $C$DW$2233      .dwtag  DW_TAG_member
   16552                      .dwattr $C$DW$2233, DW_AT_type(*$C$DW$T$58)
   16553                      .dwattr $C$DW$2233, DW_AT_name("GAIN")
   16554                      .dwattr $C$DW$2233, DW_AT_TI_symbol_name("_GAIN")
   16555                      .dwattr $C$DW$2233, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16556                      .dwattr $C$DW$2233, DW_AT_accessibility(DW_ACCESS_public)
   16557              
   16558              $C$DW$2234      .dwtag  DW_TAG_member
   16559                      .dwattr $C$DW$2234, DW_AT_type(*$C$DW$T$60)
   16560                      .dwattr $C$DW$2234, DW_AT_name("DC_CAL_CH1p2")
   16561                      .dwattr $C$DW$2234, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
   16562                      .dwattr $C$DW$2234, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16563                      .dwattr $C$DW$2234, DW_AT_accessibility(DW_ACCESS_public)
   16564              
   16565              $C$DW$2235      .dwtag  DW_TAG_member
   16566                      .dwattr $C$DW$2235, DW_AT_type(*$C$DW$T$62)
   16567                      .dwattr $C$DW$2235, DW_AT_name("OC_TOFF")
   16568                      .dwattr $C$DW$2235, DW_AT_TI_symbol_name("_OC_TOFF")
   16569                      .dwattr $C$DW$2235, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   16570                      .dwattr $C$DW$2235, DW_AT_accessibility(DW_ACCESS_public)
   16571              
   16572                      .dwendtag $C$DW$T$63
   16573              
   16574              $C$DW$T$69      .dwtag  DW_TAG_typedef
   16575                      .dwattr $C$DW$T$69, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
   16576                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$63)
   16577                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
   16578              
   16579              
   16580              $C$DW$T$64      .dwtag  DW_TAG_structure_type
   16581                      .dwattr $C$DW$T$64, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
   16582                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x0b)
   16583              $C$DW$2236      .dwtag  DW_TAG_member
   16584                      .dwattr $C$DW$2236, DW_AT_type(*$C$DW$T$42)
   16585                      .dwattr $C$DW$2236, DW_AT_name("FAULT")
   16586                      .dwattr $C$DW$2236, DW_AT_TI_symbol_name("_FAULT")
   16587                      .dwattr $C$DW$2236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16588                      .dwattr $C$DW$2236, DW_AT_accessibility(DW_ACCESS_public)
   16589              
   16590              $C$DW$2237      .dwtag  DW_TAG_member
   16591                      .dwattr $C$DW$2237, DW_AT_type(*$C$DW$T$42)
   16592                      .dwattr $C$DW$2237, DW_AT_name("GVDD_UV")
   16593                      .dwattr $C$DW$2237, DW_AT_TI_symbol_name("_GVDD_UV")
   16594                      .dwattr $C$DW$2237, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16595                      .dwattr $C$DW$2237, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{84A79833-BD82-482D-BA2B-5527AFD5BD9A} PAGE  314

   16596              
   16597              $C$DW$2238      .dwtag  DW_TAG_member
   16598                      .dwattr $C$DW$2238, DW_AT_type(*$C$DW$T$42)
   16599                      .dwattr $C$DW$2238, DW_AT_name("PVDD_UV")
   16600                      .dwattr $C$DW$2238, DW_AT_TI_symbol_name("_PVDD_UV")
   16601                      .dwattr $C$DW$2238, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16602                      .dwattr $C$DW$2238, DW_AT_accessibility(DW_ACCESS_public)
   16603              
   16604              $C$DW$2239      .dwtag  DW_TAG_member
   16605                      .dwattr $C$DW$2239, DW_AT_type(*$C$DW$T$42)
   16606                      .dwattr $C$DW$2239, DW_AT_name("OTSD")
   16607                      .dwattr $C$DW$2239, DW_AT_TI_symbol_name("_OTSD")
   16608                      .dwattr $C$DW$2239, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   16609                      .dwattr $C$DW$2239, DW_AT_accessibility(DW_ACCESS_public)
   16610              
   16611              $C$DW$2240      .dwtag  DW_TAG_member
   16612                      .dwattr $C$DW$2240, DW_AT_type(*$C$DW$T$42)
   16613                      .dwattr $C$DW$2240, DW_AT_name("OTW")
   16614                      .dwattr $C$DW$2240, DW_AT_TI_symbol_name("_OTW")
   16615                      .dwattr $C$DW$2240, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16616                      .dwattr $C$DW$2240, DW_AT_accessibility(DW_ACCESS_public)
   16617              
   16618              $C$DW$2241      .dwtag  DW_TAG_member
   16619                      .dwattr $C$DW$2241, DW_AT_type(*$C$DW$T$42)
   16620                      .dwattr $C$DW$2241, DW_AT_name("FETHA_OC")
   16621                      .dwattr $C$DW$2241, DW_AT_TI_symbol_name("_FETHA_OC")
   16622                      .dwattr $C$DW$2241, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   16623                      .dwattr $C$DW$2241, DW_AT_accessibility(DW_ACCESS_public)
   16624              
   16625              $C$DW$2242      .dwtag  DW_TAG_member
   16626                      .dwattr $C$DW$2242, DW_AT_type(*$C$DW$T$42)
   16627                      .dwattr $C$DW$2242, DW_AT_name("FETLA_OC")
   16628                      .dwattr $C$DW$2242, DW_AT_TI_symbol_name("_FETLA_OC")
   16629                      .dwattr $C$DW$2242, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   16630                      .dwattr $C$DW$2242, DW_AT_accessibility(DW_ACCESS_public)
   16631              
   16632              $C$DW$2243      .dwtag  DW_TAG_member
   16633                      .dwattr $C$DW$2243, DW_AT_type(*$C$DW$T$42)
   16634                      .dwattr $C$DW$2243, DW_AT_name("FETHB_OC")
   16635                      .dwattr $C$DW$2243, DW_AT_TI_symbol_name("_FETHB_OC")
   16636                      .dwattr $C$DW$2243, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   16637                      .dwattr $C$DW$2243, DW_AT_accessibility(DW_ACCESS_public)
   16638              
   16639              $C$DW$2244      .dwtag  DW_TAG_member
   16640                      .dwattr $C$DW$2244, DW_AT_type(*$C$DW$T$42)
   16641                      .dwattr $C$DW$2244, DW_AT_name("FETLB_OC")
   16642                      .dwattr $C$DW$2244, DW_AT_TI_symbol_name("_FETLB_OC")
   16643                      .dwattr $C$DW$2244, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   16644                      .dwattr $C$DW$2244, DW_AT_accessibility(DW_ACCESS_public)
   16645              
   16646              $C$DW$2245      .dwtag  DW_TAG_member
   16647                      .dwattr $C$DW$2245, DW_AT_type(*$C$DW$T$42)
   16648                      .dwattr $C$DW$2245, DW_AT_name("FETHC_OC")
   16649                      .dwattr $C$DW$2245, DW_AT_TI_symbol_name("_FETHC_OC")
   16650                      .dwattr $C$DW$2245, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{84A79833-BD82-482D-BA2B-5527AFD5BD9A} PAGE  315

   16651                      .dwattr $C$DW$2245, DW_AT_accessibility(DW_ACCESS_public)
   16652              
   16653              $C$DW$2246      .dwtag  DW_TAG_member
   16654                      .dwattr $C$DW$2246, DW_AT_type(*$C$DW$T$42)
   16655                      .dwattr $C$DW$2246, DW_AT_name("FETLC_OC")
   16656                      .dwattr $C$DW$2246, DW_AT_TI_symbol_name("_FETLC_OC")
   16657                      .dwattr $C$DW$2246, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   16658                      .dwattr $C$DW$2246, DW_AT_accessibility(DW_ACCESS_public)
   16659              
   16660                      .dwendtag $C$DW$T$64
   16661              
   16662              $C$DW$T$66      .dwtag  DW_TAG_typedef
   16663                      .dwattr $C$DW$T$66, DW_AT_name("DRV_SPI_8301_Stat1_t_")
   16664                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$64)
   16665                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
   16666              
   16667              
   16668              $C$DW$T$65      .dwtag  DW_TAG_structure_type
   16669                      .dwattr $C$DW$T$65, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
   16670                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x02)
   16671              $C$DW$2247      .dwtag  DW_TAG_member
   16672                      .dwattr $C$DW$2247, DW_AT_type(*$C$DW$T$42)
   16673                      .dwattr $C$DW$2247, DW_AT_name("GVDD_OV")
   16674                      .dwattr $C$DW$2247, DW_AT_TI_symbol_name("_GVDD_OV")
   16675                      .dwattr $C$DW$2247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16676                      .dwattr $C$DW$2247, DW_AT_accessibility(DW_ACCESS_public)
   16677              
   16678              $C$DW$2248      .dwtag  DW_TAG_member
   16679                      .dwattr $C$DW$2248, DW_AT_type(*$C$DW$T$22)
   16680                      .dwattr $C$DW$2248, DW_AT_name("DeviceID")
   16681                      .dwattr $C$DW$2248, DW_AT_TI_symbol_name("_DeviceID")
   16682                      .dwattr $C$DW$2248, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16683                      .dwattr $C$DW$2248, DW_AT_accessibility(DW_ACCESS_public)
   16684              
   16685                      .dwendtag $C$DW$T$65
   16686              
   16687              $C$DW$T$67      .dwtag  DW_TAG_typedef
   16688                      .dwattr $C$DW$T$67, DW_AT_name("DRV_SPI_8301_Stat2_t_")
   16689                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$65)
   16690                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
   16691              
   16692              
   16693              $C$DW$T$70      .dwtag  DW_TAG_structure_type
   16694                      .dwattr $C$DW$T$70, DW_AT_name("_DRV_SPI_8301_Vars_t_")
   16695                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x18)
   16696              $C$DW$2249      .dwtag  DW_TAG_member
   16697                      .dwattr $C$DW$2249, DW_AT_type(*$C$DW$T$66)
   16698                      .dwattr $C$DW$2249, DW_AT_name("Stat_Reg_1")
   16699                      .dwattr $C$DW$2249, DW_AT_TI_symbol_name("_Stat_Reg_1")
   16700                      .dwattr $C$DW$2249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16701                      .dwattr $C$DW$2249, DW_AT_accessibility(DW_ACCESS_public)
   16702              
   16703              $C$DW$2250      .dwtag  DW_TAG_member
   16704                      .dwattr $C$DW$2250, DW_AT_type(*$C$DW$T$67)
   16705                      .dwattr $C$DW$2250, DW_AT_name("Stat_Reg_2")
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{84A79833-BD82-482D-BA2B-5527AFD5BD9A} PAGE  316

   16706                      .dwattr $C$DW$2250, DW_AT_TI_symbol_name("_Stat_Reg_2")
   16707                      .dwattr $C$DW$2250, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   16708                      .dwattr $C$DW$2250, DW_AT_accessibility(DW_ACCESS_public)
   16709              
   16710              $C$DW$2251      .dwtag  DW_TAG_member
   16711                      .dwattr $C$DW$2251, DW_AT_type(*$C$DW$T$68)
   16712                      .dwattr $C$DW$2251, DW_AT_name("Ctrl_Reg_1")
   16713                      .dwattr $C$DW$2251, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
   16714                      .dwattr $C$DW$2251, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   16715                      .dwattr $C$DW$2251, DW_AT_accessibility(DW_ACCESS_public)
   16716              
   16717              $C$DW$2252      .dwtag  DW_TAG_member
   16718                      .dwattr $C$DW$2252, DW_AT_type(*$C$DW$T$69)
   16719                      .dwattr $C$DW$2252, DW_AT_name("Ctrl_Reg_2")
   16720                      .dwattr $C$DW$2252, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
   16721                      .dwattr $C$DW$2252, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   16722                      .dwattr $C$DW$2252, DW_AT_accessibility(DW_ACCESS_public)
   16723              
   16724              $C$DW$2253      .dwtag  DW_TAG_member
   16725                      .dwattr $C$DW$2253, DW_AT_type(*$C$DW$T$42)
   16726                      .dwattr $C$DW$2253, DW_AT_name("SndCmd")
   16727                      .dwattr $C$DW$2253, DW_AT_TI_symbol_name("_SndCmd")
   16728                      .dwattr $C$DW$2253, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   16729                      .dwattr $C$DW$2253, DW_AT_accessibility(DW_ACCESS_public)
   16730              
   16731              $C$DW$2254      .dwtag  DW_TAG_member
   16732                      .dwattr $C$DW$2254, DW_AT_type(*$C$DW$T$42)
   16733                      .dwattr $C$DW$2254, DW_AT_name("RcvCmd")
   16734                      .dwattr $C$DW$2254, DW_AT_TI_symbol_name("_RcvCmd")
   16735                      .dwattr $C$DW$2254, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
   16736                      .dwattr $C$DW$2254, DW_AT_accessibility(DW_ACCESS_public)
   16737              
   16738                      .dwendtag $C$DW$T$70
   16739              
   16740              $C$DW$T$374     .dwtag  DW_TAG_typedef
   16741                      .dwattr $C$DW$T$374, DW_AT_name("DRV_SPI_8301_Vars_t")
   16742                      .dwattr $C$DW$T$374, DW_AT_type(*$C$DW$T$70)
   16743                      .dwattr $C$DW$T$374, DW_AT_language(DW_LANG_C)
   16744              
   16745              $C$DW$T$375     .dwtag  DW_TAG_pointer_type
   16746                      .dwattr $C$DW$T$375, DW_AT_type(*$C$DW$T$374)
   16747                      .dwattr $C$DW$T$375, DW_AT_address_class(0x20)
   16748              
   16749              
   16750              $C$DW$T$72      .dwtag  DW_TAG_structure_type
   16751                      .dwattr $C$DW$T$72, DW_AT_name("_FILTER_FO_")
   16752                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x0a)
   16753              $C$DW$2255      .dwtag  DW_TAG_member
   16754                      .dwattr $C$DW$2255, DW_AT_type(*$C$DW$T$71)
   16755                      .dwattr $C$DW$2255, DW_AT_name("a1")
   16756                      .dwattr $C$DW$2255, DW_AT_TI_symbol_name("_a1")
   16757                      .dwattr $C$DW$2255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16758                      .dwattr $C$DW$2255, DW_AT_accessibility(DW_ACCESS_public)
   16759              
   16760              $C$DW$2256      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{84A79833-BD82-482D-BA2B-5527AFD5BD9A} PAGE  317

   16761                      .dwattr $C$DW$2256, DW_AT_type(*$C$DW$T$71)
   16762                      .dwattr $C$DW$2256, DW_AT_name("b0")
   16763                      .dwattr $C$DW$2256, DW_AT_TI_symbol_name("_b0")
   16764                      .dwattr $C$DW$2256, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16765                      .dwattr $C$DW$2256, DW_AT_accessibility(DW_ACCESS_public)
   16766              
   16767              $C$DW$2257      .dwtag  DW_TAG_member
   16768                      .dwattr $C$DW$2257, DW_AT_type(*$C$DW$T$71)
   16769                      .dwattr $C$DW$2257, DW_AT_name("b1")
   16770                      .dwattr $C$DW$2257, DW_AT_TI_symbol_name("_b1")
   16771                      .dwattr $C$DW$2257, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16772                      .dwattr $C$DW$2257, DW_AT_accessibility(DW_ACCESS_public)
   16773              
   16774              $C$DW$2258      .dwtag  DW_TAG_member
   16775                      .dwattr $C$DW$2258, DW_AT_type(*$C$DW$T$71)
   16776                      .dwattr $C$DW$2258, DW_AT_name("x1")
   16777                      .dwattr $C$DW$2258, DW_AT_TI_symbol_name("_x1")
   16778                      .dwattr $C$DW$2258, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   16779                      .dwattr $C$DW$2258, DW_AT_accessibility(DW_ACCESS_public)
   16780              
   16781              $C$DW$2259      .dwtag  DW_TAG_member
   16782                      .dwattr $C$DW$2259, DW_AT_type(*$C$DW$T$71)
   16783                      .dwattr $C$DW$2259, DW_AT_name("y1")
   16784                      .dwattr $C$DW$2259, DW_AT_TI_symbol_name("_y1")
   16785                      .dwattr $C$DW$2259, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   16786                      .dwattr $C$DW$2259, DW_AT_accessibility(DW_ACCESS_public)
   16787              
   16788                      .dwendtag $C$DW$T$72
   16789              
   16790              $C$DW$T$126     .dwtag  DW_TAG_typedef
   16791                      .dwattr $C$DW$T$126, DW_AT_name("FILTER_FO_Obj")
   16792                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$72)
   16793                      .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
   16794              
   16795              
   16796              $C$DW$T$19      .dwtag  DW_TAG_structure_type
   16797                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
   16798                      .dwattr $C$DW$T$19, DW_AT_declaration
   16799                      .dwendtag $C$DW$T$19
   16800              
   16801              $C$DW$T$127     .dwtag  DW_TAG_pointer_type
   16802                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$19)
   16803                      .dwattr $C$DW$T$127, DW_AT_address_class(0x20)
   16804              
   16805              $C$DW$T$128     .dwtag  DW_TAG_typedef
   16806                      .dwattr $C$DW$T$128, DW_AT_name("FILTER_FO_Handle")
   16807                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$127)
   16808                      .dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
   16809              
   16810              
   16811              $C$DW$T$73      .dwtag  DW_TAG_structure_type
   16812                      .dwattr $C$DW$T$73, DW_AT_name("_FLASH_Obj_")
   16813                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x08)
   16814              $C$DW$2260      .dwtag  DW_TAG_member
   16815                      .dwattr $C$DW$2260, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{84A79833-BD82-482D-BA2B-5527AFD5BD9A} PAGE  318

   16816                      .dwattr $C$DW$2260, DW_AT_name("FOPT")
   16817                      .dwattr $C$DW$2260, DW_AT_TI_symbol_name("_FOPT")
   16818                      .dwattr $C$DW$2260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16819                      .dwattr $C$DW$2260, DW_AT_accessibility(DW_ACCESS_public)
   16820              
   16821              $C$DW$2261      .dwtag  DW_TAG_member
   16822                      .dwattr $C$DW$2261, DW_AT_type(*$C$DW$T$23)
   16823                      .dwattr $C$DW$2261, DW_AT_name("rsvd_1")
   16824                      .dwattr $C$DW$2261, DW_AT_TI_symbol_name("_rsvd_1")
   16825                      .dwattr $C$DW$2261, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16826                      .dwattr $C$DW$2261, DW_AT_accessibility(DW_ACCESS_public)
   16827              
   16828              $C$DW$2262      .dwtag  DW_TAG_member
   16829                      .dwattr $C$DW$2262, DW_AT_type(*$C$DW$T$23)
   16830                      .dwattr $C$DW$2262, DW_AT_name("FPWR")
   16831                      .dwattr $C$DW$2262, DW_AT_TI_symbol_name("_FPWR")
   16832                      .dwattr $C$DW$2262, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16833                      .dwattr $C$DW$2262, DW_AT_accessibility(DW_ACCESS_public)
   16834              
   16835              $C$DW$2263      .dwtag  DW_TAG_member
   16836                      .dwattr $C$DW$2263, DW_AT_type(*$C$DW$T$23)
   16837                      .dwattr $C$DW$2263, DW_AT_name("FSTATUS")
   16838                      .dwattr $C$DW$2263, DW_AT_TI_symbol_name("_FSTATUS")
   16839                      .dwattr $C$DW$2263, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   16840                      .dwattr $C$DW$2263, DW_AT_accessibility(DW_ACCESS_public)
   16841              
   16842              $C$DW$2264      .dwtag  DW_TAG_member
   16843                      .dwattr $C$DW$2264, DW_AT_type(*$C$DW$T$23)
   16844                      .dwattr $C$DW$2264, DW_AT_name("FSTDBYWAIT")
   16845                      .dwattr $C$DW$2264, DW_AT_TI_symbol_name("_FSTDBYWAIT")
   16846                      .dwattr $C$DW$2264, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16847                      .dwattr $C$DW$2264, DW_AT_accessibility(DW_ACCESS_public)
   16848              
   16849              $C$DW$2265      .dwtag  DW_TAG_member
   16850                      .dwattr $C$DW$2265, DW_AT_type(*$C$DW$T$23)
   16851                      .dwattr $C$DW$2265, DW_AT_name("FACTIVEWAIT")
   16852                      .dwattr $C$DW$2265, DW_AT_TI_symbol_name("_FACTIVEWAIT")
   16853                      .dwattr $C$DW$2265, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   16854                      .dwattr $C$DW$2265, DW_AT_accessibility(DW_ACCESS_public)
   16855              
   16856              $C$DW$2266      .dwtag  DW_TAG_member
   16857                      .dwattr $C$DW$2266, DW_AT_type(*$C$DW$T$23)
   16858                      .dwattr $C$DW$2266, DW_AT_name("FBANKWAIT")
   16859                      .dwattr $C$DW$2266, DW_AT_TI_symbol_name("_FBANKWAIT")
   16860                      .dwattr $C$DW$2266, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   16861                      .dwattr $C$DW$2266, DW_AT_accessibility(DW_ACCESS_public)
   16862              
   16863              $C$DW$2267      .dwtag  DW_TAG_member
   16864                      .dwattr $C$DW$2267, DW_AT_type(*$C$DW$T$23)
   16865                      .dwattr $C$DW$2267, DW_AT_name("FOTPWAIT")
   16866                      .dwattr $C$DW$2267, DW_AT_TI_symbol_name("_FOTPWAIT")
   16867                      .dwattr $C$DW$2267, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   16868                      .dwattr $C$DW$2267, DW_AT_accessibility(DW_ACCESS_public)
   16869              
   16870                      .dwendtag $C$DW$T$73
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{84A79833-BD82-482D-BA2B-5527AFD5BD9A} PAGE  319

   16871              
   16872              $C$DW$T$94      .dwtag  DW_TAG_pointer_type
   16873                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$73)
   16874                      .dwattr $C$DW$T$94, DW_AT_address_class(0x20)
   16875              
   16876              $C$DW$T$95      .dwtag  DW_TAG_typedef
   16877                      .dwattr $C$DW$T$95, DW_AT_name("FLASH_Handle")
   16878                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
   16879                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
   16880              
   16881              
   16882              $C$DW$T$79      .dwtag  DW_TAG_structure_type
   16883                      .dwattr $C$DW$T$79, DW_AT_name("_GPIO_Obj_")
   16884                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x6a)
   16885              $C$DW$2268      .dwtag  DW_TAG_member
   16886                      .dwattr $C$DW$2268, DW_AT_type(*$C$DW$T$76)
   16887                      .dwattr $C$DW$2268, DW_AT_name("GPACTRL")
   16888                      .dwattr $C$DW$2268, DW_AT_TI_symbol_name("_GPACTRL")
   16889                      .dwattr $C$DW$2268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16890                      .dwattr $C$DW$2268, DW_AT_accessibility(DW_ACCESS_public)
   16891              
   16892              $C$DW$2269      .dwtag  DW_TAG_member
   16893                      .dwattr $C$DW$2269, DW_AT_type(*$C$DW$T$76)
   16894                      .dwattr $C$DW$2269, DW_AT_name("GPAQSEL1")
   16895                      .dwattr $C$DW$2269, DW_AT_TI_symbol_name("_GPAQSEL1")
   16896                      .dwattr $C$DW$2269, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16897                      .dwattr $C$DW$2269, DW_AT_accessibility(DW_ACCESS_public)
   16898              
   16899              $C$DW$2270      .dwtag  DW_TAG_member
   16900                      .dwattr $C$DW$2270, DW_AT_type(*$C$DW$T$76)
   16901                      .dwattr $C$DW$2270, DW_AT_name("GPAQSEL2")
   16902                      .dwattr $C$DW$2270, DW_AT_TI_symbol_name("_GPAQSEL2")
   16903                      .dwattr $C$DW$2270, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16904                      .dwattr $C$DW$2270, DW_AT_accessibility(DW_ACCESS_public)
   16905              
   16906              $C$DW$2271      .dwtag  DW_TAG_member
   16907                      .dwattr $C$DW$2271, DW_AT_type(*$C$DW$T$76)
   16908                      .dwattr $C$DW$2271, DW_AT_name("GPAMUX1")
   16909                      .dwattr $C$DW$2271, DW_AT_TI_symbol_name("_GPAMUX1")
   16910                      .dwattr $C$DW$2271, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   16911                      .dwattr $C$DW$2271, DW_AT_accessibility(DW_ACCESS_public)
   16912              
   16913              $C$DW$2272      .dwtag  DW_TAG_member
   16914                      .dwattr $C$DW$2272, DW_AT_type(*$C$DW$T$76)
   16915                      .dwattr $C$DW$2272, DW_AT_name("GPAMUX2")
   16916                      .dwattr $C$DW$2272, DW_AT_TI_symbol_name("_GPAMUX2")
   16917                      .dwattr $C$DW$2272, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   16918                      .dwattr $C$DW$2272, DW_AT_accessibility(DW_ACCESS_public)
   16919              
   16920              $C$DW$2273      .dwtag  DW_TAG_member
   16921                      .dwattr $C$DW$2273, DW_AT_type(*$C$DW$T$76)
   16922                      .dwattr $C$DW$2273, DW_AT_name("GPADIR")
   16923                      .dwattr $C$DW$2273, DW_AT_TI_symbol_name("_GPADIR")
   16924                      .dwattr $C$DW$2273, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   16925                      .dwattr $C$DW$2273, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{84A79833-BD82-482D-BA2B-5527AFD5BD9A} PAGE  320

   16926              
   16927              $C$DW$2274      .dwtag  DW_TAG_member
   16928                      .dwattr $C$DW$2274, DW_AT_type(*$C$DW$T$76)
   16929                      .dwattr $C$DW$2274, DW_AT_name("GPAPUD")
   16930                      .dwattr $C$DW$2274, DW_AT_TI_symbol_name("_GPAPUD")
   16931                      .dwattr $C$DW$2274, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   16932                      .dwattr $C$DW$2274, DW_AT_accessibility(DW_ACCESS_public)
   16933              
   16934              $C$DW$2275      .dwtag  DW_TAG_member
   16935                      .dwattr $C$DW$2275, DW_AT_type(*$C$DW$T$26)
   16936                      .dwattr $C$DW$2275, DW_AT_name("rsvd_1")
   16937                      .dwattr $C$DW$2275, DW_AT_TI_symbol_name("_rsvd_1")
   16938                      .dwattr $C$DW$2275, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   16939                      .dwattr $C$DW$2275, DW_AT_accessibility(DW_ACCESS_public)
   16940              
   16941              $C$DW$2276      .dwtag  DW_TAG_member
   16942                      .dwattr $C$DW$2276, DW_AT_type(*$C$DW$T$76)
   16943                      .dwattr $C$DW$2276, DW_AT_name("GPBCTRL")
   16944                      .dwattr $C$DW$2276, DW_AT_TI_symbol_name("_GPBCTRL")
   16945                      .dwattr $C$DW$2276, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   16946                      .dwattr $C$DW$2276, DW_AT_accessibility(DW_ACCESS_public)
   16947              
   16948              $C$DW$2277      .dwtag  DW_TAG_member
   16949                      .dwattr $C$DW$2277, DW_AT_type(*$C$DW$T$76)
   16950                      .dwattr $C$DW$2277, DW_AT_name("GPBQSEL1")
   16951                      .dwattr $C$DW$2277, DW_AT_TI_symbol_name("_GPBQSEL1")
   16952                      .dwattr $C$DW$2277, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   16953                      .dwattr $C$DW$2277, DW_AT_accessibility(DW_ACCESS_public)
   16954              
   16955              $C$DW$2278      .dwtag  DW_TAG_member
   16956                      .dwattr $C$DW$2278, DW_AT_type(*$C$DW$T$76)
   16957                      .dwattr $C$DW$2278, DW_AT_name("GPBQSEL2")
   16958                      .dwattr $C$DW$2278, DW_AT_TI_symbol_name("_GPBQSEL2")
   16959                      .dwattr $C$DW$2278, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   16960                      .dwattr $C$DW$2278, DW_AT_accessibility(DW_ACCESS_public)
   16961              
   16962              $C$DW$2279      .dwtag  DW_TAG_member
   16963                      .dwattr $C$DW$2279, DW_AT_type(*$C$DW$T$76)
   16964                      .dwattr $C$DW$2279, DW_AT_name("GPBMUX1")
   16965                      .dwattr $C$DW$2279, DW_AT_TI_symbol_name("_GPBMUX1")
   16966                      .dwattr $C$DW$2279, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   16967                      .dwattr $C$DW$2279, DW_AT_accessibility(DW_ACCESS_public)
   16968              
   16969              $C$DW$2280      .dwtag  DW_TAG_member
   16970                      .dwattr $C$DW$2280, DW_AT_type(*$C$DW$T$76)
   16971                      .dwattr $C$DW$2280, DW_AT_name("GPBMUX2")
   16972                      .dwattr $C$DW$2280, DW_AT_TI_symbol_name("_GPBMUX2")
   16973                      .dwattr $C$DW$2280, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   16974                      .dwattr $C$DW$2280, DW_AT_accessibility(DW_ACCESS_public)
   16975              
   16976              $C$DW$2281      .dwtag  DW_TAG_member
   16977                      .dwattr $C$DW$2281, DW_AT_type(*$C$DW$T$76)
   16978                      .dwattr $C$DW$2281, DW_AT_name("GPBDIR")
   16979                      .dwattr $C$DW$2281, DW_AT_TI_symbol_name("_GPBDIR")
   16980                      .dwattr $C$DW$2281, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{84A79833-BD82-482D-BA2B-5527AFD5BD9A} PAGE  321

   16981                      .dwattr $C$DW$2281, DW_AT_accessibility(DW_ACCESS_public)
   16982              
   16983              $C$DW$2282      .dwtag  DW_TAG_member
   16984                      .dwattr $C$DW$2282, DW_AT_type(*$C$DW$T$76)
   16985                      .dwattr $C$DW$2282, DW_AT_name("GPBPUD")
   16986                      .dwattr $C$DW$2282, DW_AT_TI_symbol_name("_GPBPUD")
   16987                      .dwattr $C$DW$2282, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   16988                      .dwattr $C$DW$2282, DW_AT_accessibility(DW_ACCESS_public)
   16989              
   16990              $C$DW$2283      .dwtag  DW_TAG_member
   16991                      .dwattr $C$DW$2283, DW_AT_type(*$C$DW$T$77)
   16992                      .dwattr $C$DW$2283, DW_AT_name("rsvd_4")
   16993                      .dwattr $C$DW$2283, DW_AT_TI_symbol_name("_rsvd_4")
   16994                      .dwattr $C$DW$2283, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   16995                      .dwattr $C$DW$2283, DW_AT_accessibility(DW_ACCESS_public)
   16996              
   16997              $C$DW$2284      .dwtag  DW_TAG_member
   16998                      .dwattr $C$DW$2284, DW_AT_type(*$C$DW$T$76)
   16999                      .dwattr $C$DW$2284, DW_AT_name("AIOMUX1")
   17000                      .dwattr $C$DW$2284, DW_AT_TI_symbol_name("_AIOMUX1")
   17001                      .dwattr $C$DW$2284, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   17002                      .dwattr $C$DW$2284, DW_AT_accessibility(DW_ACCESS_public)
   17003              
   17004              $C$DW$2285      .dwtag  DW_TAG_member
   17005                      .dwattr $C$DW$2285, DW_AT_type(*$C$DW$T$26)
   17006                      .dwattr $C$DW$2285, DW_AT_name("rsvd_5")
   17007                      .dwattr $C$DW$2285, DW_AT_TI_symbol_name("_rsvd_5")
   17008                      .dwattr $C$DW$2285, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   17009                      .dwattr $C$DW$2285, DW_AT_accessibility(DW_ACCESS_public)
   17010              
   17011              $C$DW$2286      .dwtag  DW_TAG_member
   17012                      .dwattr $C$DW$2286, DW_AT_type(*$C$DW$T$76)
   17013                      .dwattr $C$DW$2286, DW_AT_name("AIODIR")
   17014                      .dwattr $C$DW$2286, DW_AT_TI_symbol_name("_AIODIR")
   17015                      .dwattr $C$DW$2286, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   17016                      .dwattr $C$DW$2286, DW_AT_accessibility(DW_ACCESS_public)
   17017              
   17018              $C$DW$2287      .dwtag  DW_TAG_member
   17019                      .dwattr $C$DW$2287, DW_AT_type(*$C$DW$T$78)
   17020                      .dwattr $C$DW$2287, DW_AT_name("rsvd_6")
   17021                      .dwattr $C$DW$2287, DW_AT_TI_symbol_name("_rsvd_6")
   17022                      .dwattr $C$DW$2287, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   17023                      .dwattr $C$DW$2287, DW_AT_accessibility(DW_ACCESS_public)
   17024              
   17025              $C$DW$2288      .dwtag  DW_TAG_member
   17026                      .dwattr $C$DW$2288, DW_AT_type(*$C$DW$T$76)
   17027                      .dwattr $C$DW$2288, DW_AT_name("GPADAT")
   17028                      .dwattr $C$DW$2288, DW_AT_TI_symbol_name("_GPADAT")
   17029                      .dwattr $C$DW$2288, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   17030                      .dwattr $C$DW$2288, DW_AT_accessibility(DW_ACCESS_public)
   17031              
   17032              $C$DW$2289      .dwtag  DW_TAG_member
   17033                      .dwattr $C$DW$2289, DW_AT_type(*$C$DW$T$76)
   17034                      .dwattr $C$DW$2289, DW_AT_name("GPASET")
   17035                      .dwattr $C$DW$2289, DW_AT_TI_symbol_name("_GPASET")
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{84A79833-BD82-482D-BA2B-5527AFD5BD9A} PAGE  322

   17036                      .dwattr $C$DW$2289, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   17037                      .dwattr $C$DW$2289, DW_AT_accessibility(DW_ACCESS_public)
   17038              
   17039              $C$DW$2290      .dwtag  DW_TAG_member
   17040                      .dwattr $C$DW$2290, DW_AT_type(*$C$DW$T$76)
   17041                      .dwattr $C$DW$2290, DW_AT_name("GPACLEAR")
   17042                      .dwattr $C$DW$2290, DW_AT_TI_symbol_name("_GPACLEAR")
   17043                      .dwattr $C$DW$2290, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   17044                      .dwattr $C$DW$2290, DW_AT_accessibility(DW_ACCESS_public)
   17045              
   17046              $C$DW$2291      .dwtag  DW_TAG_member
   17047                      .dwattr $C$DW$2291, DW_AT_type(*$C$DW$T$76)
   17048                      .dwattr $C$DW$2291, DW_AT_name("GPATOGGLE")
   17049                      .dwattr $C$DW$2291, DW_AT_TI_symbol_name("_GPATOGGLE")
   17050                      .dwattr $C$DW$2291, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   17051                      .dwattr $C$DW$2291, DW_AT_accessibility(DW_ACCESS_public)
   17052              
   17053              $C$DW$2292      .dwtag  DW_TAG_member
   17054                      .dwattr $C$DW$2292, DW_AT_type(*$C$DW$T$76)
   17055                      .dwattr $C$DW$2292, DW_AT_name("GPBDAT")
   17056                      .dwattr $C$DW$2292, DW_AT_TI_symbol_name("_GPBDAT")
   17057                      .dwattr $C$DW$2292, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   17058                      .dwattr $C$DW$2292, DW_AT_accessibility(DW_ACCESS_public)
   17059              
   17060              $C$DW$2293      .dwtag  DW_TAG_member
   17061                      .dwattr $C$DW$2293, DW_AT_type(*$C$DW$T$76)
   17062                      .dwattr $C$DW$2293, DW_AT_name("GPBSET")
   17063                      .dwattr $C$DW$2293, DW_AT_TI_symbol_name("_GPBSET")
   17064                      .dwattr $C$DW$2293, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   17065                      .dwattr $C$DW$2293, DW_AT_accessibility(DW_ACCESS_public)
   17066              
   17067              $C$DW$2294      .dwtag  DW_TAG_member
   17068                      .dwattr $C$DW$2294, DW_AT_type(*$C$DW$T$76)
   17069                      .dwattr $C$DW$2294, DW_AT_name("GPBCLEAR")
   17070                      .dwattr $C$DW$2294, DW_AT_TI_symbol_name("_GPBCLEAR")
   17071                      .dwattr $C$DW$2294, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   17072                      .dwattr $C$DW$2294, DW_AT_accessibility(DW_ACCESS_public)
   17073              
   17074              $C$DW$2295      .dwtag  DW_TAG_member
   17075                      .dwattr $C$DW$2295, DW_AT_type(*$C$DW$T$76)
   17076                      .dwattr $C$DW$2295, DW_AT_name("GPBTOGGLE")
   17077                      .dwattr $C$DW$2295, DW_AT_TI_symbol_name("_GPBTOGGLE")
   17078                      .dwattr $C$DW$2295, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   17079                      .dwattr $C$DW$2295, DW_AT_accessibility(DW_ACCESS_public)
   17080              
   17081              $C$DW$2296      .dwtag  DW_TAG_member
   17082                      .dwattr $C$DW$2296, DW_AT_type(*$C$DW$T$31)
   17083                      .dwattr $C$DW$2296, DW_AT_name("rsvd_7")
   17084                      .dwattr $C$DW$2296, DW_AT_TI_symbol_name("_rsvd_7")
   17085                      .dwattr $C$DW$2296, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   17086                      .dwattr $C$DW$2296, DW_AT_accessibility(DW_ACCESS_public)
   17087              
   17088              $C$DW$2297      .dwtag  DW_TAG_member
   17089                      .dwattr $C$DW$2297, DW_AT_type(*$C$DW$T$76)
   17090                      .dwattr $C$DW$2297, DW_AT_name("AIODAT")
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{84A79833-BD82-482D-BA2B-5527AFD5BD9A} PAGE  323

   17091                      .dwattr $C$DW$2297, DW_AT_TI_symbol_name("_AIODAT")
   17092                      .dwattr $C$DW$2297, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
   17093                      .dwattr $C$DW$2297, DW_AT_accessibility(DW_ACCESS_public)
   17094              
   17095              $C$DW$2298      .dwtag  DW_TAG_member
   17096                      .dwattr $C$DW$2298, DW_AT_type(*$C$DW$T$76)
   17097                      .dwattr $C$DW$2298, DW_AT_name("AIOSET")
   17098                      .dwattr $C$DW$2298, DW_AT_TI_symbol_name("_AIOSET")
   17099                      .dwattr $C$DW$2298, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   17100                      .dwattr $C$DW$2298, DW_AT_accessibility(DW_ACCESS_public)
   17101              
   17102              $C$DW$2299      .dwtag  DW_TAG_member
   17103                      .dwattr $C$DW$2299, DW_AT_type(*$C$DW$T$76)
   17104                      .dwattr $C$DW$2299, DW_AT_name("AIOCLEAR")
   17105                      .dwattr $C$DW$2299, DW_AT_TI_symbol_name("_AIOCLEAR")
   17106                      .dwattr $C$DW$2299, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   17107                      .dwattr $C$DW$2299, DW_AT_accessibility(DW_ACCESS_public)
   17108              
   17109              $C$DW$2300      .dwtag  DW_TAG_member
   17110                      .dwattr $C$DW$2300, DW_AT_type(*$C$DW$T$76)
   17111                      .dwattr $C$DW$2300, DW_AT_name("AIOTOGGLE")
   17112                      .dwattr $C$DW$2300, DW_AT_TI_symbol_name("_AIOTOGGLE")
   17113                      .dwattr $C$DW$2300, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   17114                      .dwattr $C$DW$2300, DW_AT_accessibility(DW_ACCESS_public)
   17115              
   17116              $C$DW$2301      .dwtag  DW_TAG_member
   17117                      .dwattr $C$DW$2301, DW_AT_type(*$C$DW$T$28)
   17118                      .dwattr $C$DW$2301, DW_AT_name("GPIOXINTnSEL")
   17119                      .dwattr $C$DW$2301, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
   17120                      .dwattr $C$DW$2301, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   17121                      .dwattr $C$DW$2301, DW_AT_accessibility(DW_ACCESS_public)
   17122              
   17123              $C$DW$2302      .dwtag  DW_TAG_member
   17124                      .dwattr $C$DW$2302, DW_AT_type(*$C$DW$T$27)
   17125                      .dwattr $C$DW$2302, DW_AT_name("rsvd_8")
   17126                      .dwattr $C$DW$2302, DW_AT_TI_symbol_name("_rsvd_8")
   17127                      .dwattr $C$DW$2302, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   17128                      .dwattr $C$DW$2302, DW_AT_accessibility(DW_ACCESS_public)
   17129              
   17130              $C$DW$2303      .dwtag  DW_TAG_member
   17131                      .dwattr $C$DW$2303, DW_AT_type(*$C$DW$T$76)
   17132                      .dwattr $C$DW$2303, DW_AT_name("GPIOLPMSEL")
   17133                      .dwattr $C$DW$2303, DW_AT_TI_symbol_name("_GPIOLPMSEL")
   17134                      .dwattr $C$DW$2303, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   17135                      .dwattr $C$DW$2303, DW_AT_accessibility(DW_ACCESS_public)
   17136              
   17137                      .dwendtag $C$DW$T$79
   17138              
   17139              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
   17140                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$79)
   17141                      .dwattr $C$DW$T$38, DW_AT_address_class(0x20)
   17142              
   17143              $C$DW$T$39      .dwtag  DW_TAG_typedef
   17144                      .dwattr $C$DW$T$39, DW_AT_name("GPIO_Handle")
   17145                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{84A79833-BD82-482D-BA2B-5527AFD5BD9A} PAGE  324

   17146                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
   17147              
   17148              
   17149              $C$DW$T$81      .dwtag  DW_TAG_structure_type
   17150                      .dwattr $C$DW$T$81, DW_AT_name("_HAL_AdcData_t_")
   17151                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x0e)
   17152              $C$DW$2304      .dwtag  DW_TAG_member
   17153                      .dwattr $C$DW$2304, DW_AT_type(*$C$DW$T$80)
   17154                      .dwattr $C$DW$2304, DW_AT_name("I")
   17155                      .dwattr $C$DW$2304, DW_AT_TI_symbol_name("_I")
   17156                      .dwattr $C$DW$2304, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   17157                      .dwattr $C$DW$2304, DW_AT_accessibility(DW_ACCESS_public)
   17158              
   17159              $C$DW$2305      .dwtag  DW_TAG_member
   17160                      .dwattr $C$DW$2305, DW_AT_type(*$C$DW$T$80)
   17161                      .dwattr $C$DW$2305, DW_AT_name("V")
   17162                      .dwattr $C$DW$2305, DW_AT_TI_symbol_name("_V")
   17163                      .dwattr $C$DW$2305, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   17164                      .dwattr $C$DW$2305, DW_AT_accessibility(DW_ACCESS_public)
   17165              
   17166              $C$DW$2306      .dwtag  DW_TAG_member
   17167                      .dwattr $C$DW$2306, DW_AT_type(*$C$DW$T$71)
   17168                      .dwattr $C$DW$2306, DW_AT_name("dcBus")
   17169                      .dwattr $C$DW$2306, DW_AT_TI_symbol_name("_dcBus")
   17170                      .dwattr $C$DW$2306, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   17171                      .dwattr $C$DW$2306, DW_AT_accessibility(DW_ACCESS_public)
   17172              
   17173                      .dwendtag $C$DW$T$81
   17174              
   17175              $C$DW$T$117     .dwtag  DW_TAG_typedef
   17176                      .dwattr $C$DW$T$117, DW_AT_name("HAL_AdcData_t")
   17177                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$81)
   17178                      .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
   17179              
   17180              
   17181              $C$DW$T$87      .dwtag  DW_TAG_structure_type
   17182                      .dwattr $C$DW$T$87, DW_AT_name("_HAL_DacData_t_")
   17183                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x22)
   17184              $C$DW$2307      .dwtag  DW_TAG_member
   17185                      .dwattr $C$DW$2307, DW_AT_type(*$C$DW$T$22)
   17186                      .dwattr $C$DW$2307, DW_AT_name("PeriodMax")
   17187                      .dwattr $C$DW$2307, DW_AT_TI_symbol_name("_PeriodMax")
   17188                      .dwattr $C$DW$2307, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   17189                      .dwattr $C$DW$2307, DW_AT_accessibility(DW_ACCESS_public)
   17190              
   17191              $C$DW$2308      .dwtag  DW_TAG_member
   17192                      .dwattr $C$DW$2308, DW_AT_type(*$C$DW$T$85)
   17193                      .dwattr $C$DW$2308, DW_AT_name("ptrData")
   17194                      .dwattr $C$DW$2308, DW_AT_TI_symbol_name("_ptrData")
   17195                      .dwattr $C$DW$2308, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   17196                      .dwattr $C$DW$2308, DW_AT_accessibility(DW_ACCESS_public)
   17197              
   17198              $C$DW$2309      .dwtag  DW_TAG_member
   17199                      .dwattr $C$DW$2309, DW_AT_type(*$C$DW$T$86)
   17200                      .dwattr $C$DW$2309, DW_AT_name("value")
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{84A79833-BD82-482D-BA2B-5527AFD5BD9A} PAGE  325

   17201                      .dwattr $C$DW$2309, DW_AT_TI_symbol_name("_value")
   17202                      .dwattr $C$DW$2309, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   17203                      .dwattr $C$DW$2309, DW_AT_accessibility(DW_ACCESS_public)
   17204              
   17205              $C$DW$2310      .dwtag  DW_TAG_member
   17206                      .dwattr $C$DW$2310, DW_AT_type(*$C$DW$T$86)
   17207                      .dwattr $C$DW$2310, DW_AT_name("offset")
   17208                      .dwattr $C$DW$2310, DW_AT_TI_symbol_name("_offset")
   17209                      .dwattr $C$DW$2310, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   17210                      .dwattr $C$DW$2310, DW_AT_accessibility(DW_ACCESS_public)
   17211              
   17212              $C$DW$2311      .dwtag  DW_TAG_member
   17213                      .dwattr $C$DW$2311, DW_AT_type(*$C$DW$T$86)
   17214                      .dwattr $C$DW$2311, DW_AT_name("gain")
   17215                      .dwattr $C$DW$2311, DW_AT_TI_symbol_name("_gain")
   17216                      .dwattr $C$DW$2311, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   17217                      .dwattr $C$DW$2311, DW_AT_accessibility(DW_ACCESS_public)
   17218              
   17219                      .dwendtag $C$DW$T$87
   17220              
   17221              $C$DW$T$385     .dwtag  DW_TAG_typedef
   17222                      .dwattr $C$DW$T$385, DW_AT_name("HAL_DacData_t")
   17223                      .dwattr $C$DW$T$385, DW_AT_type(*$C$DW$T$87)
   17224                      .dwattr $C$DW$T$385, DW_AT_language(DW_LANG_C)
   17225              
   17226              $C$DW$T$386     .dwtag  DW_TAG_pointer_type
   17227                      .dwattr $C$DW$T$386, DW_AT_type(*$C$DW$T$385)
   17228                      .dwattr $C$DW$T$386, DW_AT_address_class(0x20)
   17229              
   17230              $C$DW$2312      .dwtag  DW_TAG_TI_far_type
   17231                      .dwattr $C$DW$2312, DW_AT_type(*$C$DW$T$386)
   17232              
   17233              $C$DW$T$387     .dwtag  DW_TAG_const_type
   17234                      .dwattr $C$DW$T$387, DW_AT_type(*$C$DW$2312)
   17235              
   17236              
   17237              $C$DW$T$123     .dwtag  DW_TAG_structure_type
   17238                      .dwattr $C$DW$T$123, DW_AT_name("_HAL_Obj_")
   17239                      .dwattr $C$DW$T$123, DW_AT_byte_size(0xac)
   17240              $C$DW$2313      .dwtag  DW_TAG_member
   17241                      .dwattr $C$DW$2313, DW_AT_type(*$C$DW$T$89)
   17242                      .dwattr $C$DW$2313, DW_AT_name("adcHandle")
   17243                      .dwattr $C$DW$2313, DW_AT_TI_symbol_name("_adcHandle")
   17244                      .dwattr $C$DW$2313, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   17245                      .dwattr $C$DW$2313, DW_AT_accessibility(DW_ACCESS_public)
   17246              
   17247              $C$DW$2314      .dwtag  DW_TAG_member
   17248                      .dwattr $C$DW$2314, DW_AT_type(*$C$DW$T$91)
   17249                      .dwattr $C$DW$2314, DW_AT_name("clkHandle")
   17250                      .dwattr $C$DW$2314, DW_AT_TI_symbol_name("_clkHandle")
   17251                      .dwattr $C$DW$2314, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   17252                      .dwattr $C$DW$2314, DW_AT_accessibility(DW_ACCESS_public)
   17253              
   17254              $C$DW$2315      .dwtag  DW_TAG_member
   17255                      .dwattr $C$DW$2315, DW_AT_type(*$C$DW$T$93)
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{84A79833-BD82-482D-BA2B-5527AFD5BD9A} PAGE  326

   17256                      .dwattr $C$DW$2315, DW_AT_name("cpuHandle")
   17257                      .dwattr $C$DW$2315, DW_AT_TI_symbol_name("_cpuHandle")
   17258                      .dwattr $C$DW$2315, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   17259                      .dwattr $C$DW$2315, DW_AT_accessibility(DW_ACCESS_public)
   17260              
   17261              $C$DW$2316      .dwtag  DW_TAG_member
   17262                      .dwattr $C$DW$2316, DW_AT_type(*$C$DW$T$95)
   17263                      .dwattr $C$DW$2316, DW_AT_name("flashHandle")
   17264                      .dwattr $C$DW$2316, DW_AT_TI_symbol_name("_flashHandle")
   17265                      .dwattr $C$DW$2316, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   17266                      .dwattr $C$DW$2316, DW_AT_accessibility(DW_ACCESS_public)
   17267              
   17268              $C$DW$2317      .dwtag  DW_TAG_member
   17269                      .dwattr $C$DW$2317, DW_AT_type(*$C$DW$T$39)
   17270                      .dwattr $C$DW$2317, DW_AT_name("gpioHandle")
   17271                      .dwattr $C$DW$2317, DW_AT_TI_symbol_name("_gpioHandle")
   17272                      .dwattr $C$DW$2317, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   17273                      .dwattr $C$DW$2317, DW_AT_accessibility(DW_ACCESS_public)
   17274              
   17275              $C$DW$2318      .dwtag  DW_TAG_member
   17276                      .dwattr $C$DW$2318, DW_AT_type(*$C$DW$T$98)
   17277                      .dwattr $C$DW$2318, DW_AT_name("offsetHandle_I")
   17278                      .dwattr $C$DW$2318, DW_AT_TI_symbol_name("_offsetHandle_I")
   17279                      .dwattr $C$DW$2318, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   17280                      .dwattr $C$DW$2318, DW_AT_accessibility(DW_ACCESS_public)
   17281              
   17282              $C$DW$2319      .dwtag  DW_TAG_member
   17283                      .dwattr $C$DW$2319, DW_AT_type(*$C$DW$T$100)
   17284                      .dwattr $C$DW$2319, DW_AT_name("offset_I")
   17285                      .dwattr $C$DW$2319, DW_AT_TI_symbol_name("_offset_I")
   17286                      .dwattr $C$DW$2319, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   17287                      .dwattr $C$DW$2319, DW_AT_accessibility(DW_ACCESS_public)
   17288              
   17289              $C$DW$2320      .dwtag  DW_TAG_member
   17290                      .dwattr $C$DW$2320, DW_AT_type(*$C$DW$T$98)
   17291                      .dwattr $C$DW$2320, DW_AT_name("offsetHandle_V")
   17292                      .dwattr $C$DW$2320, DW_AT_TI_symbol_name("_offsetHandle_V")
   17293                      .dwattr $C$DW$2320, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   17294                      .dwattr $C$DW$2320, DW_AT_accessibility(DW_ACCESS_public)
   17295              
   17296              $C$DW$2321      .dwtag  DW_TAG_member
   17297                      .dwattr $C$DW$2321, DW_AT_type(*$C$DW$T$100)
   17298                      .dwattr $C$DW$2321, DW_AT_name("offset_V")
   17299                      .dwattr $C$DW$2321, DW_AT_TI_symbol_name("_offset_V")
   17300                      .dwattr $C$DW$2321, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   17301                      .dwattr $C$DW$2321, DW_AT_accessibility(DW_ACCESS_public)
   17302              
   17303              $C$DW$2322      .dwtag  DW_TAG_member
   17304                      .dwattr $C$DW$2322, DW_AT_type(*$C$DW$T$102)
   17305                      .dwattr $C$DW$2322, DW_AT_name("oscHandle")
   17306                      .dwattr $C$DW$2322, DW_AT_TI_symbol_name("_oscHandle")
   17307                      .dwattr $C$DW$2322, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
   17308                      .dwattr $C$DW$2322, DW_AT_accessibility(DW_ACCESS_public)
   17309              
   17310              $C$DW$2323      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{84A79833-BD82-482D-BA2B-5527AFD5BD9A} PAGE  327

   17311                      .dwattr $C$DW$2323, DW_AT_type(*$C$DW$T$104)
   17312                      .dwattr $C$DW$2323, DW_AT_name("pieHandle")
   17313                      .dwattr $C$DW$2323, DW_AT_TI_symbol_name("_pieHandle")
   17314                      .dwattr $C$DW$2323, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
   17315                      .dwattr $C$DW$2323, DW_AT_accessibility(DW_ACCESS_public)
   17316              
   17317              $C$DW$2324      .dwtag  DW_TAG_member
   17318                      .dwattr $C$DW$2324, DW_AT_type(*$C$DW$T$106)
   17319                      .dwattr $C$DW$2324, DW_AT_name("pllHandle")
   17320                      .dwattr $C$DW$2324, DW_AT_TI_symbol_name("_pllHandle")
   17321                      .dwattr $C$DW$2324, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
   17322                      .dwattr $C$DW$2324, DW_AT_accessibility(DW_ACCESS_public)
   17323              
   17324              $C$DW$2325      .dwtag  DW_TAG_member
   17325                      .dwattr $C$DW$2325, DW_AT_type(*$C$DW$T$109)
   17326                      .dwattr $C$DW$2325, DW_AT_name("pwmHandle")
   17327                      .dwattr $C$DW$2325, DW_AT_TI_symbol_name("_pwmHandle")
   17328                      .dwattr $C$DW$2325, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
   17329                      .dwattr $C$DW$2325, DW_AT_accessibility(DW_ACCESS_public)
   17330              
   17331              $C$DW$2326      .dwtag  DW_TAG_member
   17332                      .dwattr $C$DW$2326, DW_AT_type(*$C$DW$T$109)
   17333                      .dwattr $C$DW$2326, DW_AT_name("pwmDacHandle")
   17334                      .dwattr $C$DW$2326, DW_AT_TI_symbol_name("_pwmDacHandle")
   17335                      .dwattr $C$DW$2326, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
   17336                      .dwattr $C$DW$2326, DW_AT_accessibility(DW_ACCESS_public)
   17337              
   17338              $C$DW$2327      .dwtag  DW_TAG_member
   17339                      .dwattr $C$DW$2327, DW_AT_type(*$C$DW$T$111)
   17340                      .dwattr $C$DW$2327, DW_AT_name("pwrHandle")
   17341                      .dwattr $C$DW$2327, DW_AT_TI_symbol_name("_pwrHandle")
   17342                      .dwattr $C$DW$2327, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
   17343                      .dwattr $C$DW$2327, DW_AT_accessibility(DW_ACCESS_public)
   17344              
   17345              $C$DW$2328      .dwtag  DW_TAG_member
   17346                      .dwattr $C$DW$2328, DW_AT_type(*$C$DW$T$114)
   17347                      .dwattr $C$DW$2328, DW_AT_name("timerHandle")
   17348                      .dwattr $C$DW$2328, DW_AT_TI_symbol_name("_timerHandle")
   17349                      .dwattr $C$DW$2328, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
   17350                      .dwattr $C$DW$2328, DW_AT_accessibility(DW_ACCESS_public)
   17351              
   17352              $C$DW$2329      .dwtag  DW_TAG_member
   17353                      .dwattr $C$DW$2329, DW_AT_type(*$C$DW$T$116)
   17354                      .dwattr $C$DW$2329, DW_AT_name("wdogHandle")
   17355                      .dwattr $C$DW$2329, DW_AT_TI_symbol_name("_wdogHandle")
   17356                      .dwattr $C$DW$2329, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
   17357                      .dwattr $C$DW$2329, DW_AT_accessibility(DW_ACCESS_public)
   17358              
   17359              $C$DW$2330      .dwtag  DW_TAG_member
   17360                      .dwattr $C$DW$2330, DW_AT_type(*$C$DW$T$117)
   17361                      .dwattr $C$DW$2330, DW_AT_name("adcBias")
   17362                      .dwattr $C$DW$2330, DW_AT_TI_symbol_name("_adcBias")
   17363                      .dwattr $C$DW$2330, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
   17364                      .dwattr $C$DW$2330, DW_AT_accessibility(DW_ACCESS_public)
   17365              
