TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:31 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{4F4BA5BD-0BD9-4258-B9DA-489E059A6121} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.0.LTS *
       3              ;* Date/Time created: Mon May  8 16:16:31 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/GIANT/GiantNEO/motorware/motorware_1_01_00_18/sw/modules/hal/boards/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.0.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\GIANT\GiantNEO\motorware\motorware_1_01_00_18\sw\solutions\insta
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("OFFSET_setBeta")

C:\Users\User\AppData\Local\Temp\{4F4BA5BD-0BD9-4258-B9DA-489E059A6121} PAGE  304

   16042                      .dwattr $C$DW$2172, DW_AT_const_value(0x80)
   16043              
   16044                      .dwendtag $C$DW$T$346
   16045              
   16046              $C$DW$T$347     .dwtag  DW_TAG_typedef
   16047                      .dwattr $C$DW$T$347, DW_AT_name("SCI_NumStopBits_e")
   16048                      .dwattr $C$DW$T$347, DW_AT_type(*$C$DW$T$346)
   16049                      .dwattr $C$DW$T$347, DW_AT_language(DW_LANG_C)
   16050              
   16051              $C$DW$2173      .dwtag  DW_TAG_TI_far_type
   16052                      .dwattr $C$DW$2173, DW_AT_type(*$C$DW$T$347)
   16053              
   16054              $C$DW$T$348     .dwtag  DW_TAG_const_type
   16055                      .dwattr $C$DW$T$348, DW_AT_type(*$C$DW$2173)
   16056              
   16057              
   16058              $C$DW$T$349     .dwtag  DW_TAG_enumeration_type
   16059                      .dwattr $C$DW$T$349, DW_AT_byte_size(0x01)
   16060              $C$DW$2174      .dwtag  DW_TAG_enumerator
   16061                      .dwattr $C$DW$2174, DW_AT_name("SCI_Priority_Immediate")
   16062                      .dwattr $C$DW$2174, DW_AT_const_value(0x00)
   16063              
   16064              $C$DW$2175      .dwtag  DW_TAG_enumerator
   16065                      .dwattr $C$DW$2175, DW_AT_name("SCI_Priority_FreeRun")
   16066                      .dwattr $C$DW$2175, DW_AT_const_value(0x08)
   16067              
   16068              $C$DW$2176      .dwtag  DW_TAG_enumerator
   16069                      .dwattr $C$DW$2176, DW_AT_name("SCI_Priority_AfterRxRxSeq")
   16070                      .dwattr $C$DW$2176, DW_AT_const_value(0x10)
   16071              
   16072                      .dwendtag $C$DW$T$349
   16073              
   16074              $C$DW$T$350     .dwtag  DW_TAG_typedef
   16075                      .dwattr $C$DW$T$350, DW_AT_name("SCI_Priority_e")
   16076                      .dwattr $C$DW$T$350, DW_AT_type(*$C$DW$T$349)
   16077                      .dwattr $C$DW$T$350, DW_AT_language(DW_LANG_C)
   16078              
   16079              $C$DW$2177      .dwtag  DW_TAG_TI_far_type
   16080                      .dwattr $C$DW$2177, DW_AT_type(*$C$DW$T$350)
   16081              
   16082              $C$DW$T$351     .dwtag  DW_TAG_const_type
   16083                      .dwattr $C$DW$T$351, DW_AT_type(*$C$DW$2177)
   16084              
   16085              
   16086              $C$DW$T$352     .dwtag  DW_TAG_enumeration_type
   16087                      .dwattr $C$DW$T$352, DW_AT_byte_size(0x01)
   16088              $C$DW$2178      .dwtag  DW_TAG_enumerator
   16089                      .dwattr $C$DW$2178, DW_AT_name("TIMER_EmulationMode_StopAfterNextDecrement")
   16090                      .dwattr $C$DW$2178, DW_AT_const_value(0x00)
   16091              
   16092              $C$DW$2179      .dwtag  DW_TAG_enumerator
   16093                      .dwattr $C$DW$2179, DW_AT_name("TIMER_EmulationMode_StopAtZero")
   16094                      .dwattr $C$DW$2179, DW_AT_const_value(0x400)
   16095              
   16096              $C$DW$2180      .dwtag  DW_TAG_enumerator
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:31 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{4F4BA5BD-0BD9-4258-B9DA-489E059A6121} PAGE  305

   16097                      .dwattr $C$DW$2180, DW_AT_name("TIMER_EmulationMode_RunFree")
   16098                      .dwattr $C$DW$2180, DW_AT_const_value(0x800)
   16099              
   16100                      .dwendtag $C$DW$T$352
   16101              
   16102              $C$DW$T$353     .dwtag  DW_TAG_typedef
   16103                      .dwattr $C$DW$T$353, DW_AT_name("TIMER_EmulationMode_e")
   16104                      .dwattr $C$DW$T$353, DW_AT_type(*$C$DW$T$352)
   16105                      .dwattr $C$DW$T$353, DW_AT_language(DW_LANG_C)
   16106              
   16107              $C$DW$2181      .dwtag  DW_TAG_TI_far_type
   16108                      .dwattr $C$DW$2181, DW_AT_type(*$C$DW$T$353)
   16109              
   16110              $C$DW$T$354     .dwtag  DW_TAG_const_type
   16111                      .dwattr $C$DW$T$354, DW_AT_type(*$C$DW$2181)
   16112              
   16113              
   16114              $C$DW$T$355     .dwtag  DW_TAG_enumeration_type
   16115                      .dwattr $C$DW$T$355, DW_AT_byte_size(0x01)
   16116              $C$DW$2182      .dwtag  DW_TAG_enumerator
   16117                      .dwattr $C$DW$2182, DW_AT_name("HAL_SensorType_Current")
   16118                      .dwattr $C$DW$2182, DW_AT_const_value(0x00)
   16119              
   16120              $C$DW$2183      .dwtag  DW_TAG_enumerator
   16121                      .dwattr $C$DW$2183, DW_AT_name("HAL_SensorType_Voltage")
   16122                      .dwattr $C$DW$2183, DW_AT_const_value(0x01)
   16123              
   16124                      .dwendtag $C$DW$T$355
   16125              
   16126              $C$DW$T$356     .dwtag  DW_TAG_typedef
   16127                      .dwattr $C$DW$T$356, DW_AT_name("HAL_SensorType_e")
   16128                      .dwattr $C$DW$T$356, DW_AT_type(*$C$DW$T$355)
   16129                      .dwattr $C$DW$T$356, DW_AT_language(DW_LANG_C)
   16130              
   16131              
   16132              $C$DW$T$30      .dwtag  DW_TAG_structure_type
   16133                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
   16134                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
   16135              $C$DW$2184      .dwtag  DW_TAG_member
   16136                      .dwattr $C$DW$2184, DW_AT_type(*$C$DW$T$24)
   16137                      .dwattr $C$DW$2184, DW_AT_name("ADCRESULT")
   16138                      .dwattr $C$DW$2184, DW_AT_TI_symbol_name("_ADCRESULT")
   16139                      .dwattr $C$DW$2184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16140                      .dwattr $C$DW$2184, DW_AT_accessibility(DW_ACCESS_public)
   16141              
   16142              $C$DW$2185      .dwtag  DW_TAG_member
   16143                      .dwattr $C$DW$2185, DW_AT_type(*$C$DW$T$25)
   16144                      .dwattr $C$DW$2185, DW_AT_name("resvd_1")
   16145                      .dwattr $C$DW$2185, DW_AT_TI_symbol_name("_resvd_1")
   16146                      .dwattr $C$DW$2185, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   16147                      .dwattr $C$DW$2185, DW_AT_accessibility(DW_ACCESS_public)
   16148              
   16149              $C$DW$2186      .dwtag  DW_TAG_member
   16150                      .dwattr $C$DW$2186, DW_AT_type(*$C$DW$T$23)
   16151                      .dwattr $C$DW$2186, DW_AT_name("ADCCTL1")
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:31 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{4F4BA5BD-0BD9-4258-B9DA-489E059A6121} PAGE  306

   16152                      .dwattr $C$DW$2186, DW_AT_TI_symbol_name("_ADCCTL1")
   16153                      .dwattr $C$DW$2186, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
   16154                      .dwattr $C$DW$2186, DW_AT_accessibility(DW_ACCESS_public)
   16155              
   16156              $C$DW$2187      .dwtag  DW_TAG_member
   16157                      .dwattr $C$DW$2187, DW_AT_type(*$C$DW$T$23)
   16158                      .dwattr $C$DW$2187, DW_AT_name("ADCCTL2")
   16159                      .dwattr $C$DW$2187, DW_AT_TI_symbol_name("_ADCCTL2")
   16160                      .dwattr $C$DW$2187, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
   16161                      .dwattr $C$DW$2187, DW_AT_accessibility(DW_ACCESS_public)
   16162              
   16163              $C$DW$2188      .dwtag  DW_TAG_member
   16164                      .dwattr $C$DW$2188, DW_AT_type(*$C$DW$T$26)
   16165                      .dwattr $C$DW$2188, DW_AT_name("rsvd_2")
   16166                      .dwattr $C$DW$2188, DW_AT_TI_symbol_name("_rsvd_2")
   16167                      .dwattr $C$DW$2188, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
   16168                      .dwattr $C$DW$2188, DW_AT_accessibility(DW_ACCESS_public)
   16169              
   16170              $C$DW$2189      .dwtag  DW_TAG_member
   16171                      .dwattr $C$DW$2189, DW_AT_type(*$C$DW$T$23)
   16172                      .dwattr $C$DW$2189, DW_AT_name("ADCINTFLG")
   16173                      .dwattr $C$DW$2189, DW_AT_TI_symbol_name("_ADCINTFLG")
   16174                      .dwattr $C$DW$2189, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
   16175                      .dwattr $C$DW$2189, DW_AT_accessibility(DW_ACCESS_public)
   16176              
   16177              $C$DW$2190      .dwtag  DW_TAG_member
   16178                      .dwattr $C$DW$2190, DW_AT_type(*$C$DW$T$23)
   16179                      .dwattr $C$DW$2190, DW_AT_name("ADCINTFLGCLR")
   16180                      .dwattr $C$DW$2190, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
   16181                      .dwattr $C$DW$2190, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
   16182                      .dwattr $C$DW$2190, DW_AT_accessibility(DW_ACCESS_public)
   16183              
   16184              $C$DW$2191      .dwtag  DW_TAG_member
   16185                      .dwattr $C$DW$2191, DW_AT_type(*$C$DW$T$23)
   16186                      .dwattr $C$DW$2191, DW_AT_name("ADCINTOVF")
   16187                      .dwattr $C$DW$2191, DW_AT_TI_symbol_name("_ADCINTOVF")
   16188                      .dwattr $C$DW$2191, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
   16189                      .dwattr $C$DW$2191, DW_AT_accessibility(DW_ACCESS_public)
   16190              
   16191              $C$DW$2192      .dwtag  DW_TAG_member
   16192                      .dwattr $C$DW$2192, DW_AT_type(*$C$DW$T$23)
   16193                      .dwattr $C$DW$2192, DW_AT_name("ADCINTOVFCLR")
   16194                      .dwattr $C$DW$2192, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
   16195                      .dwattr $C$DW$2192, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
   16196                      .dwattr $C$DW$2192, DW_AT_accessibility(DW_ACCESS_public)
   16197              
   16198              $C$DW$2193      .dwtag  DW_TAG_member
   16199                      .dwattr $C$DW$2193, DW_AT_type(*$C$DW$T$27)
   16200                      .dwattr $C$DW$2193, DW_AT_name("INTSELxNy")
   16201                      .dwattr $C$DW$2193, DW_AT_TI_symbol_name("_INTSELxNy")
   16202                      .dwattr $C$DW$2193, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
   16203                      .dwattr $C$DW$2193, DW_AT_accessibility(DW_ACCESS_public)
   16204              
   16205              $C$DW$2194      .dwtag  DW_TAG_member
   16206                      .dwattr $C$DW$2194, DW_AT_type(*$C$DW$T$28)
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:31 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{4F4BA5BD-0BD9-4258-B9DA-489E059A6121} PAGE  307

   16207                      .dwattr $C$DW$2194, DW_AT_name("rsvd_3")
   16208                      .dwattr $C$DW$2194, DW_AT_TI_symbol_name("_rsvd_3")
   16209                      .dwattr $C$DW$2194, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
   16210                      .dwattr $C$DW$2194, DW_AT_accessibility(DW_ACCESS_public)
   16211              
   16212              $C$DW$2195      .dwtag  DW_TAG_member
   16213                      .dwattr $C$DW$2195, DW_AT_type(*$C$DW$T$23)
   16214                      .dwattr $C$DW$2195, DW_AT_name("SOCPRICTRL")
   16215                      .dwattr $C$DW$2195, DW_AT_TI_symbol_name("_SOCPRICTRL")
   16216                      .dwattr $C$DW$2195, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
   16217                      .dwattr $C$DW$2195, DW_AT_accessibility(DW_ACCESS_public)
   16218              
   16219              $C$DW$2196      .dwtag  DW_TAG_member
   16220                      .dwattr $C$DW$2196, DW_AT_type(*$C$DW$T$23)
   16221                      .dwattr $C$DW$2196, DW_AT_name("rsvd_4")
   16222                      .dwattr $C$DW$2196, DW_AT_TI_symbol_name("_rsvd_4")
   16223                      .dwattr $C$DW$2196, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
   16224                      .dwattr $C$DW$2196, DW_AT_accessibility(DW_ACCESS_public)
   16225              
   16226              $C$DW$2197      .dwtag  DW_TAG_member
   16227                      .dwattr $C$DW$2197, DW_AT_type(*$C$DW$T$23)
   16228                      .dwattr $C$DW$2197, DW_AT_name("ADCSAMPLEMODE")
   16229                      .dwattr $C$DW$2197, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
   16230                      .dwattr $C$DW$2197, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
   16231                      .dwattr $C$DW$2197, DW_AT_accessibility(DW_ACCESS_public)
   16232              
   16233              $C$DW$2198      .dwtag  DW_TAG_member
   16234                      .dwattr $C$DW$2198, DW_AT_type(*$C$DW$T$23)
   16235                      .dwattr $C$DW$2198, DW_AT_name("rsvd_5")
   16236                      .dwattr $C$DW$2198, DW_AT_TI_symbol_name("_rsvd_5")
   16237                      .dwattr $C$DW$2198, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
   16238                      .dwattr $C$DW$2198, DW_AT_accessibility(DW_ACCESS_public)
   16239              
   16240              $C$DW$2199      .dwtag  DW_TAG_member
   16241                      .dwattr $C$DW$2199, DW_AT_type(*$C$DW$T$23)
   16242                      .dwattr $C$DW$2199, DW_AT_name("ADCINTSOCSEL1")
   16243                      .dwattr $C$DW$2199, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
   16244                      .dwattr $C$DW$2199, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
   16245                      .dwattr $C$DW$2199, DW_AT_accessibility(DW_ACCESS_public)
   16246              
   16247              $C$DW$2200      .dwtag  DW_TAG_member
   16248                      .dwattr $C$DW$2200, DW_AT_type(*$C$DW$T$23)
   16249                      .dwattr $C$DW$2200, DW_AT_name("ADCINTSOCSEL2")
   16250                      .dwattr $C$DW$2200, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
   16251                      .dwattr $C$DW$2200, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
   16252                      .dwattr $C$DW$2200, DW_AT_accessibility(DW_ACCESS_public)
   16253              
   16254              $C$DW$2201      .dwtag  DW_TAG_member
   16255                      .dwattr $C$DW$2201, DW_AT_type(*$C$DW$T$26)
   16256                      .dwattr $C$DW$2201, DW_AT_name("rsvd_6")
   16257                      .dwattr $C$DW$2201, DW_AT_TI_symbol_name("_rsvd_6")
   16258                      .dwattr $C$DW$2201, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
   16259                      .dwattr $C$DW$2201, DW_AT_accessibility(DW_ACCESS_public)
   16260              
   16261              $C$DW$2202      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:31 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{4F4BA5BD-0BD9-4258-B9DA-489E059A6121} PAGE  308

   16262                      .dwattr $C$DW$2202, DW_AT_type(*$C$DW$T$23)
   16263                      .dwattr $C$DW$2202, DW_AT_name("ADCSOCFLG1")
   16264                      .dwattr $C$DW$2202, DW_AT_TI_symbol_name("_ADCSOCFLG1")
   16265                      .dwattr $C$DW$2202, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
   16266                      .dwattr $C$DW$2202, DW_AT_accessibility(DW_ACCESS_public)
   16267              
   16268              $C$DW$2203      .dwtag  DW_TAG_member
   16269                      .dwattr $C$DW$2203, DW_AT_type(*$C$DW$T$23)
   16270                      .dwattr $C$DW$2203, DW_AT_name("rsvd_7")
   16271                      .dwattr $C$DW$2203, DW_AT_TI_symbol_name("_rsvd_7")
   16272                      .dwattr $C$DW$2203, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   16273                      .dwattr $C$DW$2203, DW_AT_accessibility(DW_ACCESS_public)
   16274              
   16275              $C$DW$2204      .dwtag  DW_TAG_member
   16276                      .dwattr $C$DW$2204, DW_AT_type(*$C$DW$T$23)
   16277                      .dwattr $C$DW$2204, DW_AT_name("ADCSOCFRC1")
   16278                      .dwattr $C$DW$2204, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   16279                      .dwattr $C$DW$2204, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   16280                      .dwattr $C$DW$2204, DW_AT_accessibility(DW_ACCESS_public)
   16281              
   16282              $C$DW$2205      .dwtag  DW_TAG_member
   16283                      .dwattr $C$DW$2205, DW_AT_type(*$C$DW$T$23)
   16284                      .dwattr $C$DW$2205, DW_AT_name("rsvd_8")
   16285                      .dwattr $C$DW$2205, DW_AT_TI_symbol_name("_rsvd_8")
   16286                      .dwattr $C$DW$2205, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   16287                      .dwattr $C$DW$2205, DW_AT_accessibility(DW_ACCESS_public)
   16288              
   16289              $C$DW$2206      .dwtag  DW_TAG_member
   16290                      .dwattr $C$DW$2206, DW_AT_type(*$C$DW$T$23)
   16291                      .dwattr $C$DW$2206, DW_AT_name("ADCSOCOVF1")
   16292                      .dwattr $C$DW$2206, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   16293                      .dwattr $C$DW$2206, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   16294                      .dwattr $C$DW$2206, DW_AT_accessibility(DW_ACCESS_public)
   16295              
   16296              $C$DW$2207      .dwtag  DW_TAG_member
   16297                      .dwattr $C$DW$2207, DW_AT_type(*$C$DW$T$23)
   16298                      .dwattr $C$DW$2207, DW_AT_name("rsvd_9")
   16299                      .dwattr $C$DW$2207, DW_AT_TI_symbol_name("_rsvd_9")
   16300                      .dwattr $C$DW$2207, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
   16301                      .dwattr $C$DW$2207, DW_AT_accessibility(DW_ACCESS_public)
   16302              
   16303              $C$DW$2208      .dwtag  DW_TAG_member
   16304                      .dwattr $C$DW$2208, DW_AT_type(*$C$DW$T$23)
   16305                      .dwattr $C$DW$2208, DW_AT_name("ADCSOCOVFCLR1")
   16306                      .dwattr $C$DW$2208, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
   16307                      .dwattr $C$DW$2208, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
   16308                      .dwattr $C$DW$2208, DW_AT_accessibility(DW_ACCESS_public)
   16309              
   16310              $C$DW$2209      .dwtag  DW_TAG_member
   16311                      .dwattr $C$DW$2209, DW_AT_type(*$C$DW$T$23)
   16312                      .dwattr $C$DW$2209, DW_AT_name("rsvd_10")
   16313                      .dwattr $C$DW$2209, DW_AT_TI_symbol_name("_rsvd_10")
   16314                      .dwattr $C$DW$2209, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   16315                      .dwattr $C$DW$2209, DW_AT_accessibility(DW_ACCESS_public)
   16316              
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:31 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{4F4BA5BD-0BD9-4258-B9DA-489E059A6121} PAGE  309

   16317              $C$DW$2210      .dwtag  DW_TAG_member
   16318                      .dwattr $C$DW$2210, DW_AT_type(*$C$DW$T$24)
   16319                      .dwattr $C$DW$2210, DW_AT_name("ADCSOCxCTL")
   16320                      .dwattr $C$DW$2210, DW_AT_TI_symbol_name("_ADCSOCxCTL")
   16321                      .dwattr $C$DW$2210, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   16322                      .dwattr $C$DW$2210, DW_AT_accessibility(DW_ACCESS_public)
   16323              
   16324              $C$DW$2211      .dwtag  DW_TAG_member
   16325                      .dwattr $C$DW$2211, DW_AT_type(*$C$DW$T$24)
   16326                      .dwattr $C$DW$2211, DW_AT_name("rsvd_11")
   16327                      .dwattr $C$DW$2211, DW_AT_TI_symbol_name("_rsvd_11")
   16328                      .dwattr $C$DW$2211, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   16329                      .dwattr $C$DW$2211, DW_AT_accessibility(DW_ACCESS_public)
   16330              
   16331              $C$DW$2212      .dwtag  DW_TAG_member
   16332                      .dwattr $C$DW$2212, DW_AT_type(*$C$DW$T$23)
   16333                      .dwattr $C$DW$2212, DW_AT_name("ADCREFTRIM")
   16334                      .dwattr $C$DW$2212, DW_AT_TI_symbol_name("_ADCREFTRIM")
   16335                      .dwattr $C$DW$2212, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   16336                      .dwattr $C$DW$2212, DW_AT_accessibility(DW_ACCESS_public)
   16337              
   16338              $C$DW$2213      .dwtag  DW_TAG_member
   16339                      .dwattr $C$DW$2213, DW_AT_type(*$C$DW$T$23)
   16340                      .dwattr $C$DW$2213, DW_AT_name("ADCOFFTRIM")
   16341                      .dwattr $C$DW$2213, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   16342                      .dwattr $C$DW$2213, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   16343                      .dwattr $C$DW$2213, DW_AT_accessibility(DW_ACCESS_public)
   16344              
   16345              $C$DW$2214      .dwtag  DW_TAG_member
   16346                      .dwattr $C$DW$2214, DW_AT_type(*$C$DW$T$29)
   16347                      .dwattr $C$DW$2214, DW_AT_name("resvd_12")
   16348                      .dwattr $C$DW$2214, DW_AT_TI_symbol_name("_resvd_12")
   16349                      .dwattr $C$DW$2214, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   16350                      .dwattr $C$DW$2214, DW_AT_accessibility(DW_ACCESS_public)
   16351              
   16352              $C$DW$2215      .dwtag  DW_TAG_member
   16353                      .dwattr $C$DW$2215, DW_AT_type(*$C$DW$T$23)
   16354                      .dwattr $C$DW$2215, DW_AT_name("ADCREV")
   16355                      .dwattr $C$DW$2215, DW_AT_TI_symbol_name("_ADCREV")
   16356                      .dwattr $C$DW$2215, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   16357                      .dwattr $C$DW$2215, DW_AT_accessibility(DW_ACCESS_public)
   16358              
   16359                      .dwendtag $C$DW$T$30
   16360              
   16361              $C$DW$T$358     .dwtag  DW_TAG_typedef
   16362                      .dwattr $C$DW$T$358, DW_AT_name("ADC_Obj")
   16363                      .dwattr $C$DW$T$358, DW_AT_type(*$C$DW$T$30)
   16364                      .dwattr $C$DW$T$358, DW_AT_language(DW_LANG_C)
   16365              
   16366              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
   16367                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$30)
   16368                      .dwattr $C$DW$T$88, DW_AT_address_class(0x20)
   16369              
   16370              $C$DW$T$89      .dwtag  DW_TAG_typedef
   16371                      .dwattr $C$DW$T$89, DW_AT_name("ADC_Handle")
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:31 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{4F4BA5BD-0BD9-4258-B9DA-489E059A6121} PAGE  310

   16372                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
   16373                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
   16374              
   16375              
   16376              $C$DW$T$32      .dwtag  DW_TAG_structure_type
   16377                      .dwattr $C$DW$T$32, DW_AT_name("_CLK_Obj_")
   16378                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x11)
   16379              $C$DW$2216      .dwtag  DW_TAG_member
   16380                      .dwattr $C$DW$2216, DW_AT_type(*$C$DW$T$23)
   16381                      .dwattr $C$DW$2216, DW_AT_name("XCLK")
   16382                      .dwattr $C$DW$2216, DW_AT_TI_symbol_name("_XCLK")
   16383                      .dwattr $C$DW$2216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16384                      .dwattr $C$DW$2216, DW_AT_accessibility(DW_ACCESS_public)
   16385              
   16386              $C$DW$2217      .dwtag  DW_TAG_member
   16387                      .dwattr $C$DW$2217, DW_AT_type(*$C$DW$T$23)
   16388                      .dwattr $C$DW$2217, DW_AT_name("rsvd_1")
   16389                      .dwattr $C$DW$2217, DW_AT_TI_symbol_name("_rsvd_1")
   16390                      .dwattr $C$DW$2217, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16391                      .dwattr $C$DW$2217, DW_AT_accessibility(DW_ACCESS_public)
   16392              
   16393              $C$DW$2218      .dwtag  DW_TAG_member
   16394                      .dwattr $C$DW$2218, DW_AT_type(*$C$DW$T$23)
   16395                      .dwattr $C$DW$2218, DW_AT_name("CLKCTL")
   16396                      .dwattr $C$DW$2218, DW_AT_TI_symbol_name("_CLKCTL")
   16397                      .dwattr $C$DW$2218, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16398                      .dwattr $C$DW$2218, DW_AT_accessibility(DW_ACCESS_public)
   16399              
   16400              $C$DW$2219      .dwtag  DW_TAG_member
   16401                      .dwattr $C$DW$2219, DW_AT_type(*$C$DW$T$31)
   16402                      .dwattr $C$DW$2219, DW_AT_name("rsvd_2")
   16403                      .dwattr $C$DW$2219, DW_AT_TI_symbol_name("_rsvd_2")
   16404                      .dwattr $C$DW$2219, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   16405                      .dwattr $C$DW$2219, DW_AT_accessibility(DW_ACCESS_public)
   16406              
   16407              $C$DW$2220      .dwtag  DW_TAG_member
   16408                      .dwattr $C$DW$2220, DW_AT_type(*$C$DW$T$23)
   16409                      .dwattr $C$DW$2220, DW_AT_name("LOSPCP")
   16410                      .dwattr $C$DW$2220, DW_AT_TI_symbol_name("_LOSPCP")
   16411                      .dwattr $C$DW$2220, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   16412                      .dwattr $C$DW$2220, DW_AT_accessibility(DW_ACCESS_public)
   16413              
   16414              $C$DW$2221      .dwtag  DW_TAG_member
   16415                      .dwattr $C$DW$2221, DW_AT_type(*$C$DW$T$23)
   16416                      .dwattr $C$DW$2221, DW_AT_name("PCLKCR0")
   16417                      .dwattr $C$DW$2221, DW_AT_TI_symbol_name("_PCLKCR0")
   16418                      .dwattr $C$DW$2221, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   16419                      .dwattr $C$DW$2221, DW_AT_accessibility(DW_ACCESS_public)
   16420              
   16421              $C$DW$2222      .dwtag  DW_TAG_member
   16422                      .dwattr $C$DW$2222, DW_AT_type(*$C$DW$T$23)
   16423                      .dwattr $C$DW$2222, DW_AT_name("PCLKCR1")
   16424                      .dwattr $C$DW$2222, DW_AT_TI_symbol_name("_PCLKCR1")
   16425                      .dwattr $C$DW$2222, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   16426                      .dwattr $C$DW$2222, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:31 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{4F4BA5BD-0BD9-4258-B9DA-489E059A6121} PAGE  311

   16427              
   16428              $C$DW$2223      .dwtag  DW_TAG_member
   16429                      .dwattr $C$DW$2223, DW_AT_type(*$C$DW$T$26)
   16430                      .dwattr $C$DW$2223, DW_AT_name("rsvd_3")
   16431                      .dwattr $C$DW$2223, DW_AT_TI_symbol_name("_rsvd_3")
   16432                      .dwattr $C$DW$2223, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   16433                      .dwattr $C$DW$2223, DW_AT_accessibility(DW_ACCESS_public)
   16434              
   16435              $C$DW$2224      .dwtag  DW_TAG_member
   16436                      .dwattr $C$DW$2224, DW_AT_type(*$C$DW$T$23)
   16437                      .dwattr $C$DW$2224, DW_AT_name("PCLKCR3")
   16438                      .dwattr $C$DW$2224, DW_AT_TI_symbol_name("_PCLKCR3")
   16439                      .dwattr $C$DW$2224, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   16440                      .dwattr $C$DW$2224, DW_AT_accessibility(DW_ACCESS_public)
   16441              
   16442                      .dwendtag $C$DW$T$32
   16443              
   16444              $C$DW$T$90      .dwtag  DW_TAG_pointer_type
   16445                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$32)
   16446                      .dwattr $C$DW$T$90, DW_AT_address_class(0x20)
   16447              
   16448              $C$DW$T$91      .dwtag  DW_TAG_typedef
   16449                      .dwattr $C$DW$T$91, DW_AT_name("CLK_Handle")
   16450                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
   16451                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
   16452              
   16453              
   16454              $C$DW$T$35      .dwtag  DW_TAG_structure_type
   16455                      .dwattr $C$DW$T$35, DW_AT_name("_CPU_Obj_")
   16456                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
   16457              $C$DW$2225      .dwtag  DW_TAG_member
   16458                      .dwattr $C$DW$2225, DW_AT_type(*$C$DW$T$34)
   16459                      .dwattr $C$DW$2225, DW_AT_name("tmp")
   16460                      .dwattr $C$DW$2225, DW_AT_TI_symbol_name("_tmp")
   16461                      .dwattr $C$DW$2225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16462                      .dwattr $C$DW$2225, DW_AT_accessibility(DW_ACCESS_public)
   16463              
   16464                      .dwendtag $C$DW$T$35
   16465              
   16466              $C$DW$T$367     .dwtag  DW_TAG_typedef
   16467                      .dwattr $C$DW$T$367, DW_AT_name("CPU_Obj")
   16468                      .dwattr $C$DW$T$367, DW_AT_type(*$C$DW$T$35)
   16469                      .dwattr $C$DW$T$367, DW_AT_language(DW_LANG_C)
   16470              
   16471              $C$DW$T$92      .dwtag  DW_TAG_pointer_type
   16472                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$35)
   16473                      .dwattr $C$DW$T$92, DW_AT_address_class(0x20)
   16474              
   16475              $C$DW$T$93      .dwtag  DW_TAG_typedef
   16476                      .dwattr $C$DW$T$93, DW_AT_name("CPU_Handle")
   16477                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
   16478                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
   16479              
   16480              
   16481              $C$DW$T$43      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:31 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{4F4BA5BD-0BD9-4258-B9DA-489E059A6121} PAGE  312

   16482                      .dwattr $C$DW$T$43, DW_AT_name("_DRV8301_Obj_")
   16483                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x08)
   16484              $C$DW$2226      .dwtag  DW_TAG_member
   16485                      .dwattr $C$DW$2226, DW_AT_type(*$C$DW$T$37)
   16486                      .dwattr $C$DW$2226, DW_AT_name("spiHandle")
   16487                      .dwattr $C$DW$2226, DW_AT_TI_symbol_name("_spiHandle")
   16488                      .dwattr $C$DW$2226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16489                      .dwattr $C$DW$2226, DW_AT_accessibility(DW_ACCESS_public)
   16490              
   16491              $C$DW$2227      .dwtag  DW_TAG_member
   16492                      .dwattr $C$DW$2227, DW_AT_type(*$C$DW$T$39)
   16493                      .dwattr $C$DW$2227, DW_AT_name("gpioHandle")
   16494                      .dwattr $C$DW$2227, DW_AT_TI_symbol_name("_gpioHandle")
   16495                      .dwattr $C$DW$2227, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16496                      .dwattr $C$DW$2227, DW_AT_accessibility(DW_ACCESS_public)
   16497              
   16498              $C$DW$2228      .dwtag  DW_TAG_member
   16499                      .dwattr $C$DW$2228, DW_AT_type(*$C$DW$T$41)
   16500                      .dwattr $C$DW$2228, DW_AT_name("gpioNumber")
   16501                      .dwattr $C$DW$2228, DW_AT_TI_symbol_name("_gpioNumber")
   16502                      .dwattr $C$DW$2228, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16503                      .dwattr $C$DW$2228, DW_AT_accessibility(DW_ACCESS_public)
   16504              
   16505              $C$DW$2229      .dwtag  DW_TAG_member
   16506                      .dwattr $C$DW$2229, DW_AT_type(*$C$DW$T$42)
   16507                      .dwattr $C$DW$2229, DW_AT_name("RxTimeOut")
   16508                      .dwattr $C$DW$2229, DW_AT_TI_symbol_name("_RxTimeOut")
   16509                      .dwattr $C$DW$2229, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   16510                      .dwattr $C$DW$2229, DW_AT_accessibility(DW_ACCESS_public)
   16511              
   16512              $C$DW$2230      .dwtag  DW_TAG_member
   16513                      .dwattr $C$DW$2230, DW_AT_type(*$C$DW$T$42)
   16514                      .dwattr $C$DW$2230, DW_AT_name("enableTimeOut")
   16515                      .dwattr $C$DW$2230, DW_AT_TI_symbol_name("_enableTimeOut")
   16516                      .dwattr $C$DW$2230, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   16517                      .dwattr $C$DW$2230, DW_AT_accessibility(DW_ACCESS_public)
   16518              
   16519                      .dwendtag $C$DW$T$43
   16520              
   16521              $C$DW$T$120     .dwtag  DW_TAG_typedef
   16522                      .dwattr $C$DW$T$120, DW_AT_name("DRV8301_Obj")
   16523                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$43)
   16524                      .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
   16525              
   16526              $C$DW$T$118     .dwtag  DW_TAG_pointer_type
   16527                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$43)
   16528                      .dwattr $C$DW$T$118, DW_AT_address_class(0x20)
   16529              
   16530              $C$DW$T$119     .dwtag  DW_TAG_typedef
   16531                      .dwattr $C$DW$T$119, DW_AT_name("DRV8301_Handle")
   16532                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
   16533                      .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
   16534              
   16535              
   16536              $C$DW$T$54      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:31 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{4F4BA5BD-0BD9-4258-B9DA-489E059A6121} PAGE  313

   16537                      .dwattr $C$DW$T$54, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
   16538                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x05)
   16539              $C$DW$2231      .dwtag  DW_TAG_member
   16540                      .dwattr $C$DW$2231, DW_AT_type(*$C$DW$T$45)
   16541                      .dwattr $C$DW$2231, DW_AT_name("DRV8301_CURRENT")
   16542                      .dwattr $C$DW$2231, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
   16543                      .dwattr $C$DW$2231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16544                      .dwattr $C$DW$2231, DW_AT_accessibility(DW_ACCESS_public)
   16545              
   16546              $C$DW$2232      .dwtag  DW_TAG_member
   16547                      .dwattr $C$DW$2232, DW_AT_type(*$C$DW$T$47)
   16548                      .dwattr $C$DW$2232, DW_AT_name("DRV8301_RESET")
   16549                      .dwattr $C$DW$2232, DW_AT_TI_symbol_name("_DRV8301_RESET")
   16550                      .dwattr $C$DW$2232, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16551                      .dwattr $C$DW$2232, DW_AT_accessibility(DW_ACCESS_public)
   16552              
   16553              $C$DW$2233      .dwtag  DW_TAG_member
   16554                      .dwattr $C$DW$2233, DW_AT_type(*$C$DW$T$49)
   16555                      .dwattr $C$DW$2233, DW_AT_name("PWM_MODE")
   16556                      .dwattr $C$DW$2233, DW_AT_TI_symbol_name("_PWM_MODE")
   16557                      .dwattr $C$DW$2233, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16558                      .dwattr $C$DW$2233, DW_AT_accessibility(DW_ACCESS_public)
   16559              
   16560              $C$DW$2234      .dwtag  DW_TAG_member
   16561                      .dwattr $C$DW$2234, DW_AT_type(*$C$DW$T$51)
   16562                      .dwattr $C$DW$2234, DW_AT_name("OC_MODE")
   16563                      .dwattr $C$DW$2234, DW_AT_TI_symbol_name("_OC_MODE")
   16564                      .dwattr $C$DW$2234, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   16565                      .dwattr $C$DW$2234, DW_AT_accessibility(DW_ACCESS_public)
   16566              
   16567              $C$DW$2235      .dwtag  DW_TAG_member
   16568                      .dwattr $C$DW$2235, DW_AT_type(*$C$DW$T$53)
   16569                      .dwattr $C$DW$2235, DW_AT_name("OC_ADJ_SET")
   16570                      .dwattr $C$DW$2235, DW_AT_TI_symbol_name("_OC_ADJ_SET")
   16571                      .dwattr $C$DW$2235, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16572                      .dwattr $C$DW$2235, DW_AT_accessibility(DW_ACCESS_public)
   16573              
   16574                      .dwendtag $C$DW$T$54
   16575              
   16576              $C$DW$T$68      .dwtag  DW_TAG_typedef
   16577                      .dwattr $C$DW$T$68, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
   16578                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$54)
   16579                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
   16580              
   16581              
   16582              $C$DW$T$63      .dwtag  DW_TAG_structure_type
   16583                      .dwattr $C$DW$T$63, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
   16584                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
   16585              $C$DW$2236      .dwtag  DW_TAG_member
   16586                      .dwattr $C$DW$2236, DW_AT_type(*$C$DW$T$56)
   16587                      .dwattr $C$DW$2236, DW_AT_name("OCTW_SET")
   16588                      .dwattr $C$DW$2236, DW_AT_TI_symbol_name("_OCTW_SET")
   16589                      .dwattr $C$DW$2236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16590                      .dwattr $C$DW$2236, DW_AT_accessibility(DW_ACCESS_public)
   16591              
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:31 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{4F4BA5BD-0BD9-4258-B9DA-489E059A6121} PAGE  314

   16592              $C$DW$2237      .dwtag  DW_TAG_member
   16593                      .dwattr $C$DW$2237, DW_AT_type(*$C$DW$T$58)
   16594                      .dwattr $C$DW$2237, DW_AT_name("GAIN")
   16595                      .dwattr $C$DW$2237, DW_AT_TI_symbol_name("_GAIN")
   16596                      .dwattr $C$DW$2237, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16597                      .dwattr $C$DW$2237, DW_AT_accessibility(DW_ACCESS_public)
   16598              
   16599              $C$DW$2238      .dwtag  DW_TAG_member
   16600                      .dwattr $C$DW$2238, DW_AT_type(*$C$DW$T$60)
   16601                      .dwattr $C$DW$2238, DW_AT_name("DC_CAL_CH1p2")
   16602                      .dwattr $C$DW$2238, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
   16603                      .dwattr $C$DW$2238, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16604                      .dwattr $C$DW$2238, DW_AT_accessibility(DW_ACCESS_public)
   16605              
   16606              $C$DW$2239      .dwtag  DW_TAG_member
   16607                      .dwattr $C$DW$2239, DW_AT_type(*$C$DW$T$62)
   16608                      .dwattr $C$DW$2239, DW_AT_name("OC_TOFF")
   16609                      .dwattr $C$DW$2239, DW_AT_TI_symbol_name("_OC_TOFF")
   16610                      .dwattr $C$DW$2239, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   16611                      .dwattr $C$DW$2239, DW_AT_accessibility(DW_ACCESS_public)
   16612              
   16613                      .dwendtag $C$DW$T$63
   16614              
   16615              $C$DW$T$69      .dwtag  DW_TAG_typedef
   16616                      .dwattr $C$DW$T$69, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
   16617                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$63)
   16618                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
   16619              
   16620              
   16621              $C$DW$T$64      .dwtag  DW_TAG_structure_type
   16622                      .dwattr $C$DW$T$64, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
   16623                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x0b)
   16624              $C$DW$2240      .dwtag  DW_TAG_member
   16625                      .dwattr $C$DW$2240, DW_AT_type(*$C$DW$T$42)
   16626                      .dwattr $C$DW$2240, DW_AT_name("FAULT")
   16627                      .dwattr $C$DW$2240, DW_AT_TI_symbol_name("_FAULT")
   16628                      .dwattr $C$DW$2240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16629                      .dwattr $C$DW$2240, DW_AT_accessibility(DW_ACCESS_public)
   16630              
   16631              $C$DW$2241      .dwtag  DW_TAG_member
   16632                      .dwattr $C$DW$2241, DW_AT_type(*$C$DW$T$42)
   16633                      .dwattr $C$DW$2241, DW_AT_name("GVDD_UV")
   16634                      .dwattr $C$DW$2241, DW_AT_TI_symbol_name("_GVDD_UV")
   16635                      .dwattr $C$DW$2241, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16636                      .dwattr $C$DW$2241, DW_AT_accessibility(DW_ACCESS_public)
   16637              
   16638              $C$DW$2242      .dwtag  DW_TAG_member
   16639                      .dwattr $C$DW$2242, DW_AT_type(*$C$DW$T$42)
   16640                      .dwattr $C$DW$2242, DW_AT_name("PVDD_UV")
   16641                      .dwattr $C$DW$2242, DW_AT_TI_symbol_name("_PVDD_UV")
   16642                      .dwattr $C$DW$2242, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16643                      .dwattr $C$DW$2242, DW_AT_accessibility(DW_ACCESS_public)
   16644              
   16645              $C$DW$2243      .dwtag  DW_TAG_member
   16646                      .dwattr $C$DW$2243, DW_AT_type(*$C$DW$T$42)
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:31 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{4F4BA5BD-0BD9-4258-B9DA-489E059A6121} PAGE  315

   16647                      .dwattr $C$DW$2243, DW_AT_name("OTSD")
   16648                      .dwattr $C$DW$2243, DW_AT_TI_symbol_name("_OTSD")
   16649                      .dwattr $C$DW$2243, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   16650                      .dwattr $C$DW$2243, DW_AT_accessibility(DW_ACCESS_public)
   16651              
   16652              $C$DW$2244      .dwtag  DW_TAG_member
   16653                      .dwattr $C$DW$2244, DW_AT_type(*$C$DW$T$42)
   16654                      .dwattr $C$DW$2244, DW_AT_name("OTW")
   16655                      .dwattr $C$DW$2244, DW_AT_TI_symbol_name("_OTW")
   16656                      .dwattr $C$DW$2244, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16657                      .dwattr $C$DW$2244, DW_AT_accessibility(DW_ACCESS_public)
   16658              
   16659              $C$DW$2245      .dwtag  DW_TAG_member
   16660                      .dwattr $C$DW$2245, DW_AT_type(*$C$DW$T$42)
   16661                      .dwattr $C$DW$2245, DW_AT_name("FETHA_OC")
   16662                      .dwattr $C$DW$2245, DW_AT_TI_symbol_name("_FETHA_OC")
   16663                      .dwattr $C$DW$2245, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   16664                      .dwattr $C$DW$2245, DW_AT_accessibility(DW_ACCESS_public)
   16665              
   16666              $C$DW$2246      .dwtag  DW_TAG_member
   16667                      .dwattr $C$DW$2246, DW_AT_type(*$C$DW$T$42)
   16668                      .dwattr $C$DW$2246, DW_AT_name("FETLA_OC")
   16669                      .dwattr $C$DW$2246, DW_AT_TI_symbol_name("_FETLA_OC")
   16670                      .dwattr $C$DW$2246, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   16671                      .dwattr $C$DW$2246, DW_AT_accessibility(DW_ACCESS_public)
   16672              
   16673              $C$DW$2247      .dwtag  DW_TAG_member
   16674                      .dwattr $C$DW$2247, DW_AT_type(*$C$DW$T$42)
   16675                      .dwattr $C$DW$2247, DW_AT_name("FETHB_OC")
   16676                      .dwattr $C$DW$2247, DW_AT_TI_symbol_name("_FETHB_OC")
   16677                      .dwattr $C$DW$2247, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   16678                      .dwattr $C$DW$2247, DW_AT_accessibility(DW_ACCESS_public)
   16679              
   16680              $C$DW$2248      .dwtag  DW_TAG_member
   16681                      .dwattr $C$DW$2248, DW_AT_type(*$C$DW$T$42)
   16682                      .dwattr $C$DW$2248, DW_AT_name("FETLB_OC")
   16683                      .dwattr $C$DW$2248, DW_AT_TI_symbol_name("_FETLB_OC")
   16684                      .dwattr $C$DW$2248, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   16685                      .dwattr $C$DW$2248, DW_AT_accessibility(DW_ACCESS_public)
   16686              
   16687              $C$DW$2249      .dwtag  DW_TAG_member
   16688                      .dwattr $C$DW$2249, DW_AT_type(*$C$DW$T$42)
   16689                      .dwattr $C$DW$2249, DW_AT_name("FETHC_OC")
   16690                      .dwattr $C$DW$2249, DW_AT_TI_symbol_name("_FETHC_OC")
   16691                      .dwattr $C$DW$2249, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   16692                      .dwattr $C$DW$2249, DW_AT_accessibility(DW_ACCESS_public)
   16693              
   16694              $C$DW$2250      .dwtag  DW_TAG_member
   16695                      .dwattr $C$DW$2250, DW_AT_type(*$C$DW$T$42)
   16696                      .dwattr $C$DW$2250, DW_AT_name("FETLC_OC")
   16697                      .dwattr $C$DW$2250, DW_AT_TI_symbol_name("_FETLC_OC")
   16698                      .dwattr $C$DW$2250, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   16699                      .dwattr $C$DW$2250, DW_AT_accessibility(DW_ACCESS_public)
   16700              
   16701                      .dwendtag $C$DW$T$64
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:31 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{4F4BA5BD-0BD9-4258-B9DA-489E059A6121} PAGE  316

   16702              
   16703              $C$DW$T$66      .dwtag  DW_TAG_typedef
   16704                      .dwattr $C$DW$T$66, DW_AT_name("DRV_SPI_8301_Stat1_t_")
   16705                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$64)
   16706                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
   16707              
   16708              
   16709              $C$DW$T$65      .dwtag  DW_TAG_structure_type
   16710                      .dwattr $C$DW$T$65, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
   16711                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x02)
   16712              $C$DW$2251      .dwtag  DW_TAG_member
   16713                      .dwattr $C$DW$2251, DW_AT_type(*$C$DW$T$42)
   16714                      .dwattr $C$DW$2251, DW_AT_name("GVDD_OV")
   16715                      .dwattr $C$DW$2251, DW_AT_TI_symbol_name("_GVDD_OV")
   16716                      .dwattr $C$DW$2251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16717                      .dwattr $C$DW$2251, DW_AT_accessibility(DW_ACCESS_public)
   16718              
   16719              $C$DW$2252      .dwtag  DW_TAG_member
   16720                      .dwattr $C$DW$2252, DW_AT_type(*$C$DW$T$22)
   16721                      .dwattr $C$DW$2252, DW_AT_name("DeviceID")
   16722                      .dwattr $C$DW$2252, DW_AT_TI_symbol_name("_DeviceID")
   16723                      .dwattr $C$DW$2252, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16724                      .dwattr $C$DW$2252, DW_AT_accessibility(DW_ACCESS_public)
   16725              
   16726                      .dwendtag $C$DW$T$65
   16727              
   16728              $C$DW$T$67      .dwtag  DW_TAG_typedef
   16729                      .dwattr $C$DW$T$67, DW_AT_name("DRV_SPI_8301_Stat2_t_")
   16730                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$65)
   16731                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
   16732              
   16733              
   16734              $C$DW$T$70      .dwtag  DW_TAG_structure_type
   16735                      .dwattr $C$DW$T$70, DW_AT_name("_DRV_SPI_8301_Vars_t_")
   16736                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x18)
   16737              $C$DW$2253      .dwtag  DW_TAG_member
   16738                      .dwattr $C$DW$2253, DW_AT_type(*$C$DW$T$66)
   16739                      .dwattr $C$DW$2253, DW_AT_name("Stat_Reg_1")
   16740                      .dwattr $C$DW$2253, DW_AT_TI_symbol_name("_Stat_Reg_1")
   16741                      .dwattr $C$DW$2253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16742                      .dwattr $C$DW$2253, DW_AT_accessibility(DW_ACCESS_public)
   16743              
   16744              $C$DW$2254      .dwtag  DW_TAG_member
   16745                      .dwattr $C$DW$2254, DW_AT_type(*$C$DW$T$67)
   16746                      .dwattr $C$DW$2254, DW_AT_name("Stat_Reg_2")
   16747                      .dwattr $C$DW$2254, DW_AT_TI_symbol_name("_Stat_Reg_2")
   16748                      .dwattr $C$DW$2254, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   16749                      .dwattr $C$DW$2254, DW_AT_accessibility(DW_ACCESS_public)
   16750              
   16751              $C$DW$2255      .dwtag  DW_TAG_member
   16752                      .dwattr $C$DW$2255, DW_AT_type(*$C$DW$T$68)
   16753                      .dwattr $C$DW$2255, DW_AT_name("Ctrl_Reg_1")
   16754                      .dwattr $C$DW$2255, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
   16755                      .dwattr $C$DW$2255, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   16756                      .dwattr $C$DW$2255, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:31 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{4F4BA5BD-0BD9-4258-B9DA-489E059A6121} PAGE  317

   16757              
   16758              $C$DW$2256      .dwtag  DW_TAG_member
   16759                      .dwattr $C$DW$2256, DW_AT_type(*$C$DW$T$69)
   16760                      .dwattr $C$DW$2256, DW_AT_name("Ctrl_Reg_2")
   16761                      .dwattr $C$DW$2256, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
   16762                      .dwattr $C$DW$2256, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   16763                      .dwattr $C$DW$2256, DW_AT_accessibility(DW_ACCESS_public)
   16764              
   16765              $C$DW$2257      .dwtag  DW_TAG_member
   16766                      .dwattr $C$DW$2257, DW_AT_type(*$C$DW$T$42)
   16767                      .dwattr $C$DW$2257, DW_AT_name("SndCmd")
   16768                      .dwattr $C$DW$2257, DW_AT_TI_symbol_name("_SndCmd")
   16769                      .dwattr $C$DW$2257, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   16770                      .dwattr $C$DW$2257, DW_AT_accessibility(DW_ACCESS_public)
   16771              
   16772              $C$DW$2258      .dwtag  DW_TAG_member
   16773                      .dwattr $C$DW$2258, DW_AT_type(*$C$DW$T$42)
   16774                      .dwattr $C$DW$2258, DW_AT_name("RcvCmd")
   16775                      .dwattr $C$DW$2258, DW_AT_TI_symbol_name("_RcvCmd")
   16776                      .dwattr $C$DW$2258, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
   16777                      .dwattr $C$DW$2258, DW_AT_accessibility(DW_ACCESS_public)
   16778              
   16779                      .dwendtag $C$DW$T$70
   16780              
   16781              $C$DW$T$374     .dwtag  DW_TAG_typedef
   16782                      .dwattr $C$DW$T$374, DW_AT_name("DRV_SPI_8301_Vars_t")
   16783                      .dwattr $C$DW$T$374, DW_AT_type(*$C$DW$T$70)
   16784                      .dwattr $C$DW$T$374, DW_AT_language(DW_LANG_C)
   16785              
   16786              $C$DW$T$375     .dwtag  DW_TAG_pointer_type
   16787                      .dwattr $C$DW$T$375, DW_AT_type(*$C$DW$T$374)
   16788                      .dwattr $C$DW$T$375, DW_AT_address_class(0x20)
   16789              
   16790              
   16791              $C$DW$T$72      .dwtag  DW_TAG_structure_type
   16792                      .dwattr $C$DW$T$72, DW_AT_name("_FILTER_FO_")
   16793                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x0a)
   16794              $C$DW$2259      .dwtag  DW_TAG_member
   16795                      .dwattr $C$DW$2259, DW_AT_type(*$C$DW$T$71)
   16796                      .dwattr $C$DW$2259, DW_AT_name("a1")
   16797                      .dwattr $C$DW$2259, DW_AT_TI_symbol_name("_a1")
   16798                      .dwattr $C$DW$2259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16799                      .dwattr $C$DW$2259, DW_AT_accessibility(DW_ACCESS_public)
   16800              
   16801              $C$DW$2260      .dwtag  DW_TAG_member
   16802                      .dwattr $C$DW$2260, DW_AT_type(*$C$DW$T$71)
   16803                      .dwattr $C$DW$2260, DW_AT_name("b0")
   16804                      .dwattr $C$DW$2260, DW_AT_TI_symbol_name("_b0")
   16805                      .dwattr $C$DW$2260, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16806                      .dwattr $C$DW$2260, DW_AT_accessibility(DW_ACCESS_public)
   16807              
   16808              $C$DW$2261      .dwtag  DW_TAG_member
   16809                      .dwattr $C$DW$2261, DW_AT_type(*$C$DW$T$71)
   16810                      .dwattr $C$DW$2261, DW_AT_name("b1")
   16811                      .dwattr $C$DW$2261, DW_AT_TI_symbol_name("_b1")
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:31 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{4F4BA5BD-0BD9-4258-B9DA-489E059A6121} PAGE  318

   16812                      .dwattr $C$DW$2261, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16813                      .dwattr $C$DW$2261, DW_AT_accessibility(DW_ACCESS_public)
   16814              
   16815              $C$DW$2262      .dwtag  DW_TAG_member
   16816                      .dwattr $C$DW$2262, DW_AT_type(*$C$DW$T$71)
   16817                      .dwattr $C$DW$2262, DW_AT_name("x1")
   16818                      .dwattr $C$DW$2262, DW_AT_TI_symbol_name("_x1")
   16819                      .dwattr $C$DW$2262, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   16820                      .dwattr $C$DW$2262, DW_AT_accessibility(DW_ACCESS_public)
   16821              
   16822              $C$DW$2263      .dwtag  DW_TAG_member
   16823                      .dwattr $C$DW$2263, DW_AT_type(*$C$DW$T$71)
   16824                      .dwattr $C$DW$2263, DW_AT_name("y1")
   16825                      .dwattr $C$DW$2263, DW_AT_TI_symbol_name("_y1")
   16826                      .dwattr $C$DW$2263, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   16827                      .dwattr $C$DW$2263, DW_AT_accessibility(DW_ACCESS_public)
   16828              
   16829                      .dwendtag $C$DW$T$72
   16830              
   16831              $C$DW$T$126     .dwtag  DW_TAG_typedef
   16832                      .dwattr $C$DW$T$126, DW_AT_name("FILTER_FO_Obj")
   16833                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$72)
   16834                      .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
   16835              
   16836              
   16837              $C$DW$T$19      .dwtag  DW_TAG_structure_type
   16838                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
   16839                      .dwattr $C$DW$T$19, DW_AT_declaration
   16840                      .dwendtag $C$DW$T$19
   16841              
   16842              $C$DW$T$127     .dwtag  DW_TAG_pointer_type
   16843                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$19)
   16844                      .dwattr $C$DW$T$127, DW_AT_address_class(0x20)
   16845              
   16846              $C$DW$T$128     .dwtag  DW_TAG_typedef
   16847                      .dwattr $C$DW$T$128, DW_AT_name("FILTER_FO_Handle")
   16848                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$127)
   16849                      .dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
   16850              
   16851              
   16852              $C$DW$T$73      .dwtag  DW_TAG_structure_type
   16853                      .dwattr $C$DW$T$73, DW_AT_name("_FLASH_Obj_")
   16854                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x08)
   16855              $C$DW$2264      .dwtag  DW_TAG_member
   16856                      .dwattr $C$DW$2264, DW_AT_type(*$C$DW$T$23)
   16857                      .dwattr $C$DW$2264, DW_AT_name("FOPT")
   16858                      .dwattr $C$DW$2264, DW_AT_TI_symbol_name("_FOPT")
   16859                      .dwattr $C$DW$2264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16860                      .dwattr $C$DW$2264, DW_AT_accessibility(DW_ACCESS_public)
   16861              
   16862              $C$DW$2265      .dwtag  DW_TAG_member
   16863                      .dwattr $C$DW$2265, DW_AT_type(*$C$DW$T$23)
   16864                      .dwattr $C$DW$2265, DW_AT_name("rsvd_1")
   16865                      .dwattr $C$DW$2265, DW_AT_TI_symbol_name("_rsvd_1")
   16866                      .dwattr $C$DW$2265, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:31 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{4F4BA5BD-0BD9-4258-B9DA-489E059A6121} PAGE  319

   16867                      .dwattr $C$DW$2265, DW_AT_accessibility(DW_ACCESS_public)
   16868              
   16869              $C$DW$2266      .dwtag  DW_TAG_member
   16870                      .dwattr $C$DW$2266, DW_AT_type(*$C$DW$T$23)
   16871                      .dwattr $C$DW$2266, DW_AT_name("FPWR")
   16872                      .dwattr $C$DW$2266, DW_AT_TI_symbol_name("_FPWR")
   16873                      .dwattr $C$DW$2266, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16874                      .dwattr $C$DW$2266, DW_AT_accessibility(DW_ACCESS_public)
   16875              
   16876              $C$DW$2267      .dwtag  DW_TAG_member
   16877                      .dwattr $C$DW$2267, DW_AT_type(*$C$DW$T$23)
   16878                      .dwattr $C$DW$2267, DW_AT_name("FSTATUS")
   16879                      .dwattr $C$DW$2267, DW_AT_TI_symbol_name("_FSTATUS")
   16880                      .dwattr $C$DW$2267, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   16881                      .dwattr $C$DW$2267, DW_AT_accessibility(DW_ACCESS_public)
   16882              
   16883              $C$DW$2268      .dwtag  DW_TAG_member
   16884                      .dwattr $C$DW$2268, DW_AT_type(*$C$DW$T$23)
   16885                      .dwattr $C$DW$2268, DW_AT_name("FSTDBYWAIT")
   16886                      .dwattr $C$DW$2268, DW_AT_TI_symbol_name("_FSTDBYWAIT")
   16887                      .dwattr $C$DW$2268, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16888                      .dwattr $C$DW$2268, DW_AT_accessibility(DW_ACCESS_public)
   16889              
   16890              $C$DW$2269      .dwtag  DW_TAG_member
   16891                      .dwattr $C$DW$2269, DW_AT_type(*$C$DW$T$23)
   16892                      .dwattr $C$DW$2269, DW_AT_name("FACTIVEWAIT")
   16893                      .dwattr $C$DW$2269, DW_AT_TI_symbol_name("_FACTIVEWAIT")
   16894                      .dwattr $C$DW$2269, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   16895                      .dwattr $C$DW$2269, DW_AT_accessibility(DW_ACCESS_public)
   16896              
   16897              $C$DW$2270      .dwtag  DW_TAG_member
   16898                      .dwattr $C$DW$2270, DW_AT_type(*$C$DW$T$23)
   16899                      .dwattr $C$DW$2270, DW_AT_name("FBANKWAIT")
   16900                      .dwattr $C$DW$2270, DW_AT_TI_symbol_name("_FBANKWAIT")
   16901                      .dwattr $C$DW$2270, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   16902                      .dwattr $C$DW$2270, DW_AT_accessibility(DW_ACCESS_public)
   16903              
   16904              $C$DW$2271      .dwtag  DW_TAG_member
   16905                      .dwattr $C$DW$2271, DW_AT_type(*$C$DW$T$23)
   16906                      .dwattr $C$DW$2271, DW_AT_name("FOTPWAIT")
   16907                      .dwattr $C$DW$2271, DW_AT_TI_symbol_name("_FOTPWAIT")
   16908                      .dwattr $C$DW$2271, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   16909                      .dwattr $C$DW$2271, DW_AT_accessibility(DW_ACCESS_public)
   16910              
   16911                      .dwendtag $C$DW$T$73
   16912              
   16913              $C$DW$T$94      .dwtag  DW_TAG_pointer_type
   16914                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$73)
   16915                      .dwattr $C$DW$T$94, DW_AT_address_class(0x20)
   16916              
   16917              $C$DW$T$95      .dwtag  DW_TAG_typedef
   16918                      .dwattr $C$DW$T$95, DW_AT_name("FLASH_Handle")
   16919                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
   16920                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
   16921              
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:31 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{4F4BA5BD-0BD9-4258-B9DA-489E059A6121} PAGE  320

   16922              
   16923              $C$DW$T$79      .dwtag  DW_TAG_structure_type
   16924                      .dwattr $C$DW$T$79, DW_AT_name("_GPIO_Obj_")
   16925                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x6a)
   16926              $C$DW$2272      .dwtag  DW_TAG_member
   16927                      .dwattr $C$DW$2272, DW_AT_type(*$C$DW$T$76)
   16928                      .dwattr $C$DW$2272, DW_AT_name("GPACTRL")
   16929                      .dwattr $C$DW$2272, DW_AT_TI_symbol_name("_GPACTRL")
   16930                      .dwattr $C$DW$2272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16931                      .dwattr $C$DW$2272, DW_AT_accessibility(DW_ACCESS_public)
   16932              
   16933              $C$DW$2273      .dwtag  DW_TAG_member
   16934                      .dwattr $C$DW$2273, DW_AT_type(*$C$DW$T$76)
   16935                      .dwattr $C$DW$2273, DW_AT_name("GPAQSEL1")
   16936                      .dwattr $C$DW$2273, DW_AT_TI_symbol_name("_GPAQSEL1")
   16937                      .dwattr $C$DW$2273, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16938                      .dwattr $C$DW$2273, DW_AT_accessibility(DW_ACCESS_public)
   16939              
   16940              $C$DW$2274      .dwtag  DW_TAG_member
   16941                      .dwattr $C$DW$2274, DW_AT_type(*$C$DW$T$76)
   16942                      .dwattr $C$DW$2274, DW_AT_name("GPAQSEL2")
   16943                      .dwattr $C$DW$2274, DW_AT_TI_symbol_name("_GPAQSEL2")
   16944                      .dwattr $C$DW$2274, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16945                      .dwattr $C$DW$2274, DW_AT_accessibility(DW_ACCESS_public)
   16946              
   16947              $C$DW$2275      .dwtag  DW_TAG_member
   16948                      .dwattr $C$DW$2275, DW_AT_type(*$C$DW$T$76)
   16949                      .dwattr $C$DW$2275, DW_AT_name("GPAMUX1")
   16950                      .dwattr $C$DW$2275, DW_AT_TI_symbol_name("_GPAMUX1")
   16951                      .dwattr $C$DW$2275, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   16952                      .dwattr $C$DW$2275, DW_AT_accessibility(DW_ACCESS_public)
   16953              
   16954              $C$DW$2276      .dwtag  DW_TAG_member
   16955                      .dwattr $C$DW$2276, DW_AT_type(*$C$DW$T$76)
   16956                      .dwattr $C$DW$2276, DW_AT_name("GPAMUX2")
   16957                      .dwattr $C$DW$2276, DW_AT_TI_symbol_name("_GPAMUX2")
   16958                      .dwattr $C$DW$2276, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   16959                      .dwattr $C$DW$2276, DW_AT_accessibility(DW_ACCESS_public)
   16960              
   16961              $C$DW$2277      .dwtag  DW_TAG_member
   16962                      .dwattr $C$DW$2277, DW_AT_type(*$C$DW$T$76)
   16963                      .dwattr $C$DW$2277, DW_AT_name("GPADIR")
   16964                      .dwattr $C$DW$2277, DW_AT_TI_symbol_name("_GPADIR")
   16965                      .dwattr $C$DW$2277, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   16966                      .dwattr $C$DW$2277, DW_AT_accessibility(DW_ACCESS_public)
   16967              
   16968              $C$DW$2278      .dwtag  DW_TAG_member
   16969                      .dwattr $C$DW$2278, DW_AT_type(*$C$DW$T$76)
   16970                      .dwattr $C$DW$2278, DW_AT_name("GPAPUD")
   16971                      .dwattr $C$DW$2278, DW_AT_TI_symbol_name("_GPAPUD")
   16972                      .dwattr $C$DW$2278, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   16973                      .dwattr $C$DW$2278, DW_AT_accessibility(DW_ACCESS_public)
   16974              
   16975              $C$DW$2279      .dwtag  DW_TAG_member
   16976                      .dwattr $C$DW$2279, DW_AT_type(*$C$DW$T$26)
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:31 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{4F4BA5BD-0BD9-4258-B9DA-489E059A6121} PAGE  321

   16977                      .dwattr $C$DW$2279, DW_AT_name("rsvd_1")
   16978                      .dwattr $C$DW$2279, DW_AT_TI_symbol_name("_rsvd_1")
   16979                      .dwattr $C$DW$2279, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   16980                      .dwattr $C$DW$2279, DW_AT_accessibility(DW_ACCESS_public)
   16981              
   16982              $C$DW$2280      .dwtag  DW_TAG_member
   16983                      .dwattr $C$DW$2280, DW_AT_type(*$C$DW$T$76)
   16984                      .dwattr $C$DW$2280, DW_AT_name("GPBCTRL")
   16985                      .dwattr $C$DW$2280, DW_AT_TI_symbol_name("_GPBCTRL")
   16986                      .dwattr $C$DW$2280, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   16987                      .dwattr $C$DW$2280, DW_AT_accessibility(DW_ACCESS_public)
   16988              
   16989              $C$DW$2281      .dwtag  DW_TAG_member
   16990                      .dwattr $C$DW$2281, DW_AT_type(*$C$DW$T$76)
   16991                      .dwattr $C$DW$2281, DW_AT_name("GPBQSEL1")
   16992                      .dwattr $C$DW$2281, DW_AT_TI_symbol_name("_GPBQSEL1")
   16993                      .dwattr $C$DW$2281, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   16994                      .dwattr $C$DW$2281, DW_AT_accessibility(DW_ACCESS_public)
   16995              
   16996              $C$DW$2282      .dwtag  DW_TAG_member
   16997                      .dwattr $C$DW$2282, DW_AT_type(*$C$DW$T$76)
   16998                      .dwattr $C$DW$2282, DW_AT_name("GPBQSEL2")
   16999                      .dwattr $C$DW$2282, DW_AT_TI_symbol_name("_GPBQSEL2")
   17000                      .dwattr $C$DW$2282, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   17001                      .dwattr $C$DW$2282, DW_AT_accessibility(DW_ACCESS_public)
   17002              
   17003              $C$DW$2283      .dwtag  DW_TAG_member
   17004                      .dwattr $C$DW$2283, DW_AT_type(*$C$DW$T$76)
   17005                      .dwattr $C$DW$2283, DW_AT_name("GPBMUX1")
   17006                      .dwattr $C$DW$2283, DW_AT_TI_symbol_name("_GPBMUX1")
   17007                      .dwattr $C$DW$2283, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   17008                      .dwattr $C$DW$2283, DW_AT_accessibility(DW_ACCESS_public)
   17009              
   17010              $C$DW$2284      .dwtag  DW_TAG_member
   17011                      .dwattr $C$DW$2284, DW_AT_type(*$C$DW$T$76)
   17012                      .dwattr $C$DW$2284, DW_AT_name("GPBMUX2")
   17013                      .dwattr $C$DW$2284, DW_AT_TI_symbol_name("_GPBMUX2")
   17014                      .dwattr $C$DW$2284, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   17015                      .dwattr $C$DW$2284, DW_AT_accessibility(DW_ACCESS_public)
   17016              
   17017              $C$DW$2285      .dwtag  DW_TAG_member
   17018                      .dwattr $C$DW$2285, DW_AT_type(*$C$DW$T$76)
   17019                      .dwattr $C$DW$2285, DW_AT_name("GPBDIR")
   17020                      .dwattr $C$DW$2285, DW_AT_TI_symbol_name("_GPBDIR")
   17021                      .dwattr $C$DW$2285, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   17022                      .dwattr $C$DW$2285, DW_AT_accessibility(DW_ACCESS_public)
   17023              
   17024              $C$DW$2286      .dwtag  DW_TAG_member
   17025                      .dwattr $C$DW$2286, DW_AT_type(*$C$DW$T$76)
   17026                      .dwattr $C$DW$2286, DW_AT_name("GPBPUD")
   17027                      .dwattr $C$DW$2286, DW_AT_TI_symbol_name("_GPBPUD")
   17028                      .dwattr $C$DW$2286, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   17029                      .dwattr $C$DW$2286, DW_AT_accessibility(DW_ACCESS_public)
   17030              
   17031              $C$DW$2287      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:31 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{4F4BA5BD-0BD9-4258-B9DA-489E059A6121} PAGE  322

   17032                      .dwattr $C$DW$2287, DW_AT_type(*$C$DW$T$77)
   17033                      .dwattr $C$DW$2287, DW_AT_name("rsvd_4")
   17034                      .dwattr $C$DW$2287, DW_AT_TI_symbol_name("_rsvd_4")
   17035                      .dwattr $C$DW$2287, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   17036                      .dwattr $C$DW$2287, DW_AT_accessibility(DW_ACCESS_public)
   17037              
   17038              $C$DW$2288      .dwtag  DW_TAG_member
   17039                      .dwattr $C$DW$2288, DW_AT_type(*$C$DW$T$76)
   17040                      .dwattr $C$DW$2288, DW_AT_name("AIOMUX1")
   17041                      .dwattr $C$DW$2288, DW_AT_TI_symbol_name("_AIOMUX1")
   17042                      .dwattr $C$DW$2288, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   17043                      .dwattr $C$DW$2288, DW_AT_accessibility(DW_ACCESS_public)
   17044              
   17045              $C$DW$2289      .dwtag  DW_TAG_member
   17046                      .dwattr $C$DW$2289, DW_AT_type(*$C$DW$T$26)
   17047                      .dwattr $C$DW$2289, DW_AT_name("rsvd_5")
   17048                      .dwattr $C$DW$2289, DW_AT_TI_symbol_name("_rsvd_5")
   17049                      .dwattr $C$DW$2289, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   17050                      .dwattr $C$DW$2289, DW_AT_accessibility(DW_ACCESS_public)
   17051              
   17052              $C$DW$2290      .dwtag  DW_TAG_member
   17053                      .dwattr $C$DW$2290, DW_AT_type(*$C$DW$T$76)
   17054                      .dwattr $C$DW$2290, DW_AT_name("AIODIR")
   17055                      .dwattr $C$DW$2290, DW_AT_TI_symbol_name("_AIODIR")
   17056                      .dwattr $C$DW$2290, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   17057                      .dwattr $C$DW$2290, DW_AT_accessibility(DW_ACCESS_public)
   17058              
   17059              $C$DW$2291      .dwtag  DW_TAG_member
   17060                      .dwattr $C$DW$2291, DW_AT_type(*$C$DW$T$78)
   17061                      .dwattr $C$DW$2291, DW_AT_name("rsvd_6")
   17062                      .dwattr $C$DW$2291, DW_AT_TI_symbol_name("_rsvd_6")
   17063                      .dwattr $C$DW$2291, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   17064                      .dwattr $C$DW$2291, DW_AT_accessibility(DW_ACCESS_public)
   17065              
   17066              $C$DW$2292      .dwtag  DW_TAG_member
   17067                      .dwattr $C$DW$2292, DW_AT_type(*$C$DW$T$76)
   17068                      .dwattr $C$DW$2292, DW_AT_name("GPADAT")
   17069                      .dwattr $C$DW$2292, DW_AT_TI_symbol_name("_GPADAT")
   17070                      .dwattr $C$DW$2292, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   17071                      .dwattr $C$DW$2292, DW_AT_accessibility(DW_ACCESS_public)
   17072              
   17073              $C$DW$2293      .dwtag  DW_TAG_member
   17074                      .dwattr $C$DW$2293, DW_AT_type(*$C$DW$T$76)
   17075                      .dwattr $C$DW$2293, DW_AT_name("GPASET")
   17076                      .dwattr $C$DW$2293, DW_AT_TI_symbol_name("_GPASET")
   17077                      .dwattr $C$DW$2293, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   17078                      .dwattr $C$DW$2293, DW_AT_accessibility(DW_ACCESS_public)
   17079              
   17080              $C$DW$2294      .dwtag  DW_TAG_member
   17081                      .dwattr $C$DW$2294, DW_AT_type(*$C$DW$T$76)
   17082                      .dwattr $C$DW$2294, DW_AT_name("GPACLEAR")
   17083                      .dwattr $C$DW$2294, DW_AT_TI_symbol_name("_GPACLEAR")
   17084                      .dwattr $C$DW$2294, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   17085                      .dwattr $C$DW$2294, DW_AT_accessibility(DW_ACCESS_public)
   17086              
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:31 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{4F4BA5BD-0BD9-4258-B9DA-489E059A6121} PAGE  323

   17087              $C$DW$2295      .dwtag  DW_TAG_member
   17088                      .dwattr $C$DW$2295, DW_AT_type(*$C$DW$T$76)
   17089                      .dwattr $C$DW$2295, DW_AT_name("GPATOGGLE")
   17090                      .dwattr $C$DW$2295, DW_AT_TI_symbol_name("_GPATOGGLE")
   17091                      .dwattr $C$DW$2295, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   17092                      .dwattr $C$DW$2295, DW_AT_accessibility(DW_ACCESS_public)
   17093              
   17094              $C$DW$2296      .dwtag  DW_TAG_member
   17095                      .dwattr $C$DW$2296, DW_AT_type(*$C$DW$T$76)
   17096                      .dwattr $C$DW$2296, DW_AT_name("GPBDAT")
   17097                      .dwattr $C$DW$2296, DW_AT_TI_symbol_name("_GPBDAT")
   17098                      .dwattr $C$DW$2296, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   17099                      .dwattr $C$DW$2296, DW_AT_accessibility(DW_ACCESS_public)
   17100              
   17101              $C$DW$2297      .dwtag  DW_TAG_member
   17102                      .dwattr $C$DW$2297, DW_AT_type(*$C$DW$T$76)
   17103                      .dwattr $C$DW$2297, DW_AT_name("GPBSET")
   17104                      .dwattr $C$DW$2297, DW_AT_TI_symbol_name("_GPBSET")
   17105                      .dwattr $C$DW$2297, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   17106                      .dwattr $C$DW$2297, DW_AT_accessibility(DW_ACCESS_public)
   17107              
   17108              $C$DW$2298      .dwtag  DW_TAG_member
   17109                      .dwattr $C$DW$2298, DW_AT_type(*$C$DW$T$76)
   17110                      .dwattr $C$DW$2298, DW_AT_name("GPBCLEAR")
   17111                      .dwattr $C$DW$2298, DW_AT_TI_symbol_name("_GPBCLEAR")
   17112                      .dwattr $C$DW$2298, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   17113                      .dwattr $C$DW$2298, DW_AT_accessibility(DW_ACCESS_public)
   17114              
   17115              $C$DW$2299      .dwtag  DW_TAG_member
   17116                      .dwattr $C$DW$2299, DW_AT_type(*$C$DW$T$76)
   17117                      .dwattr $C$DW$2299, DW_AT_name("GPBTOGGLE")
   17118                      .dwattr $C$DW$2299, DW_AT_TI_symbol_name("_GPBTOGGLE")
   17119                      .dwattr $C$DW$2299, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   17120                      .dwattr $C$DW$2299, DW_AT_accessibility(DW_ACCESS_public)
   17121              
   17122              $C$DW$2300      .dwtag  DW_TAG_member
   17123                      .dwattr $C$DW$2300, DW_AT_type(*$C$DW$T$31)
   17124                      .dwattr $C$DW$2300, DW_AT_name("rsvd_7")
   17125                      .dwattr $C$DW$2300, DW_AT_TI_symbol_name("_rsvd_7")
   17126                      .dwattr $C$DW$2300, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   17127                      .dwattr $C$DW$2300, DW_AT_accessibility(DW_ACCESS_public)
   17128              
   17129              $C$DW$2301      .dwtag  DW_TAG_member
   17130                      .dwattr $C$DW$2301, DW_AT_type(*$C$DW$T$76)
   17131                      .dwattr $C$DW$2301, DW_AT_name("AIODAT")
   17132                      .dwattr $C$DW$2301, DW_AT_TI_symbol_name("_AIODAT")
   17133                      .dwattr $C$DW$2301, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
   17134                      .dwattr $C$DW$2301, DW_AT_accessibility(DW_ACCESS_public)
   17135              
   17136              $C$DW$2302      .dwtag  DW_TAG_member
   17137                      .dwattr $C$DW$2302, DW_AT_type(*$C$DW$T$76)
   17138                      .dwattr $C$DW$2302, DW_AT_name("AIOSET")
   17139                      .dwattr $C$DW$2302, DW_AT_TI_symbol_name("_AIOSET")
   17140                      .dwattr $C$DW$2302, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   17141                      .dwattr $C$DW$2302, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:31 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{4F4BA5BD-0BD9-4258-B9DA-489E059A6121} PAGE  324

   17142              
   17143              $C$DW$2303      .dwtag  DW_TAG_member
   17144                      .dwattr $C$DW$2303, DW_AT_type(*$C$DW$T$76)
   17145                      .dwattr $C$DW$2303, DW_AT_name("AIOCLEAR")
   17146                      .dwattr $C$DW$2303, DW_AT_TI_symbol_name("_AIOCLEAR")
   17147                      .dwattr $C$DW$2303, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   17148                      .dwattr $C$DW$2303, DW_AT_accessibility(DW_ACCESS_public)
   17149              
   17150              $C$DW$2304      .dwtag  DW_TAG_member
   17151                      .dwattr $C$DW$2304, DW_AT_type(*$C$DW$T$76)
   17152                      .dwattr $C$DW$2304, DW_AT_name("AIOTOGGLE")
   17153                      .dwattr $C$DW$2304, DW_AT_TI_symbol_name("_AIOTOGGLE")
   17154                      .dwattr $C$DW$2304, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   17155                      .dwattr $C$DW$2304, DW_AT_accessibility(DW_ACCESS_public)
   17156              
   17157              $C$DW$2305      .dwtag  DW_TAG_member
   17158                      .dwattr $C$DW$2305, DW_AT_type(*$C$DW$T$28)
   17159                      .dwattr $C$DW$2305, DW_AT_name("GPIOXINTnSEL")
   17160                      .dwattr $C$DW$2305, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
   17161                      .dwattr $C$DW$2305, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   17162                      .dwattr $C$DW$2305, DW_AT_accessibility(DW_ACCESS_public)
   17163              
   17164              $C$DW$2306      .dwtag  DW_TAG_member
   17165                      .dwattr $C$DW$2306, DW_AT_type(*$C$DW$T$27)
   17166                      .dwattr $C$DW$2306, DW_AT_name("rsvd_8")
   17167                      .dwattr $C$DW$2306, DW_AT_TI_symbol_name("_rsvd_8")
   17168                      .dwattr $C$DW$2306, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   17169                      .dwattr $C$DW$2306, DW_AT_accessibility(DW_ACCESS_public)
   17170              
   17171              $C$DW$2307      .dwtag  DW_TAG_member
   17172                      .dwattr $C$DW$2307, DW_AT_type(*$C$DW$T$76)
   17173                      .dwattr $C$DW$2307, DW_AT_name("GPIOLPMSEL")
   17174                      .dwattr $C$DW$2307, DW_AT_TI_symbol_name("_GPIOLPMSEL")
   17175                      .dwattr $C$DW$2307, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   17176                      .dwattr $C$DW$2307, DW_AT_accessibility(DW_ACCESS_public)
   17177              
   17178                      .dwendtag $C$DW$T$79
   17179              
   17180              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
   17181                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$79)
   17182                      .dwattr $C$DW$T$38, DW_AT_address_class(0x20)
   17183              
   17184              $C$DW$T$39      .dwtag  DW_TAG_typedef
   17185                      .dwattr $C$DW$T$39, DW_AT_name("GPIO_Handle")
   17186                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
   17187                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
   17188              
   17189              
   17190              $C$DW$T$81      .dwtag  DW_TAG_structure_type
   17191                      .dwattr $C$DW$T$81, DW_AT_name("_HAL_AdcData_t_")
   17192                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x0e)
   17193              $C$DW$2308      .dwtag  DW_TAG_member
   17194                      .dwattr $C$DW$2308, DW_AT_type(*$C$DW$T$80)
   17195                      .dwattr $C$DW$2308, DW_AT_name("I")
   17196                      .dwattr $C$DW$2308, DW_AT_TI_symbol_name("_I")
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:31 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{4F4BA5BD-0BD9-4258-B9DA-489E059A6121} PAGE  325

   17197                      .dwattr $C$DW$2308, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   17198                      .dwattr $C$DW$2308, DW_AT_accessibility(DW_ACCESS_public)
   17199              
   17200              $C$DW$2309      .dwtag  DW_TAG_member
   17201                      .dwattr $C$DW$2309, DW_AT_type(*$C$DW$T$80)
   17202                      .dwattr $C$DW$2309, DW_AT_name("V")
   17203                      .dwattr $C$DW$2309, DW_AT_TI_symbol_name("_V")
   17204                      .dwattr $C$DW$2309, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   17205                      .dwattr $C$DW$2309, DW_AT_accessibility(DW_ACCESS_public)
   17206              
   17207              $C$DW$2310      .dwtag  DW_TAG_member
   17208                      .dwattr $C$DW$2310, DW_AT_type(*$C$DW$T$71)
   17209                      .dwattr $C$DW$2310, DW_AT_name("dcBus")
   17210                      .dwattr $C$DW$2310, DW_AT_TI_symbol_name("_dcBus")
   17211                      .dwattr $C$DW$2310, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   17212                      .dwattr $C$DW$2310, DW_AT_accessibility(DW_ACCESS_public)
   17213              
   17214                      .dwendtag $C$DW$T$81
   17215              
   17216              $C$DW$T$117     .dwtag  DW_TAG_typedef
   17217                      .dwattr $C$DW$T$117, DW_AT_name("HAL_AdcData_t")
   17218                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$81)
   17219                      .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
   17220              
   17221              
   17222              $C$DW$T$87      .dwtag  DW_TAG_structure_type
   17223                      .dwattr $C$DW$T$87, DW_AT_name("_HAL_DacData_t_")
   17224                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x22)
   17225              $C$DW$2311      .dwtag  DW_TAG_member
   17226                      .dwattr $C$DW$2311, DW_AT_type(*$C$DW$T$22)
   17227                      .dwattr $C$DW$2311, DW_AT_name("PeriodMax")
   17228                      .dwattr $C$DW$2311, DW_AT_TI_symbol_name("_PeriodMax")
   17229                      .dwattr $C$DW$2311, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   17230                      .dwattr $C$DW$2311, DW_AT_accessibility(DW_ACCESS_public)
   17231              
   17232              $C$DW$2312      .dwtag  DW_TAG_member
   17233                      .dwattr $C$DW$2312, DW_AT_type(*$C$DW$T$85)
   17234                      .dwattr $C$DW$2312, DW_AT_name("ptrData")
   17235                      .dwattr $C$DW$2312, DW_AT_TI_symbol_name("_ptrData")
   17236                      .dwattr $C$DW$2312, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   17237                      .dwattr $C$DW$2312, DW_AT_accessibility(DW_ACCESS_public)
   17238              
   17239              $C$DW$2313      .dwtag  DW_TAG_member
   17240                      .dwattr $C$DW$2313, DW_AT_type(*$C$DW$T$86)
   17241                      .dwattr $C$DW$2313, DW_AT_name("value")
   17242                      .dwattr $C$DW$2313, DW_AT_TI_symbol_name("_value")
   17243                      .dwattr $C$DW$2313, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   17244                      .dwattr $C$DW$2313, DW_AT_accessibility(DW_ACCESS_public)
   17245              
   17246              $C$DW$2314      .dwtag  DW_TAG_member
   17247                      .dwattr $C$DW$2314, DW_AT_type(*$C$DW$T$86)
   17248                      .dwattr $C$DW$2314, DW_AT_name("offset")
   17249                      .dwattr $C$DW$2314, DW_AT_TI_symbol_name("_offset")
   17250                      .dwattr $C$DW$2314, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   17251                      .dwattr $C$DW$2314, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:31 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{4F4BA5BD-0BD9-4258-B9DA-489E059A6121} PAGE  326

   17252              
   17253              $C$DW$2315      .dwtag  DW_TAG_member
   17254                      .dwattr $C$DW$2315, DW_AT_type(*$C$DW$T$86)
   17255                      .dwattr $C$DW$2315, DW_AT_name("gain")
   17256                      .dwattr $C$DW$2315, DW_AT_TI_symbol_name("_gain")
   17257                      .dwattr $C$DW$2315, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   17258                      .dwattr $C$DW$2315, DW_AT_accessibility(DW_ACCESS_public)
   17259              
   17260                      .dwendtag $C$DW$T$87
   17261              
   17262              $C$DW$T$385     .dwtag  DW_TAG_typedef
   17263                      .dwattr $C$DW$T$385, DW_AT_name("HAL_DacData_t")
   17264                      .dwattr $C$DW$T$385, DW_AT_type(*$C$DW$T$87)
   17265                      .dwattr $C$DW$T$385, DW_AT_language(DW_LANG_C)
   17266              
   17267              $C$DW$T$386     .dwtag  DW_TAG_pointer_type
   17268                      .dwattr $C$DW$T$386, DW_AT_type(*$C$DW$T$385)
   17269                      .dwattr $C$DW$T$386, DW_AT_address_class(0x20)
   17270              
   17271              $C$DW$2316      .dwtag  DW_TAG_TI_far_type
   17272                      .dwattr $C$DW$2316, DW_AT_type(*$C$DW$T$386)
   17273              
   17274              $C$DW$T$387     .dwtag  DW_TAG_const_type
   17275                      .dwattr $C$DW$T$387, DW_AT_type(*$C$DW$2316)
   17276              
   17277              
   17278              $C$DW$T$123     .dwtag  DW_TAG_structure_type
   17279                      .dwattr $C$DW$T$123, DW_AT_name("_HAL_Obj_")
   17280                      .dwattr $C$DW$T$123, DW_AT_byte_size(0xac)
   17281              $C$DW$2317      .dwtag  DW_TAG_member
   17282                      .dwattr $C$DW$2317, DW_AT_type(*$C$DW$T$89)
   17283                      .dwattr $C$DW$2317, DW_AT_name("adcHandle")
   17284                      .dwattr $C$DW$2317, DW_AT_TI_symbol_name("_adcHandle")
   17285                      .dwattr $C$DW$2317, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   17286                      .dwattr $C$DW$2317, DW_AT_accessibility(DW_ACCESS_public)
   17287              
   17288              $C$DW$2318      .dwtag  DW_TAG_member
   17289                      .dwattr $C$DW$2318, DW_AT_type(*$C$DW$T$91)
   17290                      .dwattr $C$DW$2318, DW_AT_name("clkHandle")
   17291                      .dwattr $C$DW$2318, DW_AT_TI_symbol_name("_clkHandle")
   17292                      .dwattr $C$DW$2318, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   17293                      .dwattr $C$DW$2318, DW_AT_accessibility(DW_ACCESS_public)
   17294              
   17295              $C$DW$2319      .dwtag  DW_TAG_member
   17296                      .dwattr $C$DW$2319, DW_AT_type(*$C$DW$T$93)
   17297                      .dwattr $C$DW$2319, DW_AT_name("cpuHandle")
   17298                      .dwattr $C$DW$2319, DW_AT_TI_symbol_name("_cpuHandle")
   17299                      .dwattr $C$DW$2319, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   17300                      .dwattr $C$DW$2319, DW_AT_accessibility(DW_ACCESS_public)
   17301              
   17302              $C$DW$2320      .dwtag  DW_TAG_member
   17303                      .dwattr $C$DW$2320, DW_AT_type(*$C$DW$T$95)
   17304                      .dwattr $C$DW$2320, DW_AT_name("flashHandle")
   17305                      .dwattr $C$DW$2320, DW_AT_TI_symbol_name("_flashHandle")
   17306                      .dwattr $C$DW$2320, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:31 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{4F4BA5BD-0BD9-4258-B9DA-489E059A6121} PAGE  327

   17307                      .dwattr $C$DW$2320, DW_AT_accessibility(DW_ACCESS_public)
   17308              
   17309              $C$DW$2321      .dwtag  DW_TAG_member
   17310                      .dwattr $C$DW$2321, DW_AT_type(*$C$DW$T$39)
   17311                      .dwattr $C$DW$2321, DW_AT_name("gpioHandle")
   17312                      .dwattr $C$DW$2321, DW_AT_TI_symbol_name("_gpioHandle")
   17313                      .dwattr $C$DW$2321, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   17314                      .dwattr $C$DW$2321, DW_AT_accessibility(DW_ACCESS_public)
   17315              
   17316              $C$DW$2322      .dwtag  DW_TAG_member
   17317                      .dwattr $C$DW$2322, DW_AT_type(*$C$DW$T$98)
   17318                      .dwattr $C$DW$2322, DW_AT_name("offsetHandle_I")
   17319                      .dwattr $C$DW$2322, DW_AT_TI_symbol_name("_offsetHandle_I")
   17320                      .dwattr $C$DW$2322, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   17321                      .dwattr $C$DW$2322, DW_AT_accessibility(DW_ACCESS_public)
   17322              
   17323              $C$DW$2323      .dwtag  DW_TAG_member
   17324                      .dwattr $C$DW$2323, DW_AT_type(*$C$DW$T$100)
   17325                      .dwattr $C$DW$2323, DW_AT_name("offset_I")
   17326                      .dwattr $C$DW$2323, DW_AT_TI_symbol_name("_offset_I")
   17327                      .dwattr $C$DW$2323, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   17328                      .dwattr $C$DW$2323, DW_AT_accessibility(DW_ACCESS_public)
   17329              
   17330              $C$DW$2324      .dwtag  DW_TAG_member
   17331                      .dwattr $C$DW$2324, DW_AT_type(*$C$DW$T$98)
   17332                      .dwattr $C$DW$2324, DW_AT_name("offsetHandle_V")
   17333                      .dwattr $C$DW$2324, DW_AT_TI_symbol_name("_offsetHandle_V")
   17334                      .dwattr $C$DW$2324, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   17335                      .dwattr $C$DW$2324, DW_AT_accessibility(DW_ACCESS_public)
   17336              
   17337              $C$DW$2325      .dwtag  DW_TAG_member
   17338                      .dwattr $C$DW$2325, DW_AT_type(*$C$DW$T$100)
   17339                      .dwattr $C$DW$2325, DW_AT_name("offset_V")
   17340                      .dwattr $C$DW$2325, DW_AT_TI_symbol_name("_offset_V")
   17341                      .dwattr $C$DW$2325, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   17342                      .dwattr $C$DW$2325, DW_AT_accessibility(DW_ACCESS_public)
   17343              
   17344              $C$DW$2326      .dwtag  DW_TAG_member
   17345                      .dwattr $C$DW$2326, DW_AT_type(*$C$DW$T$102)
   17346                      .dwattr $C$DW$2326, DW_AT_name("oscHandle")
   17347                      .dwattr $C$DW$2326, DW_AT_TI_symbol_name("_oscHandle")
   17348                      .dwattr $C$DW$2326, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
   17349                      .dwattr $C$DW$2326, DW_AT_accessibility(DW_ACCESS_public)
   17350              
   17351              $C$DW$2327      .dwtag  DW_TAG_member
   17352                      .dwattr $C$DW$2327, DW_AT_type(*$C$DW$T$104)
   17353                      .dwattr $C$DW$2327, DW_AT_name("pieHandle")
   17354                      .dwattr $C$DW$2327, DW_AT_TI_symbol_name("_pieHandle")
   17355                      .dwattr $C$DW$2327, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
   17356                      .dwattr $C$DW$2327, DW_AT_accessibility(DW_ACCESS_public)
   17357              
   17358              $C$DW$2328      .dwtag  DW_TAG_member
   17359                      .dwattr $C$DW$2328, DW_AT_type(*$C$DW$T$106)
   17360                      .dwattr $C$DW$2328, DW_AT_name("pllHandle")
   17361                      .dwattr $C$DW$2328, DW_AT_TI_symbol_name("_pllHandle")
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:31 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{4F4BA5BD-0BD9-4258-B9DA-489E059A6121} PAGE  328

   17362                      .dwattr $C$DW$2328, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
   17363                      .dwattr $C$DW$2328, DW_AT_accessibility(DW_ACCESS_public)
   17364              
   17365              $C$DW$2329      .dwtag  DW_TAG_member
   17366                      .dwattr $C$DW$2329, DW_AT_type(*$C$DW$T$109)
   17367                      .dwattr $C$DW$2329, DW_AT_name("pwmHandle")
   17368                      .dwattr $C$DW$2329, DW_AT_TI_symbol_name("_pwmHandle")
   17369                      .dwattr $C$DW$2329, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
   17370                      .dwattr $C$DW$2329, DW_AT_accessibility(DW_ACCESS_public)
   17371              
   17372              $C$DW$2330      .dwtag  DW_TAG_member
   17373                      .dwattr $C$DW$2330, DW_AT_type(*$C$DW$T$109)
   17374                      .dwattr $C$DW$2330, DW_AT_name("pwmDacHandle")
   17375                      .dwattr $C$DW$2330, DW_AT_TI_symbol_name("_pwmDacHandle")
   17376                      .dwattr $C$DW$2330, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
   17377                      .dwattr $C$DW$2330, DW_AT_accessibility(DW_ACCESS_public)
   17378              
   17379              $C$DW$2331      .dwtag  DW_TAG_member
   17380                      .dwattr $C$DW$2331, DW_AT_type(*$C$DW$T$111)
   17381                      .dwattr $C$DW$2331, DW_AT_name("pwrHandle")
   17382                      .dwattr $C$DW$2331, DW_AT_TI_symbol_name("_pwrHandle")
   17383                      .dwattr $C$DW$2331, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
   17384                      .dwattr $C$DW$2331, DW_AT_accessibility(DW_ACCESS_public)
   17385              
   17386              $C$DW$2332      .dwtag  DW_TAG_member
   17387                      .dwattr $C$DW$2332, DW_AT_type(*$C$DW$T$114)
   17388                      .dwattr $C$DW$2332, DW_AT_name("timerHandle")
   17389                      .dwattr $C$DW$2332, DW_AT_TI_symbol_name("_timerHandle")
   17390                      .dwattr $C$DW$2332, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
   17391                      .dwattr $C$DW$2332, DW_AT_accessibility(DW_ACCESS_public)
   17392              
   17393              $C$DW$2333      .dwtag  DW_TAG_member
   17394                      .dwattr $C$DW$2333, DW_AT_type(*$C$DW$T$116)
   17395                      .dwattr $C$DW$2333, DW_AT_name("wdogHandle")
   17396                      .dwattr $C$DW$2333, DW_AT_TI_symbol_name("_wdogHandle")
   17397                      .dwattr $C$DW$2333, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
   17398                      .dwattr $C$DW$2333, DW_AT_accessibility(DW_ACCESS_public)
   17399              
   17400              $C$DW$2334      .dwtag  DW_TAG_member
   17401                      .dwattr $C$DW$2334, DW_AT_type(*$C$DW$T$117)
   17402                      .dwattr $C$DW$2334, DW_AT_name("adcBias")
   17403                      .dwattr $C$DW$2334, DW_AT_TI_symbol_name("_adcBias")
   17404                      .dwattr $C$DW$2334, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
   17405                      .dwattr $C$DW$2334, DW_AT_accessibility(DW_ACCESS_public)
   17406              
