TMS320C2000 Assembler PC v22.6.0 Fri Mar 17 18:05:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B7BD8570-D118-473C-8DCF-18F1245813DF} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.0.LTS *
       3              ;* Date/Time created: Fri Mar 17 18:05:15 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/GIANT/GIANT_TI_instaspin/TI_instaspin_indoor_smart_trainer/motorware
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.0.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\GIANT\GIANT_TI_instaspin\TI_instaspin_indoor_smart_trainer\motor
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("OFFSET_setBeta")

   14790                      .dwendtag $C$DW$T$325
   14791              
   14792              $C$DW$T$326     .dwtag  DW_TAG_typedef
   14793                      .dwattr $C$DW$T$326, DW_AT_name("SPI_Mode_e")
   14794                      .dwattr $C$DW$T$326, DW_AT_type(*$C$DW$T$325)
   14795                      .dwattr $C$DW$T$326, DW_AT_language(DW_LANG_C)
   14796              
   14797              $C$DW$1984      .dwtag  DW_TAG_TI_far_type
   14798                      .dwattr $C$DW$1984, DW_AT_type(*$C$DW$T$326)
   14799              
   14800              $C$DW$T$327     .dwtag  DW_TAG_const_type
   14801                      .dwattr $C$DW$T$327, DW_AT_type(*$C$DW$1984)
   14802              
   14803              
   14804              $C$DW$T$328     .dwtag  DW_TAG_enumeration_type
   14805                      .dwattr $C$DW$T$328, DW_AT_byte_size(0x01)
   14806              $C$DW$1985      .dwtag  DW_TAG_enumerator
   14807                      .dwattr $C$DW$1985, DW_AT_name("SPI_TxSuspend_00")
   14808                      .dwattr $C$DW$1985, DW_AT_const_value(0x00)
   14809              
   14810              $C$DW$1986      .dwtag  DW_TAG_enumerator
   14811                      .dwattr $C$DW$1986, DW_AT_name("SPI_TxSuspend_10")
   14812                      .dwattr $C$DW$1986, DW_AT_const_value(0x20)
   14813              
TMS320C2000 Assembler PC v22.6.0 Fri Mar 17 18:05:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B7BD8570-D118-473C-8DCF-18F1245813DF} PAGE  281

   14814              $C$DW$1987      .dwtag  DW_TAG_enumerator
   14815                      .dwattr $C$DW$1987, DW_AT_name("SPI_TxSuspend_free")
   14816                      .dwattr $C$DW$1987, DW_AT_const_value(0x10)
   14817              
   14818                      .dwendtag $C$DW$T$328
   14819              
   14820              $C$DW$T$329     .dwtag  DW_TAG_typedef
   14821                      .dwattr $C$DW$T$329, DW_AT_name("SPI_EmulationSuspend_e")
   14822                      .dwattr $C$DW$T$329, DW_AT_type(*$C$DW$T$328)
   14823                      .dwattr $C$DW$T$329, DW_AT_language(DW_LANG_C)
   14824              
   14825              $C$DW$1988      .dwtag  DW_TAG_TI_far_type
   14826                      .dwattr $C$DW$1988, DW_AT_type(*$C$DW$T$329)
   14827              
   14828              $C$DW$T$330     .dwtag  DW_TAG_const_type
   14829                      .dwattr $C$DW$T$330, DW_AT_type(*$C$DW$1988)
   14830              
   14831              
   14832              $C$DW$T$331     .dwtag  DW_TAG_enumeration_type
   14833                      .dwattr $C$DW$T$331, DW_AT_byte_size(0x01)
   14834              $C$DW$1989      .dwtag  DW_TAG_enumerator
   14835                      .dwattr $C$DW$1989, DW_AT_name("TIMER_EmulationMode_StopAfterNextDecrement")
   14836                      .dwattr $C$DW$1989, DW_AT_const_value(0x00)
   14837              
   14838              $C$DW$1990      .dwtag  DW_TAG_enumerator
   14839                      .dwattr $C$DW$1990, DW_AT_name("TIMER_EmulationMode_StopAtZero")
   14840                      .dwattr $C$DW$1990, DW_AT_const_value(0x400)
   14841              
   14842              $C$DW$1991      .dwtag  DW_TAG_enumerator
   14843                      .dwattr $C$DW$1991, DW_AT_name("TIMER_EmulationMode_RunFree")
   14844                      .dwattr $C$DW$1991, DW_AT_const_value(0x800)
   14845              
   14846                      .dwendtag $C$DW$T$331
   14847              
   14848              $C$DW$T$332     .dwtag  DW_TAG_typedef
   14849                      .dwattr $C$DW$T$332, DW_AT_name("TIMER_EmulationMode_e")
   14850                      .dwattr $C$DW$T$332, DW_AT_type(*$C$DW$T$331)
   14851                      .dwattr $C$DW$T$332, DW_AT_language(DW_LANG_C)
   14852              
   14853              $C$DW$1992      .dwtag  DW_TAG_TI_far_type
   14854                      .dwattr $C$DW$1992, DW_AT_type(*$C$DW$T$332)
   14855              
   14856              $C$DW$T$333     .dwtag  DW_TAG_const_type
   14857                      .dwattr $C$DW$T$333, DW_AT_type(*$C$DW$1992)
   14858              
   14859              
   14860              $C$DW$T$334     .dwtag  DW_TAG_enumeration_type
   14861                      .dwattr $C$DW$T$334, DW_AT_byte_size(0x01)
   14862              $C$DW$1993      .dwtag  DW_TAG_enumerator
   14863                      .dwattr $C$DW$1993, DW_AT_name("HAL_SensorType_Current")
   14864                      .dwattr $C$DW$1993, DW_AT_const_value(0x00)
   14865              
   14866              $C$DW$1994      .dwtag  DW_TAG_enumerator
   14867                      .dwattr $C$DW$1994, DW_AT_name("HAL_SensorType_Voltage")
   14868                      .dwattr $C$DW$1994, DW_AT_const_value(0x01)
TMS320C2000 Assembler PC v22.6.0 Fri Mar 17 18:05:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B7BD8570-D118-473C-8DCF-18F1245813DF} PAGE  282

   14869              
   14870                      .dwendtag $C$DW$T$334
   14871              
   14872              $C$DW$T$335     .dwtag  DW_TAG_typedef
   14873                      .dwattr $C$DW$T$335, DW_AT_name("HAL_SensorType_e")
   14874                      .dwattr $C$DW$T$335, DW_AT_type(*$C$DW$T$334)
   14875                      .dwattr $C$DW$T$335, DW_AT_language(DW_LANG_C)
   14876              
   14877              
   14878              $C$DW$T$30      .dwtag  DW_TAG_structure_type
   14879                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
   14880                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
   14881              $C$DW$1995      .dwtag  DW_TAG_member
   14882                      .dwattr $C$DW$1995, DW_AT_type(*$C$DW$T$24)
   14883                      .dwattr $C$DW$1995, DW_AT_name("ADCRESULT")
   14884                      .dwattr $C$DW$1995, DW_AT_TI_symbol_name("_ADCRESULT")
   14885                      .dwattr $C$DW$1995, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14886                      .dwattr $C$DW$1995, DW_AT_accessibility(DW_ACCESS_public)
   14887              
   14888              $C$DW$1996      .dwtag  DW_TAG_member
   14889                      .dwattr $C$DW$1996, DW_AT_type(*$C$DW$T$25)
   14890                      .dwattr $C$DW$1996, DW_AT_name("resvd_1")
   14891                      .dwattr $C$DW$1996, DW_AT_TI_symbol_name("_resvd_1")
   14892                      .dwattr $C$DW$1996, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   14893                      .dwattr $C$DW$1996, DW_AT_accessibility(DW_ACCESS_public)
   14894              
   14895              $C$DW$1997      .dwtag  DW_TAG_member
   14896                      .dwattr $C$DW$1997, DW_AT_type(*$C$DW$T$23)
   14897                      .dwattr $C$DW$1997, DW_AT_name("ADCCTL1")
   14898                      .dwattr $C$DW$1997, DW_AT_TI_symbol_name("_ADCCTL1")
   14899                      .dwattr $C$DW$1997, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
   14900                      .dwattr $C$DW$1997, DW_AT_accessibility(DW_ACCESS_public)
   14901              
   14902              $C$DW$1998      .dwtag  DW_TAG_member
   14903                      .dwattr $C$DW$1998, DW_AT_type(*$C$DW$T$23)
   14904                      .dwattr $C$DW$1998, DW_AT_name("ADCCTL2")
   14905                      .dwattr $C$DW$1998, DW_AT_TI_symbol_name("_ADCCTL2")
   14906                      .dwattr $C$DW$1998, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
   14907                      .dwattr $C$DW$1998, DW_AT_accessibility(DW_ACCESS_public)
   14908              
   14909              $C$DW$1999      .dwtag  DW_TAG_member
   14910                      .dwattr $C$DW$1999, DW_AT_type(*$C$DW$T$26)
   14911                      .dwattr $C$DW$1999, DW_AT_name("rsvd_2")
   14912                      .dwattr $C$DW$1999, DW_AT_TI_symbol_name("_rsvd_2")
   14913                      .dwattr $C$DW$1999, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
   14914                      .dwattr $C$DW$1999, DW_AT_accessibility(DW_ACCESS_public)
   14915              
   14916              $C$DW$2000      .dwtag  DW_TAG_member
   14917                      .dwattr $C$DW$2000, DW_AT_type(*$C$DW$T$23)
   14918                      .dwattr $C$DW$2000, DW_AT_name("ADCINTFLG")
   14919                      .dwattr $C$DW$2000, DW_AT_TI_symbol_name("_ADCINTFLG")
   14920                      .dwattr $C$DW$2000, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
   14921                      .dwattr $C$DW$2000, DW_AT_accessibility(DW_ACCESS_public)
   14922              
   14923              $C$DW$2001      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Fri Mar 17 18:05:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B7BD8570-D118-473C-8DCF-18F1245813DF} PAGE  283

   14924                      .dwattr $C$DW$2001, DW_AT_type(*$C$DW$T$23)
   14925                      .dwattr $C$DW$2001, DW_AT_name("ADCINTFLGCLR")
   14926                      .dwattr $C$DW$2001, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
   14927                      .dwattr $C$DW$2001, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
   14928                      .dwattr $C$DW$2001, DW_AT_accessibility(DW_ACCESS_public)
   14929              
   14930              $C$DW$2002      .dwtag  DW_TAG_member
   14931                      .dwattr $C$DW$2002, DW_AT_type(*$C$DW$T$23)
   14932                      .dwattr $C$DW$2002, DW_AT_name("ADCINTOVF")
   14933                      .dwattr $C$DW$2002, DW_AT_TI_symbol_name("_ADCINTOVF")
   14934                      .dwattr $C$DW$2002, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
   14935                      .dwattr $C$DW$2002, DW_AT_accessibility(DW_ACCESS_public)
   14936              
   14937              $C$DW$2003      .dwtag  DW_TAG_member
   14938                      .dwattr $C$DW$2003, DW_AT_type(*$C$DW$T$23)
   14939                      .dwattr $C$DW$2003, DW_AT_name("ADCINTOVFCLR")
   14940                      .dwattr $C$DW$2003, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
   14941                      .dwattr $C$DW$2003, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
   14942                      .dwattr $C$DW$2003, DW_AT_accessibility(DW_ACCESS_public)
   14943              
   14944              $C$DW$2004      .dwtag  DW_TAG_member
   14945                      .dwattr $C$DW$2004, DW_AT_type(*$C$DW$T$27)
   14946                      .dwattr $C$DW$2004, DW_AT_name("INTSELxNy")
   14947                      .dwattr $C$DW$2004, DW_AT_TI_symbol_name("_INTSELxNy")
   14948                      .dwattr $C$DW$2004, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
   14949                      .dwattr $C$DW$2004, DW_AT_accessibility(DW_ACCESS_public)
   14950              
   14951              $C$DW$2005      .dwtag  DW_TAG_member
   14952                      .dwattr $C$DW$2005, DW_AT_type(*$C$DW$T$28)
   14953                      .dwattr $C$DW$2005, DW_AT_name("rsvd_3")
   14954                      .dwattr $C$DW$2005, DW_AT_TI_symbol_name("_rsvd_3")
   14955                      .dwattr $C$DW$2005, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
   14956                      .dwattr $C$DW$2005, DW_AT_accessibility(DW_ACCESS_public)
   14957              
   14958              $C$DW$2006      .dwtag  DW_TAG_member
   14959                      .dwattr $C$DW$2006, DW_AT_type(*$C$DW$T$23)
   14960                      .dwattr $C$DW$2006, DW_AT_name("SOCPRICTRL")
   14961                      .dwattr $C$DW$2006, DW_AT_TI_symbol_name("_SOCPRICTRL")
   14962                      .dwattr $C$DW$2006, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
   14963                      .dwattr $C$DW$2006, DW_AT_accessibility(DW_ACCESS_public)
   14964              
   14965              $C$DW$2007      .dwtag  DW_TAG_member
   14966                      .dwattr $C$DW$2007, DW_AT_type(*$C$DW$T$23)
   14967                      .dwattr $C$DW$2007, DW_AT_name("rsvd_4")
   14968                      .dwattr $C$DW$2007, DW_AT_TI_symbol_name("_rsvd_4")
   14969                      .dwattr $C$DW$2007, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
   14970                      .dwattr $C$DW$2007, DW_AT_accessibility(DW_ACCESS_public)
   14971              
   14972              $C$DW$2008      .dwtag  DW_TAG_member
   14973                      .dwattr $C$DW$2008, DW_AT_type(*$C$DW$T$23)
   14974                      .dwattr $C$DW$2008, DW_AT_name("ADCSAMPLEMODE")
   14975                      .dwattr $C$DW$2008, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
   14976                      .dwattr $C$DW$2008, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
   14977                      .dwattr $C$DW$2008, DW_AT_accessibility(DW_ACCESS_public)
   14978              
TMS320C2000 Assembler PC v22.6.0 Fri Mar 17 18:05:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B7BD8570-D118-473C-8DCF-18F1245813DF} PAGE  284

   14979              $C$DW$2009      .dwtag  DW_TAG_member
   14980                      .dwattr $C$DW$2009, DW_AT_type(*$C$DW$T$23)
   14981                      .dwattr $C$DW$2009, DW_AT_name("rsvd_5")
   14982                      .dwattr $C$DW$2009, DW_AT_TI_symbol_name("_rsvd_5")
   14983                      .dwattr $C$DW$2009, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
   14984                      .dwattr $C$DW$2009, DW_AT_accessibility(DW_ACCESS_public)
   14985              
   14986              $C$DW$2010      .dwtag  DW_TAG_member
   14987                      .dwattr $C$DW$2010, DW_AT_type(*$C$DW$T$23)
   14988                      .dwattr $C$DW$2010, DW_AT_name("ADCINTSOCSEL1")
   14989                      .dwattr $C$DW$2010, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
   14990                      .dwattr $C$DW$2010, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
   14991                      .dwattr $C$DW$2010, DW_AT_accessibility(DW_ACCESS_public)
   14992              
   14993              $C$DW$2011      .dwtag  DW_TAG_member
   14994                      .dwattr $C$DW$2011, DW_AT_type(*$C$DW$T$23)
   14995                      .dwattr $C$DW$2011, DW_AT_name("ADCINTSOCSEL2")
   14996                      .dwattr $C$DW$2011, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
   14997                      .dwattr $C$DW$2011, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
   14998                      .dwattr $C$DW$2011, DW_AT_accessibility(DW_ACCESS_public)
   14999              
   15000              $C$DW$2012      .dwtag  DW_TAG_member
   15001                      .dwattr $C$DW$2012, DW_AT_type(*$C$DW$T$26)
   15002                      .dwattr $C$DW$2012, DW_AT_name("rsvd_6")
   15003                      .dwattr $C$DW$2012, DW_AT_TI_symbol_name("_rsvd_6")
   15004                      .dwattr $C$DW$2012, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
   15005                      .dwattr $C$DW$2012, DW_AT_accessibility(DW_ACCESS_public)
   15006              
   15007              $C$DW$2013      .dwtag  DW_TAG_member
   15008                      .dwattr $C$DW$2013, DW_AT_type(*$C$DW$T$23)
   15009                      .dwattr $C$DW$2013, DW_AT_name("ADCSOCFLG1")
   15010                      .dwattr $C$DW$2013, DW_AT_TI_symbol_name("_ADCSOCFLG1")
   15011                      .dwattr $C$DW$2013, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
   15012                      .dwattr $C$DW$2013, DW_AT_accessibility(DW_ACCESS_public)
   15013              
   15014              $C$DW$2014      .dwtag  DW_TAG_member
   15015                      .dwattr $C$DW$2014, DW_AT_type(*$C$DW$T$23)
   15016                      .dwattr $C$DW$2014, DW_AT_name("rsvd_7")
   15017                      .dwattr $C$DW$2014, DW_AT_TI_symbol_name("_rsvd_7")
   15018                      .dwattr $C$DW$2014, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   15019                      .dwattr $C$DW$2014, DW_AT_accessibility(DW_ACCESS_public)
   15020              
   15021              $C$DW$2015      .dwtag  DW_TAG_member
   15022                      .dwattr $C$DW$2015, DW_AT_type(*$C$DW$T$23)
   15023                      .dwattr $C$DW$2015, DW_AT_name("ADCSOCFRC1")
   15024                      .dwattr $C$DW$2015, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   15025                      .dwattr $C$DW$2015, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   15026                      .dwattr $C$DW$2015, DW_AT_accessibility(DW_ACCESS_public)
   15027              
   15028              $C$DW$2016      .dwtag  DW_TAG_member
   15029                      .dwattr $C$DW$2016, DW_AT_type(*$C$DW$T$23)
   15030                      .dwattr $C$DW$2016, DW_AT_name("rsvd_8")
   15031                      .dwattr $C$DW$2016, DW_AT_TI_symbol_name("_rsvd_8")
   15032                      .dwattr $C$DW$2016, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   15033                      .dwattr $C$DW$2016, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Fri Mar 17 18:05:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B7BD8570-D118-473C-8DCF-18F1245813DF} PAGE  285

   15034              
   15035              $C$DW$2017      .dwtag  DW_TAG_member
   15036                      .dwattr $C$DW$2017, DW_AT_type(*$C$DW$T$23)
   15037                      .dwattr $C$DW$2017, DW_AT_name("ADCSOCOVF1")
   15038                      .dwattr $C$DW$2017, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   15039                      .dwattr $C$DW$2017, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   15040                      .dwattr $C$DW$2017, DW_AT_accessibility(DW_ACCESS_public)
   15041              
   15042              $C$DW$2018      .dwtag  DW_TAG_member
   15043                      .dwattr $C$DW$2018, DW_AT_type(*$C$DW$T$23)
   15044                      .dwattr $C$DW$2018, DW_AT_name("rsvd_9")
   15045                      .dwattr $C$DW$2018, DW_AT_TI_symbol_name("_rsvd_9")
   15046                      .dwattr $C$DW$2018, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
   15047                      .dwattr $C$DW$2018, DW_AT_accessibility(DW_ACCESS_public)
   15048              
   15049              $C$DW$2019      .dwtag  DW_TAG_member
   15050                      .dwattr $C$DW$2019, DW_AT_type(*$C$DW$T$23)
   15051                      .dwattr $C$DW$2019, DW_AT_name("ADCSOCOVFCLR1")
   15052                      .dwattr $C$DW$2019, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
   15053                      .dwattr $C$DW$2019, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
   15054                      .dwattr $C$DW$2019, DW_AT_accessibility(DW_ACCESS_public)
   15055              
   15056              $C$DW$2020      .dwtag  DW_TAG_member
   15057                      .dwattr $C$DW$2020, DW_AT_type(*$C$DW$T$23)
   15058                      .dwattr $C$DW$2020, DW_AT_name("rsvd_10")
   15059                      .dwattr $C$DW$2020, DW_AT_TI_symbol_name("_rsvd_10")
   15060                      .dwattr $C$DW$2020, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   15061                      .dwattr $C$DW$2020, DW_AT_accessibility(DW_ACCESS_public)
   15062              
   15063              $C$DW$2021      .dwtag  DW_TAG_member
   15064                      .dwattr $C$DW$2021, DW_AT_type(*$C$DW$T$24)
   15065                      .dwattr $C$DW$2021, DW_AT_name("ADCSOCxCTL")
   15066                      .dwattr $C$DW$2021, DW_AT_TI_symbol_name("_ADCSOCxCTL")
   15067                      .dwattr $C$DW$2021, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   15068                      .dwattr $C$DW$2021, DW_AT_accessibility(DW_ACCESS_public)
   15069              
   15070              $C$DW$2022      .dwtag  DW_TAG_member
   15071                      .dwattr $C$DW$2022, DW_AT_type(*$C$DW$T$24)
   15072                      .dwattr $C$DW$2022, DW_AT_name("rsvd_11")
   15073                      .dwattr $C$DW$2022, DW_AT_TI_symbol_name("_rsvd_11")
   15074                      .dwattr $C$DW$2022, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   15075                      .dwattr $C$DW$2022, DW_AT_accessibility(DW_ACCESS_public)
   15076              
   15077              $C$DW$2023      .dwtag  DW_TAG_member
   15078                      .dwattr $C$DW$2023, DW_AT_type(*$C$DW$T$23)
   15079                      .dwattr $C$DW$2023, DW_AT_name("ADCREFTRIM")
   15080                      .dwattr $C$DW$2023, DW_AT_TI_symbol_name("_ADCREFTRIM")
   15081                      .dwattr $C$DW$2023, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   15082                      .dwattr $C$DW$2023, DW_AT_accessibility(DW_ACCESS_public)
   15083              
   15084              $C$DW$2024      .dwtag  DW_TAG_member
   15085                      .dwattr $C$DW$2024, DW_AT_type(*$C$DW$T$23)
   15086                      .dwattr $C$DW$2024, DW_AT_name("ADCOFFTRIM")
   15087                      .dwattr $C$DW$2024, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   15088                      .dwattr $C$DW$2024, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
TMS320C2000 Assembler PC v22.6.0 Fri Mar 17 18:05:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B7BD8570-D118-473C-8DCF-18F1245813DF} PAGE  286

   15089                      .dwattr $C$DW$2024, DW_AT_accessibility(DW_ACCESS_public)
   15090              
   15091              $C$DW$2025      .dwtag  DW_TAG_member
   15092                      .dwattr $C$DW$2025, DW_AT_type(*$C$DW$T$29)
   15093                      .dwattr $C$DW$2025, DW_AT_name("resvd_12")
   15094                      .dwattr $C$DW$2025, DW_AT_TI_symbol_name("_resvd_12")
   15095                      .dwattr $C$DW$2025, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   15096                      .dwattr $C$DW$2025, DW_AT_accessibility(DW_ACCESS_public)
   15097              
   15098              $C$DW$2026      .dwtag  DW_TAG_member
   15099                      .dwattr $C$DW$2026, DW_AT_type(*$C$DW$T$23)
   15100                      .dwattr $C$DW$2026, DW_AT_name("ADCREV")
   15101                      .dwattr $C$DW$2026, DW_AT_TI_symbol_name("_ADCREV")
   15102                      .dwattr $C$DW$2026, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   15103                      .dwattr $C$DW$2026, DW_AT_accessibility(DW_ACCESS_public)
   15104              
   15105                      .dwendtag $C$DW$T$30
   15106              
   15107              $C$DW$T$337     .dwtag  DW_TAG_typedef
   15108                      .dwattr $C$DW$T$337, DW_AT_name("ADC_Obj")
   15109                      .dwattr $C$DW$T$337, DW_AT_type(*$C$DW$T$30)
   15110                      .dwattr $C$DW$T$337, DW_AT_language(DW_LANG_C)
   15111              
   15112              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
   15113                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$30)
   15114                      .dwattr $C$DW$T$88, DW_AT_address_class(0x20)
   15115              
   15116              $C$DW$T$89      .dwtag  DW_TAG_typedef
   15117                      .dwattr $C$DW$T$89, DW_AT_name("ADC_Handle")
   15118                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
   15119                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
   15120              
   15121              
   15122              $C$DW$T$32      .dwtag  DW_TAG_structure_type
   15123                      .dwattr $C$DW$T$32, DW_AT_name("_CLK_Obj_")
   15124                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x11)
   15125              $C$DW$2027      .dwtag  DW_TAG_member
   15126                      .dwattr $C$DW$2027, DW_AT_type(*$C$DW$T$23)
   15127                      .dwattr $C$DW$2027, DW_AT_name("XCLK")
   15128                      .dwattr $C$DW$2027, DW_AT_TI_symbol_name("_XCLK")
   15129                      .dwattr $C$DW$2027, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15130                      .dwattr $C$DW$2027, DW_AT_accessibility(DW_ACCESS_public)
   15131              
   15132              $C$DW$2028      .dwtag  DW_TAG_member
   15133                      .dwattr $C$DW$2028, DW_AT_type(*$C$DW$T$23)
   15134                      .dwattr $C$DW$2028, DW_AT_name("rsvd_1")
   15135                      .dwattr $C$DW$2028, DW_AT_TI_symbol_name("_rsvd_1")
   15136                      .dwattr $C$DW$2028, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15137                      .dwattr $C$DW$2028, DW_AT_accessibility(DW_ACCESS_public)
   15138              
   15139              $C$DW$2029      .dwtag  DW_TAG_member
   15140                      .dwattr $C$DW$2029, DW_AT_type(*$C$DW$T$23)
   15141                      .dwattr $C$DW$2029, DW_AT_name("CLKCTL")
   15142                      .dwattr $C$DW$2029, DW_AT_TI_symbol_name("_CLKCTL")
   15143                      .dwattr $C$DW$2029, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v22.6.0 Fri Mar 17 18:05:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B7BD8570-D118-473C-8DCF-18F1245813DF} PAGE  287

   15144                      .dwattr $C$DW$2029, DW_AT_accessibility(DW_ACCESS_public)
   15145              
   15146              $C$DW$2030      .dwtag  DW_TAG_member
   15147                      .dwattr $C$DW$2030, DW_AT_type(*$C$DW$T$31)
   15148                      .dwattr $C$DW$2030, DW_AT_name("rsvd_2")
   15149                      .dwattr $C$DW$2030, DW_AT_TI_symbol_name("_rsvd_2")
   15150                      .dwattr $C$DW$2030, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   15151                      .dwattr $C$DW$2030, DW_AT_accessibility(DW_ACCESS_public)
   15152              
   15153              $C$DW$2031      .dwtag  DW_TAG_member
   15154                      .dwattr $C$DW$2031, DW_AT_type(*$C$DW$T$23)
   15155                      .dwattr $C$DW$2031, DW_AT_name("LOSPCP")
   15156                      .dwattr $C$DW$2031, DW_AT_TI_symbol_name("_LOSPCP")
   15157                      .dwattr $C$DW$2031, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   15158                      .dwattr $C$DW$2031, DW_AT_accessibility(DW_ACCESS_public)
   15159              
   15160              $C$DW$2032      .dwtag  DW_TAG_member
   15161                      .dwattr $C$DW$2032, DW_AT_type(*$C$DW$T$23)
   15162                      .dwattr $C$DW$2032, DW_AT_name("PCLKCR0")
   15163                      .dwattr $C$DW$2032, DW_AT_TI_symbol_name("_PCLKCR0")
   15164                      .dwattr $C$DW$2032, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   15165                      .dwattr $C$DW$2032, DW_AT_accessibility(DW_ACCESS_public)
   15166              
   15167              $C$DW$2033      .dwtag  DW_TAG_member
   15168                      .dwattr $C$DW$2033, DW_AT_type(*$C$DW$T$23)
   15169                      .dwattr $C$DW$2033, DW_AT_name("PCLKCR1")
   15170                      .dwattr $C$DW$2033, DW_AT_TI_symbol_name("_PCLKCR1")
   15171                      .dwattr $C$DW$2033, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   15172                      .dwattr $C$DW$2033, DW_AT_accessibility(DW_ACCESS_public)
   15173              
   15174              $C$DW$2034      .dwtag  DW_TAG_member
   15175                      .dwattr $C$DW$2034, DW_AT_type(*$C$DW$T$26)
   15176                      .dwattr $C$DW$2034, DW_AT_name("rsvd_3")
   15177                      .dwattr $C$DW$2034, DW_AT_TI_symbol_name("_rsvd_3")
   15178                      .dwattr $C$DW$2034, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   15179                      .dwattr $C$DW$2034, DW_AT_accessibility(DW_ACCESS_public)
   15180              
   15181              $C$DW$2035      .dwtag  DW_TAG_member
   15182                      .dwattr $C$DW$2035, DW_AT_type(*$C$DW$T$23)
   15183                      .dwattr $C$DW$2035, DW_AT_name("PCLKCR3")
   15184                      .dwattr $C$DW$2035, DW_AT_TI_symbol_name("_PCLKCR3")
   15185                      .dwattr $C$DW$2035, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   15186                      .dwattr $C$DW$2035, DW_AT_accessibility(DW_ACCESS_public)
   15187              
   15188                      .dwendtag $C$DW$T$32
   15189              
   15190              $C$DW$T$90      .dwtag  DW_TAG_pointer_type
   15191                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$32)
   15192                      .dwattr $C$DW$T$90, DW_AT_address_class(0x20)
   15193              
   15194              $C$DW$T$91      .dwtag  DW_TAG_typedef
   15195                      .dwattr $C$DW$T$91, DW_AT_name("CLK_Handle")
   15196                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
   15197                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
   15198              
TMS320C2000 Assembler PC v22.6.0 Fri Mar 17 18:05:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B7BD8570-D118-473C-8DCF-18F1245813DF} PAGE  288

   15199              
   15200              $C$DW$T$35      .dwtag  DW_TAG_structure_type
   15201                      .dwattr $C$DW$T$35, DW_AT_name("_CPU_Obj_")
   15202                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
   15203              $C$DW$2036      .dwtag  DW_TAG_member
   15204                      .dwattr $C$DW$2036, DW_AT_type(*$C$DW$T$34)
   15205                      .dwattr $C$DW$2036, DW_AT_name("tmp")
   15206                      .dwattr $C$DW$2036, DW_AT_TI_symbol_name("_tmp")
   15207                      .dwattr $C$DW$2036, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15208                      .dwattr $C$DW$2036, DW_AT_accessibility(DW_ACCESS_public)
   15209              
   15210                      .dwendtag $C$DW$T$35
   15211              
   15212              $C$DW$T$346     .dwtag  DW_TAG_typedef
   15213                      .dwattr $C$DW$T$346, DW_AT_name("CPU_Obj")
   15214                      .dwattr $C$DW$T$346, DW_AT_type(*$C$DW$T$35)
   15215                      .dwattr $C$DW$T$346, DW_AT_language(DW_LANG_C)
   15216              
   15217              $C$DW$T$92      .dwtag  DW_TAG_pointer_type
   15218                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$35)
   15219                      .dwattr $C$DW$T$92, DW_AT_address_class(0x20)
   15220              
   15221              $C$DW$T$93      .dwtag  DW_TAG_typedef
   15222                      .dwattr $C$DW$T$93, DW_AT_name("CPU_Handle")
   15223                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
   15224                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
   15225              
   15226              
   15227              $C$DW$T$43      .dwtag  DW_TAG_structure_type
   15228                      .dwattr $C$DW$T$43, DW_AT_name("_DRV8301_Obj_")
   15229                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x08)
   15230              $C$DW$2037      .dwtag  DW_TAG_member
   15231                      .dwattr $C$DW$2037, DW_AT_type(*$C$DW$T$37)
   15232                      .dwattr $C$DW$2037, DW_AT_name("spiHandle")
   15233                      .dwattr $C$DW$2037, DW_AT_TI_symbol_name("_spiHandle")
   15234                      .dwattr $C$DW$2037, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15235                      .dwattr $C$DW$2037, DW_AT_accessibility(DW_ACCESS_public)
   15236              
   15237              $C$DW$2038      .dwtag  DW_TAG_member
   15238                      .dwattr $C$DW$2038, DW_AT_type(*$C$DW$T$39)
   15239                      .dwattr $C$DW$2038, DW_AT_name("gpioHandle")
   15240                      .dwattr $C$DW$2038, DW_AT_TI_symbol_name("_gpioHandle")
   15241                      .dwattr $C$DW$2038, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15242                      .dwattr $C$DW$2038, DW_AT_accessibility(DW_ACCESS_public)
   15243              
   15244              $C$DW$2039      .dwtag  DW_TAG_member
   15245                      .dwattr $C$DW$2039, DW_AT_type(*$C$DW$T$41)
   15246                      .dwattr $C$DW$2039, DW_AT_name("gpioNumber")
   15247                      .dwattr $C$DW$2039, DW_AT_TI_symbol_name("_gpioNumber")
   15248                      .dwattr $C$DW$2039, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15249                      .dwattr $C$DW$2039, DW_AT_accessibility(DW_ACCESS_public)
   15250              
   15251              $C$DW$2040      .dwtag  DW_TAG_member
   15252                      .dwattr $C$DW$2040, DW_AT_type(*$C$DW$T$42)
   15253                      .dwattr $C$DW$2040, DW_AT_name("RxTimeOut")
TMS320C2000 Assembler PC v22.6.0 Fri Mar 17 18:05:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B7BD8570-D118-473C-8DCF-18F1245813DF} PAGE  289

   15254                      .dwattr $C$DW$2040, DW_AT_TI_symbol_name("_RxTimeOut")
   15255                      .dwattr $C$DW$2040, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   15256                      .dwattr $C$DW$2040, DW_AT_accessibility(DW_ACCESS_public)
   15257              
   15258              $C$DW$2041      .dwtag  DW_TAG_member
   15259                      .dwattr $C$DW$2041, DW_AT_type(*$C$DW$T$42)
   15260                      .dwattr $C$DW$2041, DW_AT_name("enableTimeOut")
   15261                      .dwattr $C$DW$2041, DW_AT_TI_symbol_name("_enableTimeOut")
   15262                      .dwattr $C$DW$2041, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15263                      .dwattr $C$DW$2041, DW_AT_accessibility(DW_ACCESS_public)
   15264              
   15265                      .dwendtag $C$DW$T$43
   15266              
   15267              $C$DW$T$120     .dwtag  DW_TAG_typedef
   15268                      .dwattr $C$DW$T$120, DW_AT_name("DRV8301_Obj")
   15269                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$43)
   15270                      .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
   15271              
   15272              $C$DW$T$118     .dwtag  DW_TAG_pointer_type
   15273                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$43)
   15274                      .dwattr $C$DW$T$118, DW_AT_address_class(0x20)
   15275              
   15276              $C$DW$T$119     .dwtag  DW_TAG_typedef
   15277                      .dwattr $C$DW$T$119, DW_AT_name("DRV8301_Handle")
   15278                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
   15279                      .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
   15280              
   15281              
   15282              $C$DW$T$54      .dwtag  DW_TAG_structure_type
   15283                      .dwattr $C$DW$T$54, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
   15284                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x05)
   15285              $C$DW$2042      .dwtag  DW_TAG_member
   15286                      .dwattr $C$DW$2042, DW_AT_type(*$C$DW$T$45)
   15287                      .dwattr $C$DW$2042, DW_AT_name("DRV8301_CURRENT")
   15288                      .dwattr $C$DW$2042, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
   15289                      .dwattr $C$DW$2042, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15290                      .dwattr $C$DW$2042, DW_AT_accessibility(DW_ACCESS_public)
   15291              
   15292              $C$DW$2043      .dwtag  DW_TAG_member
   15293                      .dwattr $C$DW$2043, DW_AT_type(*$C$DW$T$47)
   15294                      .dwattr $C$DW$2043, DW_AT_name("DRV8301_RESET")
   15295                      .dwattr $C$DW$2043, DW_AT_TI_symbol_name("_DRV8301_RESET")
   15296                      .dwattr $C$DW$2043, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15297                      .dwattr $C$DW$2043, DW_AT_accessibility(DW_ACCESS_public)
   15298              
   15299              $C$DW$2044      .dwtag  DW_TAG_member
   15300                      .dwattr $C$DW$2044, DW_AT_type(*$C$DW$T$49)
   15301                      .dwattr $C$DW$2044, DW_AT_name("PWM_MODE")
   15302                      .dwattr $C$DW$2044, DW_AT_TI_symbol_name("_PWM_MODE")
   15303                      .dwattr $C$DW$2044, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15304                      .dwattr $C$DW$2044, DW_AT_accessibility(DW_ACCESS_public)
   15305              
   15306              $C$DW$2045      .dwtag  DW_TAG_member
   15307                      .dwattr $C$DW$2045, DW_AT_type(*$C$DW$T$51)
   15308                      .dwattr $C$DW$2045, DW_AT_name("OC_MODE")
TMS320C2000 Assembler PC v22.6.0 Fri Mar 17 18:05:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B7BD8570-D118-473C-8DCF-18F1245813DF} PAGE  290

   15309                      .dwattr $C$DW$2045, DW_AT_TI_symbol_name("_OC_MODE")
   15310                      .dwattr $C$DW$2045, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   15311                      .dwattr $C$DW$2045, DW_AT_accessibility(DW_ACCESS_public)
   15312              
   15313              $C$DW$2046      .dwtag  DW_TAG_member
   15314                      .dwattr $C$DW$2046, DW_AT_type(*$C$DW$T$53)
   15315                      .dwattr $C$DW$2046, DW_AT_name("OC_ADJ_SET")
   15316                      .dwattr $C$DW$2046, DW_AT_TI_symbol_name("_OC_ADJ_SET")
   15317                      .dwattr $C$DW$2046, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15318                      .dwattr $C$DW$2046, DW_AT_accessibility(DW_ACCESS_public)
   15319              
   15320                      .dwendtag $C$DW$T$54
   15321              
   15322              $C$DW$T$68      .dwtag  DW_TAG_typedef
   15323                      .dwattr $C$DW$T$68, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
   15324                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$54)
   15325                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
   15326              
   15327              
   15328              $C$DW$T$63      .dwtag  DW_TAG_structure_type
   15329                      .dwattr $C$DW$T$63, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
   15330                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
   15331              $C$DW$2047      .dwtag  DW_TAG_member
   15332                      .dwattr $C$DW$2047, DW_AT_type(*$C$DW$T$56)
   15333                      .dwattr $C$DW$2047, DW_AT_name("OCTW_SET")
   15334                      .dwattr $C$DW$2047, DW_AT_TI_symbol_name("_OCTW_SET")
   15335                      .dwattr $C$DW$2047, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15336                      .dwattr $C$DW$2047, DW_AT_accessibility(DW_ACCESS_public)
   15337              
   15338              $C$DW$2048      .dwtag  DW_TAG_member
   15339                      .dwattr $C$DW$2048, DW_AT_type(*$C$DW$T$58)
   15340                      .dwattr $C$DW$2048, DW_AT_name("GAIN")
   15341                      .dwattr $C$DW$2048, DW_AT_TI_symbol_name("_GAIN")
   15342                      .dwattr $C$DW$2048, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15343                      .dwattr $C$DW$2048, DW_AT_accessibility(DW_ACCESS_public)
   15344              
   15345              $C$DW$2049      .dwtag  DW_TAG_member
   15346                      .dwattr $C$DW$2049, DW_AT_type(*$C$DW$T$60)
   15347                      .dwattr $C$DW$2049, DW_AT_name("DC_CAL_CH1p2")
   15348                      .dwattr $C$DW$2049, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
   15349                      .dwattr $C$DW$2049, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15350                      .dwattr $C$DW$2049, DW_AT_accessibility(DW_ACCESS_public)
   15351              
   15352              $C$DW$2050      .dwtag  DW_TAG_member
   15353                      .dwattr $C$DW$2050, DW_AT_type(*$C$DW$T$62)
   15354                      .dwattr $C$DW$2050, DW_AT_name("OC_TOFF")
   15355                      .dwattr $C$DW$2050, DW_AT_TI_symbol_name("_OC_TOFF")
   15356                      .dwattr $C$DW$2050, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   15357                      .dwattr $C$DW$2050, DW_AT_accessibility(DW_ACCESS_public)
   15358              
   15359                      .dwendtag $C$DW$T$63
   15360              
   15361              $C$DW$T$69      .dwtag  DW_TAG_typedef
   15362                      .dwattr $C$DW$T$69, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
   15363                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$63)
TMS320C2000 Assembler PC v22.6.0 Fri Mar 17 18:05:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B7BD8570-D118-473C-8DCF-18F1245813DF} PAGE  291

   15364                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
   15365              
   15366              
   15367              $C$DW$T$64      .dwtag  DW_TAG_structure_type
   15368                      .dwattr $C$DW$T$64, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
   15369                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x0b)
   15370              $C$DW$2051      .dwtag  DW_TAG_member
   15371                      .dwattr $C$DW$2051, DW_AT_type(*$C$DW$T$42)
   15372                      .dwattr $C$DW$2051, DW_AT_name("FAULT")
   15373                      .dwattr $C$DW$2051, DW_AT_TI_symbol_name("_FAULT")
   15374                      .dwattr $C$DW$2051, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15375                      .dwattr $C$DW$2051, DW_AT_accessibility(DW_ACCESS_public)
   15376              
   15377              $C$DW$2052      .dwtag  DW_TAG_member
   15378                      .dwattr $C$DW$2052, DW_AT_type(*$C$DW$T$42)
   15379                      .dwattr $C$DW$2052, DW_AT_name("GVDD_UV")
   15380                      .dwattr $C$DW$2052, DW_AT_TI_symbol_name("_GVDD_UV")
   15381                      .dwattr $C$DW$2052, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15382                      .dwattr $C$DW$2052, DW_AT_accessibility(DW_ACCESS_public)
   15383              
   15384              $C$DW$2053      .dwtag  DW_TAG_member
   15385                      .dwattr $C$DW$2053, DW_AT_type(*$C$DW$T$42)
   15386                      .dwattr $C$DW$2053, DW_AT_name("PVDD_UV")
   15387                      .dwattr $C$DW$2053, DW_AT_TI_symbol_name("_PVDD_UV")
   15388                      .dwattr $C$DW$2053, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15389                      .dwattr $C$DW$2053, DW_AT_accessibility(DW_ACCESS_public)
   15390              
   15391              $C$DW$2054      .dwtag  DW_TAG_member
   15392                      .dwattr $C$DW$2054, DW_AT_type(*$C$DW$T$42)
   15393                      .dwattr $C$DW$2054, DW_AT_name("OTSD")
   15394                      .dwattr $C$DW$2054, DW_AT_TI_symbol_name("_OTSD")
   15395                      .dwattr $C$DW$2054, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   15396                      .dwattr $C$DW$2054, DW_AT_accessibility(DW_ACCESS_public)
   15397              
   15398              $C$DW$2055      .dwtag  DW_TAG_member
   15399                      .dwattr $C$DW$2055, DW_AT_type(*$C$DW$T$42)
   15400                      .dwattr $C$DW$2055, DW_AT_name("OTW")
   15401                      .dwattr $C$DW$2055, DW_AT_TI_symbol_name("_OTW")
   15402                      .dwattr $C$DW$2055, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15403                      .dwattr $C$DW$2055, DW_AT_accessibility(DW_ACCESS_public)
   15404              
   15405              $C$DW$2056      .dwtag  DW_TAG_member
   15406                      .dwattr $C$DW$2056, DW_AT_type(*$C$DW$T$42)
   15407                      .dwattr $C$DW$2056, DW_AT_name("FETHA_OC")
   15408                      .dwattr $C$DW$2056, DW_AT_TI_symbol_name("_FETHA_OC")
   15409                      .dwattr $C$DW$2056, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   15410                      .dwattr $C$DW$2056, DW_AT_accessibility(DW_ACCESS_public)
   15411              
   15412              $C$DW$2057      .dwtag  DW_TAG_member
   15413                      .dwattr $C$DW$2057, DW_AT_type(*$C$DW$T$42)
   15414                      .dwattr $C$DW$2057, DW_AT_name("FETLA_OC")
   15415                      .dwattr $C$DW$2057, DW_AT_TI_symbol_name("_FETLA_OC")
   15416                      .dwattr $C$DW$2057, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15417                      .dwattr $C$DW$2057, DW_AT_accessibility(DW_ACCESS_public)
   15418              
TMS320C2000 Assembler PC v22.6.0 Fri Mar 17 18:05:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B7BD8570-D118-473C-8DCF-18F1245813DF} PAGE  292

   15419              $C$DW$2058      .dwtag  DW_TAG_member
   15420                      .dwattr $C$DW$2058, DW_AT_type(*$C$DW$T$42)
   15421                      .dwattr $C$DW$2058, DW_AT_name("FETHB_OC")
   15422                      .dwattr $C$DW$2058, DW_AT_TI_symbol_name("_FETHB_OC")
   15423                      .dwattr $C$DW$2058, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   15424                      .dwattr $C$DW$2058, DW_AT_accessibility(DW_ACCESS_public)
   15425              
   15426              $C$DW$2059      .dwtag  DW_TAG_member
   15427                      .dwattr $C$DW$2059, DW_AT_type(*$C$DW$T$42)
   15428                      .dwattr $C$DW$2059, DW_AT_name("FETLB_OC")
   15429                      .dwattr $C$DW$2059, DW_AT_TI_symbol_name("_FETLB_OC")
   15430                      .dwattr $C$DW$2059, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   15431                      .dwattr $C$DW$2059, DW_AT_accessibility(DW_ACCESS_public)
   15432              
   15433              $C$DW$2060      .dwtag  DW_TAG_member
   15434                      .dwattr $C$DW$2060, DW_AT_type(*$C$DW$T$42)
   15435                      .dwattr $C$DW$2060, DW_AT_name("FETHC_OC")
   15436                      .dwattr $C$DW$2060, DW_AT_TI_symbol_name("_FETHC_OC")
   15437                      .dwattr $C$DW$2060, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   15438                      .dwattr $C$DW$2060, DW_AT_accessibility(DW_ACCESS_public)
   15439              
   15440              $C$DW$2061      .dwtag  DW_TAG_member
   15441                      .dwattr $C$DW$2061, DW_AT_type(*$C$DW$T$42)
   15442                      .dwattr $C$DW$2061, DW_AT_name("FETLC_OC")
   15443                      .dwattr $C$DW$2061, DW_AT_TI_symbol_name("_FETLC_OC")
   15444                      .dwattr $C$DW$2061, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   15445                      .dwattr $C$DW$2061, DW_AT_accessibility(DW_ACCESS_public)
   15446              
   15447                      .dwendtag $C$DW$T$64
   15448              
   15449              $C$DW$T$66      .dwtag  DW_TAG_typedef
   15450                      .dwattr $C$DW$T$66, DW_AT_name("DRV_SPI_8301_Stat1_t_")
   15451                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$64)
   15452                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
   15453              
   15454              
   15455              $C$DW$T$65      .dwtag  DW_TAG_structure_type
   15456                      .dwattr $C$DW$T$65, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
   15457                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x02)
   15458              $C$DW$2062      .dwtag  DW_TAG_member
   15459                      .dwattr $C$DW$2062, DW_AT_type(*$C$DW$T$42)
   15460                      .dwattr $C$DW$2062, DW_AT_name("GVDD_OV")
   15461                      .dwattr $C$DW$2062, DW_AT_TI_symbol_name("_GVDD_OV")
   15462                      .dwattr $C$DW$2062, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15463                      .dwattr $C$DW$2062, DW_AT_accessibility(DW_ACCESS_public)
   15464              
   15465              $C$DW$2063      .dwtag  DW_TAG_member
   15466                      .dwattr $C$DW$2063, DW_AT_type(*$C$DW$T$22)
   15467                      .dwattr $C$DW$2063, DW_AT_name("DeviceID")
   15468                      .dwattr $C$DW$2063, DW_AT_TI_symbol_name("_DeviceID")
   15469                      .dwattr $C$DW$2063, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15470                      .dwattr $C$DW$2063, DW_AT_accessibility(DW_ACCESS_public)
   15471              
   15472                      .dwendtag $C$DW$T$65
   15473              
TMS320C2000 Assembler PC v22.6.0 Fri Mar 17 18:05:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B7BD8570-D118-473C-8DCF-18F1245813DF} PAGE  293

   15474              $C$DW$T$67      .dwtag  DW_TAG_typedef
   15475                      .dwattr $C$DW$T$67, DW_AT_name("DRV_SPI_8301_Stat2_t_")
   15476                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$65)
   15477                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
   15478              
   15479              
   15480              $C$DW$T$70      .dwtag  DW_TAG_structure_type
   15481                      .dwattr $C$DW$T$70, DW_AT_name("_DRV_SPI_8301_Vars_t_")
   15482                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x18)
   15483              $C$DW$2064      .dwtag  DW_TAG_member
   15484                      .dwattr $C$DW$2064, DW_AT_type(*$C$DW$T$66)
   15485                      .dwattr $C$DW$2064, DW_AT_name("Stat_Reg_1")
   15486                      .dwattr $C$DW$2064, DW_AT_TI_symbol_name("_Stat_Reg_1")
   15487                      .dwattr $C$DW$2064, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15488                      .dwattr $C$DW$2064, DW_AT_accessibility(DW_ACCESS_public)
   15489              
   15490              $C$DW$2065      .dwtag  DW_TAG_member
   15491                      .dwattr $C$DW$2065, DW_AT_type(*$C$DW$T$67)
   15492                      .dwattr $C$DW$2065, DW_AT_name("Stat_Reg_2")
   15493                      .dwattr $C$DW$2065, DW_AT_TI_symbol_name("_Stat_Reg_2")
   15494                      .dwattr $C$DW$2065, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   15495                      .dwattr $C$DW$2065, DW_AT_accessibility(DW_ACCESS_public)
   15496              
   15497              $C$DW$2066      .dwtag  DW_TAG_member
   15498                      .dwattr $C$DW$2066, DW_AT_type(*$C$DW$T$68)
   15499                      .dwattr $C$DW$2066, DW_AT_name("Ctrl_Reg_1")
   15500                      .dwattr $C$DW$2066, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
   15501                      .dwattr $C$DW$2066, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   15502                      .dwattr $C$DW$2066, DW_AT_accessibility(DW_ACCESS_public)
   15503              
   15504              $C$DW$2067      .dwtag  DW_TAG_member
   15505                      .dwattr $C$DW$2067, DW_AT_type(*$C$DW$T$69)
   15506                      .dwattr $C$DW$2067, DW_AT_name("Ctrl_Reg_2")
   15507                      .dwattr $C$DW$2067, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
   15508                      .dwattr $C$DW$2067, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   15509                      .dwattr $C$DW$2067, DW_AT_accessibility(DW_ACCESS_public)
   15510              
   15511              $C$DW$2068      .dwtag  DW_TAG_member
   15512                      .dwattr $C$DW$2068, DW_AT_type(*$C$DW$T$42)
   15513                      .dwattr $C$DW$2068, DW_AT_name("SndCmd")
   15514                      .dwattr $C$DW$2068, DW_AT_TI_symbol_name("_SndCmd")
   15515                      .dwattr $C$DW$2068, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   15516                      .dwattr $C$DW$2068, DW_AT_accessibility(DW_ACCESS_public)
   15517              
   15518              $C$DW$2069      .dwtag  DW_TAG_member
   15519                      .dwattr $C$DW$2069, DW_AT_type(*$C$DW$T$42)
   15520                      .dwattr $C$DW$2069, DW_AT_name("RcvCmd")
   15521                      .dwattr $C$DW$2069, DW_AT_TI_symbol_name("_RcvCmd")
   15522                      .dwattr $C$DW$2069, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
   15523                      .dwattr $C$DW$2069, DW_AT_accessibility(DW_ACCESS_public)
   15524              
   15525                      .dwendtag $C$DW$T$70
   15526              
   15527              $C$DW$T$353     .dwtag  DW_TAG_typedef
   15528                      .dwattr $C$DW$T$353, DW_AT_name("DRV_SPI_8301_Vars_t")
TMS320C2000 Assembler PC v22.6.0 Fri Mar 17 18:05:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B7BD8570-D118-473C-8DCF-18F1245813DF} PAGE  294

   15529                      .dwattr $C$DW$T$353, DW_AT_type(*$C$DW$T$70)
   15530                      .dwattr $C$DW$T$353, DW_AT_language(DW_LANG_C)
   15531              
   15532              $C$DW$T$354     .dwtag  DW_TAG_pointer_type
   15533                      .dwattr $C$DW$T$354, DW_AT_type(*$C$DW$T$353)
   15534                      .dwattr $C$DW$T$354, DW_AT_address_class(0x20)
   15535              
   15536              
   15537              $C$DW$T$72      .dwtag  DW_TAG_structure_type
   15538                      .dwattr $C$DW$T$72, DW_AT_name("_FILTER_FO_")
   15539                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x0a)
   15540              $C$DW$2070      .dwtag  DW_TAG_member
   15541                      .dwattr $C$DW$2070, DW_AT_type(*$C$DW$T$71)
   15542                      .dwattr $C$DW$2070, DW_AT_name("a1")
   15543                      .dwattr $C$DW$2070, DW_AT_TI_symbol_name("_a1")
   15544                      .dwattr $C$DW$2070, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15545                      .dwattr $C$DW$2070, DW_AT_accessibility(DW_ACCESS_public)
   15546              
   15547              $C$DW$2071      .dwtag  DW_TAG_member
   15548                      .dwattr $C$DW$2071, DW_AT_type(*$C$DW$T$71)
   15549                      .dwattr $C$DW$2071, DW_AT_name("b0")
   15550                      .dwattr $C$DW$2071, DW_AT_TI_symbol_name("_b0")
   15551                      .dwattr $C$DW$2071, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15552                      .dwattr $C$DW$2071, DW_AT_accessibility(DW_ACCESS_public)
   15553              
   15554              $C$DW$2072      .dwtag  DW_TAG_member
   15555                      .dwattr $C$DW$2072, DW_AT_type(*$C$DW$T$71)
   15556                      .dwattr $C$DW$2072, DW_AT_name("b1")
   15557                      .dwattr $C$DW$2072, DW_AT_TI_symbol_name("_b1")
   15558                      .dwattr $C$DW$2072, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15559                      .dwattr $C$DW$2072, DW_AT_accessibility(DW_ACCESS_public)
   15560              
   15561              $C$DW$2073      .dwtag  DW_TAG_member
   15562                      .dwattr $C$DW$2073, DW_AT_type(*$C$DW$T$71)
   15563                      .dwattr $C$DW$2073, DW_AT_name("x1")
   15564                      .dwattr $C$DW$2073, DW_AT_TI_symbol_name("_x1")
   15565                      .dwattr $C$DW$2073, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15566                      .dwattr $C$DW$2073, DW_AT_accessibility(DW_ACCESS_public)
   15567              
   15568              $C$DW$2074      .dwtag  DW_TAG_member
   15569                      .dwattr $C$DW$2074, DW_AT_type(*$C$DW$T$71)
   15570                      .dwattr $C$DW$2074, DW_AT_name("y1")
   15571                      .dwattr $C$DW$2074, DW_AT_TI_symbol_name("_y1")
   15572                      .dwattr $C$DW$2074, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   15573                      .dwattr $C$DW$2074, DW_AT_accessibility(DW_ACCESS_public)
   15574              
   15575                      .dwendtag $C$DW$T$72
   15576              
   15577              $C$DW$T$124     .dwtag  DW_TAG_typedef
   15578                      .dwattr $C$DW$T$124, DW_AT_name("FILTER_FO_Obj")
   15579                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$72)
   15580                      .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
   15581              
   15582              
   15583              $C$DW$T$19      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v22.6.0 Fri Mar 17 18:05:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B7BD8570-D118-473C-8DCF-18F1245813DF} PAGE  295

   15584                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
   15585                      .dwattr $C$DW$T$19, DW_AT_declaration
   15586                      .dwendtag $C$DW$T$19
   15587              
   15588              $C$DW$T$125     .dwtag  DW_TAG_pointer_type
   15589                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$19)
   15590                      .dwattr $C$DW$T$125, DW_AT_address_class(0x20)
   15591              
   15592              $C$DW$T$126     .dwtag  DW_TAG_typedef
   15593                      .dwattr $C$DW$T$126, DW_AT_name("FILTER_FO_Handle")
   15594                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$125)
   15595                      .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
   15596              
   15597              
   15598              $C$DW$T$73      .dwtag  DW_TAG_structure_type
   15599                      .dwattr $C$DW$T$73, DW_AT_name("_FLASH_Obj_")
   15600                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x08)
   15601              $C$DW$2075      .dwtag  DW_TAG_member
   15602                      .dwattr $C$DW$2075, DW_AT_type(*$C$DW$T$23)
   15603                      .dwattr $C$DW$2075, DW_AT_name("FOPT")
   15604                      .dwattr $C$DW$2075, DW_AT_TI_symbol_name("_FOPT")
   15605                      .dwattr $C$DW$2075, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15606                      .dwattr $C$DW$2075, DW_AT_accessibility(DW_ACCESS_public)
   15607              
   15608              $C$DW$2076      .dwtag  DW_TAG_member
   15609                      .dwattr $C$DW$2076, DW_AT_type(*$C$DW$T$23)
   15610                      .dwattr $C$DW$2076, DW_AT_name("rsvd_1")
   15611                      .dwattr $C$DW$2076, DW_AT_TI_symbol_name("_rsvd_1")
   15612                      .dwattr $C$DW$2076, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15613                      .dwattr $C$DW$2076, DW_AT_accessibility(DW_ACCESS_public)
   15614              
   15615              $C$DW$2077      .dwtag  DW_TAG_member
   15616                      .dwattr $C$DW$2077, DW_AT_type(*$C$DW$T$23)
   15617                      .dwattr $C$DW$2077, DW_AT_name("FPWR")
   15618                      .dwattr $C$DW$2077, DW_AT_TI_symbol_name("_FPWR")
   15619                      .dwattr $C$DW$2077, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15620                      .dwattr $C$DW$2077, DW_AT_accessibility(DW_ACCESS_public)
   15621              
   15622              $C$DW$2078      .dwtag  DW_TAG_member
   15623                      .dwattr $C$DW$2078, DW_AT_type(*$C$DW$T$23)
   15624                      .dwattr $C$DW$2078, DW_AT_name("FSTATUS")
   15625                      .dwattr $C$DW$2078, DW_AT_TI_symbol_name("_FSTATUS")
   15626                      .dwattr $C$DW$2078, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   15627                      .dwattr $C$DW$2078, DW_AT_accessibility(DW_ACCESS_public)
   15628              
   15629              $C$DW$2079      .dwtag  DW_TAG_member
   15630                      .dwattr $C$DW$2079, DW_AT_type(*$C$DW$T$23)
   15631                      .dwattr $C$DW$2079, DW_AT_name("FSTDBYWAIT")
   15632                      .dwattr $C$DW$2079, DW_AT_TI_symbol_name("_FSTDBYWAIT")
   15633                      .dwattr $C$DW$2079, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15634                      .dwattr $C$DW$2079, DW_AT_accessibility(DW_ACCESS_public)
   15635              
   15636              $C$DW$2080      .dwtag  DW_TAG_member
   15637                      .dwattr $C$DW$2080, DW_AT_type(*$C$DW$T$23)
   15638                      .dwattr $C$DW$2080, DW_AT_name("FACTIVEWAIT")
TMS320C2000 Assembler PC v22.6.0 Fri Mar 17 18:05:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B7BD8570-D118-473C-8DCF-18F1245813DF} PAGE  296

   15639                      .dwattr $C$DW$2080, DW_AT_TI_symbol_name("_FACTIVEWAIT")
   15640                      .dwattr $C$DW$2080, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   15641                      .dwattr $C$DW$2080, DW_AT_accessibility(DW_ACCESS_public)
   15642              
   15643              $C$DW$2081      .dwtag  DW_TAG_member
   15644                      .dwattr $C$DW$2081, DW_AT_type(*$C$DW$T$23)
   15645                      .dwattr $C$DW$2081, DW_AT_name("FBANKWAIT")
   15646                      .dwattr $C$DW$2081, DW_AT_TI_symbol_name("_FBANKWAIT")
   15647                      .dwattr $C$DW$2081, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15648                      .dwattr $C$DW$2081, DW_AT_accessibility(DW_ACCESS_public)
   15649              
   15650              $C$DW$2082      .dwtag  DW_TAG_member
   15651                      .dwattr $C$DW$2082, DW_AT_type(*$C$DW$T$23)
   15652                      .dwattr $C$DW$2082, DW_AT_name("FOTPWAIT")
   15653                      .dwattr $C$DW$2082, DW_AT_TI_symbol_name("_FOTPWAIT")
   15654                      .dwattr $C$DW$2082, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   15655                      .dwattr $C$DW$2082, DW_AT_accessibility(DW_ACCESS_public)
   15656              
   15657                      .dwendtag $C$DW$T$73
   15658              
   15659              $C$DW$T$94      .dwtag  DW_TAG_pointer_type
   15660                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$73)
   15661                      .dwattr $C$DW$T$94, DW_AT_address_class(0x20)
   15662              
   15663              $C$DW$T$95      .dwtag  DW_TAG_typedef
   15664                      .dwattr $C$DW$T$95, DW_AT_name("FLASH_Handle")
   15665                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
   15666                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
   15667              
   15668              
   15669              $C$DW$T$79      .dwtag  DW_TAG_structure_type
   15670                      .dwattr $C$DW$T$79, DW_AT_name("_GPIO_Obj_")
   15671                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x6a)
   15672              $C$DW$2083      .dwtag  DW_TAG_member
   15673                      .dwattr $C$DW$2083, DW_AT_type(*$C$DW$T$76)
   15674                      .dwattr $C$DW$2083, DW_AT_name("GPACTRL")
   15675                      .dwattr $C$DW$2083, DW_AT_TI_symbol_name("_GPACTRL")
   15676                      .dwattr $C$DW$2083, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15677                      .dwattr $C$DW$2083, DW_AT_accessibility(DW_ACCESS_public)
   15678              
   15679              $C$DW$2084      .dwtag  DW_TAG_member
   15680                      .dwattr $C$DW$2084, DW_AT_type(*$C$DW$T$76)
   15681                      .dwattr $C$DW$2084, DW_AT_name("GPAQSEL1")
   15682                      .dwattr $C$DW$2084, DW_AT_TI_symbol_name("_GPAQSEL1")
   15683                      .dwattr $C$DW$2084, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15684                      .dwattr $C$DW$2084, DW_AT_accessibility(DW_ACCESS_public)
   15685              
   15686              $C$DW$2085      .dwtag  DW_TAG_member
   15687                      .dwattr $C$DW$2085, DW_AT_type(*$C$DW$T$76)
   15688                      .dwattr $C$DW$2085, DW_AT_name("GPAQSEL2")
   15689                      .dwattr $C$DW$2085, DW_AT_TI_symbol_name("_GPAQSEL2")
   15690                      .dwattr $C$DW$2085, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15691                      .dwattr $C$DW$2085, DW_AT_accessibility(DW_ACCESS_public)
   15692              
   15693              $C$DW$2086      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Fri Mar 17 18:05:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B7BD8570-D118-473C-8DCF-18F1245813DF} PAGE  297

   15694                      .dwattr $C$DW$2086, DW_AT_type(*$C$DW$T$76)
   15695                      .dwattr $C$DW$2086, DW_AT_name("GPAMUX1")
   15696                      .dwattr $C$DW$2086, DW_AT_TI_symbol_name("_GPAMUX1")
   15697                      .dwattr $C$DW$2086, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15698                      .dwattr $C$DW$2086, DW_AT_accessibility(DW_ACCESS_public)
   15699              
   15700              $C$DW$2087      .dwtag  DW_TAG_member
   15701                      .dwattr $C$DW$2087, DW_AT_type(*$C$DW$T$76)
   15702                      .dwattr $C$DW$2087, DW_AT_name("GPAMUX2")
   15703                      .dwattr $C$DW$2087, DW_AT_TI_symbol_name("_GPAMUX2")
   15704                      .dwattr $C$DW$2087, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   15705                      .dwattr $C$DW$2087, DW_AT_accessibility(DW_ACCESS_public)
   15706              
   15707              $C$DW$2088      .dwtag  DW_TAG_member
   15708                      .dwattr $C$DW$2088, DW_AT_type(*$C$DW$T$76)
   15709                      .dwattr $C$DW$2088, DW_AT_name("GPADIR")
   15710                      .dwattr $C$DW$2088, DW_AT_TI_symbol_name("_GPADIR")
   15711                      .dwattr $C$DW$2088, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   15712                      .dwattr $C$DW$2088, DW_AT_accessibility(DW_ACCESS_public)
   15713              
   15714              $C$DW$2089      .dwtag  DW_TAG_member
   15715                      .dwattr $C$DW$2089, DW_AT_type(*$C$DW$T$76)
   15716                      .dwattr $C$DW$2089, DW_AT_name("GPAPUD")
   15717                      .dwattr $C$DW$2089, DW_AT_TI_symbol_name("_GPAPUD")
   15718                      .dwattr $C$DW$2089, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   15719                      .dwattr $C$DW$2089, DW_AT_accessibility(DW_ACCESS_public)
   15720              
   15721              $C$DW$2090      .dwtag  DW_TAG_member
   15722                      .dwattr $C$DW$2090, DW_AT_type(*$C$DW$T$26)
   15723                      .dwattr $C$DW$2090, DW_AT_name("rsvd_1")
   15724                      .dwattr $C$DW$2090, DW_AT_TI_symbol_name("_rsvd_1")
   15725                      .dwattr $C$DW$2090, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   15726                      .dwattr $C$DW$2090, DW_AT_accessibility(DW_ACCESS_public)
   15727              
   15728              $C$DW$2091      .dwtag  DW_TAG_member
   15729                      .dwattr $C$DW$2091, DW_AT_type(*$C$DW$T$76)
   15730                      .dwattr $C$DW$2091, DW_AT_name("GPBCTRL")
   15731                      .dwattr $C$DW$2091, DW_AT_TI_symbol_name("_GPBCTRL")
   15732                      .dwattr $C$DW$2091, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   15733                      .dwattr $C$DW$2091, DW_AT_accessibility(DW_ACCESS_public)
   15734              
   15735              $C$DW$2092      .dwtag  DW_TAG_member
   15736                      .dwattr $C$DW$2092, DW_AT_type(*$C$DW$T$76)
   15737                      .dwattr $C$DW$2092, DW_AT_name("GPBQSEL1")
   15738                      .dwattr $C$DW$2092, DW_AT_TI_symbol_name("_GPBQSEL1")
   15739                      .dwattr $C$DW$2092, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   15740                      .dwattr $C$DW$2092, DW_AT_accessibility(DW_ACCESS_public)
   15741              
   15742              $C$DW$2093      .dwtag  DW_TAG_member
   15743                      .dwattr $C$DW$2093, DW_AT_type(*$C$DW$T$76)
   15744                      .dwattr $C$DW$2093, DW_AT_name("GPBQSEL2")
   15745                      .dwattr $C$DW$2093, DW_AT_TI_symbol_name("_GPBQSEL2")
   15746                      .dwattr $C$DW$2093, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   15747                      .dwattr $C$DW$2093, DW_AT_accessibility(DW_ACCESS_public)
   15748              
TMS320C2000 Assembler PC v22.6.0 Fri Mar 17 18:05:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B7BD8570-D118-473C-8DCF-18F1245813DF} PAGE  298

   15749              $C$DW$2094      .dwtag  DW_TAG_member
   15750                      .dwattr $C$DW$2094, DW_AT_type(*$C$DW$T$76)
   15751                      .dwattr $C$DW$2094, DW_AT_name("GPBMUX1")
   15752                      .dwattr $C$DW$2094, DW_AT_TI_symbol_name("_GPBMUX1")
   15753                      .dwattr $C$DW$2094, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   15754                      .dwattr $C$DW$2094, DW_AT_accessibility(DW_ACCESS_public)
   15755              
   15756              $C$DW$2095      .dwtag  DW_TAG_member
   15757                      .dwattr $C$DW$2095, DW_AT_type(*$C$DW$T$76)
   15758                      .dwattr $C$DW$2095, DW_AT_name("GPBMUX2")
   15759                      .dwattr $C$DW$2095, DW_AT_TI_symbol_name("_GPBMUX2")
   15760                      .dwattr $C$DW$2095, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   15761                      .dwattr $C$DW$2095, DW_AT_accessibility(DW_ACCESS_public)
   15762              
   15763              $C$DW$2096      .dwtag  DW_TAG_member
   15764                      .dwattr $C$DW$2096, DW_AT_type(*$C$DW$T$76)
   15765                      .dwattr $C$DW$2096, DW_AT_name("GPBDIR")
   15766                      .dwattr $C$DW$2096, DW_AT_TI_symbol_name("_GPBDIR")
   15767                      .dwattr $C$DW$2096, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   15768                      .dwattr $C$DW$2096, DW_AT_accessibility(DW_ACCESS_public)
   15769              
   15770              $C$DW$2097      .dwtag  DW_TAG_member
   15771                      .dwattr $C$DW$2097, DW_AT_type(*$C$DW$T$76)
   15772                      .dwattr $C$DW$2097, DW_AT_name("GPBPUD")
   15773                      .dwattr $C$DW$2097, DW_AT_TI_symbol_name("_GPBPUD")
   15774                      .dwattr $C$DW$2097, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   15775                      .dwattr $C$DW$2097, DW_AT_accessibility(DW_ACCESS_public)
   15776              
   15777              $C$DW$2098      .dwtag  DW_TAG_member
   15778                      .dwattr $C$DW$2098, DW_AT_type(*$C$DW$T$77)
   15779                      .dwattr $C$DW$2098, DW_AT_name("rsvd_4")
   15780                      .dwattr $C$DW$2098, DW_AT_TI_symbol_name("_rsvd_4")
   15781                      .dwattr $C$DW$2098, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   15782                      .dwattr $C$DW$2098, DW_AT_accessibility(DW_ACCESS_public)
   15783              
   15784              $C$DW$2099      .dwtag  DW_TAG_member
   15785                      .dwattr $C$DW$2099, DW_AT_type(*$C$DW$T$76)
   15786                      .dwattr $C$DW$2099, DW_AT_name("AIOMUX1")
   15787                      .dwattr $C$DW$2099, DW_AT_TI_symbol_name("_AIOMUX1")
   15788                      .dwattr $C$DW$2099, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   15789                      .dwattr $C$DW$2099, DW_AT_accessibility(DW_ACCESS_public)
   15790              
   15791              $C$DW$2100      .dwtag  DW_TAG_member
   15792                      .dwattr $C$DW$2100, DW_AT_type(*$C$DW$T$26)
   15793                      .dwattr $C$DW$2100, DW_AT_name("rsvd_5")
   15794                      .dwattr $C$DW$2100, DW_AT_TI_symbol_name("_rsvd_5")
   15795                      .dwattr $C$DW$2100, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   15796                      .dwattr $C$DW$2100, DW_AT_accessibility(DW_ACCESS_public)
   15797              
   15798              $C$DW$2101      .dwtag  DW_TAG_member
   15799                      .dwattr $C$DW$2101, DW_AT_type(*$C$DW$T$76)
   15800                      .dwattr $C$DW$2101, DW_AT_name("AIODIR")
   15801                      .dwattr $C$DW$2101, DW_AT_TI_symbol_name("_AIODIR")
   15802                      .dwattr $C$DW$2101, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   15803                      .dwattr $C$DW$2101, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Fri Mar 17 18:05:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B7BD8570-D118-473C-8DCF-18F1245813DF} PAGE  299

   15804              
   15805              $C$DW$2102      .dwtag  DW_TAG_member
   15806                      .dwattr $C$DW$2102, DW_AT_type(*$C$DW$T$78)
   15807                      .dwattr $C$DW$2102, DW_AT_name("rsvd_6")
   15808                      .dwattr $C$DW$2102, DW_AT_TI_symbol_name("_rsvd_6")
   15809                      .dwattr $C$DW$2102, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   15810                      .dwattr $C$DW$2102, DW_AT_accessibility(DW_ACCESS_public)
   15811              
   15812              $C$DW$2103      .dwtag  DW_TAG_member
   15813                      .dwattr $C$DW$2103, DW_AT_type(*$C$DW$T$76)
   15814                      .dwattr $C$DW$2103, DW_AT_name("GPADAT")
   15815                      .dwattr $C$DW$2103, DW_AT_TI_symbol_name("_GPADAT")
   15816                      .dwattr $C$DW$2103, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   15817                      .dwattr $C$DW$2103, DW_AT_accessibility(DW_ACCESS_public)
   15818              
   15819              $C$DW$2104      .dwtag  DW_TAG_member
   15820                      .dwattr $C$DW$2104, DW_AT_type(*$C$DW$T$76)
   15821                      .dwattr $C$DW$2104, DW_AT_name("GPASET")
   15822                      .dwattr $C$DW$2104, DW_AT_TI_symbol_name("_GPASET")
   15823                      .dwattr $C$DW$2104, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   15824                      .dwattr $C$DW$2104, DW_AT_accessibility(DW_ACCESS_public)
   15825              
   15826              $C$DW$2105      .dwtag  DW_TAG_member
   15827                      .dwattr $C$DW$2105, DW_AT_type(*$C$DW$T$76)
   15828                      .dwattr $C$DW$2105, DW_AT_name("GPACLEAR")
   15829                      .dwattr $C$DW$2105, DW_AT_TI_symbol_name("_GPACLEAR")
   15830                      .dwattr $C$DW$2105, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   15831                      .dwattr $C$DW$2105, DW_AT_accessibility(DW_ACCESS_public)
   15832              
   15833              $C$DW$2106      .dwtag  DW_TAG_member
   15834                      .dwattr $C$DW$2106, DW_AT_type(*$C$DW$T$76)
   15835                      .dwattr $C$DW$2106, DW_AT_name("GPATOGGLE")
   15836                      .dwattr $C$DW$2106, DW_AT_TI_symbol_name("_GPATOGGLE")
   15837                      .dwattr $C$DW$2106, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   15838                      .dwattr $C$DW$2106, DW_AT_accessibility(DW_ACCESS_public)
   15839              
   15840              $C$DW$2107      .dwtag  DW_TAG_member
   15841                      .dwattr $C$DW$2107, DW_AT_type(*$C$DW$T$76)
   15842                      .dwattr $C$DW$2107, DW_AT_name("GPBDAT")
   15843                      .dwattr $C$DW$2107, DW_AT_TI_symbol_name("_GPBDAT")
   15844                      .dwattr $C$DW$2107, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   15845                      .dwattr $C$DW$2107, DW_AT_accessibility(DW_ACCESS_public)
   15846              
   15847              $C$DW$2108      .dwtag  DW_TAG_member
   15848                      .dwattr $C$DW$2108, DW_AT_type(*$C$DW$T$76)
   15849                      .dwattr $C$DW$2108, DW_AT_name("GPBSET")
   15850                      .dwattr $C$DW$2108, DW_AT_TI_symbol_name("_GPBSET")
   15851                      .dwattr $C$DW$2108, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   15852                      .dwattr $C$DW$2108, DW_AT_accessibility(DW_ACCESS_public)
   15853              
   15854              $C$DW$2109      .dwtag  DW_TAG_member
   15855                      .dwattr $C$DW$2109, DW_AT_type(*$C$DW$T$76)
   15856                      .dwattr $C$DW$2109, DW_AT_name("GPBCLEAR")
   15857                      .dwattr $C$DW$2109, DW_AT_TI_symbol_name("_GPBCLEAR")
   15858                      .dwattr $C$DW$2109, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
TMS320C2000 Assembler PC v22.6.0 Fri Mar 17 18:05:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B7BD8570-D118-473C-8DCF-18F1245813DF} PAGE  300

   15859                      .dwattr $C$DW$2109, DW_AT_accessibility(DW_ACCESS_public)
   15860              
   15861              $C$DW$2110      .dwtag  DW_TAG_member
   15862                      .dwattr $C$DW$2110, DW_AT_type(*$C$DW$T$76)
   15863                      .dwattr $C$DW$2110, DW_AT_name("GPBTOGGLE")
   15864                      .dwattr $C$DW$2110, DW_AT_TI_symbol_name("_GPBTOGGLE")
   15865                      .dwattr $C$DW$2110, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   15866                      .dwattr $C$DW$2110, DW_AT_accessibility(DW_ACCESS_public)
   15867              
   15868              $C$DW$2111      .dwtag  DW_TAG_member
   15869                      .dwattr $C$DW$2111, DW_AT_type(*$C$DW$T$31)
   15870                      .dwattr $C$DW$2111, DW_AT_name("rsvd_7")
   15871                      .dwattr $C$DW$2111, DW_AT_TI_symbol_name("_rsvd_7")
   15872                      .dwattr $C$DW$2111, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   15873                      .dwattr $C$DW$2111, DW_AT_accessibility(DW_ACCESS_public)
   15874              
   15875              $C$DW$2112      .dwtag  DW_TAG_member
   15876                      .dwattr $C$DW$2112, DW_AT_type(*$C$DW$T$76)
   15877                      .dwattr $C$DW$2112, DW_AT_name("AIODAT")
   15878                      .dwattr $C$DW$2112, DW_AT_TI_symbol_name("_AIODAT")
   15879                      .dwattr $C$DW$2112, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
   15880                      .dwattr $C$DW$2112, DW_AT_accessibility(DW_ACCESS_public)
   15881              
   15882              $C$DW$2113      .dwtag  DW_TAG_member
   15883                      .dwattr $C$DW$2113, DW_AT_type(*$C$DW$T$76)
   15884                      .dwattr $C$DW$2113, DW_AT_name("AIOSET")
   15885                      .dwattr $C$DW$2113, DW_AT_TI_symbol_name("_AIOSET")
   15886                      .dwattr $C$DW$2113, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   15887                      .dwattr $C$DW$2113, DW_AT_accessibility(DW_ACCESS_public)
   15888              
   15889              $C$DW$2114      .dwtag  DW_TAG_member
   15890                      .dwattr $C$DW$2114, DW_AT_type(*$C$DW$T$76)
   15891                      .dwattr $C$DW$2114, DW_AT_name("AIOCLEAR")
   15892                      .dwattr $C$DW$2114, DW_AT_TI_symbol_name("_AIOCLEAR")
   15893                      .dwattr $C$DW$2114, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   15894                      .dwattr $C$DW$2114, DW_AT_accessibility(DW_ACCESS_public)
   15895              
   15896              $C$DW$2115      .dwtag  DW_TAG_member
   15897                      .dwattr $C$DW$2115, DW_AT_type(*$C$DW$T$76)
   15898                      .dwattr $C$DW$2115, DW_AT_name("AIOTOGGLE")
   15899                      .dwattr $C$DW$2115, DW_AT_TI_symbol_name("_AIOTOGGLE")
   15900                      .dwattr $C$DW$2115, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   15901                      .dwattr $C$DW$2115, DW_AT_accessibility(DW_ACCESS_public)
   15902              
   15903              $C$DW$2116      .dwtag  DW_TAG_member
   15904                      .dwattr $C$DW$2116, DW_AT_type(*$C$DW$T$28)
   15905                      .dwattr $C$DW$2116, DW_AT_name("GPIOXINTnSEL")
   15906                      .dwattr $C$DW$2116, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
   15907                      .dwattr $C$DW$2116, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   15908                      .dwattr $C$DW$2116, DW_AT_accessibility(DW_ACCESS_public)
   15909              
   15910              $C$DW$2117      .dwtag  DW_TAG_member
   15911                      .dwattr $C$DW$2117, DW_AT_type(*$C$DW$T$27)
   15912                      .dwattr $C$DW$2117, DW_AT_name("rsvd_8")
   15913                      .dwattr $C$DW$2117, DW_AT_TI_symbol_name("_rsvd_8")
TMS320C2000 Assembler PC v22.6.0 Fri Mar 17 18:05:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B7BD8570-D118-473C-8DCF-18F1245813DF} PAGE  301

   15914                      .dwattr $C$DW$2117, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   15915                      .dwattr $C$DW$2117, DW_AT_accessibility(DW_ACCESS_public)
   15916              
   15917              $C$DW$2118      .dwtag  DW_TAG_member
   15918                      .dwattr $C$DW$2118, DW_AT_type(*$C$DW$T$76)
   15919                      .dwattr $C$DW$2118, DW_AT_name("GPIOLPMSEL")
   15920                      .dwattr $C$DW$2118, DW_AT_TI_symbol_name("_GPIOLPMSEL")
   15921                      .dwattr $C$DW$2118, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   15922                      .dwattr $C$DW$2118, DW_AT_accessibility(DW_ACCESS_public)
   15923              
   15924                      .dwendtag $C$DW$T$79
   15925              
   15926              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
   15927                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$79)
   15928                      .dwattr $C$DW$T$38, DW_AT_address_class(0x20)
   15929              
   15930              $C$DW$T$39      .dwtag  DW_TAG_typedef
   15931                      .dwattr $C$DW$T$39, DW_AT_name("GPIO_Handle")
   15932                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
   15933                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
   15934              
   15935              
   15936              $C$DW$T$81      .dwtag  DW_TAG_structure_type
   15937                      .dwattr $C$DW$T$81, DW_AT_name("_HAL_AdcData_t_")
   15938                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x0e)
   15939              $C$DW$2119      .dwtag  DW_TAG_member
   15940                      .dwattr $C$DW$2119, DW_AT_type(*$C$DW$T$80)
   15941                      .dwattr $C$DW$2119, DW_AT_name("I")
   15942                      .dwattr $C$DW$2119, DW_AT_TI_symbol_name("_I")
   15943                      .dwattr $C$DW$2119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15944                      .dwattr $C$DW$2119, DW_AT_accessibility(DW_ACCESS_public)
   15945              
   15946              $C$DW$2120      .dwtag  DW_TAG_member
   15947                      .dwattr $C$DW$2120, DW_AT_type(*$C$DW$T$80)
   15948                      .dwattr $C$DW$2120, DW_AT_name("V")
   15949                      .dwattr $C$DW$2120, DW_AT_TI_symbol_name("_V")
   15950                      .dwattr $C$DW$2120, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15951                      .dwattr $C$DW$2120, DW_AT_accessibility(DW_ACCESS_public)
   15952              
   15953              $C$DW$2121      .dwtag  DW_TAG_member
   15954                      .dwattr $C$DW$2121, DW_AT_type(*$C$DW$T$71)
   15955                      .dwattr $C$DW$2121, DW_AT_name("dcBus")
   15956                      .dwattr $C$DW$2121, DW_AT_TI_symbol_name("_dcBus")
   15957                      .dwattr $C$DW$2121, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   15958                      .dwattr $C$DW$2121, DW_AT_accessibility(DW_ACCESS_public)
   15959              
   15960                      .dwendtag $C$DW$T$81
   15961              
   15962              $C$DW$T$117     .dwtag  DW_TAG_typedef
   15963                      .dwattr $C$DW$T$117, DW_AT_name("HAL_AdcData_t")
   15964                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$81)
   15965                      .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
   15966              
   15967              
   15968              $C$DW$T$87      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v22.6.0 Fri Mar 17 18:05:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B7BD8570-D118-473C-8DCF-18F1245813DF} PAGE  302

   15969                      .dwattr $C$DW$T$87, DW_AT_name("_HAL_DacData_t_")
   15970                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x22)
   15971              $C$DW$2122      .dwtag  DW_TAG_member
   15972                      .dwattr $C$DW$2122, DW_AT_type(*$C$DW$T$22)
   15973                      .dwattr $C$DW$2122, DW_AT_name("PeriodMax")
   15974                      .dwattr $C$DW$2122, DW_AT_TI_symbol_name("_PeriodMax")
   15975                      .dwattr $C$DW$2122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15976                      .dwattr $C$DW$2122, DW_AT_accessibility(DW_ACCESS_public)
   15977              
   15978              $C$DW$2123      .dwtag  DW_TAG_member
   15979                      .dwattr $C$DW$2123, DW_AT_type(*$C$DW$T$85)
   15980                      .dwattr $C$DW$2123, DW_AT_name("ptrData")
   15981                      .dwattr $C$DW$2123, DW_AT_TI_symbol_name("_ptrData")
   15982                      .dwattr $C$DW$2123, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15983                      .dwattr $C$DW$2123, DW_AT_accessibility(DW_ACCESS_public)
   15984              
   15985              $C$DW$2124      .dwtag  DW_TAG_member
   15986                      .dwattr $C$DW$2124, DW_AT_type(*$C$DW$T$86)
   15987                      .dwattr $C$DW$2124, DW_AT_name("value")
   15988                      .dwattr $C$DW$2124, DW_AT_TI_symbol_name("_value")
   15989                      .dwattr $C$DW$2124, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   15990                      .dwattr $C$DW$2124, DW_AT_accessibility(DW_ACCESS_public)
   15991              
   15992              $C$DW$2125      .dwtag  DW_TAG_member
   15993                      .dwattr $C$DW$2125, DW_AT_type(*$C$DW$T$86)
   15994                      .dwattr $C$DW$2125, DW_AT_name("offset")
   15995                      .dwattr $C$DW$2125, DW_AT_TI_symbol_name("_offset")
   15996                      .dwattr $C$DW$2125, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   15997                      .dwattr $C$DW$2125, DW_AT_accessibility(DW_ACCESS_public)
   15998              
   15999              $C$DW$2126      .dwtag  DW_TAG_member
   16000                      .dwattr $C$DW$2126, DW_AT_type(*$C$DW$T$86)
   16001                      .dwattr $C$DW$2126, DW_AT_name("gain")
   16002                      .dwattr $C$DW$2126, DW_AT_TI_symbol_name("_gain")
   16003                      .dwattr $C$DW$2126, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   16004                      .dwattr $C$DW$2126, DW_AT_accessibility(DW_ACCESS_public)
   16005              
   16006                      .dwendtag $C$DW$T$87
   16007              
   16008              $C$DW$T$364     .dwtag  DW_TAG_typedef
   16009                      .dwattr $C$DW$T$364, DW_AT_name("HAL_DacData_t")
   16010                      .dwattr $C$DW$T$364, DW_AT_type(*$C$DW$T$87)
   16011                      .dwattr $C$DW$T$364, DW_AT_language(DW_LANG_C)
   16012              
   16013              $C$DW$T$365     .dwtag  DW_TAG_pointer_type
   16014                      .dwattr $C$DW$T$365, DW_AT_type(*$C$DW$T$364)
   16015                      .dwattr $C$DW$T$365, DW_AT_address_class(0x20)
   16016              
   16017              $C$DW$2127      .dwtag  DW_TAG_TI_far_type
   16018                      .dwattr $C$DW$2127, DW_AT_type(*$C$DW$T$365)
   16019              
   16020              $C$DW$T$366     .dwtag  DW_TAG_const_type
   16021                      .dwattr $C$DW$T$366, DW_AT_type(*$C$DW$2127)
   16022              
   16023              
TMS320C2000 Assembler PC v22.6.0 Fri Mar 17 18:05:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B7BD8570-D118-473C-8DCF-18F1245813DF} PAGE  303

   16024              $C$DW$T$121     .dwtag  DW_TAG_structure_type
   16025                      .dwattr $C$DW$T$121, DW_AT_name("_HAL_Obj_")
   16026                      .dwattr $C$DW$T$121, DW_AT_byte_size(0xa8)
   16027              $C$DW$2128      .dwtag  DW_TAG_member
   16028                      .dwattr $C$DW$2128, DW_AT_type(*$C$DW$T$89)
   16029                      .dwattr $C$DW$2128, DW_AT_name("adcHandle")
   16030                      .dwattr $C$DW$2128, DW_AT_TI_symbol_name("_adcHandle")
   16031                      .dwattr $C$DW$2128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16032                      .dwattr $C$DW$2128, DW_AT_accessibility(DW_ACCESS_public)
   16033              
   16034              $C$DW$2129      .dwtag  DW_TAG_member
   16035                      .dwattr $C$DW$2129, DW_AT_type(*$C$DW$T$91)
   16036                      .dwattr $C$DW$2129, DW_AT_name("clkHandle")
   16037                      .dwattr $C$DW$2129, DW_AT_TI_symbol_name("_clkHandle")
   16038                      .dwattr $C$DW$2129, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16039                      .dwattr $C$DW$2129, DW_AT_accessibility(DW_ACCESS_public)
   16040              
   16041              $C$DW$2130      .dwtag  DW_TAG_member
   16042                      .dwattr $C$DW$2130, DW_AT_type(*$C$DW$T$93)
   16043                      .dwattr $C$DW$2130, DW_AT_name("cpuHandle")
   16044                      .dwattr $C$DW$2130, DW_AT_TI_symbol_name("_cpuHandle")
   16045                      .dwattr $C$DW$2130, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16046                      .dwattr $C$DW$2130, DW_AT_accessibility(DW_ACCESS_public)
   16047              
   16048              $C$DW$2131      .dwtag  DW_TAG_member
   16049                      .dwattr $C$DW$2131, DW_AT_type(*$C$DW$T$95)
   16050                      .dwattr $C$DW$2131, DW_AT_name("flashHandle")
   16051                      .dwattr $C$DW$2131, DW_AT_TI_symbol_name("_flashHandle")
   16052                      .dwattr $C$DW$2131, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   16053                      .dwattr $C$DW$2131, DW_AT_accessibility(DW_ACCESS_public)
   16054              
   16055              $C$DW$2132      .dwtag  DW_TAG_member
   16056                      .dwattr $C$DW$2132, DW_AT_type(*$C$DW$T$39)
   16057                      .dwattr $C$DW$2132, DW_AT_name("gpioHandle")
   16058                      .dwattr $C$DW$2132, DW_AT_TI_symbol_name("_gpioHandle")
   16059                      .dwattr $C$DW$2132, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   16060                      .dwattr $C$DW$2132, DW_AT_accessibility(DW_ACCESS_public)
   16061              
   16062              $C$DW$2133      .dwtag  DW_TAG_member
   16063                      .dwattr $C$DW$2133, DW_AT_type(*$C$DW$T$98)
   16064                      .dwattr $C$DW$2133, DW_AT_name("offsetHandle_I")
   16065                      .dwattr $C$DW$2133, DW_AT_TI_symbol_name("_offsetHandle_I")
   16066                      .dwattr $C$DW$2133, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   16067                      .dwattr $C$DW$2133, DW_AT_accessibility(DW_ACCESS_public)
   16068              
   16069              $C$DW$2134      .dwtag  DW_TAG_member
   16070                      .dwattr $C$DW$2134, DW_AT_type(*$C$DW$T$100)
   16071                      .dwattr $C$DW$2134, DW_AT_name("offset_I")
   16072                      .dwattr $C$DW$2134, DW_AT_TI_symbol_name("_offset_I")
   16073                      .dwattr $C$DW$2134, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   16074                      .dwattr $C$DW$2134, DW_AT_accessibility(DW_ACCESS_public)
   16075              
   16076              $C$DW$2135      .dwtag  DW_TAG_member
   16077                      .dwattr $C$DW$2135, DW_AT_type(*$C$DW$T$98)
   16078                      .dwattr $C$DW$2135, DW_AT_name("offsetHandle_V")
TMS320C2000 Assembler PC v22.6.0 Fri Mar 17 18:05:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B7BD8570-D118-473C-8DCF-18F1245813DF} PAGE  304

   16079                      .dwattr $C$DW$2135, DW_AT_TI_symbol_name("_offsetHandle_V")
   16080                      .dwattr $C$DW$2135, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   16081                      .dwattr $C$DW$2135, DW_AT_accessibility(DW_ACCESS_public)
   16082              
   16083              $C$DW$2136      .dwtag  DW_TAG_member
   16084                      .dwattr $C$DW$2136, DW_AT_type(*$C$DW$T$100)
   16085                      .dwattr $C$DW$2136, DW_AT_name("offset_V")
   16086                      .dwattr $C$DW$2136, DW_AT_TI_symbol_name("_offset_V")
   16087                      .dwattr $C$DW$2136, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   16088                      .dwattr $C$DW$2136, DW_AT_accessibility(DW_ACCESS_public)
   16089              
   16090              $C$DW$2137      .dwtag  DW_TAG_member
   16091                      .dwattr $C$DW$2137, DW_AT_type(*$C$DW$T$102)
   16092                      .dwattr $C$DW$2137, DW_AT_name("oscHandle")
   16093                      .dwattr $C$DW$2137, DW_AT_TI_symbol_name("_oscHandle")
   16094                      .dwattr $C$DW$2137, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
   16095                      .dwattr $C$DW$2137, DW_AT_accessibility(DW_ACCESS_public)
   16096              
   16097              $C$DW$2138      .dwtag  DW_TAG_member
   16098                      .dwattr $C$DW$2138, DW_AT_type(*$C$DW$T$104)
   16099                      .dwattr $C$DW$2138, DW_AT_name("pieHandle")
   16100                      .dwattr $C$DW$2138, DW_AT_TI_symbol_name("_pieHandle")
   16101                      .dwattr $C$DW$2138, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
   16102                      .dwattr $C$DW$2138, DW_AT_accessibility(DW_ACCESS_public)
   16103              
   16104              $C$DW$2139      .dwtag  DW_TAG_member
   16105                      .dwattr $C$DW$2139, DW_AT_type(*$C$DW$T$106)
   16106                      .dwattr $C$DW$2139, DW_AT_name("pllHandle")
   16107                      .dwattr $C$DW$2139, DW_AT_TI_symbol_name("_pllHandle")
   16108                      .dwattr $C$DW$2139, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
   16109                      .dwattr $C$DW$2139, DW_AT_accessibility(DW_ACCESS_public)
   16110              
   16111              $C$DW$2140      .dwtag  DW_TAG_member
   16112                      .dwattr $C$DW$2140, DW_AT_type(*$C$DW$T$109)
   16113                      .dwattr $C$DW$2140, DW_AT_name("pwmHandle")
   16114                      .dwattr $C$DW$2140, DW_AT_TI_symbol_name("_pwmHandle")
   16115                      .dwattr $C$DW$2140, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
   16116                      .dwattr $C$DW$2140, DW_AT_accessibility(DW_ACCESS_public)
   16117              
   16118              $C$DW$2141      .dwtag  DW_TAG_member
   16119                      .dwattr $C$DW$2141, DW_AT_type(*$C$DW$T$109)
   16120                      .dwattr $C$DW$2141, DW_AT_name("pwmDacHandle")
   16121                      .dwattr $C$DW$2141, DW_AT_TI_symbol_name("_pwmDacHandle")
   16122                      .dwattr $C$DW$2141, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
   16123                      .dwattr $C$DW$2141, DW_AT_accessibility(DW_ACCESS_public)
   16124              
   16125              $C$DW$2142      .dwtag  DW_TAG_member
   16126                      .dwattr $C$DW$2142, DW_AT_type(*$C$DW$T$111)
   16127                      .dwattr $C$DW$2142, DW_AT_name("pwrHandle")
   16128                      .dwattr $C$DW$2142, DW_AT_TI_symbol_name("_pwrHandle")
   16129                      .dwattr $C$DW$2142, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
   16130                      .dwattr $C$DW$2142, DW_AT_accessibility(DW_ACCESS_public)
   16131              
   16132              $C$DW$2143      .dwtag  DW_TAG_member
   16133                      .dwattr $C$DW$2143, DW_AT_type(*$C$DW$T$114)
TMS320C2000 Assembler PC v22.6.0 Fri Mar 17 18:05:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B7BD8570-D118-473C-8DCF-18F1245813DF} PAGE  305

   16134                      .dwattr $C$DW$2143, DW_AT_name("timerHandle")
   16135                      .dwattr $C$DW$2143, DW_AT_TI_symbol_name("_timerHandle")
   16136                      .dwattr $C$DW$2143, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
   16137                      .dwattr $C$DW$2143, DW_AT_accessibility(DW_ACCESS_public)
   16138              
   16139              $C$DW$2144      .dwtag  DW_TAG_member
   16140                      .dwattr $C$DW$2144, DW_AT_type(*$C$DW$T$116)
   16141                      .dwattr $C$DW$2144, DW_AT_name("wdogHandle")
   16142                      .dwattr $C$DW$2144, DW_AT_TI_symbol_name("_wdogHandle")
   16143                      .dwattr $C$DW$2144, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
   16144                      .dwattr $C$DW$2144, DW_AT_accessibility(DW_ACCESS_public)
   16145              
   16146              $C$DW$2145      .dwtag  DW_TAG_member
   16147                      .dwattr $C$DW$2145, DW_AT_type(*$C$DW$T$117)
   16148                      .dwattr $C$DW$2145, DW_AT_name("adcBias")
   16149                      .dwattr $C$DW$2145, DW_AT_TI_symbol_name("_adcBias")
   16150                      .dwattr $C$DW$2145, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
   16151                      .dwattr $C$DW$2145, DW_AT_accessibility(DW_ACCESS_public)
   16152              
