TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{39F05D06-9873-4A8B-BE3D-C44CD24E8753} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                             PC v18.12.4.LTS *
       3              ;* Date/Time created: Tue Feb 21 14:51:41 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/GIANT/GAINT_TI_instaspin/motorware/motorware_1_01_00_18/sw/modules/h
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v18.12.4.LTS Copyright (c) 1996-
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\GIANT\GAINT_TI_instaspin\motorware\motorware_1_01_00_18\sw\solut
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("OFFSET_setBeta")

   14795                      .dwendtag $C$DW$T$325
   14796              
   14797              $C$DW$T$326     .dwtag  DW_TAG_typedef
   14798                      .dwattr $C$DW$T$326, DW_AT_name("SPI_Mode_e")
   14799                      .dwattr $C$DW$T$326, DW_AT_type(*$C$DW$T$325)
   14800                      .dwattr $C$DW$T$326, DW_AT_language(DW_LANG_C)
   14801              
   14802              $C$DW$1984      .dwtag  DW_TAG_TI_far_type
   14803                      .dwattr $C$DW$1984, DW_AT_type(*$C$DW$T$326)
   14804              
   14805              $C$DW$T$327     .dwtag  DW_TAG_const_type
   14806                      .dwattr $C$DW$T$327, DW_AT_type(*$C$DW$1984)
   14807              
   14808              
   14809              $C$DW$T$328     .dwtag  DW_TAG_enumeration_type
   14810                      .dwattr $C$DW$T$328, DW_AT_byte_size(0x01)
   14811              $C$DW$1985      .dwtag  DW_TAG_enumerator
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{39F05D06-9873-4A8B-BE3D-C44CD24E8753} PAGE  281

   14812                      .dwattr $C$DW$1985, DW_AT_name("SPI_TxSuspend_00")
   14813                      .dwattr $C$DW$1985, DW_AT_const_value(0x00)
   14814              
   14815              $C$DW$1986      .dwtag  DW_TAG_enumerator
   14816                      .dwattr $C$DW$1986, DW_AT_name("SPI_TxSuspend_10")
   14817                      .dwattr $C$DW$1986, DW_AT_const_value(0x20)
   14818              
   14819              $C$DW$1987      .dwtag  DW_TAG_enumerator
   14820                      .dwattr $C$DW$1987, DW_AT_name("SPI_TxSuspend_free")
   14821                      .dwattr $C$DW$1987, DW_AT_const_value(0x10)
   14822              
   14823                      .dwendtag $C$DW$T$328
   14824              
   14825              $C$DW$T$329     .dwtag  DW_TAG_typedef
   14826                      .dwattr $C$DW$T$329, DW_AT_name("SPI_EmulationSuspend_e")
   14827                      .dwattr $C$DW$T$329, DW_AT_type(*$C$DW$T$328)
   14828                      .dwattr $C$DW$T$329, DW_AT_language(DW_LANG_C)
   14829              
   14830              $C$DW$1988      .dwtag  DW_TAG_TI_far_type
   14831                      .dwattr $C$DW$1988, DW_AT_type(*$C$DW$T$329)
   14832              
   14833              $C$DW$T$330     .dwtag  DW_TAG_const_type
   14834                      .dwattr $C$DW$T$330, DW_AT_type(*$C$DW$1988)
   14835              
   14836              
   14837              $C$DW$T$331     .dwtag  DW_TAG_enumeration_type
   14838                      .dwattr $C$DW$T$331, DW_AT_byte_size(0x01)
   14839              $C$DW$1989      .dwtag  DW_TAG_enumerator
   14840                      .dwattr $C$DW$1989, DW_AT_name("TIMER_EmulationMode_StopAfterNextDecrement")
   14841                      .dwattr $C$DW$1989, DW_AT_const_value(0x00)
   14842              
   14843              $C$DW$1990      .dwtag  DW_TAG_enumerator
   14844                      .dwattr $C$DW$1990, DW_AT_name("TIMER_EmulationMode_StopAtZero")
   14845                      .dwattr $C$DW$1990, DW_AT_const_value(0x400)
   14846              
   14847              $C$DW$1991      .dwtag  DW_TAG_enumerator
   14848                      .dwattr $C$DW$1991, DW_AT_name("TIMER_EmulationMode_RunFree")
   14849                      .dwattr $C$DW$1991, DW_AT_const_value(0x800)
   14850              
   14851                      .dwendtag $C$DW$T$331
   14852              
   14853              $C$DW$T$332     .dwtag  DW_TAG_typedef
   14854                      .dwattr $C$DW$T$332, DW_AT_name("TIMER_EmulationMode_e")
   14855                      .dwattr $C$DW$T$332, DW_AT_type(*$C$DW$T$331)
   14856                      .dwattr $C$DW$T$332, DW_AT_language(DW_LANG_C)
   14857              
   14858              $C$DW$1992      .dwtag  DW_TAG_TI_far_type
   14859                      .dwattr $C$DW$1992, DW_AT_type(*$C$DW$T$332)
   14860              
   14861              $C$DW$T$333     .dwtag  DW_TAG_const_type
   14862                      .dwattr $C$DW$T$333, DW_AT_type(*$C$DW$1992)
   14863              
   14864              
   14865              $C$DW$T$334     .dwtag  DW_TAG_enumeration_type
   14866                      .dwattr $C$DW$T$334, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{39F05D06-9873-4A8B-BE3D-C44CD24E8753} PAGE  282

   14867              $C$DW$1993      .dwtag  DW_TAG_enumerator
   14868                      .dwattr $C$DW$1993, DW_AT_name("HAL_SensorType_Current")
   14869                      .dwattr $C$DW$1993, DW_AT_const_value(0x00)
   14870              
   14871              $C$DW$1994      .dwtag  DW_TAG_enumerator
   14872                      .dwattr $C$DW$1994, DW_AT_name("HAL_SensorType_Voltage")
   14873                      .dwattr $C$DW$1994, DW_AT_const_value(0x01)
   14874              
   14875                      .dwendtag $C$DW$T$334
   14876              
   14877              $C$DW$T$335     .dwtag  DW_TAG_typedef
   14878                      .dwattr $C$DW$T$335, DW_AT_name("HAL_SensorType_e")
   14879                      .dwattr $C$DW$T$335, DW_AT_type(*$C$DW$T$334)
   14880                      .dwattr $C$DW$T$335, DW_AT_language(DW_LANG_C)
   14881              
   14882              
   14883              $C$DW$T$30      .dwtag  DW_TAG_structure_type
   14884                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
   14885                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
   14886              $C$DW$1995      .dwtag  DW_TAG_member
   14887                      .dwattr $C$DW$1995, DW_AT_type(*$C$DW$T$24)
   14888                      .dwattr $C$DW$1995, DW_AT_name("ADCRESULT")
   14889                      .dwattr $C$DW$1995, DW_AT_TI_symbol_name("_ADCRESULT")
   14890                      .dwattr $C$DW$1995, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14891                      .dwattr $C$DW$1995, DW_AT_accessibility(DW_ACCESS_public)
   14892              
   14893              $C$DW$1996      .dwtag  DW_TAG_member
   14894                      .dwattr $C$DW$1996, DW_AT_type(*$C$DW$T$25)
   14895                      .dwattr $C$DW$1996, DW_AT_name("resvd_1")
   14896                      .dwattr $C$DW$1996, DW_AT_TI_symbol_name("_resvd_1")
   14897                      .dwattr $C$DW$1996, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   14898                      .dwattr $C$DW$1996, DW_AT_accessibility(DW_ACCESS_public)
   14899              
   14900              $C$DW$1997      .dwtag  DW_TAG_member
   14901                      .dwattr $C$DW$1997, DW_AT_type(*$C$DW$T$23)
   14902                      .dwattr $C$DW$1997, DW_AT_name("ADCCTL1")
   14903                      .dwattr $C$DW$1997, DW_AT_TI_symbol_name("_ADCCTL1")
   14904                      .dwattr $C$DW$1997, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
   14905                      .dwattr $C$DW$1997, DW_AT_accessibility(DW_ACCESS_public)
   14906              
   14907              $C$DW$1998      .dwtag  DW_TAG_member
   14908                      .dwattr $C$DW$1998, DW_AT_type(*$C$DW$T$23)
   14909                      .dwattr $C$DW$1998, DW_AT_name("ADCCTL2")
   14910                      .dwattr $C$DW$1998, DW_AT_TI_symbol_name("_ADCCTL2")
   14911                      .dwattr $C$DW$1998, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
   14912                      .dwattr $C$DW$1998, DW_AT_accessibility(DW_ACCESS_public)
   14913              
   14914              $C$DW$1999      .dwtag  DW_TAG_member
   14915                      .dwattr $C$DW$1999, DW_AT_type(*$C$DW$T$26)
   14916                      .dwattr $C$DW$1999, DW_AT_name("rsvd_2")
   14917                      .dwattr $C$DW$1999, DW_AT_TI_symbol_name("_rsvd_2")
   14918                      .dwattr $C$DW$1999, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
   14919                      .dwattr $C$DW$1999, DW_AT_accessibility(DW_ACCESS_public)
   14920              
   14921              $C$DW$2000      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{39F05D06-9873-4A8B-BE3D-C44CD24E8753} PAGE  283

   14922                      .dwattr $C$DW$2000, DW_AT_type(*$C$DW$T$23)
   14923                      .dwattr $C$DW$2000, DW_AT_name("ADCINTFLG")
   14924                      .dwattr $C$DW$2000, DW_AT_TI_symbol_name("_ADCINTFLG")
   14925                      .dwattr $C$DW$2000, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
   14926                      .dwattr $C$DW$2000, DW_AT_accessibility(DW_ACCESS_public)
   14927              
   14928              $C$DW$2001      .dwtag  DW_TAG_member
   14929                      .dwattr $C$DW$2001, DW_AT_type(*$C$DW$T$23)
   14930                      .dwattr $C$DW$2001, DW_AT_name("ADCINTFLGCLR")
   14931                      .dwattr $C$DW$2001, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
   14932                      .dwattr $C$DW$2001, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
   14933                      .dwattr $C$DW$2001, DW_AT_accessibility(DW_ACCESS_public)
   14934              
   14935              $C$DW$2002      .dwtag  DW_TAG_member
   14936                      .dwattr $C$DW$2002, DW_AT_type(*$C$DW$T$23)
   14937                      .dwattr $C$DW$2002, DW_AT_name("ADCINTOVF")
   14938                      .dwattr $C$DW$2002, DW_AT_TI_symbol_name("_ADCINTOVF")
   14939                      .dwattr $C$DW$2002, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
   14940                      .dwattr $C$DW$2002, DW_AT_accessibility(DW_ACCESS_public)
   14941              
   14942              $C$DW$2003      .dwtag  DW_TAG_member
   14943                      .dwattr $C$DW$2003, DW_AT_type(*$C$DW$T$23)
   14944                      .dwattr $C$DW$2003, DW_AT_name("ADCINTOVFCLR")
   14945                      .dwattr $C$DW$2003, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
   14946                      .dwattr $C$DW$2003, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
   14947                      .dwattr $C$DW$2003, DW_AT_accessibility(DW_ACCESS_public)
   14948              
   14949              $C$DW$2004      .dwtag  DW_TAG_member
   14950                      .dwattr $C$DW$2004, DW_AT_type(*$C$DW$T$27)
   14951                      .dwattr $C$DW$2004, DW_AT_name("INTSELxNy")
   14952                      .dwattr $C$DW$2004, DW_AT_TI_symbol_name("_INTSELxNy")
   14953                      .dwattr $C$DW$2004, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
   14954                      .dwattr $C$DW$2004, DW_AT_accessibility(DW_ACCESS_public)
   14955              
   14956              $C$DW$2005      .dwtag  DW_TAG_member
   14957                      .dwattr $C$DW$2005, DW_AT_type(*$C$DW$T$28)
   14958                      .dwattr $C$DW$2005, DW_AT_name("rsvd_3")
   14959                      .dwattr $C$DW$2005, DW_AT_TI_symbol_name("_rsvd_3")
   14960                      .dwattr $C$DW$2005, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
   14961                      .dwattr $C$DW$2005, DW_AT_accessibility(DW_ACCESS_public)
   14962              
   14963              $C$DW$2006      .dwtag  DW_TAG_member
   14964                      .dwattr $C$DW$2006, DW_AT_type(*$C$DW$T$23)
   14965                      .dwattr $C$DW$2006, DW_AT_name("SOCPRICTRL")
   14966                      .dwattr $C$DW$2006, DW_AT_TI_symbol_name("_SOCPRICTRL")
   14967                      .dwattr $C$DW$2006, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
   14968                      .dwattr $C$DW$2006, DW_AT_accessibility(DW_ACCESS_public)
   14969              
   14970              $C$DW$2007      .dwtag  DW_TAG_member
   14971                      .dwattr $C$DW$2007, DW_AT_type(*$C$DW$T$23)
   14972                      .dwattr $C$DW$2007, DW_AT_name("rsvd_4")
   14973                      .dwattr $C$DW$2007, DW_AT_TI_symbol_name("_rsvd_4")
   14974                      .dwattr $C$DW$2007, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
   14975                      .dwattr $C$DW$2007, DW_AT_accessibility(DW_ACCESS_public)
   14976              
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{39F05D06-9873-4A8B-BE3D-C44CD24E8753} PAGE  284

   14977              $C$DW$2008      .dwtag  DW_TAG_member
   14978                      .dwattr $C$DW$2008, DW_AT_type(*$C$DW$T$23)
   14979                      .dwattr $C$DW$2008, DW_AT_name("ADCSAMPLEMODE")
   14980                      .dwattr $C$DW$2008, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
   14981                      .dwattr $C$DW$2008, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
   14982                      .dwattr $C$DW$2008, DW_AT_accessibility(DW_ACCESS_public)
   14983              
   14984              $C$DW$2009      .dwtag  DW_TAG_member
   14985                      .dwattr $C$DW$2009, DW_AT_type(*$C$DW$T$23)
   14986                      .dwattr $C$DW$2009, DW_AT_name("rsvd_5")
   14987                      .dwattr $C$DW$2009, DW_AT_TI_symbol_name("_rsvd_5")
   14988                      .dwattr $C$DW$2009, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
   14989                      .dwattr $C$DW$2009, DW_AT_accessibility(DW_ACCESS_public)
   14990              
   14991              $C$DW$2010      .dwtag  DW_TAG_member
   14992                      .dwattr $C$DW$2010, DW_AT_type(*$C$DW$T$23)
   14993                      .dwattr $C$DW$2010, DW_AT_name("ADCINTSOCSEL1")
   14994                      .dwattr $C$DW$2010, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
   14995                      .dwattr $C$DW$2010, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
   14996                      .dwattr $C$DW$2010, DW_AT_accessibility(DW_ACCESS_public)
   14997              
   14998              $C$DW$2011      .dwtag  DW_TAG_member
   14999                      .dwattr $C$DW$2011, DW_AT_type(*$C$DW$T$23)
   15000                      .dwattr $C$DW$2011, DW_AT_name("ADCINTSOCSEL2")
   15001                      .dwattr $C$DW$2011, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
   15002                      .dwattr $C$DW$2011, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
   15003                      .dwattr $C$DW$2011, DW_AT_accessibility(DW_ACCESS_public)
   15004              
   15005              $C$DW$2012      .dwtag  DW_TAG_member
   15006                      .dwattr $C$DW$2012, DW_AT_type(*$C$DW$T$26)
   15007                      .dwattr $C$DW$2012, DW_AT_name("rsvd_6")
   15008                      .dwattr $C$DW$2012, DW_AT_TI_symbol_name("_rsvd_6")
   15009                      .dwattr $C$DW$2012, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
   15010                      .dwattr $C$DW$2012, DW_AT_accessibility(DW_ACCESS_public)
   15011              
   15012              $C$DW$2013      .dwtag  DW_TAG_member
   15013                      .dwattr $C$DW$2013, DW_AT_type(*$C$DW$T$23)
   15014                      .dwattr $C$DW$2013, DW_AT_name("ADCSOCFLG1")
   15015                      .dwattr $C$DW$2013, DW_AT_TI_symbol_name("_ADCSOCFLG1")
   15016                      .dwattr $C$DW$2013, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
   15017                      .dwattr $C$DW$2013, DW_AT_accessibility(DW_ACCESS_public)
   15018              
   15019              $C$DW$2014      .dwtag  DW_TAG_member
   15020                      .dwattr $C$DW$2014, DW_AT_type(*$C$DW$T$23)
   15021                      .dwattr $C$DW$2014, DW_AT_name("rsvd_7")
   15022                      .dwattr $C$DW$2014, DW_AT_TI_symbol_name("_rsvd_7")
   15023                      .dwattr $C$DW$2014, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   15024                      .dwattr $C$DW$2014, DW_AT_accessibility(DW_ACCESS_public)
   15025              
   15026              $C$DW$2015      .dwtag  DW_TAG_member
   15027                      .dwattr $C$DW$2015, DW_AT_type(*$C$DW$T$23)
   15028                      .dwattr $C$DW$2015, DW_AT_name("ADCSOCFRC1")
   15029                      .dwattr $C$DW$2015, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   15030                      .dwattr $C$DW$2015, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   15031                      .dwattr $C$DW$2015, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{39F05D06-9873-4A8B-BE3D-C44CD24E8753} PAGE  285

   15032              
   15033              $C$DW$2016      .dwtag  DW_TAG_member
   15034                      .dwattr $C$DW$2016, DW_AT_type(*$C$DW$T$23)
   15035                      .dwattr $C$DW$2016, DW_AT_name("rsvd_8")
   15036                      .dwattr $C$DW$2016, DW_AT_TI_symbol_name("_rsvd_8")
   15037                      .dwattr $C$DW$2016, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   15038                      .dwattr $C$DW$2016, DW_AT_accessibility(DW_ACCESS_public)
   15039              
   15040              $C$DW$2017      .dwtag  DW_TAG_member
   15041                      .dwattr $C$DW$2017, DW_AT_type(*$C$DW$T$23)
   15042                      .dwattr $C$DW$2017, DW_AT_name("ADCSOCOVF1")
   15043                      .dwattr $C$DW$2017, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   15044                      .dwattr $C$DW$2017, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   15045                      .dwattr $C$DW$2017, DW_AT_accessibility(DW_ACCESS_public)
   15046              
   15047              $C$DW$2018      .dwtag  DW_TAG_member
   15048                      .dwattr $C$DW$2018, DW_AT_type(*$C$DW$T$23)
   15049                      .dwattr $C$DW$2018, DW_AT_name("rsvd_9")
   15050                      .dwattr $C$DW$2018, DW_AT_TI_symbol_name("_rsvd_9")
   15051                      .dwattr $C$DW$2018, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
   15052                      .dwattr $C$DW$2018, DW_AT_accessibility(DW_ACCESS_public)
   15053              
   15054              $C$DW$2019      .dwtag  DW_TAG_member
   15055                      .dwattr $C$DW$2019, DW_AT_type(*$C$DW$T$23)
   15056                      .dwattr $C$DW$2019, DW_AT_name("ADCSOCOVFCLR1")
   15057                      .dwattr $C$DW$2019, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
   15058                      .dwattr $C$DW$2019, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
   15059                      .dwattr $C$DW$2019, DW_AT_accessibility(DW_ACCESS_public)
   15060              
   15061              $C$DW$2020      .dwtag  DW_TAG_member
   15062                      .dwattr $C$DW$2020, DW_AT_type(*$C$DW$T$23)
   15063                      .dwattr $C$DW$2020, DW_AT_name("rsvd_10")
   15064                      .dwattr $C$DW$2020, DW_AT_TI_symbol_name("_rsvd_10")
   15065                      .dwattr $C$DW$2020, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   15066                      .dwattr $C$DW$2020, DW_AT_accessibility(DW_ACCESS_public)
   15067              
   15068              $C$DW$2021      .dwtag  DW_TAG_member
   15069                      .dwattr $C$DW$2021, DW_AT_type(*$C$DW$T$24)
   15070                      .dwattr $C$DW$2021, DW_AT_name("ADCSOCxCTL")
   15071                      .dwattr $C$DW$2021, DW_AT_TI_symbol_name("_ADCSOCxCTL")
   15072                      .dwattr $C$DW$2021, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   15073                      .dwattr $C$DW$2021, DW_AT_accessibility(DW_ACCESS_public)
   15074              
   15075              $C$DW$2022      .dwtag  DW_TAG_member
   15076                      .dwattr $C$DW$2022, DW_AT_type(*$C$DW$T$24)
   15077                      .dwattr $C$DW$2022, DW_AT_name("rsvd_11")
   15078                      .dwattr $C$DW$2022, DW_AT_TI_symbol_name("_rsvd_11")
   15079                      .dwattr $C$DW$2022, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   15080                      .dwattr $C$DW$2022, DW_AT_accessibility(DW_ACCESS_public)
   15081              
   15082              $C$DW$2023      .dwtag  DW_TAG_member
   15083                      .dwattr $C$DW$2023, DW_AT_type(*$C$DW$T$23)
   15084                      .dwattr $C$DW$2023, DW_AT_name("ADCREFTRIM")
   15085                      .dwattr $C$DW$2023, DW_AT_TI_symbol_name("_ADCREFTRIM")
   15086                      .dwattr $C$DW$2023, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{39F05D06-9873-4A8B-BE3D-C44CD24E8753} PAGE  286

   15087                      .dwattr $C$DW$2023, DW_AT_accessibility(DW_ACCESS_public)
   15088              
   15089              $C$DW$2024      .dwtag  DW_TAG_member
   15090                      .dwattr $C$DW$2024, DW_AT_type(*$C$DW$T$23)
   15091                      .dwattr $C$DW$2024, DW_AT_name("ADCOFFTRIM")
   15092                      .dwattr $C$DW$2024, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   15093                      .dwattr $C$DW$2024, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   15094                      .dwattr $C$DW$2024, DW_AT_accessibility(DW_ACCESS_public)
   15095              
   15096              $C$DW$2025      .dwtag  DW_TAG_member
   15097                      .dwattr $C$DW$2025, DW_AT_type(*$C$DW$T$29)
   15098                      .dwattr $C$DW$2025, DW_AT_name("resvd_12")
   15099                      .dwattr $C$DW$2025, DW_AT_TI_symbol_name("_resvd_12")
   15100                      .dwattr $C$DW$2025, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   15101                      .dwattr $C$DW$2025, DW_AT_accessibility(DW_ACCESS_public)
   15102              
   15103              $C$DW$2026      .dwtag  DW_TAG_member
   15104                      .dwattr $C$DW$2026, DW_AT_type(*$C$DW$T$23)
   15105                      .dwattr $C$DW$2026, DW_AT_name("ADCREV")
   15106                      .dwattr $C$DW$2026, DW_AT_TI_symbol_name("_ADCREV")
   15107                      .dwattr $C$DW$2026, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   15108                      .dwattr $C$DW$2026, DW_AT_accessibility(DW_ACCESS_public)
   15109              
   15110                      .dwendtag $C$DW$T$30
   15111              
   15112              $C$DW$T$337     .dwtag  DW_TAG_typedef
   15113                      .dwattr $C$DW$T$337, DW_AT_name("ADC_Obj")
   15114                      .dwattr $C$DW$T$337, DW_AT_type(*$C$DW$T$30)
   15115                      .dwattr $C$DW$T$337, DW_AT_language(DW_LANG_C)
   15116              
   15117              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
   15118                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$30)
   15119                      .dwattr $C$DW$T$88, DW_AT_address_class(0x20)
   15120              
   15121              $C$DW$T$89      .dwtag  DW_TAG_typedef
   15122                      .dwattr $C$DW$T$89, DW_AT_name("ADC_Handle")
   15123                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
   15124                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
   15125              
   15126              
   15127              $C$DW$T$32      .dwtag  DW_TAG_structure_type
   15128                      .dwattr $C$DW$T$32, DW_AT_name("_CLK_Obj_")
   15129                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x11)
   15130              $C$DW$2027      .dwtag  DW_TAG_member
   15131                      .dwattr $C$DW$2027, DW_AT_type(*$C$DW$T$23)
   15132                      .dwattr $C$DW$2027, DW_AT_name("XCLK")
   15133                      .dwattr $C$DW$2027, DW_AT_TI_symbol_name("_XCLK")
   15134                      .dwattr $C$DW$2027, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15135                      .dwattr $C$DW$2027, DW_AT_accessibility(DW_ACCESS_public)
   15136              
   15137              $C$DW$2028      .dwtag  DW_TAG_member
   15138                      .dwattr $C$DW$2028, DW_AT_type(*$C$DW$T$23)
   15139                      .dwattr $C$DW$2028, DW_AT_name("rsvd_1")
   15140                      .dwattr $C$DW$2028, DW_AT_TI_symbol_name("_rsvd_1")
   15141                      .dwattr $C$DW$2028, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{39F05D06-9873-4A8B-BE3D-C44CD24E8753} PAGE  287

   15142                      .dwattr $C$DW$2028, DW_AT_accessibility(DW_ACCESS_public)
   15143              
   15144              $C$DW$2029      .dwtag  DW_TAG_member
   15145                      .dwattr $C$DW$2029, DW_AT_type(*$C$DW$T$23)
   15146                      .dwattr $C$DW$2029, DW_AT_name("CLKCTL")
   15147                      .dwattr $C$DW$2029, DW_AT_TI_symbol_name("_CLKCTL")
   15148                      .dwattr $C$DW$2029, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15149                      .dwattr $C$DW$2029, DW_AT_accessibility(DW_ACCESS_public)
   15150              
   15151              $C$DW$2030      .dwtag  DW_TAG_member
   15152                      .dwattr $C$DW$2030, DW_AT_type(*$C$DW$T$31)
   15153                      .dwattr $C$DW$2030, DW_AT_name("rsvd_2")
   15154                      .dwattr $C$DW$2030, DW_AT_TI_symbol_name("_rsvd_2")
   15155                      .dwattr $C$DW$2030, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   15156                      .dwattr $C$DW$2030, DW_AT_accessibility(DW_ACCESS_public)
   15157              
   15158              $C$DW$2031      .dwtag  DW_TAG_member
   15159                      .dwattr $C$DW$2031, DW_AT_type(*$C$DW$T$23)
   15160                      .dwattr $C$DW$2031, DW_AT_name("LOSPCP")
   15161                      .dwattr $C$DW$2031, DW_AT_TI_symbol_name("_LOSPCP")
   15162                      .dwattr $C$DW$2031, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   15163                      .dwattr $C$DW$2031, DW_AT_accessibility(DW_ACCESS_public)
   15164              
   15165              $C$DW$2032      .dwtag  DW_TAG_member
   15166                      .dwattr $C$DW$2032, DW_AT_type(*$C$DW$T$23)
   15167                      .dwattr $C$DW$2032, DW_AT_name("PCLKCR0")
   15168                      .dwattr $C$DW$2032, DW_AT_TI_symbol_name("_PCLKCR0")
   15169                      .dwattr $C$DW$2032, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   15170                      .dwattr $C$DW$2032, DW_AT_accessibility(DW_ACCESS_public)
   15171              
   15172              $C$DW$2033      .dwtag  DW_TAG_member
   15173                      .dwattr $C$DW$2033, DW_AT_type(*$C$DW$T$23)
   15174                      .dwattr $C$DW$2033, DW_AT_name("PCLKCR1")
   15175                      .dwattr $C$DW$2033, DW_AT_TI_symbol_name("_PCLKCR1")
   15176                      .dwattr $C$DW$2033, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   15177                      .dwattr $C$DW$2033, DW_AT_accessibility(DW_ACCESS_public)
   15178              
   15179              $C$DW$2034      .dwtag  DW_TAG_member
   15180                      .dwattr $C$DW$2034, DW_AT_type(*$C$DW$T$26)
   15181                      .dwattr $C$DW$2034, DW_AT_name("rsvd_3")
   15182                      .dwattr $C$DW$2034, DW_AT_TI_symbol_name("_rsvd_3")
   15183                      .dwattr $C$DW$2034, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   15184                      .dwattr $C$DW$2034, DW_AT_accessibility(DW_ACCESS_public)
   15185              
   15186              $C$DW$2035      .dwtag  DW_TAG_member
   15187                      .dwattr $C$DW$2035, DW_AT_type(*$C$DW$T$23)
   15188                      .dwattr $C$DW$2035, DW_AT_name("PCLKCR3")
   15189                      .dwattr $C$DW$2035, DW_AT_TI_symbol_name("_PCLKCR3")
   15190                      .dwattr $C$DW$2035, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   15191                      .dwattr $C$DW$2035, DW_AT_accessibility(DW_ACCESS_public)
   15192              
   15193                      .dwendtag $C$DW$T$32
   15194              
   15195              $C$DW$T$90      .dwtag  DW_TAG_pointer_type
   15196                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$32)
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{39F05D06-9873-4A8B-BE3D-C44CD24E8753} PAGE  288

   15197                      .dwattr $C$DW$T$90, DW_AT_address_class(0x20)
   15198              
   15199              $C$DW$T$91      .dwtag  DW_TAG_typedef
   15200                      .dwattr $C$DW$T$91, DW_AT_name("CLK_Handle")
   15201                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
   15202                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
   15203              
   15204              
   15205              $C$DW$T$35      .dwtag  DW_TAG_structure_type
   15206                      .dwattr $C$DW$T$35, DW_AT_name("_CPU_Obj_")
   15207                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
   15208              $C$DW$2036      .dwtag  DW_TAG_member
   15209                      .dwattr $C$DW$2036, DW_AT_type(*$C$DW$T$34)
   15210                      .dwattr $C$DW$2036, DW_AT_name("tmp")
   15211                      .dwattr $C$DW$2036, DW_AT_TI_symbol_name("_tmp")
   15212                      .dwattr $C$DW$2036, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15213                      .dwattr $C$DW$2036, DW_AT_accessibility(DW_ACCESS_public)
   15214              
   15215                      .dwendtag $C$DW$T$35
   15216              
   15217              $C$DW$T$346     .dwtag  DW_TAG_typedef
   15218                      .dwattr $C$DW$T$346, DW_AT_name("CPU_Obj")
   15219                      .dwattr $C$DW$T$346, DW_AT_type(*$C$DW$T$35)
   15220                      .dwattr $C$DW$T$346, DW_AT_language(DW_LANG_C)
   15221              
   15222              $C$DW$T$92      .dwtag  DW_TAG_pointer_type
   15223                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$35)
   15224                      .dwattr $C$DW$T$92, DW_AT_address_class(0x20)
   15225              
   15226              $C$DW$T$93      .dwtag  DW_TAG_typedef
   15227                      .dwattr $C$DW$T$93, DW_AT_name("CPU_Handle")
   15228                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
   15229                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
   15230              
   15231              
   15232              $C$DW$T$43      .dwtag  DW_TAG_structure_type
   15233                      .dwattr $C$DW$T$43, DW_AT_name("_DRV8301_Obj_")
   15234                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x08)
   15235              $C$DW$2037      .dwtag  DW_TAG_member
   15236                      .dwattr $C$DW$2037, DW_AT_type(*$C$DW$T$37)
   15237                      .dwattr $C$DW$2037, DW_AT_name("spiHandle")
   15238                      .dwattr $C$DW$2037, DW_AT_TI_symbol_name("_spiHandle")
   15239                      .dwattr $C$DW$2037, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15240                      .dwattr $C$DW$2037, DW_AT_accessibility(DW_ACCESS_public)
   15241              
   15242              $C$DW$2038      .dwtag  DW_TAG_member
   15243                      .dwattr $C$DW$2038, DW_AT_type(*$C$DW$T$39)
   15244                      .dwattr $C$DW$2038, DW_AT_name("gpioHandle")
   15245                      .dwattr $C$DW$2038, DW_AT_TI_symbol_name("_gpioHandle")
   15246                      .dwattr $C$DW$2038, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15247                      .dwattr $C$DW$2038, DW_AT_accessibility(DW_ACCESS_public)
   15248              
   15249              $C$DW$2039      .dwtag  DW_TAG_member
   15250                      .dwattr $C$DW$2039, DW_AT_type(*$C$DW$T$41)
   15251                      .dwattr $C$DW$2039, DW_AT_name("gpioNumber")
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{39F05D06-9873-4A8B-BE3D-C44CD24E8753} PAGE  289

   15252                      .dwattr $C$DW$2039, DW_AT_TI_symbol_name("_gpioNumber")
   15253                      .dwattr $C$DW$2039, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15254                      .dwattr $C$DW$2039, DW_AT_accessibility(DW_ACCESS_public)
   15255              
   15256              $C$DW$2040      .dwtag  DW_TAG_member
   15257                      .dwattr $C$DW$2040, DW_AT_type(*$C$DW$T$42)
   15258                      .dwattr $C$DW$2040, DW_AT_name("RxTimeOut")
   15259                      .dwattr $C$DW$2040, DW_AT_TI_symbol_name("_RxTimeOut")
   15260                      .dwattr $C$DW$2040, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   15261                      .dwattr $C$DW$2040, DW_AT_accessibility(DW_ACCESS_public)
   15262              
   15263              $C$DW$2041      .dwtag  DW_TAG_member
   15264                      .dwattr $C$DW$2041, DW_AT_type(*$C$DW$T$42)
   15265                      .dwattr $C$DW$2041, DW_AT_name("enableTimeOut")
   15266                      .dwattr $C$DW$2041, DW_AT_TI_symbol_name("_enableTimeOut")
   15267                      .dwattr $C$DW$2041, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15268                      .dwattr $C$DW$2041, DW_AT_accessibility(DW_ACCESS_public)
   15269              
   15270                      .dwendtag $C$DW$T$43
   15271              
   15272              $C$DW$T$120     .dwtag  DW_TAG_typedef
   15273                      .dwattr $C$DW$T$120, DW_AT_name("DRV8301_Obj")
   15274                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$43)
   15275                      .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
   15276              
   15277              $C$DW$T$118     .dwtag  DW_TAG_pointer_type
   15278                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$43)
   15279                      .dwattr $C$DW$T$118, DW_AT_address_class(0x20)
   15280              
   15281              $C$DW$T$119     .dwtag  DW_TAG_typedef
   15282                      .dwattr $C$DW$T$119, DW_AT_name("DRV8301_Handle")
   15283                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
   15284                      .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
   15285              
   15286              
   15287              $C$DW$T$54      .dwtag  DW_TAG_structure_type
   15288                      .dwattr $C$DW$T$54, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
   15289                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x05)
   15290              $C$DW$2042      .dwtag  DW_TAG_member
   15291                      .dwattr $C$DW$2042, DW_AT_type(*$C$DW$T$45)
   15292                      .dwattr $C$DW$2042, DW_AT_name("DRV8301_CURRENT")
   15293                      .dwattr $C$DW$2042, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
   15294                      .dwattr $C$DW$2042, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15295                      .dwattr $C$DW$2042, DW_AT_accessibility(DW_ACCESS_public)
   15296              
   15297              $C$DW$2043      .dwtag  DW_TAG_member
   15298                      .dwattr $C$DW$2043, DW_AT_type(*$C$DW$T$47)
   15299                      .dwattr $C$DW$2043, DW_AT_name("DRV8301_RESET")
   15300                      .dwattr $C$DW$2043, DW_AT_TI_symbol_name("_DRV8301_RESET")
   15301                      .dwattr $C$DW$2043, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15302                      .dwattr $C$DW$2043, DW_AT_accessibility(DW_ACCESS_public)
   15303              
   15304              $C$DW$2044      .dwtag  DW_TAG_member
   15305                      .dwattr $C$DW$2044, DW_AT_type(*$C$DW$T$49)
   15306                      .dwattr $C$DW$2044, DW_AT_name("PWM_MODE")
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{39F05D06-9873-4A8B-BE3D-C44CD24E8753} PAGE  290

   15307                      .dwattr $C$DW$2044, DW_AT_TI_symbol_name("_PWM_MODE")
   15308                      .dwattr $C$DW$2044, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15309                      .dwattr $C$DW$2044, DW_AT_accessibility(DW_ACCESS_public)
   15310              
   15311              $C$DW$2045      .dwtag  DW_TAG_member
   15312                      .dwattr $C$DW$2045, DW_AT_type(*$C$DW$T$51)
   15313                      .dwattr $C$DW$2045, DW_AT_name("OC_MODE")
   15314                      .dwattr $C$DW$2045, DW_AT_TI_symbol_name("_OC_MODE")
   15315                      .dwattr $C$DW$2045, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   15316                      .dwattr $C$DW$2045, DW_AT_accessibility(DW_ACCESS_public)
   15317              
   15318              $C$DW$2046      .dwtag  DW_TAG_member
   15319                      .dwattr $C$DW$2046, DW_AT_type(*$C$DW$T$53)
   15320                      .dwattr $C$DW$2046, DW_AT_name("OC_ADJ_SET")
   15321                      .dwattr $C$DW$2046, DW_AT_TI_symbol_name("_OC_ADJ_SET")
   15322                      .dwattr $C$DW$2046, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15323                      .dwattr $C$DW$2046, DW_AT_accessibility(DW_ACCESS_public)
   15324              
   15325                      .dwendtag $C$DW$T$54
   15326              
   15327              $C$DW$T$68      .dwtag  DW_TAG_typedef
   15328                      .dwattr $C$DW$T$68, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
   15329                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$54)
   15330                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
   15331              
   15332              
   15333              $C$DW$T$63      .dwtag  DW_TAG_structure_type
   15334                      .dwattr $C$DW$T$63, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
   15335                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
   15336              $C$DW$2047      .dwtag  DW_TAG_member
   15337                      .dwattr $C$DW$2047, DW_AT_type(*$C$DW$T$56)
   15338                      .dwattr $C$DW$2047, DW_AT_name("OCTW_SET")
   15339                      .dwattr $C$DW$2047, DW_AT_TI_symbol_name("_OCTW_SET")
   15340                      .dwattr $C$DW$2047, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15341                      .dwattr $C$DW$2047, DW_AT_accessibility(DW_ACCESS_public)
   15342              
   15343              $C$DW$2048      .dwtag  DW_TAG_member
   15344                      .dwattr $C$DW$2048, DW_AT_type(*$C$DW$T$58)
   15345                      .dwattr $C$DW$2048, DW_AT_name("GAIN")
   15346                      .dwattr $C$DW$2048, DW_AT_TI_symbol_name("_GAIN")
   15347                      .dwattr $C$DW$2048, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15348                      .dwattr $C$DW$2048, DW_AT_accessibility(DW_ACCESS_public)
   15349              
   15350              $C$DW$2049      .dwtag  DW_TAG_member
   15351                      .dwattr $C$DW$2049, DW_AT_type(*$C$DW$T$60)
   15352                      .dwattr $C$DW$2049, DW_AT_name("DC_CAL_CH1p2")
   15353                      .dwattr $C$DW$2049, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
   15354                      .dwattr $C$DW$2049, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15355                      .dwattr $C$DW$2049, DW_AT_accessibility(DW_ACCESS_public)
   15356              
   15357              $C$DW$2050      .dwtag  DW_TAG_member
   15358                      .dwattr $C$DW$2050, DW_AT_type(*$C$DW$T$62)
   15359                      .dwattr $C$DW$2050, DW_AT_name("OC_TOFF")
   15360                      .dwattr $C$DW$2050, DW_AT_TI_symbol_name("_OC_TOFF")
   15361                      .dwattr $C$DW$2050, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{39F05D06-9873-4A8B-BE3D-C44CD24E8753} PAGE  291

   15362                      .dwattr $C$DW$2050, DW_AT_accessibility(DW_ACCESS_public)
   15363              
   15364                      .dwendtag $C$DW$T$63
   15365              
   15366              $C$DW$T$69      .dwtag  DW_TAG_typedef
   15367                      .dwattr $C$DW$T$69, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
   15368                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$63)
   15369                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
   15370              
   15371              
   15372              $C$DW$T$64      .dwtag  DW_TAG_structure_type
   15373                      .dwattr $C$DW$T$64, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
   15374                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x0b)
   15375              $C$DW$2051      .dwtag  DW_TAG_member
   15376                      .dwattr $C$DW$2051, DW_AT_type(*$C$DW$T$42)
   15377                      .dwattr $C$DW$2051, DW_AT_name("FAULT")
   15378                      .dwattr $C$DW$2051, DW_AT_TI_symbol_name("_FAULT")
   15379                      .dwattr $C$DW$2051, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15380                      .dwattr $C$DW$2051, DW_AT_accessibility(DW_ACCESS_public)
   15381              
   15382              $C$DW$2052      .dwtag  DW_TAG_member
   15383                      .dwattr $C$DW$2052, DW_AT_type(*$C$DW$T$42)
   15384                      .dwattr $C$DW$2052, DW_AT_name("GVDD_UV")
   15385                      .dwattr $C$DW$2052, DW_AT_TI_symbol_name("_GVDD_UV")
   15386                      .dwattr $C$DW$2052, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15387                      .dwattr $C$DW$2052, DW_AT_accessibility(DW_ACCESS_public)
   15388              
   15389              $C$DW$2053      .dwtag  DW_TAG_member
   15390                      .dwattr $C$DW$2053, DW_AT_type(*$C$DW$T$42)
   15391                      .dwattr $C$DW$2053, DW_AT_name("PVDD_UV")
   15392                      .dwattr $C$DW$2053, DW_AT_TI_symbol_name("_PVDD_UV")
   15393                      .dwattr $C$DW$2053, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15394                      .dwattr $C$DW$2053, DW_AT_accessibility(DW_ACCESS_public)
   15395              
   15396              $C$DW$2054      .dwtag  DW_TAG_member
   15397                      .dwattr $C$DW$2054, DW_AT_type(*$C$DW$T$42)
   15398                      .dwattr $C$DW$2054, DW_AT_name("OTSD")
   15399                      .dwattr $C$DW$2054, DW_AT_TI_symbol_name("_OTSD")
   15400                      .dwattr $C$DW$2054, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   15401                      .dwattr $C$DW$2054, DW_AT_accessibility(DW_ACCESS_public)
   15402              
   15403              $C$DW$2055      .dwtag  DW_TAG_member
   15404                      .dwattr $C$DW$2055, DW_AT_type(*$C$DW$T$42)
   15405                      .dwattr $C$DW$2055, DW_AT_name("OTW")
   15406                      .dwattr $C$DW$2055, DW_AT_TI_symbol_name("_OTW")
   15407                      .dwattr $C$DW$2055, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15408                      .dwattr $C$DW$2055, DW_AT_accessibility(DW_ACCESS_public)
   15409              
   15410              $C$DW$2056      .dwtag  DW_TAG_member
   15411                      .dwattr $C$DW$2056, DW_AT_type(*$C$DW$T$42)
   15412                      .dwattr $C$DW$2056, DW_AT_name("FETHA_OC")
   15413                      .dwattr $C$DW$2056, DW_AT_TI_symbol_name("_FETHA_OC")
   15414                      .dwattr $C$DW$2056, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   15415                      .dwattr $C$DW$2056, DW_AT_accessibility(DW_ACCESS_public)
   15416              
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{39F05D06-9873-4A8B-BE3D-C44CD24E8753} PAGE  292

   15417              $C$DW$2057      .dwtag  DW_TAG_member
   15418                      .dwattr $C$DW$2057, DW_AT_type(*$C$DW$T$42)
   15419                      .dwattr $C$DW$2057, DW_AT_name("FETLA_OC")
   15420                      .dwattr $C$DW$2057, DW_AT_TI_symbol_name("_FETLA_OC")
   15421                      .dwattr $C$DW$2057, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15422                      .dwattr $C$DW$2057, DW_AT_accessibility(DW_ACCESS_public)
   15423              
   15424              $C$DW$2058      .dwtag  DW_TAG_member
   15425                      .dwattr $C$DW$2058, DW_AT_type(*$C$DW$T$42)
   15426                      .dwattr $C$DW$2058, DW_AT_name("FETHB_OC")
   15427                      .dwattr $C$DW$2058, DW_AT_TI_symbol_name("_FETHB_OC")
   15428                      .dwattr $C$DW$2058, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   15429                      .dwattr $C$DW$2058, DW_AT_accessibility(DW_ACCESS_public)
   15430              
   15431              $C$DW$2059      .dwtag  DW_TAG_member
   15432                      .dwattr $C$DW$2059, DW_AT_type(*$C$DW$T$42)
   15433                      .dwattr $C$DW$2059, DW_AT_name("FETLB_OC")
   15434                      .dwattr $C$DW$2059, DW_AT_TI_symbol_name("_FETLB_OC")
   15435                      .dwattr $C$DW$2059, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   15436                      .dwattr $C$DW$2059, DW_AT_accessibility(DW_ACCESS_public)
   15437              
   15438              $C$DW$2060      .dwtag  DW_TAG_member
   15439                      .dwattr $C$DW$2060, DW_AT_type(*$C$DW$T$42)
   15440                      .dwattr $C$DW$2060, DW_AT_name("FETHC_OC")
   15441                      .dwattr $C$DW$2060, DW_AT_TI_symbol_name("_FETHC_OC")
   15442                      .dwattr $C$DW$2060, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   15443                      .dwattr $C$DW$2060, DW_AT_accessibility(DW_ACCESS_public)
   15444              
   15445              $C$DW$2061      .dwtag  DW_TAG_member
   15446                      .dwattr $C$DW$2061, DW_AT_type(*$C$DW$T$42)
   15447                      .dwattr $C$DW$2061, DW_AT_name("FETLC_OC")
   15448                      .dwattr $C$DW$2061, DW_AT_TI_symbol_name("_FETLC_OC")
   15449                      .dwattr $C$DW$2061, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   15450                      .dwattr $C$DW$2061, DW_AT_accessibility(DW_ACCESS_public)
   15451              
   15452                      .dwendtag $C$DW$T$64
   15453              
   15454              $C$DW$T$66      .dwtag  DW_TAG_typedef
   15455                      .dwattr $C$DW$T$66, DW_AT_name("DRV_SPI_8301_Stat1_t_")
   15456                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$64)
   15457                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
   15458              
   15459              
   15460              $C$DW$T$65      .dwtag  DW_TAG_structure_type
   15461                      .dwattr $C$DW$T$65, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
   15462                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x02)
   15463              $C$DW$2062      .dwtag  DW_TAG_member
   15464                      .dwattr $C$DW$2062, DW_AT_type(*$C$DW$T$42)
   15465                      .dwattr $C$DW$2062, DW_AT_name("GVDD_OV")
   15466                      .dwattr $C$DW$2062, DW_AT_TI_symbol_name("_GVDD_OV")
   15467                      .dwattr $C$DW$2062, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15468                      .dwattr $C$DW$2062, DW_AT_accessibility(DW_ACCESS_public)
   15469              
   15470              $C$DW$2063      .dwtag  DW_TAG_member
   15471                      .dwattr $C$DW$2063, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{39F05D06-9873-4A8B-BE3D-C44CD24E8753} PAGE  293

   15472                      .dwattr $C$DW$2063, DW_AT_name("DeviceID")
   15473                      .dwattr $C$DW$2063, DW_AT_TI_symbol_name("_DeviceID")
   15474                      .dwattr $C$DW$2063, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15475                      .dwattr $C$DW$2063, DW_AT_accessibility(DW_ACCESS_public)
   15476              
   15477                      .dwendtag $C$DW$T$65
   15478              
   15479              $C$DW$T$67      .dwtag  DW_TAG_typedef
   15480                      .dwattr $C$DW$T$67, DW_AT_name("DRV_SPI_8301_Stat2_t_")
   15481                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$65)
   15482                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
   15483              
   15484              
   15485              $C$DW$T$70      .dwtag  DW_TAG_structure_type
   15486                      .dwattr $C$DW$T$70, DW_AT_name("_DRV_SPI_8301_Vars_t_")
   15487                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x18)
   15488              $C$DW$2064      .dwtag  DW_TAG_member
   15489                      .dwattr $C$DW$2064, DW_AT_type(*$C$DW$T$66)
   15490                      .dwattr $C$DW$2064, DW_AT_name("Stat_Reg_1")
   15491                      .dwattr $C$DW$2064, DW_AT_TI_symbol_name("_Stat_Reg_1")
   15492                      .dwattr $C$DW$2064, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15493                      .dwattr $C$DW$2064, DW_AT_accessibility(DW_ACCESS_public)
   15494              
   15495              $C$DW$2065      .dwtag  DW_TAG_member
   15496                      .dwattr $C$DW$2065, DW_AT_type(*$C$DW$T$67)
   15497                      .dwattr $C$DW$2065, DW_AT_name("Stat_Reg_2")
   15498                      .dwattr $C$DW$2065, DW_AT_TI_symbol_name("_Stat_Reg_2")
   15499                      .dwattr $C$DW$2065, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   15500                      .dwattr $C$DW$2065, DW_AT_accessibility(DW_ACCESS_public)
   15501              
   15502              $C$DW$2066      .dwtag  DW_TAG_member
   15503                      .dwattr $C$DW$2066, DW_AT_type(*$C$DW$T$68)
   15504                      .dwattr $C$DW$2066, DW_AT_name("Ctrl_Reg_1")
   15505                      .dwattr $C$DW$2066, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
   15506                      .dwattr $C$DW$2066, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   15507                      .dwattr $C$DW$2066, DW_AT_accessibility(DW_ACCESS_public)
   15508              
   15509              $C$DW$2067      .dwtag  DW_TAG_member
   15510                      .dwattr $C$DW$2067, DW_AT_type(*$C$DW$T$69)
   15511                      .dwattr $C$DW$2067, DW_AT_name("Ctrl_Reg_2")
   15512                      .dwattr $C$DW$2067, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
   15513                      .dwattr $C$DW$2067, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   15514                      .dwattr $C$DW$2067, DW_AT_accessibility(DW_ACCESS_public)
   15515              
   15516              $C$DW$2068      .dwtag  DW_TAG_member
   15517                      .dwattr $C$DW$2068, DW_AT_type(*$C$DW$T$42)
   15518                      .dwattr $C$DW$2068, DW_AT_name("SndCmd")
   15519                      .dwattr $C$DW$2068, DW_AT_TI_symbol_name("_SndCmd")
   15520                      .dwattr $C$DW$2068, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   15521                      .dwattr $C$DW$2068, DW_AT_accessibility(DW_ACCESS_public)
   15522              
   15523              $C$DW$2069      .dwtag  DW_TAG_member
   15524                      .dwattr $C$DW$2069, DW_AT_type(*$C$DW$T$42)
   15525                      .dwattr $C$DW$2069, DW_AT_name("RcvCmd")
   15526                      .dwattr $C$DW$2069, DW_AT_TI_symbol_name("_RcvCmd")
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{39F05D06-9873-4A8B-BE3D-C44CD24E8753} PAGE  294

   15527                      .dwattr $C$DW$2069, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
   15528                      .dwattr $C$DW$2069, DW_AT_accessibility(DW_ACCESS_public)
   15529              
   15530                      .dwendtag $C$DW$T$70
   15531              
   15532              $C$DW$T$353     .dwtag  DW_TAG_typedef
   15533                      .dwattr $C$DW$T$353, DW_AT_name("DRV_SPI_8301_Vars_t")
   15534                      .dwattr $C$DW$T$353, DW_AT_type(*$C$DW$T$70)
   15535                      .dwattr $C$DW$T$353, DW_AT_language(DW_LANG_C)
   15536              
   15537              $C$DW$T$354     .dwtag  DW_TAG_pointer_type
   15538                      .dwattr $C$DW$T$354, DW_AT_type(*$C$DW$T$353)
   15539                      .dwattr $C$DW$T$354, DW_AT_address_class(0x20)
   15540              
   15541              
   15542              $C$DW$T$72      .dwtag  DW_TAG_structure_type
   15543                      .dwattr $C$DW$T$72, DW_AT_name("_FILTER_FO_")
   15544                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x0a)
   15545              $C$DW$2070      .dwtag  DW_TAG_member
   15546                      .dwattr $C$DW$2070, DW_AT_type(*$C$DW$T$71)
   15547                      .dwattr $C$DW$2070, DW_AT_name("a1")
   15548                      .dwattr $C$DW$2070, DW_AT_TI_symbol_name("_a1")
   15549                      .dwattr $C$DW$2070, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15550                      .dwattr $C$DW$2070, DW_AT_accessibility(DW_ACCESS_public)
   15551              
   15552              $C$DW$2071      .dwtag  DW_TAG_member
   15553                      .dwattr $C$DW$2071, DW_AT_type(*$C$DW$T$71)
   15554                      .dwattr $C$DW$2071, DW_AT_name("b0")
   15555                      .dwattr $C$DW$2071, DW_AT_TI_symbol_name("_b0")
   15556                      .dwattr $C$DW$2071, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15557                      .dwattr $C$DW$2071, DW_AT_accessibility(DW_ACCESS_public)
   15558              
   15559              $C$DW$2072      .dwtag  DW_TAG_member
   15560                      .dwattr $C$DW$2072, DW_AT_type(*$C$DW$T$71)
   15561                      .dwattr $C$DW$2072, DW_AT_name("b1")
   15562                      .dwattr $C$DW$2072, DW_AT_TI_symbol_name("_b1")
   15563                      .dwattr $C$DW$2072, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15564                      .dwattr $C$DW$2072, DW_AT_accessibility(DW_ACCESS_public)
   15565              
   15566              $C$DW$2073      .dwtag  DW_TAG_member
   15567                      .dwattr $C$DW$2073, DW_AT_type(*$C$DW$T$71)
   15568                      .dwattr $C$DW$2073, DW_AT_name("x1")
   15569                      .dwattr $C$DW$2073, DW_AT_TI_symbol_name("_x1")
   15570                      .dwattr $C$DW$2073, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15571                      .dwattr $C$DW$2073, DW_AT_accessibility(DW_ACCESS_public)
   15572              
   15573              $C$DW$2074      .dwtag  DW_TAG_member
   15574                      .dwattr $C$DW$2074, DW_AT_type(*$C$DW$T$71)
   15575                      .dwattr $C$DW$2074, DW_AT_name("y1")
   15576                      .dwattr $C$DW$2074, DW_AT_TI_symbol_name("_y1")
   15577                      .dwattr $C$DW$2074, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   15578                      .dwattr $C$DW$2074, DW_AT_accessibility(DW_ACCESS_public)
   15579              
   15580                      .dwendtag $C$DW$T$72
   15581              
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{39F05D06-9873-4A8B-BE3D-C44CD24E8753} PAGE  295

   15582              $C$DW$T$124     .dwtag  DW_TAG_typedef
   15583                      .dwattr $C$DW$T$124, DW_AT_name("FILTER_FO_Obj")
   15584                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$72)
   15585                      .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
   15586              
   15587              
   15588              $C$DW$T$19      .dwtag  DW_TAG_structure_type
   15589                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
   15590                      .dwattr $C$DW$T$19, DW_AT_declaration
   15591                      .dwendtag $C$DW$T$19
   15592              
   15593              $C$DW$T$125     .dwtag  DW_TAG_pointer_type
   15594                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$19)
   15595                      .dwattr $C$DW$T$125, DW_AT_address_class(0x20)
   15596              
   15597              $C$DW$T$126     .dwtag  DW_TAG_typedef
   15598                      .dwattr $C$DW$T$126, DW_AT_name("FILTER_FO_Handle")
   15599                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$125)
   15600                      .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
   15601              
   15602              
   15603              $C$DW$T$73      .dwtag  DW_TAG_structure_type
   15604                      .dwattr $C$DW$T$73, DW_AT_name("_FLASH_Obj_")
   15605                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x08)
   15606              $C$DW$2075      .dwtag  DW_TAG_member
   15607                      .dwattr $C$DW$2075, DW_AT_type(*$C$DW$T$23)
   15608                      .dwattr $C$DW$2075, DW_AT_name("FOPT")
   15609                      .dwattr $C$DW$2075, DW_AT_TI_symbol_name("_FOPT")
   15610                      .dwattr $C$DW$2075, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15611                      .dwattr $C$DW$2075, DW_AT_accessibility(DW_ACCESS_public)
   15612              
   15613              $C$DW$2076      .dwtag  DW_TAG_member
   15614                      .dwattr $C$DW$2076, DW_AT_type(*$C$DW$T$23)
   15615                      .dwattr $C$DW$2076, DW_AT_name("rsvd_1")
   15616                      .dwattr $C$DW$2076, DW_AT_TI_symbol_name("_rsvd_1")
   15617                      .dwattr $C$DW$2076, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15618                      .dwattr $C$DW$2076, DW_AT_accessibility(DW_ACCESS_public)
   15619              
   15620              $C$DW$2077      .dwtag  DW_TAG_member
   15621                      .dwattr $C$DW$2077, DW_AT_type(*$C$DW$T$23)
   15622                      .dwattr $C$DW$2077, DW_AT_name("FPWR")
   15623                      .dwattr $C$DW$2077, DW_AT_TI_symbol_name("_FPWR")
   15624                      .dwattr $C$DW$2077, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15625                      .dwattr $C$DW$2077, DW_AT_accessibility(DW_ACCESS_public)
   15626              
   15627              $C$DW$2078      .dwtag  DW_TAG_member
   15628                      .dwattr $C$DW$2078, DW_AT_type(*$C$DW$T$23)
   15629                      .dwattr $C$DW$2078, DW_AT_name("FSTATUS")
   15630                      .dwattr $C$DW$2078, DW_AT_TI_symbol_name("_FSTATUS")
   15631                      .dwattr $C$DW$2078, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   15632                      .dwattr $C$DW$2078, DW_AT_accessibility(DW_ACCESS_public)
   15633              
   15634              $C$DW$2079      .dwtag  DW_TAG_member
   15635                      .dwattr $C$DW$2079, DW_AT_type(*$C$DW$T$23)
   15636                      .dwattr $C$DW$2079, DW_AT_name("FSTDBYWAIT")
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{39F05D06-9873-4A8B-BE3D-C44CD24E8753} PAGE  296

   15637                      .dwattr $C$DW$2079, DW_AT_TI_symbol_name("_FSTDBYWAIT")
   15638                      .dwattr $C$DW$2079, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15639                      .dwattr $C$DW$2079, DW_AT_accessibility(DW_ACCESS_public)
   15640              
   15641              $C$DW$2080      .dwtag  DW_TAG_member
   15642                      .dwattr $C$DW$2080, DW_AT_type(*$C$DW$T$23)
   15643                      .dwattr $C$DW$2080, DW_AT_name("FACTIVEWAIT")
   15644                      .dwattr $C$DW$2080, DW_AT_TI_symbol_name("_FACTIVEWAIT")
   15645                      .dwattr $C$DW$2080, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   15646                      .dwattr $C$DW$2080, DW_AT_accessibility(DW_ACCESS_public)
   15647              
   15648              $C$DW$2081      .dwtag  DW_TAG_member
   15649                      .dwattr $C$DW$2081, DW_AT_type(*$C$DW$T$23)
   15650                      .dwattr $C$DW$2081, DW_AT_name("FBANKWAIT")
   15651                      .dwattr $C$DW$2081, DW_AT_TI_symbol_name("_FBANKWAIT")
   15652                      .dwattr $C$DW$2081, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15653                      .dwattr $C$DW$2081, DW_AT_accessibility(DW_ACCESS_public)
   15654              
   15655              $C$DW$2082      .dwtag  DW_TAG_member
   15656                      .dwattr $C$DW$2082, DW_AT_type(*$C$DW$T$23)
   15657                      .dwattr $C$DW$2082, DW_AT_name("FOTPWAIT")
   15658                      .dwattr $C$DW$2082, DW_AT_TI_symbol_name("_FOTPWAIT")
   15659                      .dwattr $C$DW$2082, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   15660                      .dwattr $C$DW$2082, DW_AT_accessibility(DW_ACCESS_public)
   15661              
   15662                      .dwendtag $C$DW$T$73
   15663              
   15664              $C$DW$T$94      .dwtag  DW_TAG_pointer_type
   15665                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$73)
   15666                      .dwattr $C$DW$T$94, DW_AT_address_class(0x20)
   15667              
   15668              $C$DW$T$95      .dwtag  DW_TAG_typedef
   15669                      .dwattr $C$DW$T$95, DW_AT_name("FLASH_Handle")
   15670                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
   15671                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
   15672              
   15673              
   15674              $C$DW$T$79      .dwtag  DW_TAG_structure_type
   15675                      .dwattr $C$DW$T$79, DW_AT_name("_GPIO_Obj_")
   15676                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x6a)
   15677              $C$DW$2083      .dwtag  DW_TAG_member
   15678                      .dwattr $C$DW$2083, DW_AT_type(*$C$DW$T$76)
   15679                      .dwattr $C$DW$2083, DW_AT_name("GPACTRL")
   15680                      .dwattr $C$DW$2083, DW_AT_TI_symbol_name("_GPACTRL")
   15681                      .dwattr $C$DW$2083, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15682                      .dwattr $C$DW$2083, DW_AT_accessibility(DW_ACCESS_public)
   15683              
   15684              $C$DW$2084      .dwtag  DW_TAG_member
   15685                      .dwattr $C$DW$2084, DW_AT_type(*$C$DW$T$76)
   15686                      .dwattr $C$DW$2084, DW_AT_name("GPAQSEL1")
   15687                      .dwattr $C$DW$2084, DW_AT_TI_symbol_name("_GPAQSEL1")
   15688                      .dwattr $C$DW$2084, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15689                      .dwattr $C$DW$2084, DW_AT_accessibility(DW_ACCESS_public)
   15690              
   15691              $C$DW$2085      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{39F05D06-9873-4A8B-BE3D-C44CD24E8753} PAGE  297

   15692                      .dwattr $C$DW$2085, DW_AT_type(*$C$DW$T$76)
   15693                      .dwattr $C$DW$2085, DW_AT_name("GPAQSEL2")
   15694                      .dwattr $C$DW$2085, DW_AT_TI_symbol_name("_GPAQSEL2")
   15695                      .dwattr $C$DW$2085, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15696                      .dwattr $C$DW$2085, DW_AT_accessibility(DW_ACCESS_public)
   15697              
   15698              $C$DW$2086      .dwtag  DW_TAG_member
   15699                      .dwattr $C$DW$2086, DW_AT_type(*$C$DW$T$76)
   15700                      .dwattr $C$DW$2086, DW_AT_name("GPAMUX1")
   15701                      .dwattr $C$DW$2086, DW_AT_TI_symbol_name("_GPAMUX1")
   15702                      .dwattr $C$DW$2086, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15703                      .dwattr $C$DW$2086, DW_AT_accessibility(DW_ACCESS_public)
   15704              
   15705              $C$DW$2087      .dwtag  DW_TAG_member
   15706                      .dwattr $C$DW$2087, DW_AT_type(*$C$DW$T$76)
   15707                      .dwattr $C$DW$2087, DW_AT_name("GPAMUX2")
   15708                      .dwattr $C$DW$2087, DW_AT_TI_symbol_name("_GPAMUX2")
   15709                      .dwattr $C$DW$2087, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   15710                      .dwattr $C$DW$2087, DW_AT_accessibility(DW_ACCESS_public)
   15711              
   15712              $C$DW$2088      .dwtag  DW_TAG_member
   15713                      .dwattr $C$DW$2088, DW_AT_type(*$C$DW$T$76)
   15714                      .dwattr $C$DW$2088, DW_AT_name("GPADIR")
   15715                      .dwattr $C$DW$2088, DW_AT_TI_symbol_name("_GPADIR")
   15716                      .dwattr $C$DW$2088, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   15717                      .dwattr $C$DW$2088, DW_AT_accessibility(DW_ACCESS_public)
   15718              
   15719              $C$DW$2089      .dwtag  DW_TAG_member
   15720                      .dwattr $C$DW$2089, DW_AT_type(*$C$DW$T$76)
   15721                      .dwattr $C$DW$2089, DW_AT_name("GPAPUD")
   15722                      .dwattr $C$DW$2089, DW_AT_TI_symbol_name("_GPAPUD")
   15723                      .dwattr $C$DW$2089, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   15724                      .dwattr $C$DW$2089, DW_AT_accessibility(DW_ACCESS_public)
   15725              
   15726              $C$DW$2090      .dwtag  DW_TAG_member
   15727                      .dwattr $C$DW$2090, DW_AT_type(*$C$DW$T$26)
   15728                      .dwattr $C$DW$2090, DW_AT_name("rsvd_1")
   15729                      .dwattr $C$DW$2090, DW_AT_TI_symbol_name("_rsvd_1")
   15730                      .dwattr $C$DW$2090, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   15731                      .dwattr $C$DW$2090, DW_AT_accessibility(DW_ACCESS_public)
   15732              
   15733              $C$DW$2091      .dwtag  DW_TAG_member
   15734                      .dwattr $C$DW$2091, DW_AT_type(*$C$DW$T$76)
   15735                      .dwattr $C$DW$2091, DW_AT_name("GPBCTRL")
   15736                      .dwattr $C$DW$2091, DW_AT_TI_symbol_name("_GPBCTRL")
   15737                      .dwattr $C$DW$2091, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   15738                      .dwattr $C$DW$2091, DW_AT_accessibility(DW_ACCESS_public)
   15739              
   15740              $C$DW$2092      .dwtag  DW_TAG_member
   15741                      .dwattr $C$DW$2092, DW_AT_type(*$C$DW$T$76)
   15742                      .dwattr $C$DW$2092, DW_AT_name("GPBQSEL1")
   15743                      .dwattr $C$DW$2092, DW_AT_TI_symbol_name("_GPBQSEL1")
   15744                      .dwattr $C$DW$2092, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   15745                      .dwattr $C$DW$2092, DW_AT_accessibility(DW_ACCESS_public)
   15746              
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{39F05D06-9873-4A8B-BE3D-C44CD24E8753} PAGE  298

   15747              $C$DW$2093      .dwtag  DW_TAG_member
   15748                      .dwattr $C$DW$2093, DW_AT_type(*$C$DW$T$76)
   15749                      .dwattr $C$DW$2093, DW_AT_name("GPBQSEL2")
   15750                      .dwattr $C$DW$2093, DW_AT_TI_symbol_name("_GPBQSEL2")
   15751                      .dwattr $C$DW$2093, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   15752                      .dwattr $C$DW$2093, DW_AT_accessibility(DW_ACCESS_public)
   15753              
   15754              $C$DW$2094      .dwtag  DW_TAG_member
   15755                      .dwattr $C$DW$2094, DW_AT_type(*$C$DW$T$76)
   15756                      .dwattr $C$DW$2094, DW_AT_name("GPBMUX1")
   15757                      .dwattr $C$DW$2094, DW_AT_TI_symbol_name("_GPBMUX1")
   15758                      .dwattr $C$DW$2094, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   15759                      .dwattr $C$DW$2094, DW_AT_accessibility(DW_ACCESS_public)
   15760              
   15761              $C$DW$2095      .dwtag  DW_TAG_member
   15762                      .dwattr $C$DW$2095, DW_AT_type(*$C$DW$T$76)
   15763                      .dwattr $C$DW$2095, DW_AT_name("GPBMUX2")
   15764                      .dwattr $C$DW$2095, DW_AT_TI_symbol_name("_GPBMUX2")
   15765                      .dwattr $C$DW$2095, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   15766                      .dwattr $C$DW$2095, DW_AT_accessibility(DW_ACCESS_public)
   15767              
   15768              $C$DW$2096      .dwtag  DW_TAG_member
   15769                      .dwattr $C$DW$2096, DW_AT_type(*$C$DW$T$76)
   15770                      .dwattr $C$DW$2096, DW_AT_name("GPBDIR")
   15771                      .dwattr $C$DW$2096, DW_AT_TI_symbol_name("_GPBDIR")
   15772                      .dwattr $C$DW$2096, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   15773                      .dwattr $C$DW$2096, DW_AT_accessibility(DW_ACCESS_public)
   15774              
   15775              $C$DW$2097      .dwtag  DW_TAG_member
   15776                      .dwattr $C$DW$2097, DW_AT_type(*$C$DW$T$76)
   15777                      .dwattr $C$DW$2097, DW_AT_name("GPBPUD")
   15778                      .dwattr $C$DW$2097, DW_AT_TI_symbol_name("_GPBPUD")
   15779                      .dwattr $C$DW$2097, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   15780                      .dwattr $C$DW$2097, DW_AT_accessibility(DW_ACCESS_public)
   15781              
   15782              $C$DW$2098      .dwtag  DW_TAG_member
   15783                      .dwattr $C$DW$2098, DW_AT_type(*$C$DW$T$77)
   15784                      .dwattr $C$DW$2098, DW_AT_name("rsvd_4")
   15785                      .dwattr $C$DW$2098, DW_AT_TI_symbol_name("_rsvd_4")
   15786                      .dwattr $C$DW$2098, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   15787                      .dwattr $C$DW$2098, DW_AT_accessibility(DW_ACCESS_public)
   15788              
   15789              $C$DW$2099      .dwtag  DW_TAG_member
   15790                      .dwattr $C$DW$2099, DW_AT_type(*$C$DW$T$76)
   15791                      .dwattr $C$DW$2099, DW_AT_name("AIOMUX1")
   15792                      .dwattr $C$DW$2099, DW_AT_TI_symbol_name("_AIOMUX1")
   15793                      .dwattr $C$DW$2099, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   15794                      .dwattr $C$DW$2099, DW_AT_accessibility(DW_ACCESS_public)
   15795              
   15796              $C$DW$2100      .dwtag  DW_TAG_member
   15797                      .dwattr $C$DW$2100, DW_AT_type(*$C$DW$T$26)
   15798                      .dwattr $C$DW$2100, DW_AT_name("rsvd_5")
   15799                      .dwattr $C$DW$2100, DW_AT_TI_symbol_name("_rsvd_5")
   15800                      .dwattr $C$DW$2100, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   15801                      .dwattr $C$DW$2100, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{39F05D06-9873-4A8B-BE3D-C44CD24E8753} PAGE  299

   15802              
   15803              $C$DW$2101      .dwtag  DW_TAG_member
   15804                      .dwattr $C$DW$2101, DW_AT_type(*$C$DW$T$76)
   15805                      .dwattr $C$DW$2101, DW_AT_name("AIODIR")
   15806                      .dwattr $C$DW$2101, DW_AT_TI_symbol_name("_AIODIR")
   15807                      .dwattr $C$DW$2101, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   15808                      .dwattr $C$DW$2101, DW_AT_accessibility(DW_ACCESS_public)
   15809              
   15810              $C$DW$2102      .dwtag  DW_TAG_member
   15811                      .dwattr $C$DW$2102, DW_AT_type(*$C$DW$T$78)
   15812                      .dwattr $C$DW$2102, DW_AT_name("rsvd_6")
   15813                      .dwattr $C$DW$2102, DW_AT_TI_symbol_name("_rsvd_6")
   15814                      .dwattr $C$DW$2102, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   15815                      .dwattr $C$DW$2102, DW_AT_accessibility(DW_ACCESS_public)
   15816              
   15817              $C$DW$2103      .dwtag  DW_TAG_member
   15818                      .dwattr $C$DW$2103, DW_AT_type(*$C$DW$T$76)
   15819                      .dwattr $C$DW$2103, DW_AT_name("GPADAT")
   15820                      .dwattr $C$DW$2103, DW_AT_TI_symbol_name("_GPADAT")
   15821                      .dwattr $C$DW$2103, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   15822                      .dwattr $C$DW$2103, DW_AT_accessibility(DW_ACCESS_public)
   15823              
   15824              $C$DW$2104      .dwtag  DW_TAG_member
   15825                      .dwattr $C$DW$2104, DW_AT_type(*$C$DW$T$76)
   15826                      .dwattr $C$DW$2104, DW_AT_name("GPASET")
   15827                      .dwattr $C$DW$2104, DW_AT_TI_symbol_name("_GPASET")
   15828                      .dwattr $C$DW$2104, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   15829                      .dwattr $C$DW$2104, DW_AT_accessibility(DW_ACCESS_public)
   15830              
   15831              $C$DW$2105      .dwtag  DW_TAG_member
   15832                      .dwattr $C$DW$2105, DW_AT_type(*$C$DW$T$76)
   15833                      .dwattr $C$DW$2105, DW_AT_name("GPACLEAR")
   15834                      .dwattr $C$DW$2105, DW_AT_TI_symbol_name("_GPACLEAR")
   15835                      .dwattr $C$DW$2105, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   15836                      .dwattr $C$DW$2105, DW_AT_accessibility(DW_ACCESS_public)
   15837              
   15838              $C$DW$2106      .dwtag  DW_TAG_member
   15839                      .dwattr $C$DW$2106, DW_AT_type(*$C$DW$T$76)
   15840                      .dwattr $C$DW$2106, DW_AT_name("GPATOGGLE")
   15841                      .dwattr $C$DW$2106, DW_AT_TI_symbol_name("_GPATOGGLE")
   15842                      .dwattr $C$DW$2106, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   15843                      .dwattr $C$DW$2106, DW_AT_accessibility(DW_ACCESS_public)
   15844              
   15845              $C$DW$2107      .dwtag  DW_TAG_member
   15846                      .dwattr $C$DW$2107, DW_AT_type(*$C$DW$T$76)
   15847                      .dwattr $C$DW$2107, DW_AT_name("GPBDAT")
   15848                      .dwattr $C$DW$2107, DW_AT_TI_symbol_name("_GPBDAT")
   15849                      .dwattr $C$DW$2107, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   15850                      .dwattr $C$DW$2107, DW_AT_accessibility(DW_ACCESS_public)
   15851              
   15852              $C$DW$2108      .dwtag  DW_TAG_member
   15853                      .dwattr $C$DW$2108, DW_AT_type(*$C$DW$T$76)
   15854                      .dwattr $C$DW$2108, DW_AT_name("GPBSET")
   15855                      .dwattr $C$DW$2108, DW_AT_TI_symbol_name("_GPBSET")
   15856                      .dwattr $C$DW$2108, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{39F05D06-9873-4A8B-BE3D-C44CD24E8753} PAGE  300

   15857                      .dwattr $C$DW$2108, DW_AT_accessibility(DW_ACCESS_public)
   15858              
   15859              $C$DW$2109      .dwtag  DW_TAG_member
   15860                      .dwattr $C$DW$2109, DW_AT_type(*$C$DW$T$76)
   15861                      .dwattr $C$DW$2109, DW_AT_name("GPBCLEAR")
   15862                      .dwattr $C$DW$2109, DW_AT_TI_symbol_name("_GPBCLEAR")
   15863                      .dwattr $C$DW$2109, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   15864                      .dwattr $C$DW$2109, DW_AT_accessibility(DW_ACCESS_public)
   15865              
   15866              $C$DW$2110      .dwtag  DW_TAG_member
   15867                      .dwattr $C$DW$2110, DW_AT_type(*$C$DW$T$76)
   15868                      .dwattr $C$DW$2110, DW_AT_name("GPBTOGGLE")
   15869                      .dwattr $C$DW$2110, DW_AT_TI_symbol_name("_GPBTOGGLE")
   15870                      .dwattr $C$DW$2110, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   15871                      .dwattr $C$DW$2110, DW_AT_accessibility(DW_ACCESS_public)
   15872              
   15873              $C$DW$2111      .dwtag  DW_TAG_member
   15874                      .dwattr $C$DW$2111, DW_AT_type(*$C$DW$T$31)
   15875                      .dwattr $C$DW$2111, DW_AT_name("rsvd_7")
   15876                      .dwattr $C$DW$2111, DW_AT_TI_symbol_name("_rsvd_7")
   15877                      .dwattr $C$DW$2111, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   15878                      .dwattr $C$DW$2111, DW_AT_accessibility(DW_ACCESS_public)
   15879              
   15880              $C$DW$2112      .dwtag  DW_TAG_member
   15881                      .dwattr $C$DW$2112, DW_AT_type(*$C$DW$T$76)
   15882                      .dwattr $C$DW$2112, DW_AT_name("AIODAT")
   15883                      .dwattr $C$DW$2112, DW_AT_TI_symbol_name("_AIODAT")
   15884                      .dwattr $C$DW$2112, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
   15885                      .dwattr $C$DW$2112, DW_AT_accessibility(DW_ACCESS_public)
   15886              
   15887              $C$DW$2113      .dwtag  DW_TAG_member
   15888                      .dwattr $C$DW$2113, DW_AT_type(*$C$DW$T$76)
   15889                      .dwattr $C$DW$2113, DW_AT_name("AIOSET")
   15890                      .dwattr $C$DW$2113, DW_AT_TI_symbol_name("_AIOSET")
   15891                      .dwattr $C$DW$2113, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   15892                      .dwattr $C$DW$2113, DW_AT_accessibility(DW_ACCESS_public)
   15893              
   15894              $C$DW$2114      .dwtag  DW_TAG_member
   15895                      .dwattr $C$DW$2114, DW_AT_type(*$C$DW$T$76)
   15896                      .dwattr $C$DW$2114, DW_AT_name("AIOCLEAR")
   15897                      .dwattr $C$DW$2114, DW_AT_TI_symbol_name("_AIOCLEAR")
   15898                      .dwattr $C$DW$2114, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   15899                      .dwattr $C$DW$2114, DW_AT_accessibility(DW_ACCESS_public)
   15900              
   15901              $C$DW$2115      .dwtag  DW_TAG_member
   15902                      .dwattr $C$DW$2115, DW_AT_type(*$C$DW$T$76)
   15903                      .dwattr $C$DW$2115, DW_AT_name("AIOTOGGLE")
   15904                      .dwattr $C$DW$2115, DW_AT_TI_symbol_name("_AIOTOGGLE")
   15905                      .dwattr $C$DW$2115, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   15906                      .dwattr $C$DW$2115, DW_AT_accessibility(DW_ACCESS_public)
   15907              
   15908              $C$DW$2116      .dwtag  DW_TAG_member
   15909                      .dwattr $C$DW$2116, DW_AT_type(*$C$DW$T$28)
   15910                      .dwattr $C$DW$2116, DW_AT_name("GPIOXINTnSEL")
   15911                      .dwattr $C$DW$2116, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{39F05D06-9873-4A8B-BE3D-C44CD24E8753} PAGE  301

   15912                      .dwattr $C$DW$2116, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   15913                      .dwattr $C$DW$2116, DW_AT_accessibility(DW_ACCESS_public)
   15914              
   15915              $C$DW$2117      .dwtag  DW_TAG_member
   15916                      .dwattr $C$DW$2117, DW_AT_type(*$C$DW$T$27)
   15917                      .dwattr $C$DW$2117, DW_AT_name("rsvd_8")
   15918                      .dwattr $C$DW$2117, DW_AT_TI_symbol_name("_rsvd_8")
   15919                      .dwattr $C$DW$2117, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   15920                      .dwattr $C$DW$2117, DW_AT_accessibility(DW_ACCESS_public)
   15921              
   15922              $C$DW$2118      .dwtag  DW_TAG_member
   15923                      .dwattr $C$DW$2118, DW_AT_type(*$C$DW$T$76)
   15924                      .dwattr $C$DW$2118, DW_AT_name("GPIOLPMSEL")
   15925                      .dwattr $C$DW$2118, DW_AT_TI_symbol_name("_GPIOLPMSEL")
   15926                      .dwattr $C$DW$2118, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   15927                      .dwattr $C$DW$2118, DW_AT_accessibility(DW_ACCESS_public)
   15928              
   15929                      .dwendtag $C$DW$T$79
   15930              
   15931              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
   15932                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$79)
   15933                      .dwattr $C$DW$T$38, DW_AT_address_class(0x20)
   15934              
   15935              $C$DW$T$39      .dwtag  DW_TAG_typedef
   15936                      .dwattr $C$DW$T$39, DW_AT_name("GPIO_Handle")
   15937                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
   15938                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
   15939              
   15940              
   15941              $C$DW$T$81      .dwtag  DW_TAG_structure_type
   15942                      .dwattr $C$DW$T$81, DW_AT_name("_HAL_AdcData_t_")
   15943                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x0e)
   15944              $C$DW$2119      .dwtag  DW_TAG_member
   15945                      .dwattr $C$DW$2119, DW_AT_type(*$C$DW$T$80)
   15946                      .dwattr $C$DW$2119, DW_AT_name("I")
   15947                      .dwattr $C$DW$2119, DW_AT_TI_symbol_name("_I")
   15948                      .dwattr $C$DW$2119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15949                      .dwattr $C$DW$2119, DW_AT_accessibility(DW_ACCESS_public)
   15950              
   15951              $C$DW$2120      .dwtag  DW_TAG_member
   15952                      .dwattr $C$DW$2120, DW_AT_type(*$C$DW$T$80)
   15953                      .dwattr $C$DW$2120, DW_AT_name("V")
   15954                      .dwattr $C$DW$2120, DW_AT_TI_symbol_name("_V")
   15955                      .dwattr $C$DW$2120, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15956                      .dwattr $C$DW$2120, DW_AT_accessibility(DW_ACCESS_public)
   15957              
   15958              $C$DW$2121      .dwtag  DW_TAG_member
   15959                      .dwattr $C$DW$2121, DW_AT_type(*$C$DW$T$71)
   15960                      .dwattr $C$DW$2121, DW_AT_name("dcBus")
   15961                      .dwattr $C$DW$2121, DW_AT_TI_symbol_name("_dcBus")
   15962                      .dwattr $C$DW$2121, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   15963                      .dwattr $C$DW$2121, DW_AT_accessibility(DW_ACCESS_public)
   15964              
   15965                      .dwendtag $C$DW$T$81
   15966              
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{39F05D06-9873-4A8B-BE3D-C44CD24E8753} PAGE  302

   15967              $C$DW$T$117     .dwtag  DW_TAG_typedef
   15968                      .dwattr $C$DW$T$117, DW_AT_name("HAL_AdcData_t")
   15969                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$81)
   15970                      .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
   15971              
   15972              
   15973              $C$DW$T$87      .dwtag  DW_TAG_structure_type
   15974                      .dwattr $C$DW$T$87, DW_AT_name("_HAL_DacData_t_")
   15975                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x22)
   15976              $C$DW$2122      .dwtag  DW_TAG_member
   15977                      .dwattr $C$DW$2122, DW_AT_type(*$C$DW$T$22)
   15978                      .dwattr $C$DW$2122, DW_AT_name("PeriodMax")
   15979                      .dwattr $C$DW$2122, DW_AT_TI_symbol_name("_PeriodMax")
   15980                      .dwattr $C$DW$2122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15981                      .dwattr $C$DW$2122, DW_AT_accessibility(DW_ACCESS_public)
   15982              
   15983              $C$DW$2123      .dwtag  DW_TAG_member
   15984                      .dwattr $C$DW$2123, DW_AT_type(*$C$DW$T$85)
   15985                      .dwattr $C$DW$2123, DW_AT_name("ptrData")
   15986                      .dwattr $C$DW$2123, DW_AT_TI_symbol_name("_ptrData")
   15987                      .dwattr $C$DW$2123, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15988                      .dwattr $C$DW$2123, DW_AT_accessibility(DW_ACCESS_public)
   15989              
   15990              $C$DW$2124      .dwtag  DW_TAG_member
   15991                      .dwattr $C$DW$2124, DW_AT_type(*$C$DW$T$86)
   15992                      .dwattr $C$DW$2124, DW_AT_name("value")
   15993                      .dwattr $C$DW$2124, DW_AT_TI_symbol_name("_value")
   15994                      .dwattr $C$DW$2124, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   15995                      .dwattr $C$DW$2124, DW_AT_accessibility(DW_ACCESS_public)
   15996              
   15997              $C$DW$2125      .dwtag  DW_TAG_member
   15998                      .dwattr $C$DW$2125, DW_AT_type(*$C$DW$T$86)
   15999                      .dwattr $C$DW$2125, DW_AT_name("offset")
   16000                      .dwattr $C$DW$2125, DW_AT_TI_symbol_name("_offset")
   16001                      .dwattr $C$DW$2125, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   16002                      .dwattr $C$DW$2125, DW_AT_accessibility(DW_ACCESS_public)
   16003              
   16004              $C$DW$2126      .dwtag  DW_TAG_member
   16005                      .dwattr $C$DW$2126, DW_AT_type(*$C$DW$T$86)
   16006                      .dwattr $C$DW$2126, DW_AT_name("gain")
   16007                      .dwattr $C$DW$2126, DW_AT_TI_symbol_name("_gain")
   16008                      .dwattr $C$DW$2126, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   16009                      .dwattr $C$DW$2126, DW_AT_accessibility(DW_ACCESS_public)
   16010              
   16011                      .dwendtag $C$DW$T$87
   16012              
   16013              $C$DW$T$364     .dwtag  DW_TAG_typedef
   16014                      .dwattr $C$DW$T$364, DW_AT_name("HAL_DacData_t")
   16015                      .dwattr $C$DW$T$364, DW_AT_type(*$C$DW$T$87)
   16016                      .dwattr $C$DW$T$364, DW_AT_language(DW_LANG_C)
   16017              
   16018              $C$DW$T$365     .dwtag  DW_TAG_pointer_type
   16019                      .dwattr $C$DW$T$365, DW_AT_type(*$C$DW$T$364)
   16020                      .dwattr $C$DW$T$365, DW_AT_address_class(0x20)
   16021              
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{39F05D06-9873-4A8B-BE3D-C44CD24E8753} PAGE  303

   16022              $C$DW$2127      .dwtag  DW_TAG_TI_far_type
   16023                      .dwattr $C$DW$2127, DW_AT_type(*$C$DW$T$365)
   16024              
   16025              $C$DW$T$366     .dwtag  DW_TAG_const_type
   16026                      .dwattr $C$DW$T$366, DW_AT_type(*$C$DW$2127)
   16027              
   16028              
   16029              $C$DW$T$121     .dwtag  DW_TAG_structure_type
   16030                      .dwattr $C$DW$T$121, DW_AT_name("_HAL_Obj_")
   16031                      .dwattr $C$DW$T$121, DW_AT_byte_size(0xa8)
   16032              $C$DW$2128      .dwtag  DW_TAG_member
   16033                      .dwattr $C$DW$2128, DW_AT_type(*$C$DW$T$89)
   16034                      .dwattr $C$DW$2128, DW_AT_name("adcHandle")
   16035                      .dwattr $C$DW$2128, DW_AT_TI_symbol_name("_adcHandle")
   16036                      .dwattr $C$DW$2128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16037                      .dwattr $C$DW$2128, DW_AT_accessibility(DW_ACCESS_public)
   16038              
   16039              $C$DW$2129      .dwtag  DW_TAG_member
   16040                      .dwattr $C$DW$2129, DW_AT_type(*$C$DW$T$91)
   16041                      .dwattr $C$DW$2129, DW_AT_name("clkHandle")
   16042                      .dwattr $C$DW$2129, DW_AT_TI_symbol_name("_clkHandle")
   16043                      .dwattr $C$DW$2129, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16044                      .dwattr $C$DW$2129, DW_AT_accessibility(DW_ACCESS_public)
   16045              
   16046              $C$DW$2130      .dwtag  DW_TAG_member
   16047                      .dwattr $C$DW$2130, DW_AT_type(*$C$DW$T$93)
   16048                      .dwattr $C$DW$2130, DW_AT_name("cpuHandle")
   16049                      .dwattr $C$DW$2130, DW_AT_TI_symbol_name("_cpuHandle")
   16050                      .dwattr $C$DW$2130, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16051                      .dwattr $C$DW$2130, DW_AT_accessibility(DW_ACCESS_public)
   16052              
   16053              $C$DW$2131      .dwtag  DW_TAG_member
   16054                      .dwattr $C$DW$2131, DW_AT_type(*$C$DW$T$95)
   16055                      .dwattr $C$DW$2131, DW_AT_name("flashHandle")
   16056                      .dwattr $C$DW$2131, DW_AT_TI_symbol_name("_flashHandle")
   16057                      .dwattr $C$DW$2131, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   16058                      .dwattr $C$DW$2131, DW_AT_accessibility(DW_ACCESS_public)
   16059              
   16060              $C$DW$2132      .dwtag  DW_TAG_member
   16061                      .dwattr $C$DW$2132, DW_AT_type(*$C$DW$T$39)
   16062                      .dwattr $C$DW$2132, DW_AT_name("gpioHandle")
   16063                      .dwattr $C$DW$2132, DW_AT_TI_symbol_name("_gpioHandle")
   16064                      .dwattr $C$DW$2132, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   16065                      .dwattr $C$DW$2132, DW_AT_accessibility(DW_ACCESS_public)
   16066              
   16067              $C$DW$2133      .dwtag  DW_TAG_member
   16068                      .dwattr $C$DW$2133, DW_AT_type(*$C$DW$T$98)
   16069                      .dwattr $C$DW$2133, DW_AT_name("offsetHandle_I")
   16070                      .dwattr $C$DW$2133, DW_AT_TI_symbol_name("_offsetHandle_I")
   16071                      .dwattr $C$DW$2133, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   16072                      .dwattr $C$DW$2133, DW_AT_accessibility(DW_ACCESS_public)
   16073              
   16074              $C$DW$2134      .dwtag  DW_TAG_member
   16075                      .dwattr $C$DW$2134, DW_AT_type(*$C$DW$T$100)
   16076                      .dwattr $C$DW$2134, DW_AT_name("offset_I")
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{39F05D06-9873-4A8B-BE3D-C44CD24E8753} PAGE  304

   16077                      .dwattr $C$DW$2134, DW_AT_TI_symbol_name("_offset_I")
   16078                      .dwattr $C$DW$2134, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   16079                      .dwattr $C$DW$2134, DW_AT_accessibility(DW_ACCESS_public)
   16080              
   16081              $C$DW$2135      .dwtag  DW_TAG_member
   16082                      .dwattr $C$DW$2135, DW_AT_type(*$C$DW$T$98)
   16083                      .dwattr $C$DW$2135, DW_AT_name("offsetHandle_V")
   16084                      .dwattr $C$DW$2135, DW_AT_TI_symbol_name("_offsetHandle_V")
   16085                      .dwattr $C$DW$2135, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   16086                      .dwattr $C$DW$2135, DW_AT_accessibility(DW_ACCESS_public)
   16087              
   16088              $C$DW$2136      .dwtag  DW_TAG_member
   16089                      .dwattr $C$DW$2136, DW_AT_type(*$C$DW$T$100)
   16090                      .dwattr $C$DW$2136, DW_AT_name("offset_V")
   16091                      .dwattr $C$DW$2136, DW_AT_TI_symbol_name("_offset_V")
   16092                      .dwattr $C$DW$2136, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   16093                      .dwattr $C$DW$2136, DW_AT_accessibility(DW_ACCESS_public)
   16094              
   16095              $C$DW$2137      .dwtag  DW_TAG_member
   16096                      .dwattr $C$DW$2137, DW_AT_type(*$C$DW$T$102)
   16097                      .dwattr $C$DW$2137, DW_AT_name("oscHandle")
   16098                      .dwattr $C$DW$2137, DW_AT_TI_symbol_name("_oscHandle")
   16099                      .dwattr $C$DW$2137, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
   16100                      .dwattr $C$DW$2137, DW_AT_accessibility(DW_ACCESS_public)
   16101              
   16102              $C$DW$2138      .dwtag  DW_TAG_member
   16103                      .dwattr $C$DW$2138, DW_AT_type(*$C$DW$T$104)
   16104                      .dwattr $C$DW$2138, DW_AT_name("pieHandle")
   16105                      .dwattr $C$DW$2138, DW_AT_TI_symbol_name("_pieHandle")
   16106                      .dwattr $C$DW$2138, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
   16107                      .dwattr $C$DW$2138, DW_AT_accessibility(DW_ACCESS_public)
   16108              
   16109              $C$DW$2139      .dwtag  DW_TAG_member
   16110                      .dwattr $C$DW$2139, DW_AT_type(*$C$DW$T$106)
   16111                      .dwattr $C$DW$2139, DW_AT_name("pllHandle")
   16112                      .dwattr $C$DW$2139, DW_AT_TI_symbol_name("_pllHandle")
   16113                      .dwattr $C$DW$2139, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
   16114                      .dwattr $C$DW$2139, DW_AT_accessibility(DW_ACCESS_public)
   16115              
   16116              $C$DW$2140      .dwtag  DW_TAG_member
   16117                      .dwattr $C$DW$2140, DW_AT_type(*$C$DW$T$109)
   16118                      .dwattr $C$DW$2140, DW_AT_name("pwmHandle")
   16119                      .dwattr $C$DW$2140, DW_AT_TI_symbol_name("_pwmHandle")
   16120                      .dwattr $C$DW$2140, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
   16121                      .dwattr $C$DW$2140, DW_AT_accessibility(DW_ACCESS_public)
   16122              
   16123              $C$DW$2141      .dwtag  DW_TAG_member
   16124                      .dwattr $C$DW$2141, DW_AT_type(*$C$DW$T$109)
   16125                      .dwattr $C$DW$2141, DW_AT_name("pwmDacHandle")
   16126                      .dwattr $C$DW$2141, DW_AT_TI_symbol_name("_pwmDacHandle")
   16127                      .dwattr $C$DW$2141, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
   16128                      .dwattr $C$DW$2141, DW_AT_accessibility(DW_ACCESS_public)
   16129              
   16130              $C$DW$2142      .dwtag  DW_TAG_member
   16131                      .dwattr $C$DW$2142, DW_AT_type(*$C$DW$T$111)
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{39F05D06-9873-4A8B-BE3D-C44CD24E8753} PAGE  305

   16132                      .dwattr $C$DW$2142, DW_AT_name("pwrHandle")
   16133                      .dwattr $C$DW$2142, DW_AT_TI_symbol_name("_pwrHandle")
   16134                      .dwattr $C$DW$2142, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
   16135                      .dwattr $C$DW$2142, DW_AT_accessibility(DW_ACCESS_public)
   16136              
   16137              $C$DW$2143      .dwtag  DW_TAG_member
   16138                      .dwattr $C$DW$2143, DW_AT_type(*$C$DW$T$114)
   16139                      .dwattr $C$DW$2143, DW_AT_name("timerHandle")
   16140                      .dwattr $C$DW$2143, DW_AT_TI_symbol_name("_timerHandle")
   16141                      .dwattr $C$DW$2143, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
   16142                      .dwattr $C$DW$2143, DW_AT_accessibility(DW_ACCESS_public)
   16143              
   16144              $C$DW$2144      .dwtag  DW_TAG_member
   16145                      .dwattr $C$DW$2144, DW_AT_type(*$C$DW$T$116)
   16146                      .dwattr $C$DW$2144, DW_AT_name("wdogHandle")
   16147                      .dwattr $C$DW$2144, DW_AT_TI_symbol_name("_wdogHandle")
   16148                      .dwattr $C$DW$2144, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
   16149                      .dwattr $C$DW$2144, DW_AT_accessibility(DW_ACCESS_public)
   16150              
   16151              $C$DW$2145      .dwtag  DW_TAG_member
   16152                      .dwattr $C$DW$2145, DW_AT_type(*$C$DW$T$117)
   16153                      .dwattr $C$DW$2145, DW_AT_name("adcBias")
   16154                      .dwattr $C$DW$2145, DW_AT_TI_symbol_name("_adcBias")
   16155                      .dwattr $C$DW$2145, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
   16156                      .dwattr $C$DW$2145, DW_AT_accessibility(DW_ACCESS_public)
   16157              
