TMS320C2000 Assembler PC v22.6.0 Thu May 11 14:54:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{B4E7D00B-49F3-4D8E-BF74-563B7E51F3FF} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.0.LTS *
       3              ;* Date/Time created: Thu May 11 14:54:15 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/GIANT/GiantNEO/motorware/motorware_1_01_00_18/sw/drivers/pie/src/32b
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.0.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\GIANT\GiantNEO\motorware\motorware_1_01_00_18\sw\solutions\insta
      13              ;       C:\ti\ccs1200\ccs\tools\compiler\ti-cgt-c2000_22.6.0.LTS\bin\opt2000.exe C:\\Users\\GA5354\\AppData\\

    2645                      .dwattr $C$DW$285, DW_AT_name("PIE_SystemInterrupts_ILLEGAL")
    2646                      .dwattr $C$DW$285, DW_AT_const_value(0x13)
    2647              
    2648              $C$DW$286       .dwtag  DW_TAG_enumerator
    2649                      .dwattr $C$DW$286, DW_AT_name("PIE_SystemInterrupts_USER1")
    2650                      .dwattr $C$DW$286, DW_AT_const_value(0x14)
    2651              
    2652              $C$DW$287       .dwtag  DW_TAG_enumerator
    2653                      .dwattr $C$DW$287, DW_AT_name("PIE_SystemInterrupts_USER2")
    2654                      .dwattr $C$DW$287, DW_AT_const_value(0x15)
    2655              
    2656              $C$DW$288       .dwtag  DW_TAG_enumerator
    2657                      .dwattr $C$DW$288, DW_AT_name("PIE_SystemInterrupts_USER3")
    2658                      .dwattr $C$DW$288, DW_AT_const_value(0x16)
    2659              
    2660              $C$DW$289       .dwtag  DW_TAG_enumerator
    2661                      .dwattr $C$DW$289, DW_AT_name("PIE_SystemInterrupts_USER4")
    2662                      .dwattr $C$DW$289, DW_AT_const_value(0x17)
    2663              
    2664              $C$DW$290       .dwtag  DW_TAG_enumerator
    2665                      .dwattr $C$DW$290, DW_AT_name("PIE_SystemInterrupts_USER5")
    2666                      .dwattr $C$DW$290, DW_AT_const_value(0x18)
    2667              
    2668              $C$DW$291       .dwtag  DW_TAG_enumerator
    2669                      .dwattr $C$DW$291, DW_AT_name("PIE_SystemInterrupts_USER6")
    2670                      .dwattr $C$DW$291, DW_AT_const_value(0x19)
    2671              
    2672              $C$DW$292       .dwtag  DW_TAG_enumerator
    2673                      .dwattr $C$DW$292, DW_AT_name("PIE_SystemInterrupts_USER7")
    2674                      .dwattr $C$DW$292, DW_AT_const_value(0x1a)
    2675              
    2676              $C$DW$293       .dwtag  DW_TAG_enumerator
    2677                      .dwattr $C$DW$293, DW_AT_name("PIE_SystemInterrupts_USER8")
    2678                      .dwattr $C$DW$293, DW_AT_const_value(0x1b)
    2679              
    2680              $C$DW$294       .dwtag  DW_TAG_enumerator
    2681                      .dwattr $C$DW$294, DW_AT_name("PIE_SystemInterrupts_USER9")
    2682                      .dwattr $C$DW$294, DW_AT_const_value(0x1c)
    2683              
    2684              $C$DW$295       .dwtag  DW_TAG_enumerator
    2685                      .dwattr $C$DW$295, DW_AT_name("PIE_SystemInterrupts_USER10")
    2686                      .dwattr $C$DW$295, DW_AT_const_value(0x1d)
    2687              
    2688              $C$DW$296       .dwtag  DW_TAG_enumerator
    2689                      .dwattr $C$DW$296, DW_AT_name("PIE_SystemInterrupts_USER11")
    2690                      .dwattr $C$DW$296, DW_AT_const_value(0x1e)
    2691              
    2692              $C$DW$297       .dwtag  DW_TAG_enumerator
    2693                      .dwattr $C$DW$297, DW_AT_name("PIE_SystemInterrupts_USER12")
    2694                      .dwattr $C$DW$297, DW_AT_const_value(0x1f)
    2695              
    2696                      .dwendtag $C$DW$T$53
    2697              
    2698              $C$DW$T$54      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v22.6.0 Thu May 11 14:54:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{B4E7D00B-49F3-4D8E-BF74-563B7E51F3FF} PAGE   51

    2699                      .dwattr $C$DW$T$54, DW_AT_name("PIE_SystemInterrupts_e")
    2700                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    2701                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    2702              
    2703              
    2704              $C$DW$T$56      .dwtag  DW_TAG_enumeration_type
    2705                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x01)
    2706              $C$DW$298       .dwtag  DW_TAG_enumerator
    2707                      .dwattr $C$DW$298, DW_AT_name("PIE_ExtIntPolarity_FallingEdge")
    2708                      .dwattr $C$DW$298, DW_AT_const_value(0x00)
    2709              
    2710              $C$DW$299       .dwtag  DW_TAG_enumerator
    2711                      .dwattr $C$DW$299, DW_AT_name("PIE_ExtIntPolarity_RisingEdge")
    2712                      .dwattr $C$DW$299, DW_AT_const_value(0x04)
    2713              
    2714              $C$DW$300       .dwtag  DW_TAG_enumerator
    2715                      .dwattr $C$DW$300, DW_AT_name("PIE_ExtIntPolarity_RisingAndFallingEdge")
    2716                      .dwattr $C$DW$300, DW_AT_const_value(0x0c)
    2717              
    2718                      .dwendtag $C$DW$T$56
    2719              
    2720              $C$DW$T$57      .dwtag  DW_TAG_typedef
    2721                      .dwattr $C$DW$T$57, DW_AT_name("PIE_ExtIntPolarity_e")
    2722                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    2723                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    2724              
    2725              $C$DW$301       .dwtag  DW_TAG_TI_far_type
    2726                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$57)
    2727              
    2728              $C$DW$T$58      .dwtag  DW_TAG_const_type
    2729                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$301)
    2730              
    2731              
    2732              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2733                      .dwattr $C$DW$T$22, DW_AT_name("_PIE_IERIFR_t")
    2734                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    2735              $C$DW$302       .dwtag  DW_TAG_member
    2736                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$21)
    2737                      .dwattr $C$DW$302, DW_AT_name("IER")
    2738                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_IER")
    2739                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2740                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    2741              
    2742              $C$DW$303       .dwtag  DW_TAG_member
    2743                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$21)
    2744                      .dwattr $C$DW$303, DW_AT_name("IFR")
    2745                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_IFR")
    2746                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2747                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    2748              
    2749                      .dwendtag $C$DW$T$22
    2750              
    2751              $C$DW$T$23      .dwtag  DW_TAG_typedef
    2752                      .dwattr $C$DW$T$23, DW_AT_name("PIE_IERIFR_t")
    2753                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v22.6.0 Thu May 11 14:54:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{B4E7D00B-49F3-4D8E-BF74-563B7E51F3FF} PAGE   52

    2754                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    2755              
    2756              $C$DW$304       .dwtag  DW_TAG_TI_far_type
    2757                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$23)
    2758              
    2759              $C$DW$T$24      .dwtag  DW_TAG_volatile_type
    2760                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$304)
    2761              
    2762              
    2763              $C$DW$T$25      .dwtag  DW_TAG_array_type
    2764                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    2765                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    2766                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x18)
    2767              $C$DW$305       .dwtag  DW_TAG_subrange_type
    2768                      .dwattr $C$DW$305, DW_AT_upper_bound(0x0b)
    2769              
    2770                      .dwendtag $C$DW$T$25
    2771              
    2772              
    2773              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2774                      .dwattr $C$DW$T$34, DW_AT_name("_PIE_Obj_")
    2775                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x639c)
    2776              $C$DW$306       .dwtag  DW_TAG_member
    2777                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$21)
    2778                      .dwattr $C$DW$306, DW_AT_name("PIECTRL")
    2779                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_PIECTRL")
    2780                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2781                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    2782              
    2783              $C$DW$307       .dwtag  DW_TAG_member
    2784                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$21)
    2785                      .dwattr $C$DW$307, DW_AT_name("PIEACK")
    2786                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_PIEACK")
    2787                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2788                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    2789              
    2790              $C$DW$308       .dwtag  DW_TAG_member
    2791                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$25)
    2792                      .dwattr $C$DW$308, DW_AT_name("PIEIER_PIEIFR")
    2793                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_PIEIER_PIEIFR")
    2794                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2795                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    2796              
    2797              $C$DW$309       .dwtag  DW_TAG_member
    2798                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$26)
    2799                      .dwattr $C$DW$309, DW_AT_name("rsvd_1")
    2800                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_rsvd_1")
    2801                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2802                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    2803              
    2804              $C$DW$310       .dwtag  DW_TAG_member
    2805                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$30)
    2806                      .dwattr $C$DW$310, DW_AT_name("Reset")
    2807                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_Reset")
    2808                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
TMS320C2000 Assembler PC v22.6.0 Thu May 11 14:54:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{B4E7D00B-49F3-4D8E-BF74-563B7E51F3FF} PAGE   53

    2809                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    2810              
    2811              $C$DW$311       .dwtag  DW_TAG_member
    2812                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$30)
    2813                      .dwattr $C$DW$311, DW_AT_name("INT1")
    2814                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_INT1")
    2815                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2816                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    2817              
    2818              $C$DW$312       .dwtag  DW_TAG_member
    2819                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$30)
    2820                      .dwattr $C$DW$312, DW_AT_name("INT2")
    2821                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_INT2")
    2822                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2823                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    2824              
    2825              $C$DW$313       .dwtag  DW_TAG_member
    2826                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$30)
    2827                      .dwattr $C$DW$313, DW_AT_name("INT3")
    2828                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_INT3")
    2829                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2830                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    2831              
    2832              $C$DW$314       .dwtag  DW_TAG_member
    2833                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$30)
    2834                      .dwattr $C$DW$314, DW_AT_name("INT4")
    2835                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_INT4")
    2836                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2837                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    2838              
    2839              $C$DW$315       .dwtag  DW_TAG_member
    2840                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$30)
    2841                      .dwattr $C$DW$315, DW_AT_name("INT5")
    2842                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_INT5")
    2843                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2844                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    2845              
    2846              $C$DW$316       .dwtag  DW_TAG_member
    2847                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$30)
    2848                      .dwattr $C$DW$316, DW_AT_name("INT6")
    2849                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_INT6")
    2850                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2851                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    2852              
    2853              $C$DW$317       .dwtag  DW_TAG_member
    2854                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$30)
    2855                      .dwattr $C$DW$317, DW_AT_name("INT7")
    2856                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_INT7")
    2857                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2858                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    2859              
    2860              $C$DW$318       .dwtag  DW_TAG_member
    2861                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$30)
    2862                      .dwattr $C$DW$318, DW_AT_name("INT8")
    2863                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_INT8")
TMS320C2000 Assembler PC v22.6.0 Thu May 11 14:54:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{B4E7D00B-49F3-4D8E-BF74-563B7E51F3FF} PAGE   54

    2864                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2865                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    2866              
    2867              $C$DW$319       .dwtag  DW_TAG_member
    2868                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$30)
    2869                      .dwattr $C$DW$319, DW_AT_name("INT9")
    2870                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_INT9")
    2871                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2872                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    2873              
    2874              $C$DW$320       .dwtag  DW_TAG_member
    2875                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$30)
    2876                      .dwattr $C$DW$320, DW_AT_name("INT10")
    2877                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_INT10")
    2878                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2879                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    2880              
    2881              $C$DW$321       .dwtag  DW_TAG_member
    2882                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$30)
    2883                      .dwattr $C$DW$321, DW_AT_name("INT11")
    2884                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_INT11")
    2885                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2886                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    2887              
    2888              $C$DW$322       .dwtag  DW_TAG_member
    2889                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$30)
    2890                      .dwattr $C$DW$322, DW_AT_name("INT12")
    2891                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_INT12")
    2892                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2893                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    2894              
    2895              $C$DW$323       .dwtag  DW_TAG_member
    2896                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$30)
    2897                      .dwattr $C$DW$323, DW_AT_name("TINT1")
    2898                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_TINT1")
    2899                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2900                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    2901              
    2902              $C$DW$324       .dwtag  DW_TAG_member
    2903                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$30)
    2904                      .dwattr $C$DW$324, DW_AT_name("TINT2")
    2905                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_TINT2")
    2906                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2907                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    2908              
    2909              $C$DW$325       .dwtag  DW_TAG_member
    2910                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$30)
    2911                      .dwattr $C$DW$325, DW_AT_name("DATALOG")
    2912                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_DATALOG")
    2913                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2914                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    2915              
    2916              $C$DW$326       .dwtag  DW_TAG_member
    2917                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$30)
    2918                      .dwattr $C$DW$326, DW_AT_name("RTOSINT")
TMS320C2000 Assembler PC v22.6.0 Thu May 11 14:54:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{B4E7D00B-49F3-4D8E-BF74-563B7E51F3FF} PAGE   55

    2919                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_RTOSINT")
    2920                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2921                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    2922              
    2923              $C$DW$327       .dwtag  DW_TAG_member
    2924                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$30)
    2925                      .dwattr $C$DW$327, DW_AT_name("EMUINT")
    2926                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_EMUINT")
    2927                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2928                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    2929              
    2930              $C$DW$328       .dwtag  DW_TAG_member
    2931                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$30)
    2932                      .dwattr $C$DW$328, DW_AT_name("NMI")
    2933                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_NMI")
    2934                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2935                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    2936              
    2937              $C$DW$329       .dwtag  DW_TAG_member
    2938                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$30)
    2939                      .dwattr $C$DW$329, DW_AT_name("ILLEGAL")
    2940                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_ILLEGAL")
    2941                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2942                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    2943              
    2944              $C$DW$330       .dwtag  DW_TAG_member
    2945                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$30)
    2946                      .dwattr $C$DW$330, DW_AT_name("USER1")
    2947                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_USER1")
    2948                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2949                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    2950              
    2951              $C$DW$331       .dwtag  DW_TAG_member
    2952                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$30)
    2953                      .dwattr $C$DW$331, DW_AT_name("USER2")
    2954                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_USER2")
    2955                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    2956                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    2957              
    2958              $C$DW$332       .dwtag  DW_TAG_member
    2959                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$30)
    2960                      .dwattr $C$DW$332, DW_AT_name("USER3")
    2961                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_USER3")
    2962                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2963                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    2964              
    2965              $C$DW$333       .dwtag  DW_TAG_member
    2966                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$30)
    2967                      .dwattr $C$DW$333, DW_AT_name("USER4")
    2968                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_USER4")
    2969                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    2970                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    2971              
    2972              $C$DW$334       .dwtag  DW_TAG_member
    2973                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$30)
TMS320C2000 Assembler PC v22.6.0 Thu May 11 14:54:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{B4E7D00B-49F3-4D8E-BF74-563B7E51F3FF} PAGE   56

    2974                      .dwattr $C$DW$334, DW_AT_name("USER5")
    2975                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_USER5")
    2976                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2977                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    2978              
    2979              $C$DW$335       .dwtag  DW_TAG_member
    2980                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$30)
    2981                      .dwattr $C$DW$335, DW_AT_name("USER6")
    2982                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_USER6")
    2983                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    2984                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    2985              
    2986              $C$DW$336       .dwtag  DW_TAG_member
    2987                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$30)
    2988                      .dwattr $C$DW$336, DW_AT_name("USER7")
    2989                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_USER7")
    2990                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2991                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    2992              
    2993              $C$DW$337       .dwtag  DW_TAG_member
    2994                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$30)
    2995                      .dwattr $C$DW$337, DW_AT_name("USER8")
    2996                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_USER8")
    2997                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    2998                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    2999              
    3000              $C$DW$338       .dwtag  DW_TAG_member
    3001                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$30)
    3002                      .dwattr $C$DW$338, DW_AT_name("USER9")
    3003                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_USER9")
    3004                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3005                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3006              
    3007              $C$DW$339       .dwtag  DW_TAG_member
    3008                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$30)
    3009                      .dwattr $C$DW$339, DW_AT_name("USER10")
    3010                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_USER10")
    3011                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    3012                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3013              
    3014              $C$DW$340       .dwtag  DW_TAG_member
    3015                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$30)
    3016                      .dwattr $C$DW$340, DW_AT_name("USER11")
    3017                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_USER11")
    3018                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3019                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3020              
    3021              $C$DW$341       .dwtag  DW_TAG_member
    3022                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$30)
    3023                      .dwattr $C$DW$341, DW_AT_name("USER12")
    3024                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_USER12")
    3025                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3026                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3027              
    3028              $C$DW$342       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Thu May 11 14:54:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{B4E7D00B-49F3-4D8E-BF74-563B7E51F3FF} PAGE   57

    3029                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$30)
    3030                      .dwattr $C$DW$342, DW_AT_name("ADCINT1_HP")
    3031                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_ADCINT1_HP")
    3032                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3033                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3034              
    3035              $C$DW$343       .dwtag  DW_TAG_member
    3036                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$30)
    3037                      .dwattr $C$DW$343, DW_AT_name("ADCINT2_HP")
    3038                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_ADCINT2_HP")
    3039                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3040                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3041              
    3042              $C$DW$344       .dwtag  DW_TAG_member
    3043                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$30)
    3044                      .dwattr $C$DW$344, DW_AT_name("rsvd1_3")
    3045                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_rsvd1_3")
    3046                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    3047                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3048              
    3049              $C$DW$345       .dwtag  DW_TAG_member
    3050                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$30)
    3051                      .dwattr $C$DW$345, DW_AT_name("XINT1")
    3052                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_XINT1")
    3053                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
    3054                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3055              
    3056              $C$DW$346       .dwtag  DW_TAG_member
    3057                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$30)
    3058                      .dwattr $C$DW$346, DW_AT_name("XINT2")
    3059                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_XINT2")
    3060                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    3061                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3062              
    3063              $C$DW$347       .dwtag  DW_TAG_member
    3064                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$30)
    3065                      .dwattr $C$DW$347, DW_AT_name("ADCINT9")
    3066                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_ADCINT9")
    3067                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
    3068                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3069              
    3070              $C$DW$348       .dwtag  DW_TAG_member
    3071                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$30)
    3072                      .dwattr $C$DW$348, DW_AT_name("TINT0")
    3073                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_TINT0")
    3074                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3075                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3076              
    3077              $C$DW$349       .dwtag  DW_TAG_member
    3078                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$30)
    3079                      .dwattr $C$DW$349, DW_AT_name("WAKEINT")
    3080                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_WAKEINT")
    3081                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    3082                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3083              
TMS320C2000 Assembler PC v22.6.0 Thu May 11 14:54:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{B4E7D00B-49F3-4D8E-BF74-563B7E51F3FF} PAGE   58

    3084              $C$DW$350       .dwtag  DW_TAG_member
    3085                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$30)
    3086                      .dwattr $C$DW$350, DW_AT_name("EPWM1_TZINT")
    3087                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_EPWM1_TZINT")
    3088                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    3089                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3090              
    3091              $C$DW$351       .dwtag  DW_TAG_member
    3092                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$30)
    3093                      .dwattr $C$DW$351, DW_AT_name("EPWM2_TZINT")
    3094                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_EPWM2_TZINT")
    3095                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
    3096                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3097              
    3098              $C$DW$352       .dwtag  DW_TAG_member
    3099                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$30)
    3100                      .dwattr $C$DW$352, DW_AT_name("EPWM3_TZINT")
    3101                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_EPWM3_TZINT")
    3102                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    3103                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3104              
    3105              $C$DW$353       .dwtag  DW_TAG_member
    3106                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$30)
    3107                      .dwattr $C$DW$353, DW_AT_name("EPWM4_TZINT")
    3108                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_EPWM4_TZINT")
    3109                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    3110                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3111              
    3112              $C$DW$354       .dwtag  DW_TAG_member
    3113                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$30)
    3114                      .dwattr $C$DW$354, DW_AT_name("EPWM5_TZINT")
    3115                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_EPWM5_TZINT")
    3116                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3117                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3118              
    3119              $C$DW$355       .dwtag  DW_TAG_member
    3120                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$30)
    3121                      .dwattr $C$DW$355, DW_AT_name("EPWM6_TZINT")
    3122                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_EPWM6_TZINT")
    3123                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3124                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3125              
    3126              $C$DW$356       .dwtag  DW_TAG_member
    3127                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$30)
    3128                      .dwattr $C$DW$356, DW_AT_name("EPWM7_TZINT")
    3129                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_EPWM7_TZINT")
    3130                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    3131                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3132              
    3133              $C$DW$357       .dwtag  DW_TAG_member
    3134                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$30)
    3135                      .dwattr $C$DW$357, DW_AT_name("EPWM8_TZINT")
    3136                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_EPWM8_TZINT")
    3137                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
    3138                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Thu May 11 14:54:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{B4E7D00B-49F3-4D8E-BF74-563B7E51F3FF} PAGE   59

    3139              
    3140              $C$DW$358       .dwtag  DW_TAG_member
    3141                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$30)
    3142                      .dwattr $C$DW$358, DW_AT_name("EPWM1_INT")
    3143                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_EPWM1_INT")
    3144                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    3145                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3146              
    3147              $C$DW$359       .dwtag  DW_TAG_member
    3148                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$30)
    3149                      .dwattr $C$DW$359, DW_AT_name("EPWM2_INT")
    3150                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_EPWM2_INT")
    3151                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    3152                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3153              
    3154              $C$DW$360       .dwtag  DW_TAG_member
    3155                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$30)
    3156                      .dwattr $C$DW$360, DW_AT_name("EPWM3_INT")
    3157                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_EPWM3_INT")
    3158                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3159                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3160              
    3161              $C$DW$361       .dwtag  DW_TAG_member
    3162                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$30)
    3163                      .dwattr $C$DW$361, DW_AT_name("EPWM4_INT")
    3164                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_EPWM4_INT")
    3165                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
    3166                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3167              
    3168              $C$DW$362       .dwtag  DW_TAG_member
    3169                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$30)
    3170                      .dwattr $C$DW$362, DW_AT_name("EPWM5_INT")
    3171                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_EPWM5_INT")
    3172                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    3173                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3174              
    3175              $C$DW$363       .dwtag  DW_TAG_member
    3176                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$30)
    3177                      .dwattr $C$DW$363, DW_AT_name("EPWM6_INT")
    3178                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_EPWM6_INT")
    3179                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    3180                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3181              
    3182              $C$DW$364       .dwtag  DW_TAG_member
    3183                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$30)
    3184                      .dwattr $C$DW$364, DW_AT_name("EPWM7_INT")
    3185                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_EPWM7_INT")
    3186                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    3187                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3188              
    3189              $C$DW$365       .dwtag  DW_TAG_member
    3190                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$30)
    3191                      .dwattr $C$DW$365, DW_AT_name("EPWM8_INT")
    3192                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_EPWM8_INT")
    3193                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x8e]
TMS320C2000 Assembler PC v22.6.0 Thu May 11 14:54:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{B4E7D00B-49F3-4D8E-BF74-563B7E51F3FF} PAGE   60

    3194                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3195              
    3196              $C$DW$366       .dwtag  DW_TAG_member
    3197                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$30)
    3198                      .dwattr $C$DW$366, DW_AT_name("ECAP1_INT")
    3199                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_ECAP1_INT")
    3200                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    3201                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3202              
    3203              $C$DW$367       .dwtag  DW_TAG_member
    3204                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$30)
    3205                      .dwattr $C$DW$367, DW_AT_name("ECAP2_INT")
    3206                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_ECAP2_INT")
    3207                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3208                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3209              
    3210              $C$DW$368       .dwtag  DW_TAG_member
    3211                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$30)
    3212                      .dwattr $C$DW$368, DW_AT_name("ECAP3_INT")
    3213                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_ECAP3_INT")
    3214                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    3215                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3216              
    3217              $C$DW$369       .dwtag  DW_TAG_member
    3218                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$30)
    3219                      .dwattr $C$DW$369, DW_AT_name("rsvd4_4")
    3220                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_rsvd4_4")
    3221                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
    3222                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3223              
    3224              $C$DW$370       .dwtag  DW_TAG_member
    3225                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$30)
    3226                      .dwattr $C$DW$370, DW_AT_name("rsvd4_5")
    3227                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_rsvd4_5")
    3228                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    3229                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3230              
    3231              $C$DW$371       .dwtag  DW_TAG_member
    3232                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$30)
    3233                      .dwattr $C$DW$371, DW_AT_name("rsvd4_6")
    3234                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_rsvd4_6")
    3235                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    3236                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3237              
    3238              $C$DW$372       .dwtag  DW_TAG_member
    3239                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$30)
    3240                      .dwattr $C$DW$372, DW_AT_name("HRCAP1_INT")
    3241                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_HRCAP1_INT")
    3242                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3243                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3244              
    3245              $C$DW$373       .dwtag  DW_TAG_member
    3246                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$30)
    3247                      .dwattr $C$DW$373, DW_AT_name("HRCAP2_INT")
    3248                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_HRCAP2_INT")
TMS320C2000 Assembler PC v22.6.0 Thu May 11 14:54:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{B4E7D00B-49F3-4D8E-BF74-563B7E51F3FF} PAGE   61

    3249                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3250                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3251              
    3252              $C$DW$374       .dwtag  DW_TAG_member
    3253                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$30)
    3254                      .dwattr $C$DW$374, DW_AT_name("EQEP1_INT")
    3255                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_EQEP1_INT")
    3256                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3257                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3258              
    3259              $C$DW$375       .dwtag  DW_TAG_member
    3260                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$30)
    3261                      .dwattr $C$DW$375, DW_AT_name("EQEP2_INT")
    3262                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_EQEP2_INT")
    3263                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3264                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3265              
    3266              $C$DW$376       .dwtag  DW_TAG_member
    3267                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$30)
    3268                      .dwattr $C$DW$376, DW_AT_name("rsvd5_3")
    3269                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_rsvd5_3")
    3270                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3271                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3272              
    3273              $C$DW$377       .dwtag  DW_TAG_member
    3274                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$30)
    3275                      .dwattr $C$DW$377, DW_AT_name("HRCAP3_INT")
    3276                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_HRCAP3_INT")
    3277                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3278                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3279              
    3280              $C$DW$378       .dwtag  DW_TAG_member
    3281                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$30)
    3282                      .dwattr $C$DW$378, DW_AT_name("HRCAP4_INT")
    3283                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_HRCAP4_INT")
    3284                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3285                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3286              
    3287              $C$DW$379       .dwtag  DW_TAG_member
    3288                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$30)
    3289                      .dwattr $C$DW$379, DW_AT_name("rsvd5_6")
    3290                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_rsvd5_6")
    3291                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3292                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3293              
    3294              $C$DW$380       .dwtag  DW_TAG_member
    3295                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$30)
    3296                      .dwattr $C$DW$380, DW_AT_name("rsvd5_7")
    3297                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_rsvd5_7")
    3298                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    3299                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3300              
    3301              $C$DW$381       .dwtag  DW_TAG_member
    3302                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$30)
    3303                      .dwattr $C$DW$381, DW_AT_name("USB0_INT")
TMS320C2000 Assembler PC v22.6.0 Thu May 11 14:54:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{B4E7D00B-49F3-4D8E-BF74-563B7E51F3FF} PAGE   62

    3304                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_USB0_INT")
    3305                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3306                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3307              
    3308              $C$DW$382       .dwtag  DW_TAG_member
    3309                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$30)
    3310                      .dwattr $C$DW$382, DW_AT_name("SPIRXINTA")
    3311                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_SPIRXINTA")
    3312                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    3313                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3314              
    3315              $C$DW$383       .dwtag  DW_TAG_member
    3316                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$30)
    3317                      .dwattr $C$DW$383, DW_AT_name("SPITXINTA")
    3318                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_SPITXINTA")
    3319                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3320                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3321              
    3322              $C$DW$384       .dwtag  DW_TAG_member
    3323                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$30)
    3324                      .dwattr $C$DW$384, DW_AT_name("SPIRXINTB")
    3325                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_SPIRXINTB")
    3326                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
    3327                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3328              
    3329              $C$DW$385       .dwtag  DW_TAG_member
    3330                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$30)
    3331                      .dwattr $C$DW$385, DW_AT_name("SPITXINTB")
    3332                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_SPITXINTB")
    3333                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3334                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3335              
    3336              $C$DW$386       .dwtag  DW_TAG_member
    3337                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$30)
    3338                      .dwattr $C$DW$386, DW_AT_name("MCBSPARX")
    3339                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_MCBSPARX")
    3340                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    3341                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3342              
    3343              $C$DW$387       .dwtag  DW_TAG_member
    3344                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$30)
    3345                      .dwattr $C$DW$387, DW_AT_name("MCBSPATX")
    3346                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_MCBSPATX")
    3347                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3348                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3349              
    3350              $C$DW$388       .dwtag  DW_TAG_member
    3351                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$30)
    3352                      .dwattr $C$DW$388, DW_AT_name("rsvd6_7")
    3353                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_rsvd6_7")
    3354                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3355                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3356              
    3357              $C$DW$389       .dwtag  DW_TAG_member
    3358                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$30)
TMS320C2000 Assembler PC v22.6.0 Thu May 11 14:54:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{B4E7D00B-49F3-4D8E-BF74-563B7E51F3FF} PAGE   63

    3359                      .dwattr $C$DW$389, DW_AT_name("rsvd6_8")
    3360                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_rsvd6_8")
    3361                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0xbe]
    3362                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3363              
    3364              $C$DW$390       .dwtag  DW_TAG_member
    3365                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$30)
    3366                      .dwattr $C$DW$390, DW_AT_name("DMACH1_INT")
    3367                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_DMACH1_INT")
    3368                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3369                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3370              
    3371              $C$DW$391       .dwtag  DW_TAG_member
    3372                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$30)
    3373                      .dwattr $C$DW$391, DW_AT_name("DMACH2_INT")
    3374                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_DMACH2_INT")
    3375                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0xc2]
    3376                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3377              
    3378              $C$DW$392       .dwtag  DW_TAG_member
    3379                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$30)
    3380                      .dwattr $C$DW$392, DW_AT_name("DMACH3_INT")
    3381                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_DMACH3_INT")
    3382                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3383                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3384              
    3385              $C$DW$393       .dwtag  DW_TAG_member
    3386                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$30)
    3387                      .dwattr $C$DW$393, DW_AT_name("DMACH4_INT")
    3388                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_DMACH4_INT")
    3389                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3390                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3391              
    3392              $C$DW$394       .dwtag  DW_TAG_member
    3393                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$30)
    3394                      .dwattr $C$DW$394, DW_AT_name("DMACH5_INT")
    3395                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_DMACH5_INT")
    3396                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3397                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3398              
    3399              $C$DW$395       .dwtag  DW_TAG_member
    3400                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$30)
    3401                      .dwattr $C$DW$395, DW_AT_name("DMACH6_INT")
    3402                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_DMACH6_INT")
    3403                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3404                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3405              
    3406              $C$DW$396       .dwtag  DW_TAG_member
    3407                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$30)
    3408                      .dwattr $C$DW$396, DW_AT_name("rsvd7_7")
    3409                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_rsvd7_7")
    3410                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3411                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3412              
    3413              $C$DW$397       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Thu May 11 14:54:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{B4E7D00B-49F3-4D8E-BF74-563B7E51F3FF} PAGE   64

    3414                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$30)
    3415                      .dwattr $C$DW$397, DW_AT_name("rsvd7_8")
    3416                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_rsvd7_8")
    3417                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3418                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3419              
    3420              $C$DW$398       .dwtag  DW_TAG_member
    3421                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$30)
    3422                      .dwattr $C$DW$398, DW_AT_name("I2CINT1A")
    3423                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_I2CINT1A")
    3424                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3425                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3426              
    3427              $C$DW$399       .dwtag  DW_TAG_member
    3428                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$30)
    3429                      .dwattr $C$DW$399, DW_AT_name("I2CINT2A")
    3430                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_I2CINT2A")
    3431                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3432                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3433              
    3434              $C$DW$400       .dwtag  DW_TAG_member
    3435                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$30)
    3436                      .dwattr $C$DW$400, DW_AT_name("rsvd8_3")
    3437                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_rsvd8_3")
    3438                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3439                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3440              
    3441              $C$DW$401       .dwtag  DW_TAG_member
    3442                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$30)
    3443                      .dwattr $C$DW$401, DW_AT_name("rsvd8_4")
    3444                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_rsvd8_4")
    3445                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3446                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3447              
    3448              $C$DW$402       .dwtag  DW_TAG_member
    3449                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$30)
    3450                      .dwattr $C$DW$402, DW_AT_name("rsvd8_5")
    3451                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_rsvd8_5")
    3452                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3453                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3454              
    3455              $C$DW$403       .dwtag  DW_TAG_member
    3456                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$30)
    3457                      .dwattr $C$DW$403, DW_AT_name("rsvd8_6")
    3458                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_rsvd8_6")
    3459                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3460                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3461              
    3462              $C$DW$404       .dwtag  DW_TAG_member
    3463                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$30)
    3464                      .dwattr $C$DW$404, DW_AT_name("rsvd8_7")
    3465                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_rsvd8_7")
    3466                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    3467                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3468              
TMS320C2000 Assembler PC v22.6.0 Thu May 11 14:54:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{B4E7D00B-49F3-4D8E-BF74-563B7E51F3FF} PAGE   65

    3469              $C$DW$405       .dwtag  DW_TAG_member
    3470                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$30)
    3471                      .dwattr $C$DW$405, DW_AT_name("rsvd8_8")
    3472                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_rsvd8_8")
    3473                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    3474                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3475              
    3476              $C$DW$406       .dwtag  DW_TAG_member
    3477                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$30)
    3478                      .dwattr $C$DW$406, DW_AT_name("SCIRXINTA")
    3479                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_SCIRXINTA")
    3480                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    3481                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3482              
    3483              $C$DW$407       .dwtag  DW_TAG_member
    3484                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$30)
    3485                      .dwattr $C$DW$407, DW_AT_name("SCITXINTA")
    3486                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_SCITXINTA")
    3487                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    3488                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    3489              
    3490              $C$DW$408       .dwtag  DW_TAG_member
    3491                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$30)
    3492                      .dwattr $C$DW$408, DW_AT_name("SCIRXINTB")
    3493                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_SCIRXINTB")
    3494                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    3495                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3496              
    3497              $C$DW$409       .dwtag  DW_TAG_member
    3498                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$30)
    3499                      .dwattr $C$DW$409, DW_AT_name("SCITXINTB")
    3500                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_SCITXINTB")
    3501                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    3502                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3503              
    3504              $C$DW$410       .dwtag  DW_TAG_member
    3505                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$30)
    3506                      .dwattr $C$DW$410, DW_AT_name("ECAN0INT")
    3507                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_ECAN0INT")
    3508                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    3509                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3510              
    3511              $C$DW$411       .dwtag  DW_TAG_member
    3512                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$30)
    3513                      .dwattr $C$DW$411, DW_AT_name("ECAN1INT")
    3514                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_ECAN1INT")
    3515                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    3516                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3517              
    3518              $C$DW$412       .dwtag  DW_TAG_member
    3519                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$30)
    3520                      .dwattr $C$DW$412, DW_AT_name("rsvd9_7")
    3521                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_rsvd9_7")
    3522                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3523                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Thu May 11 14:54:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{B4E7D00B-49F3-4D8E-BF74-563B7E51F3FF} PAGE   66

    3524              
    3525              $C$DW$413       .dwtag  DW_TAG_member
    3526                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$30)
    3527                      .dwattr $C$DW$413, DW_AT_name("rsvd9_8")
    3528                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_rsvd9_8")
    3529                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3530                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3531              
    3532              $C$DW$414       .dwtag  DW_TAG_member
    3533                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$30)
    3534                      .dwattr $C$DW$414, DW_AT_name("ADCINT1")
    3535                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_ADCINT1")
    3536                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3537                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3538              
    3539              $C$DW$415       .dwtag  DW_TAG_member
    3540                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$30)
    3541                      .dwattr $C$DW$415, DW_AT_name("ADCINT2")
    3542                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_ADCINT2")
    3543                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3544                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3545              
    3546              $C$DW$416       .dwtag  DW_TAG_member
    3547                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$30)
    3548                      .dwattr $C$DW$416, DW_AT_name("ADCINT3")
    3549                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_ADCINT3")
    3550                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3551                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3552              
    3553              $C$DW$417       .dwtag  DW_TAG_member
    3554                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$30)
    3555                      .dwattr $C$DW$417, DW_AT_name("ADCINT4")
    3556                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_ADCINT4")
    3557                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    3558                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3559              
    3560              $C$DW$418       .dwtag  DW_TAG_member
    3561                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$30)
    3562                      .dwattr $C$DW$418, DW_AT_name("ADCINT5")
    3563                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_ADCINT5")
    3564                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    3565                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3566              
    3567              $C$DW$419       .dwtag  DW_TAG_member
    3568                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$30)
    3569                      .dwattr $C$DW$419, DW_AT_name("ADCINT6")
    3570                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_ADCINT6")
    3571                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    3572                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3573              
    3574              $C$DW$420       .dwtag  DW_TAG_member
    3575                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$30)
    3576                      .dwattr $C$DW$420, DW_AT_name("ADCINT7")
    3577                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_ADCINT7")
    3578                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
TMS320C2000 Assembler PC v22.6.0 Thu May 11 14:54:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{B4E7D00B-49F3-4D8E-BF74-563B7E51F3FF} PAGE   67

    3579                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3580              
    3581              $C$DW$421       .dwtag  DW_TAG_member
    3582                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$30)
    3583                      .dwattr $C$DW$421, DW_AT_name("ADCINT8")
    3584                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_ADCINT8")
    3585                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    3586                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3587              
    3588              $C$DW$422       .dwtag  DW_TAG_member
    3589                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$30)
    3590                      .dwattr $C$DW$422, DW_AT_name("CLAINT1")
    3591                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_CLAINT1")
    3592                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    3593                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3594              
    3595              $C$DW$423       .dwtag  DW_TAG_member
    3596                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$30)
    3597                      .dwattr $C$DW$423, DW_AT_name("CLAINT2")
    3598                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_CLAINT2")
    3599                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    3600                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3601              
    3602              $C$DW$424       .dwtag  DW_TAG_member
    3603                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$30)
    3604                      .dwattr $C$DW$424, DW_AT_name("CLAINT3")
    3605                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_CLAINT3")
    3606                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    3607                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3608              
    3609              $C$DW$425       .dwtag  DW_TAG_member
    3610                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$30)
    3611                      .dwattr $C$DW$425, DW_AT_name("CLAINT4")
    3612                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_CLAINT4")
    3613                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    3614                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    3615              
    3616              $C$DW$426       .dwtag  DW_TAG_member
    3617                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$30)
    3618                      .dwattr $C$DW$426, DW_AT_name("CLAINT5")
    3619                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_CLAINT5")
    3620                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    3621                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    3622              
    3623              $C$DW$427       .dwtag  DW_TAG_member
    3624                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$30)
    3625                      .dwattr $C$DW$427, DW_AT_name("CLAINT6")
    3626                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_CLAINT6")
    3627                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    3628                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    3629              
    3630              $C$DW$428       .dwtag  DW_TAG_member
    3631                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$30)
    3632                      .dwattr $C$DW$428, DW_AT_name("CLAINT7")
    3633                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_CLAINT7")
TMS320C2000 Assembler PC v22.6.0 Thu May 11 14:54:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{B4E7D00B-49F3-4D8E-BF74-563B7E51F3FF} PAGE   68

    3634                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
    3635                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    3636              
    3637              $C$DW$429       .dwtag  DW_TAG_member
    3638                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$30)
    3639                      .dwattr $C$DW$429, DW_AT_name("CLAINT8")
    3640                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_CLAINT8")
    3641                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x10e]
    3642                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    3643              
    3644              $C$DW$430       .dwtag  DW_TAG_member
    3645                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$30)
    3646                      .dwattr $C$DW$430, DW_AT_name("XINT3")
    3647                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_XINT3")
    3648                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    3649                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    3650              
    3651              $C$DW$431       .dwtag  DW_TAG_member
    3652                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$30)
    3653                      .dwattr $C$DW$431, DW_AT_name("rsvd12_2")
    3654                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_rsvd12_2")
    3655                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x112]
    3656                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    3657              
    3658              $C$DW$432       .dwtag  DW_TAG_member
    3659                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$30)
    3660                      .dwattr $C$DW$432, DW_AT_name("rsvd12_3")
    3661                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_rsvd12_3")
    3662                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    3663                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    3664              
    3665              $C$DW$433       .dwtag  DW_TAG_member
    3666                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$30)
    3667                      .dwattr $C$DW$433, DW_AT_name("rsvd12_4")
    3668                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_rsvd12_4")
    3669                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x116]
    3670                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    3671              
    3672              $C$DW$434       .dwtag  DW_TAG_member
    3673                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$30)
    3674                      .dwattr $C$DW$434, DW_AT_name("rsvd12_5")
    3675                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_rsvd12_5")
    3676                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
    3677                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    3678              
    3679              $C$DW$435       .dwtag  DW_TAG_member
    3680                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$30)
    3681                      .dwattr $C$DW$435, DW_AT_name("rsvd12_6")
    3682                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_rsvd12_6")
    3683                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x11a]
    3684                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    3685              
    3686              $C$DW$436       .dwtag  DW_TAG_member
    3687                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$30)
    3688                      .dwattr $C$DW$436, DW_AT_name("CLAINT_LVF")
TMS320C2000 Assembler PC v22.6.0 Thu May 11 14:54:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{B4E7D00B-49F3-4D8E-BF74-563B7E51F3FF} PAGE   69

    3689                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_CLAINT_LVF")
    3690                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
    3691                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    3692              
    3693              $C$DW$437       .dwtag  DW_TAG_member
    3694                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$30)
    3695                      .dwattr $C$DW$437, DW_AT_name("CLAINT_LUF")
    3696                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_CLAINT_LUF")
    3697                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x11e]
    3698                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    3699              
    3700              $C$DW$438       .dwtag  DW_TAG_member
    3701                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$31)
    3702                      .dwattr $C$DW$438, DW_AT_name("rsvd13")
    3703                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_rsvd13")
    3704                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    3705                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    3706              
    3707              $C$DW$439       .dwtag  DW_TAG_member
    3708                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$32)
    3709                      .dwattr $C$DW$439, DW_AT_name("XINTnCR")
    3710                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_XINTnCR")
    3711                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x6390]
    3712                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    3713              
    3714              $C$DW$440       .dwtag  DW_TAG_member
    3715                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$33)
    3716                      .dwattr $C$DW$440, DW_AT_name("rsvd14")
    3717                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_rsvd14")
    3718                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x6393]
    3719                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    3720              
    3721              $C$DW$441       .dwtag  DW_TAG_member
    3722                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$32)
    3723                      .dwattr $C$DW$441, DW_AT_name("XINTnCTR")
    3724                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_XINTnCTR")
    3725                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x6398]
    3726                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    3727              
    3728                      .dwendtag $C$DW$T$34
    3729              
    3730              $C$DW$T$61      .dwtag  DW_TAG_typedef
    3731                      .dwattr $C$DW$T$61, DW_AT_name("PIE_Obj")
    3732                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$34)
    3733                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    3734              
    3735              $C$DW$T$62      .dwtag  DW_TAG_pointer_type
    3736                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$34)
    3737                      .dwattr $C$DW$T$62, DW_AT_address_class(0x20)
    3738              
    3739              $C$DW$T$63      .dwtag  DW_TAG_typedef
    3740                      .dwattr $C$DW$T$63, DW_AT_name("PIE_Handle")
    3741                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    3742                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    3743              
TMS320C2000 Assembler PC v22.6.0 Thu May 11 14:54:15 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{B4E7D00B-49F3-4D8E-BF74-563B7E51F3FF} PAGE   70

    3744              $C$DW$442       .dwtag  DW_TAG_TI_far_type
    3745                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$63)
    3746              
    3747              $C$DW$T$64      .dwtag  DW_TAG_const_type
    3748                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$442)
    3749              
    3750              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3751                      .dwattr $C$DW$T$2, DW_AT_name("void")
    3752              
    3753              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3754                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3755                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3756              
    3757              
    3758              $C$DW$T$27      .dwtag  DW_TAG_subroutine_type
    3759                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    3760                      .dwendtag $C$DW$T$27
    3761              
    3762              $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    3763                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    3764                      .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
    3765              
    3766              $C$DW$T$29      .dwtag  DW_TAG_typedef
    3767                      .dwattr $C$DW$T$29, DW_AT_name("PIE_IntVec_t")
    3768                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    3769                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    3770              
    3771              $C$DW$443       .dwtag  DW_TAG_TI_far_type
    3772                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$29)
    3773              
    3774              $C$DW$T$30      .dwtag  DW_TAG_volatile_type
    3775                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$443)
    3776              
    3777              $C$DW$444       .dwtag  DW_TAG_TI_far_type
    3778                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$29)
    3779              
    3780              $C$DW$T$71      .dwtag  DW_TAG_const_type
    3781                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$444)
    3782              
    3783              $C$DW$T$72      .dwtag  DW_TAG_pointer_type
    3784                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$29)
    3785                      .dwattr $C$DW$T$72, DW_AT_address_class(0x20)
    3786              
    3787              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3788                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3789                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3790                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3791              
