TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B2C05AB2-F74F-488F-8958-8E18CF9A39A1} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                             PC v18.12.4.LTS *
       3              ;* Date/Time created: Wed Feb 22 13:06:46 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/GIANT/GIANT_TI_instaspin/motorware/motorware_1_01_00_18/sw/drivers/p
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v18.12.4.LTS Copyright (c) 1996-
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\GIANT\GIANT_TI_instaspin\motorware\motorware_1_01_00_18\sw\solut
      13              ;       C:\ti\ccs930\ccs\tools\compiler\ti-cgt-c2000_18.12.4.LTS\bin\opt2000.exe C:\\Users\\User\\AppData\\Lo

    2647                      .dwattr $C$DW$285, DW_AT_name("PIE_SystemInterrupts_ILLEGAL")
    2648                      .dwattr $C$DW$285, DW_AT_const_value(0x13)
    2649              
    2650              $C$DW$286       .dwtag  DW_TAG_enumerator
    2651                      .dwattr $C$DW$286, DW_AT_name("PIE_SystemInterrupts_USER1")
    2652                      .dwattr $C$DW$286, DW_AT_const_value(0x14)
    2653              
    2654              $C$DW$287       .dwtag  DW_TAG_enumerator
    2655                      .dwattr $C$DW$287, DW_AT_name("PIE_SystemInterrupts_USER2")
    2656                      .dwattr $C$DW$287, DW_AT_const_value(0x15)
    2657              
    2658              $C$DW$288       .dwtag  DW_TAG_enumerator
    2659                      .dwattr $C$DW$288, DW_AT_name("PIE_SystemInterrupts_USER3")
    2660                      .dwattr $C$DW$288, DW_AT_const_value(0x16)
    2661              
    2662              $C$DW$289       .dwtag  DW_TAG_enumerator
    2663                      .dwattr $C$DW$289, DW_AT_name("PIE_SystemInterrupts_USER4")
    2664                      .dwattr $C$DW$289, DW_AT_const_value(0x17)
    2665              
    2666              $C$DW$290       .dwtag  DW_TAG_enumerator
    2667                      .dwattr $C$DW$290, DW_AT_name("PIE_SystemInterrupts_USER5")
    2668                      .dwattr $C$DW$290, DW_AT_const_value(0x18)
    2669              
    2670              $C$DW$291       .dwtag  DW_TAG_enumerator
    2671                      .dwattr $C$DW$291, DW_AT_name("PIE_SystemInterrupts_USER6")
    2672                      .dwattr $C$DW$291, DW_AT_const_value(0x19)
    2673              
    2674              $C$DW$292       .dwtag  DW_TAG_enumerator
    2675                      .dwattr $C$DW$292, DW_AT_name("PIE_SystemInterrupts_USER7")
    2676                      .dwattr $C$DW$292, DW_AT_const_value(0x1a)
    2677              
    2678              $C$DW$293       .dwtag  DW_TAG_enumerator
    2679                      .dwattr $C$DW$293, DW_AT_name("PIE_SystemInterrupts_USER8")
    2680                      .dwattr $C$DW$293, DW_AT_const_value(0x1b)
    2681              
    2682              $C$DW$294       .dwtag  DW_TAG_enumerator
    2683                      .dwattr $C$DW$294, DW_AT_name("PIE_SystemInterrupts_USER9")
    2684                      .dwattr $C$DW$294, DW_AT_const_value(0x1c)
    2685              
    2686              $C$DW$295       .dwtag  DW_TAG_enumerator
    2687                      .dwattr $C$DW$295, DW_AT_name("PIE_SystemInterrupts_USER10")
    2688                      .dwattr $C$DW$295, DW_AT_const_value(0x1d)
    2689              
    2690              $C$DW$296       .dwtag  DW_TAG_enumerator
    2691                      .dwattr $C$DW$296, DW_AT_name("PIE_SystemInterrupts_USER11")
    2692                      .dwattr $C$DW$296, DW_AT_const_value(0x1e)
    2693              
    2694              $C$DW$297       .dwtag  DW_TAG_enumerator
    2695                      .dwattr $C$DW$297, DW_AT_name("PIE_SystemInterrupts_USER12")
    2696                      .dwattr $C$DW$297, DW_AT_const_value(0x1f)
    2697              
    2698                      .dwendtag $C$DW$T$53
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B2C05AB2-F74F-488F-8958-8E18CF9A39A1} PAGE   51

    2699              
    2700              $C$DW$T$54      .dwtag  DW_TAG_typedef
    2701                      .dwattr $C$DW$T$54, DW_AT_name("PIE_SystemInterrupts_e")
    2702                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    2703                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    2704              
    2705              
    2706              $C$DW$T$56      .dwtag  DW_TAG_enumeration_type
    2707                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x01)
    2708              $C$DW$298       .dwtag  DW_TAG_enumerator
    2709                      .dwattr $C$DW$298, DW_AT_name("PIE_ExtIntPolarity_FallingEdge")
    2710                      .dwattr $C$DW$298, DW_AT_const_value(0x00)
    2711              
    2712              $C$DW$299       .dwtag  DW_TAG_enumerator
    2713                      .dwattr $C$DW$299, DW_AT_name("PIE_ExtIntPolarity_RisingEdge")
    2714                      .dwattr $C$DW$299, DW_AT_const_value(0x04)
    2715              
    2716              $C$DW$300       .dwtag  DW_TAG_enumerator
    2717                      .dwattr $C$DW$300, DW_AT_name("PIE_ExtIntPolarity_RisingAndFallingEdge")
    2718                      .dwattr $C$DW$300, DW_AT_const_value(0x0c)
    2719              
    2720                      .dwendtag $C$DW$T$56
    2721              
    2722              $C$DW$T$57      .dwtag  DW_TAG_typedef
    2723                      .dwattr $C$DW$T$57, DW_AT_name("PIE_ExtIntPolarity_e")
    2724                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    2725                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    2726              
    2727              $C$DW$301       .dwtag  DW_TAG_TI_far_type
    2728                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$57)
    2729              
    2730              $C$DW$T$58      .dwtag  DW_TAG_const_type
    2731                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$301)
    2732              
    2733              
    2734              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2735                      .dwattr $C$DW$T$22, DW_AT_name("_PIE_IERIFR_t")
    2736                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    2737              $C$DW$302       .dwtag  DW_TAG_member
    2738                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$21)
    2739                      .dwattr $C$DW$302, DW_AT_name("IER")
    2740                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_IER")
    2741                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2742                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    2743              
    2744              $C$DW$303       .dwtag  DW_TAG_member
    2745                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$21)
    2746                      .dwattr $C$DW$303, DW_AT_name("IFR")
    2747                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_IFR")
    2748                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2749                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    2750              
    2751                      .dwendtag $C$DW$T$22
    2752              
    2753              $C$DW$T$23      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B2C05AB2-F74F-488F-8958-8E18CF9A39A1} PAGE   52

    2754                      .dwattr $C$DW$T$23, DW_AT_name("PIE_IERIFR_t")
    2755                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
    2756                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    2757              
    2758              $C$DW$304       .dwtag  DW_TAG_TI_far_type
    2759                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$23)
    2760              
    2761              $C$DW$T$24      .dwtag  DW_TAG_volatile_type
    2762                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$304)
    2763              
    2764              
    2765              $C$DW$T$25      .dwtag  DW_TAG_array_type
    2766                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    2767                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    2768                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x18)
    2769              $C$DW$305       .dwtag  DW_TAG_subrange_type
    2770                      .dwattr $C$DW$305, DW_AT_upper_bound(0x0b)
    2771              
    2772                      .dwendtag $C$DW$T$25
    2773              
    2774              
    2775              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2776                      .dwattr $C$DW$T$34, DW_AT_name("_PIE_Obj_")
    2777                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x639c)
    2778              $C$DW$306       .dwtag  DW_TAG_member
    2779                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$21)
    2780                      .dwattr $C$DW$306, DW_AT_name("PIECTRL")
    2781                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_PIECTRL")
    2782                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2783                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    2784              
    2785              $C$DW$307       .dwtag  DW_TAG_member
    2786                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$21)
    2787                      .dwattr $C$DW$307, DW_AT_name("PIEACK")
    2788                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_PIEACK")
    2789                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2790                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    2791              
    2792              $C$DW$308       .dwtag  DW_TAG_member
    2793                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$25)
    2794                      .dwattr $C$DW$308, DW_AT_name("PIEIER_PIEIFR")
    2795                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_PIEIER_PIEIFR")
    2796                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2797                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    2798              
    2799              $C$DW$309       .dwtag  DW_TAG_member
    2800                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$26)
    2801                      .dwattr $C$DW$309, DW_AT_name("rsvd_1")
    2802                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_rsvd_1")
    2803                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2804                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    2805              
    2806              $C$DW$310       .dwtag  DW_TAG_member
    2807                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$30)
    2808                      .dwattr $C$DW$310, DW_AT_name("Reset")
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B2C05AB2-F74F-488F-8958-8E18CF9A39A1} PAGE   53

    2809                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_Reset")
    2810                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2811                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    2812              
    2813              $C$DW$311       .dwtag  DW_TAG_member
    2814                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$30)
    2815                      .dwattr $C$DW$311, DW_AT_name("INT1")
    2816                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_INT1")
    2817                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2818                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    2819              
    2820              $C$DW$312       .dwtag  DW_TAG_member
    2821                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$30)
    2822                      .dwattr $C$DW$312, DW_AT_name("INT2")
    2823                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_INT2")
    2824                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2825                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    2826              
    2827              $C$DW$313       .dwtag  DW_TAG_member
    2828                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$30)
    2829                      .dwattr $C$DW$313, DW_AT_name("INT3")
    2830                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_INT3")
    2831                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2832                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    2833              
    2834              $C$DW$314       .dwtag  DW_TAG_member
    2835                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$30)
    2836                      .dwattr $C$DW$314, DW_AT_name("INT4")
    2837                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_INT4")
    2838                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2839                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    2840              
    2841              $C$DW$315       .dwtag  DW_TAG_member
    2842                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$30)
    2843                      .dwattr $C$DW$315, DW_AT_name("INT5")
    2844                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_INT5")
    2845                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2846                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    2847              
    2848              $C$DW$316       .dwtag  DW_TAG_member
    2849                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$30)
    2850                      .dwattr $C$DW$316, DW_AT_name("INT6")
    2851                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_INT6")
    2852                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2853                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    2854              
    2855              $C$DW$317       .dwtag  DW_TAG_member
    2856                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$30)
    2857                      .dwattr $C$DW$317, DW_AT_name("INT7")
    2858                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_INT7")
    2859                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2860                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    2861              
    2862              $C$DW$318       .dwtag  DW_TAG_member
    2863                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$30)
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B2C05AB2-F74F-488F-8958-8E18CF9A39A1} PAGE   54

    2864                      .dwattr $C$DW$318, DW_AT_name("INT8")
    2865                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_INT8")
    2866                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2867                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    2868              
    2869              $C$DW$319       .dwtag  DW_TAG_member
    2870                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$30)
    2871                      .dwattr $C$DW$319, DW_AT_name("INT9")
    2872                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_INT9")
    2873                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2874                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    2875              
    2876              $C$DW$320       .dwtag  DW_TAG_member
    2877                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$30)
    2878                      .dwattr $C$DW$320, DW_AT_name("INT10")
    2879                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_INT10")
    2880                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2881                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    2882              
    2883              $C$DW$321       .dwtag  DW_TAG_member
    2884                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$30)
    2885                      .dwattr $C$DW$321, DW_AT_name("INT11")
    2886                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_INT11")
    2887                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2888                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    2889              
    2890              $C$DW$322       .dwtag  DW_TAG_member
    2891                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$30)
    2892                      .dwattr $C$DW$322, DW_AT_name("INT12")
    2893                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_INT12")
    2894                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2895                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    2896              
    2897              $C$DW$323       .dwtag  DW_TAG_member
    2898                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$30)
    2899                      .dwattr $C$DW$323, DW_AT_name("TINT1")
    2900                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_TINT1")
    2901                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2902                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    2903              
    2904              $C$DW$324       .dwtag  DW_TAG_member
    2905                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$30)
    2906                      .dwattr $C$DW$324, DW_AT_name("TINT2")
    2907                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_TINT2")
    2908                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2909                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    2910              
    2911              $C$DW$325       .dwtag  DW_TAG_member
    2912                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$30)
    2913                      .dwattr $C$DW$325, DW_AT_name("DATALOG")
    2914                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_DATALOG")
    2915                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2916                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    2917              
    2918              $C$DW$326       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B2C05AB2-F74F-488F-8958-8E18CF9A39A1} PAGE   55

    2919                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$30)
    2920                      .dwattr $C$DW$326, DW_AT_name("RTOSINT")
    2921                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_RTOSINT")
    2922                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2923                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    2924              
    2925              $C$DW$327       .dwtag  DW_TAG_member
    2926                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$30)
    2927                      .dwattr $C$DW$327, DW_AT_name("EMUINT")
    2928                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_EMUINT")
    2929                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2930                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    2931              
    2932              $C$DW$328       .dwtag  DW_TAG_member
    2933                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$30)
    2934                      .dwattr $C$DW$328, DW_AT_name("NMI")
    2935                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_NMI")
    2936                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2937                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    2938              
    2939              $C$DW$329       .dwtag  DW_TAG_member
    2940                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$30)
    2941                      .dwattr $C$DW$329, DW_AT_name("ILLEGAL")
    2942                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_ILLEGAL")
    2943                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2944                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    2945              
    2946              $C$DW$330       .dwtag  DW_TAG_member
    2947                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$30)
    2948                      .dwattr $C$DW$330, DW_AT_name("USER1")
    2949                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_USER1")
    2950                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2951                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    2952              
    2953              $C$DW$331       .dwtag  DW_TAG_member
    2954                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$30)
    2955                      .dwattr $C$DW$331, DW_AT_name("USER2")
    2956                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_USER2")
    2957                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    2958                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    2959              
    2960              $C$DW$332       .dwtag  DW_TAG_member
    2961                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$30)
    2962                      .dwattr $C$DW$332, DW_AT_name("USER3")
    2963                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_USER3")
    2964                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2965                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    2966              
    2967              $C$DW$333       .dwtag  DW_TAG_member
    2968                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$30)
    2969                      .dwattr $C$DW$333, DW_AT_name("USER4")
    2970                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_USER4")
    2971                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    2972                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    2973              
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B2C05AB2-F74F-488F-8958-8E18CF9A39A1} PAGE   56

    2974              $C$DW$334       .dwtag  DW_TAG_member
    2975                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$30)
    2976                      .dwattr $C$DW$334, DW_AT_name("USER5")
    2977                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_USER5")
    2978                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2979                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    2980              
    2981              $C$DW$335       .dwtag  DW_TAG_member
    2982                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$30)
    2983                      .dwattr $C$DW$335, DW_AT_name("USER6")
    2984                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_USER6")
    2985                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    2986                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    2987              
    2988              $C$DW$336       .dwtag  DW_TAG_member
    2989                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$30)
    2990                      .dwattr $C$DW$336, DW_AT_name("USER7")
    2991                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_USER7")
    2992                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2993                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    2994              
    2995              $C$DW$337       .dwtag  DW_TAG_member
    2996                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$30)
    2997                      .dwattr $C$DW$337, DW_AT_name("USER8")
    2998                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_USER8")
    2999                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3000                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3001              
    3002              $C$DW$338       .dwtag  DW_TAG_member
    3003                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$30)
    3004                      .dwattr $C$DW$338, DW_AT_name("USER9")
    3005                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_USER9")
    3006                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3007                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3008              
    3009              $C$DW$339       .dwtag  DW_TAG_member
    3010                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$30)
    3011                      .dwattr $C$DW$339, DW_AT_name("USER10")
    3012                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_USER10")
    3013                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    3014                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3015              
    3016              $C$DW$340       .dwtag  DW_TAG_member
    3017                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$30)
    3018                      .dwattr $C$DW$340, DW_AT_name("USER11")
    3019                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_USER11")
    3020                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3021                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3022              
    3023              $C$DW$341       .dwtag  DW_TAG_member
    3024                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$30)
    3025                      .dwattr $C$DW$341, DW_AT_name("USER12")
    3026                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_USER12")
    3027                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3028                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B2C05AB2-F74F-488F-8958-8E18CF9A39A1} PAGE   57

    3029              
    3030              $C$DW$342       .dwtag  DW_TAG_member
    3031                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$30)
    3032                      .dwattr $C$DW$342, DW_AT_name("ADCINT1_HP")
    3033                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_ADCINT1_HP")
    3034                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3035                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3036              
    3037              $C$DW$343       .dwtag  DW_TAG_member
    3038                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$30)
    3039                      .dwattr $C$DW$343, DW_AT_name("ADCINT2_HP")
    3040                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_ADCINT2_HP")
    3041                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3042                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3043              
    3044              $C$DW$344       .dwtag  DW_TAG_member
    3045                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$30)
    3046                      .dwattr $C$DW$344, DW_AT_name("rsvd1_3")
    3047                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_rsvd1_3")
    3048                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    3049                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3050              
    3051              $C$DW$345       .dwtag  DW_TAG_member
    3052                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$30)
    3053                      .dwattr $C$DW$345, DW_AT_name("XINT1")
    3054                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_XINT1")
    3055                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
    3056                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3057              
    3058              $C$DW$346       .dwtag  DW_TAG_member
    3059                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$30)
    3060                      .dwattr $C$DW$346, DW_AT_name("XINT2")
    3061                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_XINT2")
    3062                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    3063                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3064              
    3065              $C$DW$347       .dwtag  DW_TAG_member
    3066                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$30)
    3067                      .dwattr $C$DW$347, DW_AT_name("ADCINT9")
    3068                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_ADCINT9")
    3069                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
    3070                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3071              
    3072              $C$DW$348       .dwtag  DW_TAG_member
    3073                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$30)
    3074                      .dwattr $C$DW$348, DW_AT_name("TINT0")
    3075                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_TINT0")
    3076                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3077                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3078              
    3079              $C$DW$349       .dwtag  DW_TAG_member
    3080                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$30)
    3081                      .dwattr $C$DW$349, DW_AT_name("WAKEINT")
    3082                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_WAKEINT")
    3083                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B2C05AB2-F74F-488F-8958-8E18CF9A39A1} PAGE   58

    3084                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3085              
    3086              $C$DW$350       .dwtag  DW_TAG_member
    3087                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$30)
    3088                      .dwattr $C$DW$350, DW_AT_name("EPWM1_TZINT")
    3089                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_EPWM1_TZINT")
    3090                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    3091                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3092              
    3093              $C$DW$351       .dwtag  DW_TAG_member
    3094                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$30)
    3095                      .dwattr $C$DW$351, DW_AT_name("EPWM2_TZINT")
    3096                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_EPWM2_TZINT")
    3097                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
    3098                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3099              
    3100              $C$DW$352       .dwtag  DW_TAG_member
    3101                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$30)
    3102                      .dwattr $C$DW$352, DW_AT_name("EPWM3_TZINT")
    3103                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_EPWM3_TZINT")
    3104                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    3105                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3106              
    3107              $C$DW$353       .dwtag  DW_TAG_member
    3108                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$30)
    3109                      .dwattr $C$DW$353, DW_AT_name("EPWM4_TZINT")
    3110                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_EPWM4_TZINT")
    3111                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    3112                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3113              
    3114              $C$DW$354       .dwtag  DW_TAG_member
    3115                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$30)
    3116                      .dwattr $C$DW$354, DW_AT_name("EPWM5_TZINT")
    3117                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_EPWM5_TZINT")
    3118                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3119                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3120              
    3121              $C$DW$355       .dwtag  DW_TAG_member
    3122                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$30)
    3123                      .dwattr $C$DW$355, DW_AT_name("EPWM6_TZINT")
    3124                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_EPWM6_TZINT")
    3125                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3126                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3127              
    3128              $C$DW$356       .dwtag  DW_TAG_member
    3129                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$30)
    3130                      .dwattr $C$DW$356, DW_AT_name("EPWM7_TZINT")
    3131                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_EPWM7_TZINT")
    3132                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    3133                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3134              
    3135              $C$DW$357       .dwtag  DW_TAG_member
    3136                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$30)
    3137                      .dwattr $C$DW$357, DW_AT_name("EPWM8_TZINT")
    3138                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_EPWM8_TZINT")
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B2C05AB2-F74F-488F-8958-8E18CF9A39A1} PAGE   59

    3139                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
    3140                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3141              
    3142              $C$DW$358       .dwtag  DW_TAG_member
    3143                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$30)
    3144                      .dwattr $C$DW$358, DW_AT_name("EPWM1_INT")
    3145                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_EPWM1_INT")
    3146                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    3147                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3148              
    3149              $C$DW$359       .dwtag  DW_TAG_member
    3150                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$30)
    3151                      .dwattr $C$DW$359, DW_AT_name("EPWM2_INT")
    3152                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_EPWM2_INT")
    3153                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    3154                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3155              
    3156              $C$DW$360       .dwtag  DW_TAG_member
    3157                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$30)
    3158                      .dwattr $C$DW$360, DW_AT_name("EPWM3_INT")
    3159                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_EPWM3_INT")
    3160                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3161                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3162              
    3163              $C$DW$361       .dwtag  DW_TAG_member
    3164                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$30)
    3165                      .dwattr $C$DW$361, DW_AT_name("EPWM4_INT")
    3166                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_EPWM4_INT")
    3167                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
    3168                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3169              
    3170              $C$DW$362       .dwtag  DW_TAG_member
    3171                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$30)
    3172                      .dwattr $C$DW$362, DW_AT_name("EPWM5_INT")
    3173                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_EPWM5_INT")
    3174                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    3175                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3176              
    3177              $C$DW$363       .dwtag  DW_TAG_member
    3178                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$30)
    3179                      .dwattr $C$DW$363, DW_AT_name("EPWM6_INT")
    3180                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_EPWM6_INT")
    3181                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    3182                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3183              
    3184              $C$DW$364       .dwtag  DW_TAG_member
    3185                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$30)
    3186                      .dwattr $C$DW$364, DW_AT_name("EPWM7_INT")
    3187                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_EPWM7_INT")
    3188                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    3189                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3190              
    3191              $C$DW$365       .dwtag  DW_TAG_member
    3192                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$30)
    3193                      .dwattr $C$DW$365, DW_AT_name("EPWM8_INT")
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B2C05AB2-F74F-488F-8958-8E18CF9A39A1} PAGE   60

    3194                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_EPWM8_INT")
    3195                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x8e]
    3196                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3197              
    3198              $C$DW$366       .dwtag  DW_TAG_member
    3199                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$30)
    3200                      .dwattr $C$DW$366, DW_AT_name("ECAP1_INT")
    3201                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_ECAP1_INT")
    3202                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    3203                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3204              
    3205              $C$DW$367       .dwtag  DW_TAG_member
    3206                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$30)
    3207                      .dwattr $C$DW$367, DW_AT_name("ECAP2_INT")
    3208                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_ECAP2_INT")
    3209                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3210                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3211              
    3212              $C$DW$368       .dwtag  DW_TAG_member
    3213                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$30)
    3214                      .dwattr $C$DW$368, DW_AT_name("ECAP3_INT")
    3215                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_ECAP3_INT")
    3216                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    3217                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3218              
    3219              $C$DW$369       .dwtag  DW_TAG_member
    3220                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$30)
    3221                      .dwattr $C$DW$369, DW_AT_name("rsvd4_4")
    3222                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_rsvd4_4")
    3223                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
    3224                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3225              
    3226              $C$DW$370       .dwtag  DW_TAG_member
    3227                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$30)
    3228                      .dwattr $C$DW$370, DW_AT_name("rsvd4_5")
    3229                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_rsvd4_5")
    3230                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    3231                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3232              
    3233              $C$DW$371       .dwtag  DW_TAG_member
    3234                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$30)
    3235                      .dwattr $C$DW$371, DW_AT_name("rsvd4_6")
    3236                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_rsvd4_6")
    3237                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    3238                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3239              
    3240              $C$DW$372       .dwtag  DW_TAG_member
    3241                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$30)
    3242                      .dwattr $C$DW$372, DW_AT_name("HRCAP1_INT")
    3243                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_HRCAP1_INT")
    3244                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3245                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3246              
    3247              $C$DW$373       .dwtag  DW_TAG_member
    3248                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$30)
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B2C05AB2-F74F-488F-8958-8E18CF9A39A1} PAGE   61

    3249                      .dwattr $C$DW$373, DW_AT_name("HRCAP2_INT")
    3250                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_HRCAP2_INT")
    3251                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3252                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3253              
    3254              $C$DW$374       .dwtag  DW_TAG_member
    3255                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$30)
    3256                      .dwattr $C$DW$374, DW_AT_name("EQEP1_INT")
    3257                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_EQEP1_INT")
    3258                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3259                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3260              
    3261              $C$DW$375       .dwtag  DW_TAG_member
    3262                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$30)
    3263                      .dwattr $C$DW$375, DW_AT_name("EQEP2_INT")
    3264                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_EQEP2_INT")
    3265                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3266                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3267              
    3268              $C$DW$376       .dwtag  DW_TAG_member
    3269                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$30)
    3270                      .dwattr $C$DW$376, DW_AT_name("rsvd5_3")
    3271                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_rsvd5_3")
    3272                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3273                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3274              
    3275              $C$DW$377       .dwtag  DW_TAG_member
    3276                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$30)
    3277                      .dwattr $C$DW$377, DW_AT_name("HRCAP3_INT")
    3278                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_HRCAP3_INT")
    3279                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3280                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3281              
    3282              $C$DW$378       .dwtag  DW_TAG_member
    3283                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$30)
    3284                      .dwattr $C$DW$378, DW_AT_name("HRCAP4_INT")
    3285                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_HRCAP4_INT")
    3286                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3287                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3288              
    3289              $C$DW$379       .dwtag  DW_TAG_member
    3290                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$30)
    3291                      .dwattr $C$DW$379, DW_AT_name("rsvd5_6")
    3292                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_rsvd5_6")
    3293                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3294                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3295              
    3296              $C$DW$380       .dwtag  DW_TAG_member
    3297                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$30)
    3298                      .dwattr $C$DW$380, DW_AT_name("rsvd5_7")
    3299                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_rsvd5_7")
    3300                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    3301                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3302              
    3303              $C$DW$381       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B2C05AB2-F74F-488F-8958-8E18CF9A39A1} PAGE   62

    3304                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$30)
    3305                      .dwattr $C$DW$381, DW_AT_name("USB0_INT")
    3306                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_USB0_INT")
    3307                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3308                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3309              
    3310              $C$DW$382       .dwtag  DW_TAG_member
    3311                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$30)
    3312                      .dwattr $C$DW$382, DW_AT_name("SPIRXINTA")
    3313                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_SPIRXINTA")
    3314                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    3315                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3316              
    3317              $C$DW$383       .dwtag  DW_TAG_member
    3318                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$30)
    3319                      .dwattr $C$DW$383, DW_AT_name("SPITXINTA")
    3320                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_SPITXINTA")
    3321                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3322                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3323              
    3324              $C$DW$384       .dwtag  DW_TAG_member
    3325                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$30)
    3326                      .dwattr $C$DW$384, DW_AT_name("SPIRXINTB")
    3327                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_SPIRXINTB")
    3328                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
    3329                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3330              
    3331              $C$DW$385       .dwtag  DW_TAG_member
    3332                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$30)
    3333                      .dwattr $C$DW$385, DW_AT_name("SPITXINTB")
    3334                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_SPITXINTB")
    3335                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3336                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3337              
    3338              $C$DW$386       .dwtag  DW_TAG_member
    3339                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$30)
    3340                      .dwattr $C$DW$386, DW_AT_name("MCBSPARX")
    3341                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_MCBSPARX")
    3342                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    3343                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3344              
    3345              $C$DW$387       .dwtag  DW_TAG_member
    3346                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$30)
    3347                      .dwattr $C$DW$387, DW_AT_name("MCBSPATX")
    3348                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_MCBSPATX")
    3349                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3350                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3351              
    3352              $C$DW$388       .dwtag  DW_TAG_member
    3353                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$30)
    3354                      .dwattr $C$DW$388, DW_AT_name("rsvd6_7")
    3355                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_rsvd6_7")
    3356                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3357                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3358              
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B2C05AB2-F74F-488F-8958-8E18CF9A39A1} PAGE   63

    3359              $C$DW$389       .dwtag  DW_TAG_member
    3360                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$30)
    3361                      .dwattr $C$DW$389, DW_AT_name("rsvd6_8")
    3362                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_rsvd6_8")
    3363                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0xbe]
    3364                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3365              
    3366              $C$DW$390       .dwtag  DW_TAG_member
    3367                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$30)
    3368                      .dwattr $C$DW$390, DW_AT_name("DMACH1_INT")
    3369                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_DMACH1_INT")
    3370                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3371                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3372              
    3373              $C$DW$391       .dwtag  DW_TAG_member
    3374                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$30)
    3375                      .dwattr $C$DW$391, DW_AT_name("DMACH2_INT")
    3376                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_DMACH2_INT")
    3377                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0xc2]
    3378                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3379              
    3380              $C$DW$392       .dwtag  DW_TAG_member
    3381                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$30)
    3382                      .dwattr $C$DW$392, DW_AT_name("DMACH3_INT")
    3383                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_DMACH3_INT")
    3384                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3385                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3386              
    3387              $C$DW$393       .dwtag  DW_TAG_member
    3388                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$30)
    3389                      .dwattr $C$DW$393, DW_AT_name("DMACH4_INT")
    3390                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_DMACH4_INT")
    3391                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3392                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3393              
    3394              $C$DW$394       .dwtag  DW_TAG_member
    3395                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$30)
    3396                      .dwattr $C$DW$394, DW_AT_name("DMACH5_INT")
    3397                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_DMACH5_INT")
    3398                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3399                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3400              
    3401              $C$DW$395       .dwtag  DW_TAG_member
    3402                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$30)
    3403                      .dwattr $C$DW$395, DW_AT_name("DMACH6_INT")
    3404                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_DMACH6_INT")
    3405                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3406                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3407              
    3408              $C$DW$396       .dwtag  DW_TAG_member
    3409                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$30)
    3410                      .dwattr $C$DW$396, DW_AT_name("rsvd7_7")
    3411                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_rsvd7_7")
    3412                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3413                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B2C05AB2-F74F-488F-8958-8E18CF9A39A1} PAGE   64

    3414              
    3415              $C$DW$397       .dwtag  DW_TAG_member
    3416                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$30)
    3417                      .dwattr $C$DW$397, DW_AT_name("rsvd7_8")
    3418                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_rsvd7_8")
    3419                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3420                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3421              
    3422              $C$DW$398       .dwtag  DW_TAG_member
    3423                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$30)
    3424                      .dwattr $C$DW$398, DW_AT_name("I2CINT1A")
    3425                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_I2CINT1A")
    3426                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3427                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3428              
    3429              $C$DW$399       .dwtag  DW_TAG_member
    3430                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$30)
    3431                      .dwattr $C$DW$399, DW_AT_name("I2CINT2A")
    3432                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_I2CINT2A")
    3433                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3434                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3435              
    3436              $C$DW$400       .dwtag  DW_TAG_member
    3437                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$30)
    3438                      .dwattr $C$DW$400, DW_AT_name("rsvd8_3")
    3439                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_rsvd8_3")
    3440                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3441                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3442              
    3443              $C$DW$401       .dwtag  DW_TAG_member
    3444                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$30)
    3445                      .dwattr $C$DW$401, DW_AT_name("rsvd8_4")
    3446                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_rsvd8_4")
    3447                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3448                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3449              
    3450              $C$DW$402       .dwtag  DW_TAG_member
    3451                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$30)
    3452                      .dwattr $C$DW$402, DW_AT_name("rsvd8_5")
    3453                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_rsvd8_5")
    3454                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3455                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3456              
    3457              $C$DW$403       .dwtag  DW_TAG_member
    3458                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$30)
    3459                      .dwattr $C$DW$403, DW_AT_name("rsvd8_6")
    3460                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_rsvd8_6")
    3461                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3462                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3463              
    3464              $C$DW$404       .dwtag  DW_TAG_member
    3465                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$30)
    3466                      .dwattr $C$DW$404, DW_AT_name("rsvd8_7")
    3467                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_rsvd8_7")
    3468                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B2C05AB2-F74F-488F-8958-8E18CF9A39A1} PAGE   65

    3469                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3470              
    3471              $C$DW$405       .dwtag  DW_TAG_member
    3472                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$30)
    3473                      .dwattr $C$DW$405, DW_AT_name("rsvd8_8")
    3474                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_rsvd8_8")
    3475                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    3476                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3477              
    3478              $C$DW$406       .dwtag  DW_TAG_member
    3479                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$30)
    3480                      .dwattr $C$DW$406, DW_AT_name("SCIRXINTA")
    3481                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_SCIRXINTA")
    3482                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    3483                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3484              
    3485              $C$DW$407       .dwtag  DW_TAG_member
    3486                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$30)
    3487                      .dwattr $C$DW$407, DW_AT_name("SCITXINTA")
    3488                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_SCITXINTA")
    3489                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    3490                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    3491              
    3492              $C$DW$408       .dwtag  DW_TAG_member
    3493                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$30)
    3494                      .dwattr $C$DW$408, DW_AT_name("SCIRXINTB")
    3495                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_SCIRXINTB")
    3496                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    3497                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3498              
    3499              $C$DW$409       .dwtag  DW_TAG_member
    3500                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$30)
    3501                      .dwattr $C$DW$409, DW_AT_name("SCITXINTB")
    3502                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_SCITXINTB")
    3503                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    3504                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3505              
    3506              $C$DW$410       .dwtag  DW_TAG_member
    3507                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$30)
    3508                      .dwattr $C$DW$410, DW_AT_name("ECAN0INT")
    3509                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_ECAN0INT")
    3510                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    3511                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3512              
    3513              $C$DW$411       .dwtag  DW_TAG_member
    3514                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$30)
    3515                      .dwattr $C$DW$411, DW_AT_name("ECAN1INT")
    3516                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_ECAN1INT")
    3517                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    3518                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3519              
    3520              $C$DW$412       .dwtag  DW_TAG_member
    3521                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$30)
    3522                      .dwattr $C$DW$412, DW_AT_name("rsvd9_7")
    3523                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_rsvd9_7")
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B2C05AB2-F74F-488F-8958-8E18CF9A39A1} PAGE   66

    3524                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3525                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3526              
    3527              $C$DW$413       .dwtag  DW_TAG_member
    3528                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$30)
    3529                      .dwattr $C$DW$413, DW_AT_name("rsvd9_8")
    3530                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_rsvd9_8")
    3531                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3532                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3533              
    3534              $C$DW$414       .dwtag  DW_TAG_member
    3535                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$30)
    3536                      .dwattr $C$DW$414, DW_AT_name("ADCINT1")
    3537                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_ADCINT1")
    3538                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3539                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3540              
    3541              $C$DW$415       .dwtag  DW_TAG_member
    3542                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$30)
    3543                      .dwattr $C$DW$415, DW_AT_name("ADCINT2")
    3544                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_ADCINT2")
    3545                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3546                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3547              
    3548              $C$DW$416       .dwtag  DW_TAG_member
    3549                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$30)
    3550                      .dwattr $C$DW$416, DW_AT_name("ADCINT3")
    3551                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_ADCINT3")
    3552                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3553                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3554              
    3555              $C$DW$417       .dwtag  DW_TAG_member
    3556                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$30)
    3557                      .dwattr $C$DW$417, DW_AT_name("ADCINT4")
    3558                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_ADCINT4")
    3559                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    3560                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3561              
    3562              $C$DW$418       .dwtag  DW_TAG_member
    3563                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$30)
    3564                      .dwattr $C$DW$418, DW_AT_name("ADCINT5")
    3565                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_ADCINT5")
    3566                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    3567                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3568              
    3569              $C$DW$419       .dwtag  DW_TAG_member
    3570                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$30)
    3571                      .dwattr $C$DW$419, DW_AT_name("ADCINT6")
    3572                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_ADCINT6")
    3573                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    3574                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3575              
    3576              $C$DW$420       .dwtag  DW_TAG_member
    3577                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$30)
    3578                      .dwattr $C$DW$420, DW_AT_name("ADCINT7")
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B2C05AB2-F74F-488F-8958-8E18CF9A39A1} PAGE   67

    3579                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_ADCINT7")
    3580                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    3581                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3582              
    3583              $C$DW$421       .dwtag  DW_TAG_member
    3584                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$30)
    3585                      .dwattr $C$DW$421, DW_AT_name("ADCINT8")
    3586                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_ADCINT8")
    3587                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    3588                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3589              
    3590              $C$DW$422       .dwtag  DW_TAG_member
    3591                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$30)
    3592                      .dwattr $C$DW$422, DW_AT_name("CLAINT1")
    3593                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_CLAINT1")
    3594                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    3595                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3596              
    3597              $C$DW$423       .dwtag  DW_TAG_member
    3598                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$30)
    3599                      .dwattr $C$DW$423, DW_AT_name("CLAINT2")
    3600                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_CLAINT2")
    3601                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    3602                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3603              
    3604              $C$DW$424       .dwtag  DW_TAG_member
    3605                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$30)
    3606                      .dwattr $C$DW$424, DW_AT_name("CLAINT3")
    3607                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_CLAINT3")
    3608                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    3609                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3610              
    3611              $C$DW$425       .dwtag  DW_TAG_member
    3612                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$30)
    3613                      .dwattr $C$DW$425, DW_AT_name("CLAINT4")
    3614                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_CLAINT4")
    3615                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    3616                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    3617              
    3618              $C$DW$426       .dwtag  DW_TAG_member
    3619                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$30)
    3620                      .dwattr $C$DW$426, DW_AT_name("CLAINT5")
    3621                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_CLAINT5")
    3622                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    3623                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    3624              
    3625              $C$DW$427       .dwtag  DW_TAG_member
    3626                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$30)
    3627                      .dwattr $C$DW$427, DW_AT_name("CLAINT6")
    3628                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_CLAINT6")
    3629                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    3630                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    3631              
    3632              $C$DW$428       .dwtag  DW_TAG_member
    3633                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$30)
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B2C05AB2-F74F-488F-8958-8E18CF9A39A1} PAGE   68

    3634                      .dwattr $C$DW$428, DW_AT_name("CLAINT7")
    3635                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_CLAINT7")
    3636                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
    3637                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    3638              
    3639              $C$DW$429       .dwtag  DW_TAG_member
    3640                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$30)
    3641                      .dwattr $C$DW$429, DW_AT_name("CLAINT8")
    3642                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_CLAINT8")
    3643                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x10e]
    3644                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    3645              
    3646              $C$DW$430       .dwtag  DW_TAG_member
    3647                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$30)
    3648                      .dwattr $C$DW$430, DW_AT_name("XINT3")
    3649                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_XINT3")
    3650                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    3651                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    3652              
    3653              $C$DW$431       .dwtag  DW_TAG_member
    3654                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$30)
    3655                      .dwattr $C$DW$431, DW_AT_name("rsvd12_2")
    3656                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_rsvd12_2")
    3657                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x112]
    3658                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    3659              
    3660              $C$DW$432       .dwtag  DW_TAG_member
    3661                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$30)
    3662                      .dwattr $C$DW$432, DW_AT_name("rsvd12_3")
    3663                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_rsvd12_3")
    3664                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    3665                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    3666              
    3667              $C$DW$433       .dwtag  DW_TAG_member
    3668                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$30)
    3669                      .dwattr $C$DW$433, DW_AT_name("rsvd12_4")
    3670                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_rsvd12_4")
    3671                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x116]
    3672                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    3673              
    3674              $C$DW$434       .dwtag  DW_TAG_member
    3675                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$30)
    3676                      .dwattr $C$DW$434, DW_AT_name("rsvd12_5")
    3677                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_rsvd12_5")
    3678                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
    3679                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    3680              
    3681              $C$DW$435       .dwtag  DW_TAG_member
    3682                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$30)
    3683                      .dwattr $C$DW$435, DW_AT_name("rsvd12_6")
    3684                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_rsvd12_6")
    3685                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x11a]
    3686                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    3687              
    3688              $C$DW$436       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B2C05AB2-F74F-488F-8958-8E18CF9A39A1} PAGE   69

    3689                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$30)
    3690                      .dwattr $C$DW$436, DW_AT_name("CLAINT_LVF")
    3691                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_CLAINT_LVF")
    3692                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
    3693                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    3694              
    3695              $C$DW$437       .dwtag  DW_TAG_member
    3696                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$30)
    3697                      .dwattr $C$DW$437, DW_AT_name("CLAINT_LUF")
    3698                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_CLAINT_LUF")
    3699                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x11e]
    3700                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    3701              
    3702              $C$DW$438       .dwtag  DW_TAG_member
    3703                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$31)
    3704                      .dwattr $C$DW$438, DW_AT_name("rsvd13")
    3705                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_rsvd13")
    3706                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    3707                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    3708              
    3709              $C$DW$439       .dwtag  DW_TAG_member
    3710                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$32)
    3711                      .dwattr $C$DW$439, DW_AT_name("XINTnCR")
    3712                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_XINTnCR")
    3713                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x6390]
    3714                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    3715              
    3716              $C$DW$440       .dwtag  DW_TAG_member
    3717                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$33)
    3718                      .dwattr $C$DW$440, DW_AT_name("rsvd14")
    3719                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_rsvd14")
    3720                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x6393]
    3721                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    3722              
    3723              $C$DW$441       .dwtag  DW_TAG_member
    3724                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$32)
    3725                      .dwattr $C$DW$441, DW_AT_name("XINTnCTR")
    3726                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_XINTnCTR")
    3727                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x6398]
    3728                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    3729              
    3730                      .dwendtag $C$DW$T$34
    3731              
    3732              $C$DW$T$61      .dwtag  DW_TAG_typedef
    3733                      .dwattr $C$DW$T$61, DW_AT_name("PIE_Obj")
    3734                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$34)
    3735                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    3736              
    3737              $C$DW$T$62      .dwtag  DW_TAG_pointer_type
    3738                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$34)
    3739                      .dwattr $C$DW$T$62, DW_AT_address_class(0x20)
    3740              
    3741              $C$DW$T$63      .dwtag  DW_TAG_typedef
    3742                      .dwattr $C$DW$T$63, DW_AT_name("PIE_Handle")
    3743                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:46 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{B2C05AB2-F74F-488F-8958-8E18CF9A39A1} PAGE   70

    3744                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    3745              
    3746              $C$DW$442       .dwtag  DW_TAG_TI_far_type
    3747                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$63)
    3748              
    3749              $C$DW$T$64      .dwtag  DW_TAG_const_type
    3750                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$442)
    3751              
    3752              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3753                      .dwattr $C$DW$T$2, DW_AT_name("void")
    3754              
    3755              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3756                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3757                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3758              
    3759              
    3760              $C$DW$T$27      .dwtag  DW_TAG_subroutine_type
    3761                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    3762                      .dwendtag $C$DW$T$27
    3763              
    3764              $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    3765                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    3766                      .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
    3767              
    3768              $C$DW$T$29      .dwtag  DW_TAG_typedef
    3769                      .dwattr $C$DW$T$29, DW_AT_name("PIE_IntVec_t")
    3770                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    3771                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    3772              
    3773              $C$DW$443       .dwtag  DW_TAG_TI_far_type
    3774                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$29)
    3775              
    3776              $C$DW$T$30      .dwtag  DW_TAG_volatile_type
    3777                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$443)
    3778              
    3779              $C$DW$444       .dwtag  DW_TAG_TI_far_type
    3780                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$29)
    3781              
    3782              $C$DW$T$71      .dwtag  DW_TAG_const_type
    3783                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$444)
    3784              
    3785              $C$DW$T$72      .dwtag  DW_TAG_pointer_type
    3786                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$29)
    3787                      .dwattr $C$DW$T$72, DW_AT_address_class(0x20)
    3788              
    3789              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3790                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3791                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3792                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3793              
