TMS320C2000 Assembler PC v22.6.0 Thu Feb 16 09:13:12 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{BAFF65D2-0E2D-4A9B-88E7-9F24ECAE7FAA} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.0.LTS *
       3              ;* Date/Time created: Thu Feb 16 09:13:11 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/ti/motorware/motorware_1_01_00_18/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.0.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    8798              $C$DW$903       .dwtag  DW_TAG_enumerator
    8799                      .dwattr $C$DW$903, DW_AT_name("PIE_GroupNumber_7")
    8800                      .dwattr $C$DW$903, DW_AT_const_value(0x06)
    8801              
    8802              $C$DW$904       .dwtag  DW_TAG_enumerator
    8803                      .dwattr $C$DW$904, DW_AT_name("PIE_GroupNumber_8")
    8804                      .dwattr $C$DW$904, DW_AT_const_value(0x07)
    8805              
    8806              $C$DW$905       .dwtag  DW_TAG_enumerator
    8807                      .dwattr $C$DW$905, DW_AT_name("PIE_GroupNumber_9")
    8808                      .dwattr $C$DW$905, DW_AT_const_value(0x08)
    8809              
    8810              $C$DW$906       .dwtag  DW_TAG_enumerator
    8811                      .dwattr $C$DW$906, DW_AT_name("PIE_GroupNumber_10")
    8812                      .dwattr $C$DW$906, DW_AT_const_value(0x09)
    8813              
    8814              $C$DW$907       .dwtag  DW_TAG_enumerator
    8815                      .dwattr $C$DW$907, DW_AT_name("PIE_GroupNumber_11")
    8816                      .dwattr $C$DW$907, DW_AT_const_value(0x0a)
    8817              
    8818              $C$DW$908       .dwtag  DW_TAG_enumerator
    8819                      .dwattr $C$DW$908, DW_AT_name("PIE_GroupNumber_12")
    8820                      .dwattr $C$DW$908, DW_AT_const_value(0x0b)
    8821              
    8822                      .dwendtag $C$DW$T$224
    8823              
    8824              $C$DW$T$225     .dwtag  DW_TAG_typedef
    8825                      .dwattr $C$DW$T$225, DW_AT_name("PIE_GroupNumber_e")
    8826                      .dwattr $C$DW$T$225, DW_AT_type(*$C$DW$T$224)
    8827                      .dwattr $C$DW$T$225, DW_AT_language(DW_LANG_C)
    8828              
    8829              
    8830              $C$DW$T$227     .dwtag  DW_TAG_enumeration_type
    8831                      .dwattr $C$DW$T$227, DW_AT_byte_size(0x01)
    8832              $C$DW$909       .dwtag  DW_TAG_enumerator
    8833                      .dwattr $C$DW$909, DW_AT_name("CTRL_Type_PID_spd")
    8834                      .dwattr $C$DW$909, DW_AT_const_value(0x00)
    8835              
    8836              $C$DW$910       .dwtag  DW_TAG_enumerator
TMS320C2000 Assembler PC v22.6.0 Thu Feb 16 09:13:12 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{BAFF65D2-0E2D-4A9B-88E7-9F24ECAE7FAA} PAGE  174

    8837                      .dwattr $C$DW$910, DW_AT_name("CTRL_Type_PID_Id")
    8838                      .dwattr $C$DW$910, DW_AT_const_value(0x01)
    8839              
    8840              $C$DW$911       .dwtag  DW_TAG_enumerator
    8841                      .dwattr $C$DW$911, DW_AT_name("CTRL_Type_PID_Iq")
    8842                      .dwattr $C$DW$911, DW_AT_const_value(0x02)
    8843              
    8844                      .dwendtag $C$DW$T$227
    8845              
    8846              $C$DW$T$228     .dwtag  DW_TAG_typedef
    8847                      .dwattr $C$DW$T$228, DW_AT_name("CTRL_Type_e")
    8848                      .dwattr $C$DW$T$228, DW_AT_type(*$C$DW$T$227)
    8849                      .dwattr $C$DW$T$228, DW_AT_language(DW_LANG_C)
    8850              
    8851              
    8852              $C$DW$T$230     .dwtag  DW_TAG_enumeration_type
    8853                      .dwattr $C$DW$T$230, DW_AT_byte_size(0x01)
    8854              $C$DW$912       .dwtag  DW_TAG_enumerator
    8855                      .dwattr $C$DW$912, DW_AT_name("HAL_SensorType_Current")
    8856                      .dwattr $C$DW$912, DW_AT_const_value(0x00)
    8857              
    8858              $C$DW$913       .dwtag  DW_TAG_enumerator
    8859                      .dwattr $C$DW$913, DW_AT_name("HAL_SensorType_Voltage")
    8860                      .dwattr $C$DW$913, DW_AT_const_value(0x01)
    8861              
    8862                      .dwendtag $C$DW$T$230
    8863              
    8864              $C$DW$T$231     .dwtag  DW_TAG_typedef
    8865                      .dwattr $C$DW$T$231, DW_AT_name("HAL_SensorType_e")
    8866                      .dwattr $C$DW$T$231, DW_AT_type(*$C$DW$T$230)
    8867                      .dwattr $C$DW$T$231, DW_AT_language(DW_LANG_C)
    8868              
    8869              
    8870              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    8871                      .dwattr $C$DW$T$19, DW_AT_name("IPD_HFI_Obj")
    8872                      .dwattr $C$DW$T$19, DW_AT_declaration
    8873                      .dwendtag $C$DW$T$19
    8874              
    8875              $C$DW$T$233     .dwtag  DW_TAG_pointer_type
    8876                      .dwattr $C$DW$T$233, DW_AT_type(*$C$DW$T$19)
    8877                      .dwattr $C$DW$T$233, DW_AT_address_class(0x20)
    8878              
    8879              $C$DW$T$234     .dwtag  DW_TAG_typedef
    8880                      .dwattr $C$DW$T$234, DW_AT_name("IPD_HFI_Handle")
    8881                      .dwattr $C$DW$T$234, DW_AT_type(*$C$DW$T$233)
    8882                      .dwattr $C$DW$T$234, DW_AT_language(DW_LANG_C)
    8883              
    8884              
    8885              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    8886                      .dwattr $C$DW$T$34, DW_AT_name("_ADC_Obj_")
    8887                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x6650)
    8888              $C$DW$914       .dwtag  DW_TAG_member
    8889                      .dwattr $C$DW$914, DW_AT_type(*$C$DW$T$28)
    8890                      .dwattr $C$DW$914, DW_AT_name("ADCRESULT")
    8891                      .dwattr $C$DW$914, DW_AT_TI_symbol_name("_ADCRESULT")
TMS320C2000 Assembler PC v22.6.0 Thu Feb 16 09:13:12 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{BAFF65D2-0E2D-4A9B-88E7-9F24ECAE7FAA} PAGE  175

    8892                      .dwattr $C$DW$914, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8893                      .dwattr $C$DW$914, DW_AT_accessibility(DW_ACCESS_public)
    8894              
    8895              $C$DW$915       .dwtag  DW_TAG_member
    8896                      .dwattr $C$DW$915, DW_AT_type(*$C$DW$T$29)
    8897                      .dwattr $C$DW$915, DW_AT_name("resvd_1")
    8898                      .dwattr $C$DW$915, DW_AT_TI_symbol_name("_resvd_1")
    8899                      .dwattr $C$DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8900                      .dwattr $C$DW$915, DW_AT_accessibility(DW_ACCESS_public)
    8901              
    8902              $C$DW$916       .dwtag  DW_TAG_member
    8903                      .dwattr $C$DW$916, DW_AT_type(*$C$DW$T$27)
    8904                      .dwattr $C$DW$916, DW_AT_name("ADCCTL1")
    8905                      .dwattr $C$DW$916, DW_AT_TI_symbol_name("_ADCCTL1")
    8906                      .dwattr $C$DW$916, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    8907                      .dwattr $C$DW$916, DW_AT_accessibility(DW_ACCESS_public)
    8908              
    8909              $C$DW$917       .dwtag  DW_TAG_member
    8910                      .dwattr $C$DW$917, DW_AT_type(*$C$DW$T$27)
    8911                      .dwattr $C$DW$917, DW_AT_name("ADCCTL2")
    8912                      .dwattr $C$DW$917, DW_AT_TI_symbol_name("_ADCCTL2")
    8913                      .dwattr $C$DW$917, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    8914                      .dwattr $C$DW$917, DW_AT_accessibility(DW_ACCESS_public)
    8915              
    8916              $C$DW$918       .dwtag  DW_TAG_member
    8917                      .dwattr $C$DW$918, DW_AT_type(*$C$DW$T$30)
    8918                      .dwattr $C$DW$918, DW_AT_name("rsvd_2")
    8919                      .dwattr $C$DW$918, DW_AT_TI_symbol_name("_rsvd_2")
    8920                      .dwattr $C$DW$918, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    8921                      .dwattr $C$DW$918, DW_AT_accessibility(DW_ACCESS_public)
    8922              
    8923              $C$DW$919       .dwtag  DW_TAG_member
    8924                      .dwattr $C$DW$919, DW_AT_type(*$C$DW$T$27)
    8925                      .dwattr $C$DW$919, DW_AT_name("ADCINTFLG")
    8926                      .dwattr $C$DW$919, DW_AT_TI_symbol_name("_ADCINTFLG")
    8927                      .dwattr $C$DW$919, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    8928                      .dwattr $C$DW$919, DW_AT_accessibility(DW_ACCESS_public)
    8929              
    8930              $C$DW$920       .dwtag  DW_TAG_member
    8931                      .dwattr $C$DW$920, DW_AT_type(*$C$DW$T$27)
    8932                      .dwattr $C$DW$920, DW_AT_name("ADCINTFLGCLR")
    8933                      .dwattr $C$DW$920, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    8934                      .dwattr $C$DW$920, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    8935                      .dwattr $C$DW$920, DW_AT_accessibility(DW_ACCESS_public)
    8936              
    8937              $C$DW$921       .dwtag  DW_TAG_member
    8938                      .dwattr $C$DW$921, DW_AT_type(*$C$DW$T$27)
    8939                      .dwattr $C$DW$921, DW_AT_name("ADCINTOVF")
    8940                      .dwattr $C$DW$921, DW_AT_TI_symbol_name("_ADCINTOVF")
    8941                      .dwattr $C$DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    8942                      .dwattr $C$DW$921, DW_AT_accessibility(DW_ACCESS_public)
    8943              
    8944              $C$DW$922       .dwtag  DW_TAG_member
    8945                      .dwattr $C$DW$922, DW_AT_type(*$C$DW$T$27)
    8946                      .dwattr $C$DW$922, DW_AT_name("ADCINTOVFCLR")
TMS320C2000 Assembler PC v22.6.0 Thu Feb 16 09:13:12 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{BAFF65D2-0E2D-4A9B-88E7-9F24ECAE7FAA} PAGE  176

    8947                      .dwattr $C$DW$922, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    8948                      .dwattr $C$DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    8949                      .dwattr $C$DW$922, DW_AT_accessibility(DW_ACCESS_public)
    8950              
    8951              $C$DW$923       .dwtag  DW_TAG_member
    8952                      .dwattr $C$DW$923, DW_AT_type(*$C$DW$T$31)
    8953                      .dwattr $C$DW$923, DW_AT_name("INTSELxNy")
    8954                      .dwattr $C$DW$923, DW_AT_TI_symbol_name("_INTSELxNy")
    8955                      .dwattr $C$DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    8956                      .dwattr $C$DW$923, DW_AT_accessibility(DW_ACCESS_public)
    8957              
    8958              $C$DW$924       .dwtag  DW_TAG_member
    8959                      .dwattr $C$DW$924, DW_AT_type(*$C$DW$T$32)
    8960                      .dwattr $C$DW$924, DW_AT_name("rsvd_3")
    8961                      .dwattr $C$DW$924, DW_AT_TI_symbol_name("_rsvd_3")
    8962                      .dwattr $C$DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    8963                      .dwattr $C$DW$924, DW_AT_accessibility(DW_ACCESS_public)
    8964              
    8965              $C$DW$925       .dwtag  DW_TAG_member
    8966                      .dwattr $C$DW$925, DW_AT_type(*$C$DW$T$27)
    8967                      .dwattr $C$DW$925, DW_AT_name("SOCPRICTRL")
    8968                      .dwattr $C$DW$925, DW_AT_TI_symbol_name("_SOCPRICTRL")
    8969                      .dwattr $C$DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    8970                      .dwattr $C$DW$925, DW_AT_accessibility(DW_ACCESS_public)
    8971              
    8972              $C$DW$926       .dwtag  DW_TAG_member
    8973                      .dwattr $C$DW$926, DW_AT_type(*$C$DW$T$27)
    8974                      .dwattr $C$DW$926, DW_AT_name("rsvd_4")
    8975                      .dwattr $C$DW$926, DW_AT_TI_symbol_name("_rsvd_4")
    8976                      .dwattr $C$DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    8977                      .dwattr $C$DW$926, DW_AT_accessibility(DW_ACCESS_public)
    8978              
    8979              $C$DW$927       .dwtag  DW_TAG_member
    8980                      .dwattr $C$DW$927, DW_AT_type(*$C$DW$T$27)
    8981                      .dwattr $C$DW$927, DW_AT_name("ADCSAMPLEMODE")
    8982                      .dwattr $C$DW$927, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    8983                      .dwattr $C$DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    8984                      .dwattr $C$DW$927, DW_AT_accessibility(DW_ACCESS_public)
    8985              
    8986              $C$DW$928       .dwtag  DW_TAG_member
    8987                      .dwattr $C$DW$928, DW_AT_type(*$C$DW$T$27)
    8988                      .dwattr $C$DW$928, DW_AT_name("rsvd_5")
    8989                      .dwattr $C$DW$928, DW_AT_TI_symbol_name("_rsvd_5")
    8990                      .dwattr $C$DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    8991                      .dwattr $C$DW$928, DW_AT_accessibility(DW_ACCESS_public)
    8992              
    8993              $C$DW$929       .dwtag  DW_TAG_member
    8994                      .dwattr $C$DW$929, DW_AT_type(*$C$DW$T$27)
    8995                      .dwattr $C$DW$929, DW_AT_name("ADCINTSOCSEL1")
    8996                      .dwattr $C$DW$929, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    8997                      .dwattr $C$DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    8998                      .dwattr $C$DW$929, DW_AT_accessibility(DW_ACCESS_public)
    8999              
    9000              $C$DW$930       .dwtag  DW_TAG_member
    9001                      .dwattr $C$DW$930, DW_AT_type(*$C$DW$T$27)
TMS320C2000 Assembler PC v22.6.0 Thu Feb 16 09:13:12 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{BAFF65D2-0E2D-4A9B-88E7-9F24ECAE7FAA} PAGE  177

    9002                      .dwattr $C$DW$930, DW_AT_name("ADCINTSOCSEL2")
    9003                      .dwattr $C$DW$930, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    9004                      .dwattr $C$DW$930, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    9005                      .dwattr $C$DW$930, DW_AT_accessibility(DW_ACCESS_public)
    9006              
    9007              $C$DW$931       .dwtag  DW_TAG_member
    9008                      .dwattr $C$DW$931, DW_AT_type(*$C$DW$T$30)
    9009                      .dwattr $C$DW$931, DW_AT_name("rsvd_6")
    9010                      .dwattr $C$DW$931, DW_AT_TI_symbol_name("_rsvd_6")
    9011                      .dwattr $C$DW$931, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    9012                      .dwattr $C$DW$931, DW_AT_accessibility(DW_ACCESS_public)
    9013              
    9014              $C$DW$932       .dwtag  DW_TAG_member
    9015                      .dwattr $C$DW$932, DW_AT_type(*$C$DW$T$27)
    9016                      .dwattr $C$DW$932, DW_AT_name("ADCSOCFLG1")
    9017                      .dwattr $C$DW$932, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    9018                      .dwattr $C$DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    9019                      .dwattr $C$DW$932, DW_AT_accessibility(DW_ACCESS_public)
    9020              
    9021              $C$DW$933       .dwtag  DW_TAG_member
    9022                      .dwattr $C$DW$933, DW_AT_type(*$C$DW$T$27)
    9023                      .dwattr $C$DW$933, DW_AT_name("rsvd_7")
    9024                      .dwattr $C$DW$933, DW_AT_TI_symbol_name("_rsvd_7")
    9025                      .dwattr $C$DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    9026                      .dwattr $C$DW$933, DW_AT_accessibility(DW_ACCESS_public)
    9027              
    9028              $C$DW$934       .dwtag  DW_TAG_member
    9029                      .dwattr $C$DW$934, DW_AT_type(*$C$DW$T$27)
    9030                      .dwattr $C$DW$934, DW_AT_name("ADCSOCFRC1")
    9031                      .dwattr $C$DW$934, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    9032                      .dwattr $C$DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    9033                      .dwattr $C$DW$934, DW_AT_accessibility(DW_ACCESS_public)
    9034              
    9035              $C$DW$935       .dwtag  DW_TAG_member
    9036                      .dwattr $C$DW$935, DW_AT_type(*$C$DW$T$27)
    9037                      .dwattr $C$DW$935, DW_AT_name("rsvd_8")
    9038                      .dwattr $C$DW$935, DW_AT_TI_symbol_name("_rsvd_8")
    9039                      .dwattr $C$DW$935, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    9040                      .dwattr $C$DW$935, DW_AT_accessibility(DW_ACCESS_public)
    9041              
    9042              $C$DW$936       .dwtag  DW_TAG_member
    9043                      .dwattr $C$DW$936, DW_AT_type(*$C$DW$T$27)
    9044                      .dwattr $C$DW$936, DW_AT_name("ADCSOCOVF1")
    9045                      .dwattr $C$DW$936, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    9046                      .dwattr $C$DW$936, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    9047                      .dwattr $C$DW$936, DW_AT_accessibility(DW_ACCESS_public)
    9048              
    9049              $C$DW$937       .dwtag  DW_TAG_member
    9050                      .dwattr $C$DW$937, DW_AT_type(*$C$DW$T$27)
    9051                      .dwattr $C$DW$937, DW_AT_name("rsvd_9")
    9052                      .dwattr $C$DW$937, DW_AT_TI_symbol_name("_rsvd_9")
    9053                      .dwattr $C$DW$937, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    9054                      .dwattr $C$DW$937, DW_AT_accessibility(DW_ACCESS_public)
    9055              
    9056              $C$DW$938       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Thu Feb 16 09:13:12 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{BAFF65D2-0E2D-4A9B-88E7-9F24ECAE7FAA} PAGE  178

    9057                      .dwattr $C$DW$938, DW_AT_type(*$C$DW$T$27)
    9058                      .dwattr $C$DW$938, DW_AT_name("ADCSOCOVFCLR1")
    9059                      .dwattr $C$DW$938, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    9060                      .dwattr $C$DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    9061                      .dwattr $C$DW$938, DW_AT_accessibility(DW_ACCESS_public)
    9062              
    9063              $C$DW$939       .dwtag  DW_TAG_member
    9064                      .dwattr $C$DW$939, DW_AT_type(*$C$DW$T$27)
    9065                      .dwattr $C$DW$939, DW_AT_name("rsvd_10")
    9066                      .dwattr $C$DW$939, DW_AT_TI_symbol_name("_rsvd_10")
    9067                      .dwattr $C$DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    9068                      .dwattr $C$DW$939, DW_AT_accessibility(DW_ACCESS_public)
    9069              
    9070              $C$DW$940       .dwtag  DW_TAG_member
    9071                      .dwattr $C$DW$940, DW_AT_type(*$C$DW$T$28)
    9072                      .dwattr $C$DW$940, DW_AT_name("ADCSOCxCTL")
    9073                      .dwattr $C$DW$940, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    9074                      .dwattr $C$DW$940, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    9075                      .dwattr $C$DW$940, DW_AT_accessibility(DW_ACCESS_public)
    9076              
    9077              $C$DW$941       .dwtag  DW_TAG_member
    9078                      .dwattr $C$DW$941, DW_AT_type(*$C$DW$T$28)
    9079                      .dwattr $C$DW$941, DW_AT_name("rsvd_11")
    9080                      .dwattr $C$DW$941, DW_AT_TI_symbol_name("_rsvd_11")
    9081                      .dwattr $C$DW$941, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    9082                      .dwattr $C$DW$941, DW_AT_accessibility(DW_ACCESS_public)
    9083              
    9084              $C$DW$942       .dwtag  DW_TAG_member
    9085                      .dwattr $C$DW$942, DW_AT_type(*$C$DW$T$27)
    9086                      .dwattr $C$DW$942, DW_AT_name("ADCREFTRIM")
    9087                      .dwattr $C$DW$942, DW_AT_TI_symbol_name("_ADCREFTRIM")
    9088                      .dwattr $C$DW$942, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    9089                      .dwattr $C$DW$942, DW_AT_accessibility(DW_ACCESS_public)
    9090              
    9091              $C$DW$943       .dwtag  DW_TAG_member
    9092                      .dwattr $C$DW$943, DW_AT_type(*$C$DW$T$27)
    9093                      .dwattr $C$DW$943, DW_AT_name("ADCOFFTRIM")
    9094                      .dwattr $C$DW$943, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    9095                      .dwattr $C$DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    9096                      .dwattr $C$DW$943, DW_AT_accessibility(DW_ACCESS_public)
    9097              
    9098              $C$DW$944       .dwtag  DW_TAG_member
    9099                      .dwattr $C$DW$944, DW_AT_type(*$C$DW$T$33)
    9100                      .dwattr $C$DW$944, DW_AT_name("resvd_12")
    9101                      .dwattr $C$DW$944, DW_AT_TI_symbol_name("_resvd_12")
    9102                      .dwattr $C$DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    9103                      .dwattr $C$DW$944, DW_AT_accessibility(DW_ACCESS_public)
    9104              
    9105              $C$DW$945       .dwtag  DW_TAG_member
    9106                      .dwattr $C$DW$945, DW_AT_type(*$C$DW$T$27)
    9107                      .dwattr $C$DW$945, DW_AT_name("ADCREV")
    9108                      .dwattr $C$DW$945, DW_AT_TI_symbol_name("_ADCREV")
    9109                      .dwattr $C$DW$945, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    9110                      .dwattr $C$DW$945, DW_AT_accessibility(DW_ACCESS_public)
    9111              
TMS320C2000 Assembler PC v22.6.0 Thu Feb 16 09:13:12 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{BAFF65D2-0E2D-4A9B-88E7-9F24ECAE7FAA} PAGE  179

    9112                      .dwendtag $C$DW$T$34
    9113              
    9114              $C$DW$T$238     .dwtag  DW_TAG_typedef
    9115                      .dwattr $C$DW$T$238, DW_AT_name("ADC_Obj")
    9116                      .dwattr $C$DW$T$238, DW_AT_type(*$C$DW$T$34)
    9117                      .dwattr $C$DW$T$238, DW_AT_language(DW_LANG_C)
    9118              
    9119              $C$DW$T$124     .dwtag  DW_TAG_pointer_type
    9120                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$34)
    9121                      .dwattr $C$DW$T$124, DW_AT_address_class(0x20)
    9122              
    9123              $C$DW$T$125     .dwtag  DW_TAG_typedef
    9124                      .dwattr $C$DW$T$125, DW_AT_name("ADC_Handle")
    9125                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
    9126                      .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    9127              
    9128              
    9129              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    9130                      .dwattr $C$DW$T$20, DW_AT_name("_AFSEL_Obj_")
    9131                      .dwattr $C$DW$T$20, DW_AT_declaration
    9132                      .dwendtag $C$DW$T$20
    9133              
    9134              $C$DW$T$239     .dwtag  DW_TAG_pointer_type
    9135                      .dwattr $C$DW$T$239, DW_AT_type(*$C$DW$T$20)
    9136                      .dwattr $C$DW$T$239, DW_AT_address_class(0x20)
    9137              
    9138              $C$DW$T$240     .dwtag  DW_TAG_typedef
    9139                      .dwattr $C$DW$T$240, DW_AT_name("AFSEL_Handle")
    9140                      .dwattr $C$DW$T$240, DW_AT_type(*$C$DW$T$239)
    9141                      .dwattr $C$DW$T$240, DW_AT_language(DW_LANG_C)
    9142              
    9143              
    9144              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    9145                      .dwattr $C$DW$T$38, DW_AT_name("_CLARKE_Obj_")
    9146                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x06)
    9147              $C$DW$946       .dwtag  DW_TAG_member
    9148                      .dwattr $C$DW$946, DW_AT_type(*$C$DW$T$35)
    9149                      .dwattr $C$DW$946, DW_AT_name("alpha_sf")
    9150                      .dwattr $C$DW$946, DW_AT_TI_symbol_name("_alpha_sf")
    9151                      .dwattr $C$DW$946, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9152                      .dwattr $C$DW$946, DW_AT_accessibility(DW_ACCESS_public)
    9153              
    9154              $C$DW$947       .dwtag  DW_TAG_member
    9155                      .dwattr $C$DW$947, DW_AT_type(*$C$DW$T$35)
    9156                      .dwattr $C$DW$947, DW_AT_name("beta_sf")
    9157                      .dwattr $C$DW$947, DW_AT_TI_symbol_name("_beta_sf")
    9158                      .dwattr $C$DW$947, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9159                      .dwattr $C$DW$947, DW_AT_accessibility(DW_ACCESS_public)
    9160              
    9161              $C$DW$948       .dwtag  DW_TAG_member
    9162                      .dwattr $C$DW$948, DW_AT_type(*$C$DW$T$37)
    9163                      .dwattr $C$DW$948, DW_AT_name("numSensors")
    9164                      .dwattr $C$DW$948, DW_AT_TI_symbol_name("_numSensors")
    9165                      .dwattr $C$DW$948, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9166                      .dwattr $C$DW$948, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Thu Feb 16 09:13:12 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{BAFF65D2-0E2D-4A9B-88E7-9F24ECAE7FAA} PAGE  180

    9167              
    9168                      .dwendtag $C$DW$T$38
    9169              
    9170              $C$DW$T$49      .dwtag  DW_TAG_typedef
    9171                      .dwattr $C$DW$T$49, DW_AT_name("CLARKE_Obj")
    9172                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$38)
    9173                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    9174              
    9175              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    9176                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$38)
    9177                      .dwattr $C$DW$T$47, DW_AT_address_class(0x20)
    9178              
    9179              $C$DW$T$48      .dwtag  DW_TAG_typedef
    9180                      .dwattr $C$DW$T$48, DW_AT_name("CLARKE_Handle")
    9181                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    9182                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    9183              
    9184              $C$DW$949       .dwtag  DW_TAG_TI_far_type
    9185                      .dwattr $C$DW$949, DW_AT_type(*$C$DW$T$48)
    9186              
    9187              $C$DW$T$244     .dwtag  DW_TAG_const_type
    9188                      .dwattr $C$DW$T$244, DW_AT_type(*$C$DW$949)
    9189              
    9190              
    9191              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    9192                      .dwattr $C$DW$T$40, DW_AT_name("_CLK_Obj_")
    9193                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x11)
    9194              $C$DW$950       .dwtag  DW_TAG_member
    9195                      .dwattr $C$DW$950, DW_AT_type(*$C$DW$T$27)
    9196                      .dwattr $C$DW$950, DW_AT_name("XCLK")
    9197                      .dwattr $C$DW$950, DW_AT_TI_symbol_name("_XCLK")
    9198                      .dwattr $C$DW$950, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9199                      .dwattr $C$DW$950, DW_AT_accessibility(DW_ACCESS_public)
    9200              
    9201              $C$DW$951       .dwtag  DW_TAG_member
    9202                      .dwattr $C$DW$951, DW_AT_type(*$C$DW$T$27)
    9203                      .dwattr $C$DW$951, DW_AT_name("rsvd_1")
    9204                      .dwattr $C$DW$951, DW_AT_TI_symbol_name("_rsvd_1")
    9205                      .dwattr $C$DW$951, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9206                      .dwattr $C$DW$951, DW_AT_accessibility(DW_ACCESS_public)
    9207              
    9208              $C$DW$952       .dwtag  DW_TAG_member
    9209                      .dwattr $C$DW$952, DW_AT_type(*$C$DW$T$27)
    9210                      .dwattr $C$DW$952, DW_AT_name("CLKCTL")
    9211                      .dwattr $C$DW$952, DW_AT_TI_symbol_name("_CLKCTL")
    9212                      .dwattr $C$DW$952, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9213                      .dwattr $C$DW$952, DW_AT_accessibility(DW_ACCESS_public)
    9214              
    9215              $C$DW$953       .dwtag  DW_TAG_member
    9216                      .dwattr $C$DW$953, DW_AT_type(*$C$DW$T$39)
    9217                      .dwattr $C$DW$953, DW_AT_name("rsvd_2")
    9218                      .dwattr $C$DW$953, DW_AT_TI_symbol_name("_rsvd_2")
    9219                      .dwattr $C$DW$953, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9220                      .dwattr $C$DW$953, DW_AT_accessibility(DW_ACCESS_public)
    9221              
TMS320C2000 Assembler PC v22.6.0 Thu Feb 16 09:13:12 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{BAFF65D2-0E2D-4A9B-88E7-9F24ECAE7FAA} PAGE  181

    9222              $C$DW$954       .dwtag  DW_TAG_member
    9223                      .dwattr $C$DW$954, DW_AT_type(*$C$DW$T$27)
    9224                      .dwattr $C$DW$954, DW_AT_name("LOSPCP")
    9225                      .dwattr $C$DW$954, DW_AT_TI_symbol_name("_LOSPCP")
    9226                      .dwattr $C$DW$954, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    9227                      .dwattr $C$DW$954, DW_AT_accessibility(DW_ACCESS_public)
    9228              
    9229              $C$DW$955       .dwtag  DW_TAG_member
    9230                      .dwattr $C$DW$955, DW_AT_type(*$C$DW$T$27)
    9231                      .dwattr $C$DW$955, DW_AT_name("PCLKCR0")
    9232                      .dwattr $C$DW$955, DW_AT_TI_symbol_name("_PCLKCR0")
    9233                      .dwattr $C$DW$955, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9234                      .dwattr $C$DW$955, DW_AT_accessibility(DW_ACCESS_public)
    9235              
    9236              $C$DW$956       .dwtag  DW_TAG_member
    9237                      .dwattr $C$DW$956, DW_AT_type(*$C$DW$T$27)
    9238                      .dwattr $C$DW$956, DW_AT_name("PCLKCR1")
    9239                      .dwattr $C$DW$956, DW_AT_TI_symbol_name("_PCLKCR1")
    9240                      .dwattr $C$DW$956, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    9241                      .dwattr $C$DW$956, DW_AT_accessibility(DW_ACCESS_public)
    9242              
    9243              $C$DW$957       .dwtag  DW_TAG_member
    9244                      .dwattr $C$DW$957, DW_AT_type(*$C$DW$T$30)
    9245                      .dwattr $C$DW$957, DW_AT_name("rsvd_3")
    9246                      .dwattr $C$DW$957, DW_AT_TI_symbol_name("_rsvd_3")
    9247                      .dwattr $C$DW$957, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9248                      .dwattr $C$DW$957, DW_AT_accessibility(DW_ACCESS_public)
    9249              
    9250              $C$DW$958       .dwtag  DW_TAG_member
    9251                      .dwattr $C$DW$958, DW_AT_type(*$C$DW$T$27)
    9252                      .dwattr $C$DW$958, DW_AT_name("PCLKCR3")
    9253                      .dwattr $C$DW$958, DW_AT_TI_symbol_name("_PCLKCR3")
    9254                      .dwattr $C$DW$958, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9255                      .dwattr $C$DW$958, DW_AT_accessibility(DW_ACCESS_public)
    9256              
    9257                      .dwendtag $C$DW$T$40
    9258              
    9259              $C$DW$T$126     .dwtag  DW_TAG_pointer_type
    9260                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$40)
    9261                      .dwattr $C$DW$T$126, DW_AT_address_class(0x20)
    9262              
    9263              $C$DW$T$127     .dwtag  DW_TAG_typedef
    9264                      .dwattr $C$DW$T$127, DW_AT_name("CLK_Handle")
    9265                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
    9266                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    9267              
    9268              
    9269              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    9270                      .dwattr $C$DW$T$41, DW_AT_name("_CPU_Obj_")
    9271                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    9272              $C$DW$959       .dwtag  DW_TAG_member
    9273                      .dwattr $C$DW$959, DW_AT_type(*$C$DW$T$37)
    9274                      .dwattr $C$DW$959, DW_AT_name("tmp")
    9275                      .dwattr $C$DW$959, DW_AT_TI_symbol_name("_tmp")
    9276                      .dwattr $C$DW$959, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.0 Thu Feb 16 09:13:12 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{BAFF65D2-0E2D-4A9B-88E7-9F24ECAE7FAA} PAGE  182

    9277                      .dwattr $C$DW$959, DW_AT_accessibility(DW_ACCESS_public)
    9278              
    9279                      .dwendtag $C$DW$T$41
    9280              
    9281              $C$DW$T$128     .dwtag  DW_TAG_pointer_type
    9282                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$41)
    9283                      .dwattr $C$DW$T$128, DW_AT_address_class(0x20)
    9284              
    9285              $C$DW$T$129     .dwtag  DW_TAG_typedef
    9286                      .dwattr $C$DW$T$129, DW_AT_name("CPU_Handle")
    9287                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$128)
    9288                      .dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
    9289              
    9290              
    9291              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    9292                      .dwattr $C$DW$T$77, DW_AT_name("_CTRL_Obj_")
    9293                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x10a)
    9294              $C$DW$960       .dwtag  DW_TAG_member
    9295                      .dwattr $C$DW$960, DW_AT_type(*$C$DW$T$42)
    9296                      .dwattr $C$DW$960, DW_AT_name("version")
    9297                      .dwattr $C$DW$960, DW_AT_TI_symbol_name("_version")
    9298                      .dwattr $C$DW$960, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9299                      .dwattr $C$DW$960, DW_AT_accessibility(DW_ACCESS_public)
    9300              
    9301              $C$DW$961       .dwtag  DW_TAG_member
    9302                      .dwattr $C$DW$961, DW_AT_type(*$C$DW$T$44)
    9303                      .dwattr $C$DW$961, DW_AT_name("state")
    9304                      .dwattr $C$DW$961, DW_AT_TI_symbol_name("_state")
    9305                      .dwattr $C$DW$961, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9306                      .dwattr $C$DW$961, DW_AT_accessibility(DW_ACCESS_public)
    9307              
    9308              $C$DW$962       .dwtag  DW_TAG_member
    9309                      .dwattr $C$DW$962, DW_AT_type(*$C$DW$T$44)
    9310                      .dwattr $C$DW$962, DW_AT_name("prevState")
    9311                      .dwattr $C$DW$962, DW_AT_TI_symbol_name("_prevState")
    9312                      .dwattr $C$DW$962, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9313                      .dwattr $C$DW$962, DW_AT_accessibility(DW_ACCESS_public)
    9314              
    9315              $C$DW$963       .dwtag  DW_TAG_member
    9316                      .dwattr $C$DW$963, DW_AT_type(*$C$DW$T$46)
    9317                      .dwattr $C$DW$963, DW_AT_name("errorCode")
    9318                      .dwattr $C$DW$963, DW_AT_TI_symbol_name("_errorCode")
    9319                      .dwattr $C$DW$963, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9320                      .dwattr $C$DW$963, DW_AT_accessibility(DW_ACCESS_public)
    9321              
    9322              $C$DW$964       .dwtag  DW_TAG_member
    9323                      .dwattr $C$DW$964, DW_AT_type(*$C$DW$T$48)
    9324                      .dwattr $C$DW$964, DW_AT_name("clarkeHandle_I")
    9325                      .dwattr $C$DW$964, DW_AT_TI_symbol_name("_clarkeHandle_I")
    9326                      .dwattr $C$DW$964, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9327                      .dwattr $C$DW$964, DW_AT_accessibility(DW_ACCESS_public)
    9328              
    9329              $C$DW$965       .dwtag  DW_TAG_member
    9330                      .dwattr $C$DW$965, DW_AT_type(*$C$DW$T$49)
    9331                      .dwattr $C$DW$965, DW_AT_name("clarke_I")
TMS320C2000 Assembler PC v22.6.0 Thu Feb 16 09:13:12 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{BAFF65D2-0E2D-4A9B-88E7-9F24ECAE7FAA} PAGE  183

    9332                      .dwattr $C$DW$965, DW_AT_TI_symbol_name("_clarke_I")
    9333                      .dwattr $C$DW$965, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9334                      .dwattr $C$DW$965, DW_AT_accessibility(DW_ACCESS_public)
    9335              
    9336              $C$DW$966       .dwtag  DW_TAG_member
    9337                      .dwattr $C$DW$966, DW_AT_type(*$C$DW$T$48)
    9338                      .dwattr $C$DW$966, DW_AT_name("clarkeHandle_V")
    9339                      .dwattr $C$DW$966, DW_AT_TI_symbol_name("_clarkeHandle_V")
    9340                      .dwattr $C$DW$966, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9341                      .dwattr $C$DW$966, DW_AT_accessibility(DW_ACCESS_public)
    9342              
    9343              $C$DW$967       .dwtag  DW_TAG_member
    9344                      .dwattr $C$DW$967, DW_AT_type(*$C$DW$T$49)
    9345                      .dwattr $C$DW$967, DW_AT_name("clarke_V")
    9346                      .dwattr $C$DW$967, DW_AT_TI_symbol_name("_clarke_V")
    9347                      .dwattr $C$DW$967, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9348                      .dwattr $C$DW$967, DW_AT_accessibility(DW_ACCESS_public)
    9349              
    9350              $C$DW$968       .dwtag  DW_TAG_member
    9351                      .dwattr $C$DW$968, DW_AT_type(*$C$DW$T$51)
    9352                      .dwattr $C$DW$968, DW_AT_name("estHandle")
    9353                      .dwattr $C$DW$968, DW_AT_TI_symbol_name("_estHandle")
    9354                      .dwattr $C$DW$968, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9355                      .dwattr $C$DW$968, DW_AT_accessibility(DW_ACCESS_public)
    9356              
    9357              $C$DW$969       .dwtag  DW_TAG_member
    9358                      .dwattr $C$DW$969, DW_AT_type(*$C$DW$T$53)
    9359                      .dwattr $C$DW$969, DW_AT_name("parkHandle")
    9360                      .dwattr $C$DW$969, DW_AT_TI_symbol_name("_parkHandle")
    9361                      .dwattr $C$DW$969, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9362                      .dwattr $C$DW$969, DW_AT_accessibility(DW_ACCESS_public)
    9363              
    9364              $C$DW$970       .dwtag  DW_TAG_member
    9365                      .dwattr $C$DW$970, DW_AT_type(*$C$DW$T$54)
    9366                      .dwattr $C$DW$970, DW_AT_name("park")
    9367                      .dwattr $C$DW$970, DW_AT_TI_symbol_name("_park")
    9368                      .dwattr $C$DW$970, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9369                      .dwattr $C$DW$970, DW_AT_accessibility(DW_ACCESS_public)
    9370              
    9371              $C$DW$971       .dwtag  DW_TAG_member
    9372                      .dwattr $C$DW$971, DW_AT_type(*$C$DW$T$56)
    9373                      .dwattr $C$DW$971, DW_AT_name("pidHandle_Id")
    9374                      .dwattr $C$DW$971, DW_AT_TI_symbol_name("_pidHandle_Id")
    9375                      .dwattr $C$DW$971, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    9376                      .dwattr $C$DW$971, DW_AT_accessibility(DW_ACCESS_public)
    9377              
    9378              $C$DW$972       .dwtag  DW_TAG_member
    9379                      .dwattr $C$DW$972, DW_AT_type(*$C$DW$T$57)
    9380                      .dwattr $C$DW$972, DW_AT_name("pid_Id")
    9381                      .dwattr $C$DW$972, DW_AT_TI_symbol_name("_pid_Id")
    9382                      .dwattr $C$DW$972, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    9383                      .dwattr $C$DW$972, DW_AT_accessibility(DW_ACCESS_public)
    9384              
    9385              $C$DW$973       .dwtag  DW_TAG_member
    9386                      .dwattr $C$DW$973, DW_AT_type(*$C$DW$T$56)
TMS320C2000 Assembler PC v22.6.0 Thu Feb 16 09:13:12 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{BAFF65D2-0E2D-4A9B-88E7-9F24ECAE7FAA} PAGE  184

    9387                      .dwattr $C$DW$973, DW_AT_name("pidHandle_Iq")
    9388                      .dwattr $C$DW$973, DW_AT_TI_symbol_name("_pidHandle_Iq")
    9389                      .dwattr $C$DW$973, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    9390                      .dwattr $C$DW$973, DW_AT_accessibility(DW_ACCESS_public)
    9391              
    9392              $C$DW$974       .dwtag  DW_TAG_member
    9393                      .dwattr $C$DW$974, DW_AT_type(*$C$DW$T$57)
    9394                      .dwattr $C$DW$974, DW_AT_name("pid_Iq")
    9395                      .dwattr $C$DW$974, DW_AT_TI_symbol_name("_pid_Iq")
    9396                      .dwattr $C$DW$974, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    9397                      .dwattr $C$DW$974, DW_AT_accessibility(DW_ACCESS_public)
    9398              
    9399              $C$DW$975       .dwtag  DW_TAG_member
    9400                      .dwattr $C$DW$975, DW_AT_type(*$C$DW$T$56)
    9401                      .dwattr $C$DW$975, DW_AT_name("pidHandle_spd")
    9402                      .dwattr $C$DW$975, DW_AT_TI_symbol_name("_pidHandle_spd")
    9403                      .dwattr $C$DW$975, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    9404                      .dwattr $C$DW$975, DW_AT_accessibility(DW_ACCESS_public)
    9405              
    9406              $C$DW$976       .dwtag  DW_TAG_member
    9407                      .dwattr $C$DW$976, DW_AT_type(*$C$DW$T$57)
    9408                      .dwattr $C$DW$976, DW_AT_name("pid_spd")
    9409                      .dwattr $C$DW$976, DW_AT_TI_symbol_name("_pid_spd")
    9410                      .dwattr $C$DW$976, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    9411                      .dwattr $C$DW$976, DW_AT_accessibility(DW_ACCESS_public)
    9412              
    9413              $C$DW$977       .dwtag  DW_TAG_member
    9414                      .dwattr $C$DW$977, DW_AT_type(*$C$DW$T$59)
    9415                      .dwattr $C$DW$977, DW_AT_name("iparkHandle")
    9416                      .dwattr $C$DW$977, DW_AT_TI_symbol_name("_iparkHandle")
    9417                      .dwattr $C$DW$977, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    9418                      .dwattr $C$DW$977, DW_AT_accessibility(DW_ACCESS_public)
    9419              
    9420              $C$DW$978       .dwtag  DW_TAG_member
    9421                      .dwattr $C$DW$978, DW_AT_type(*$C$DW$T$60)
    9422                      .dwattr $C$DW$978, DW_AT_name("ipark")
    9423                      .dwattr $C$DW$978, DW_AT_TI_symbol_name("_ipark")
    9424                      .dwattr $C$DW$978, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    9425                      .dwattr $C$DW$978, DW_AT_accessibility(DW_ACCESS_public)
    9426              
    9427              $C$DW$979       .dwtag  DW_TAG_member
    9428                      .dwattr $C$DW$979, DW_AT_type(*$C$DW$T$62)
    9429                      .dwattr $C$DW$979, DW_AT_name("svgenHandle")
    9430                      .dwattr $C$DW$979, DW_AT_TI_symbol_name("_svgenHandle")
    9431                      .dwattr $C$DW$979, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    9432                      .dwattr $C$DW$979, DW_AT_accessibility(DW_ACCESS_public)
    9433              
    9434              $C$DW$980       .dwtag  DW_TAG_member
    9435                      .dwattr $C$DW$980, DW_AT_type(*$C$DW$T$63)
    9436                      .dwattr $C$DW$980, DW_AT_name("svgen")
    9437                      .dwattr $C$DW$980, DW_AT_TI_symbol_name("_svgen")
    9438                      .dwattr $C$DW$980, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    9439                      .dwattr $C$DW$980, DW_AT_accessibility(DW_ACCESS_public)
    9440              
    9441              $C$DW$981       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Thu Feb 16 09:13:12 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{BAFF65D2-0E2D-4A9B-88E7-9F24ECAE7FAA} PAGE  185

    9442                      .dwattr $C$DW$981, DW_AT_type(*$C$DW$T$65)
    9443                      .dwattr $C$DW$981, DW_AT_name("trajHandle_Id")
    9444                      .dwattr $C$DW$981, DW_AT_TI_symbol_name("_trajHandle_Id")
    9445                      .dwattr $C$DW$981, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    9446                      .dwattr $C$DW$981, DW_AT_accessibility(DW_ACCESS_public)
    9447              
    9448              $C$DW$982       .dwtag  DW_TAG_member
    9449                      .dwattr $C$DW$982, DW_AT_type(*$C$DW$T$66)
    9450                      .dwattr $C$DW$982, DW_AT_name("traj_Id")
    9451                      .dwattr $C$DW$982, DW_AT_TI_symbol_name("_traj_Id")
    9452                      .dwattr $C$DW$982, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    9453                      .dwattr $C$DW$982, DW_AT_accessibility(DW_ACCESS_public)
    9454              
    9455              $C$DW$983       .dwtag  DW_TAG_member
    9456                      .dwattr $C$DW$983, DW_AT_type(*$C$DW$T$65)
    9457                      .dwattr $C$DW$983, DW_AT_name("trajHandle_spd")
    9458                      .dwattr $C$DW$983, DW_AT_TI_symbol_name("_trajHandle_spd")
    9459                      .dwattr $C$DW$983, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    9460                      .dwattr $C$DW$983, DW_AT_accessibility(DW_ACCESS_public)
    9461              
    9462              $C$DW$984       .dwtag  DW_TAG_member
    9463                      .dwattr $C$DW$984, DW_AT_type(*$C$DW$T$66)
    9464                      .dwattr $C$DW$984, DW_AT_name("traj_spd")
    9465                      .dwattr $C$DW$984, DW_AT_TI_symbol_name("_traj_spd")
    9466                      .dwattr $C$DW$984, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    9467                      .dwattr $C$DW$984, DW_AT_accessibility(DW_ACCESS_public)
    9468              
    9469              $C$DW$985       .dwtag  DW_TAG_member
    9470                      .dwattr $C$DW$985, DW_AT_type(*$C$DW$T$65)
    9471                      .dwattr $C$DW$985, DW_AT_name("trajHandle_spdMax")
    9472                      .dwattr $C$DW$985, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    9473                      .dwattr $C$DW$985, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    9474                      .dwattr $C$DW$985, DW_AT_accessibility(DW_ACCESS_public)
    9475              
    9476              $C$DW$986       .dwtag  DW_TAG_member
    9477                      .dwattr $C$DW$986, DW_AT_type(*$C$DW$T$66)
    9478                      .dwattr $C$DW$986, DW_AT_name("traj_spdMax")
    9479                      .dwattr $C$DW$986, DW_AT_TI_symbol_name("_traj_spdMax")
    9480                      .dwattr $C$DW$986, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    9481                      .dwattr $C$DW$986, DW_AT_accessibility(DW_ACCESS_public)
    9482              
    9483              $C$DW$987       .dwtag  DW_TAG_member
    9484                      .dwattr $C$DW$987, DW_AT_type(*$C$DW$T$67)
    9485                      .dwattr $C$DW$987, DW_AT_name("motorParams")
    9486                      .dwattr $C$DW$987, DW_AT_TI_symbol_name("_motorParams")
    9487                      .dwattr $C$DW$987, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    9488                      .dwattr $C$DW$987, DW_AT_accessibility(DW_ACCESS_public)
    9489              
    9490              $C$DW$988       .dwtag  DW_TAG_member
    9491                      .dwattr $C$DW$988, DW_AT_type(*$C$DW$T$71)
    9492                      .dwattr $C$DW$988, DW_AT_name("waitTimes")
    9493                      .dwattr $C$DW$988, DW_AT_TI_symbol_name("_waitTimes")
    9494                      .dwattr $C$DW$988, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    9495                      .dwattr $C$DW$988, DW_AT_accessibility(DW_ACCESS_public)
    9496              
TMS320C2000 Assembler PC v22.6.0 Thu Feb 16 09:13:12 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{BAFF65D2-0E2D-4A9B-88E7-9F24ECAE7FAA} PAGE  186

    9497              $C$DW$989       .dwtag  DW_TAG_member
    9498                      .dwattr $C$DW$989, DW_AT_type(*$C$DW$T$70)
    9499                      .dwattr $C$DW$989, DW_AT_name("counter_state")
    9500                      .dwattr $C$DW$989, DW_AT_TI_symbol_name("_counter_state")
    9501                      .dwattr $C$DW$989, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    9502                      .dwattr $C$DW$989, DW_AT_accessibility(DW_ACCESS_public)
    9503              
    9504              $C$DW$990       .dwtag  DW_TAG_member
    9505                      .dwattr $C$DW$990, DW_AT_type(*$C$DW$T$73)
    9506                      .dwattr $C$DW$990, DW_AT_name("numIsrTicksPerCtrlTick")
    9507                      .dwattr $C$DW$990, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    9508                      .dwattr $C$DW$990, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    9509                      .dwattr $C$DW$990, DW_AT_accessibility(DW_ACCESS_public)
    9510              
    9511              $C$DW$991       .dwtag  DW_TAG_member
    9512                      .dwattr $C$DW$991, DW_AT_type(*$C$DW$T$73)
    9513                      .dwattr $C$DW$991, DW_AT_name("numCtrlTicksPerCurrentTick")
    9514                      .dwattr $C$DW$991, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    9515                      .dwattr $C$DW$991, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    9516                      .dwattr $C$DW$991, DW_AT_accessibility(DW_ACCESS_public)
    9517              
    9518              $C$DW$992       .dwtag  DW_TAG_member
    9519                      .dwattr $C$DW$992, DW_AT_type(*$C$DW$T$73)
    9520                      .dwattr $C$DW$992, DW_AT_name("numCtrlTicksPerSpeedTick")
    9521                      .dwattr $C$DW$992, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    9522                      .dwattr $C$DW$992, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    9523                      .dwattr $C$DW$992, DW_AT_accessibility(DW_ACCESS_public)
    9524              
    9525              $C$DW$993       .dwtag  DW_TAG_member
    9526                      .dwattr $C$DW$993, DW_AT_type(*$C$DW$T$73)
    9527                      .dwattr $C$DW$993, DW_AT_name("numCtrlTicksPerTrajTick")
    9528                      .dwattr $C$DW$993, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    9529                      .dwattr $C$DW$993, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    9530                      .dwattr $C$DW$993, DW_AT_accessibility(DW_ACCESS_public)
    9531              
    9532              $C$DW$994       .dwtag  DW_TAG_member
    9533                      .dwattr $C$DW$994, DW_AT_type(*$C$DW$T$70)
    9534                      .dwattr $C$DW$994, DW_AT_name("ctrlFreq_Hz")
    9535                      .dwattr $C$DW$994, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    9536                      .dwattr $C$DW$994, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    9537                      .dwattr $C$DW$994, DW_AT_accessibility(DW_ACCESS_public)
    9538              
    9539              $C$DW$995       .dwtag  DW_TAG_member
    9540                      .dwattr $C$DW$995, DW_AT_type(*$C$DW$T$70)
    9541                      .dwattr $C$DW$995, DW_AT_name("trajFreq_Hz")
    9542                      .dwattr $C$DW$995, DW_AT_TI_symbol_name("_trajFreq_Hz")
    9543                      .dwattr $C$DW$995, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    9544                      .dwattr $C$DW$995, DW_AT_accessibility(DW_ACCESS_public)
    9545              
    9546              $C$DW$996       .dwtag  DW_TAG_member
    9547                      .dwattr $C$DW$996, DW_AT_type(*$C$DW$T$35)
    9548                      .dwattr $C$DW$996, DW_AT_name("trajPeriod_sec")
    9549                      .dwattr $C$DW$996, DW_AT_TI_symbol_name("_trajPeriod_sec")
    9550                      .dwattr $C$DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    9551                      .dwattr $C$DW$996, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Thu Feb 16 09:13:12 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{BAFF65D2-0E2D-4A9B-88E7-9F24ECAE7FAA} PAGE  187

    9552              
    9553              $C$DW$997       .dwtag  DW_TAG_member
    9554                      .dwattr $C$DW$997, DW_AT_type(*$C$DW$T$74)
    9555                      .dwattr $C$DW$997, DW_AT_name("ctrlPeriod_sec")
    9556                      .dwattr $C$DW$997, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    9557                      .dwattr $C$DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    9558                      .dwattr $C$DW$997, DW_AT_accessibility(DW_ACCESS_public)
    9559              
    9560              $C$DW$998       .dwtag  DW_TAG_member
    9561                      .dwattr $C$DW$998, DW_AT_type(*$C$DW$T$35)
    9562                      .dwattr $C$DW$998, DW_AT_name("maxVsMag_pu")
    9563                      .dwattr $C$DW$998, DW_AT_TI_symbol_name("_maxVsMag_pu")
    9564                      .dwattr $C$DW$998, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    9565                      .dwattr $C$DW$998, DW_AT_accessibility(DW_ACCESS_public)
    9566              
    9567              $C$DW$999       .dwtag  DW_TAG_member
    9568                      .dwattr $C$DW$999, DW_AT_type(*$C$DW$T$75)
    9569                      .dwattr $C$DW$999, DW_AT_name("Iab_in")
    9570                      .dwattr $C$DW$999, DW_AT_TI_symbol_name("_Iab_in")
    9571                      .dwattr $C$DW$999, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    9572                      .dwattr $C$DW$999, DW_AT_accessibility(DW_ACCESS_public)
    9573              
    9574              $C$DW$1000      .dwtag  DW_TAG_member
    9575                      .dwattr $C$DW$1000, DW_AT_type(*$C$DW$T$75)
    9576                      .dwattr $C$DW$1000, DW_AT_name("Iab_filt")
    9577                      .dwattr $C$DW$1000, DW_AT_TI_symbol_name("_Iab_filt")
    9578                      .dwattr $C$DW$1000, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    9579                      .dwattr $C$DW$1000, DW_AT_accessibility(DW_ACCESS_public)
    9580              
    9581              $C$DW$1001      .dwtag  DW_TAG_member
    9582                      .dwattr $C$DW$1001, DW_AT_type(*$C$DW$T$75)
    9583                      .dwattr $C$DW$1001, DW_AT_name("Idq_in")
    9584                      .dwattr $C$DW$1001, DW_AT_TI_symbol_name("_Idq_in")
    9585                      .dwattr $C$DW$1001, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    9586                      .dwattr $C$DW$1001, DW_AT_accessibility(DW_ACCESS_public)
    9587              
    9588              $C$DW$1002      .dwtag  DW_TAG_member
    9589                      .dwattr $C$DW$1002, DW_AT_type(*$C$DW$T$75)
    9590                      .dwattr $C$DW$1002, DW_AT_name("Vab_in")
    9591                      .dwattr $C$DW$1002, DW_AT_TI_symbol_name("_Vab_in")
    9592                      .dwattr $C$DW$1002, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    9593                      .dwattr $C$DW$1002, DW_AT_accessibility(DW_ACCESS_public)
    9594              
    9595              $C$DW$1003      .dwtag  DW_TAG_member
    9596                      .dwattr $C$DW$1003, DW_AT_type(*$C$DW$T$35)
    9597                      .dwattr $C$DW$1003, DW_AT_name("spd_out")
    9598                      .dwattr $C$DW$1003, DW_AT_TI_symbol_name("_spd_out")
    9599                      .dwattr $C$DW$1003, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    9600                      .dwattr $C$DW$1003, DW_AT_accessibility(DW_ACCESS_public)
    9601              
    9602              $C$DW$1004      .dwtag  DW_TAG_member
    9603                      .dwattr $C$DW$1004, DW_AT_type(*$C$DW$T$75)
    9604                      .dwattr $C$DW$1004, DW_AT_name("Vab_out")
    9605                      .dwattr $C$DW$1004, DW_AT_TI_symbol_name("_Vab_out")
    9606                      .dwattr $C$DW$1004, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
TMS320C2000 Assembler PC v22.6.0 Thu Feb 16 09:13:12 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{BAFF65D2-0E2D-4A9B-88E7-9F24ECAE7FAA} PAGE  188

    9607                      .dwattr $C$DW$1004, DW_AT_accessibility(DW_ACCESS_public)
    9608              
    9609              $C$DW$1005      .dwtag  DW_TAG_member
    9610                      .dwattr $C$DW$1005, DW_AT_type(*$C$DW$T$75)
    9611                      .dwattr $C$DW$1005, DW_AT_name("Vdq_out")
    9612                      .dwattr $C$DW$1005, DW_AT_TI_symbol_name("_Vdq_out")
    9613                      .dwattr $C$DW$1005, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    9614                      .dwattr $C$DW$1005, DW_AT_accessibility(DW_ACCESS_public)
    9615              
    9616              $C$DW$1006      .dwtag  DW_TAG_member
    9617                      .dwattr $C$DW$1006, DW_AT_type(*$C$DW$T$74)
    9618                      .dwattr $C$DW$1006, DW_AT_name("Rhf")
    9619                      .dwattr $C$DW$1006, DW_AT_TI_symbol_name("_Rhf")
    9620                      .dwattr $C$DW$1006, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    9621                      .dwattr $C$DW$1006, DW_AT_accessibility(DW_ACCESS_public)
    9622              
    9623              $C$DW$1007      .dwtag  DW_TAG_member
    9624                      .dwattr $C$DW$1007, DW_AT_type(*$C$DW$T$74)
    9625                      .dwattr $C$DW$1007, DW_AT_name("Lhf")
    9626                      .dwattr $C$DW$1007, DW_AT_TI_symbol_name("_Lhf")
    9627                      .dwattr $C$DW$1007, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    9628                      .dwattr $C$DW$1007, DW_AT_accessibility(DW_ACCESS_public)
    9629              
    9630              $C$DW$1008      .dwtag  DW_TAG_member
    9631                      .dwattr $C$DW$1008, DW_AT_type(*$C$DW$T$74)
    9632                      .dwattr $C$DW$1008, DW_AT_name("RoverL")
    9633                      .dwattr $C$DW$1008, DW_AT_TI_symbol_name("_RoverL")
    9634                      .dwattr $C$DW$1008, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    9635                      .dwattr $C$DW$1008, DW_AT_accessibility(DW_ACCESS_public)
    9636              
    9637              $C$DW$1009      .dwtag  DW_TAG_member
    9638                      .dwattr $C$DW$1009, DW_AT_type(*$C$DW$T$35)
    9639                      .dwattr $C$DW$1009, DW_AT_name("Kp_Id")
    9640                      .dwattr $C$DW$1009, DW_AT_TI_symbol_name("_Kp_Id")
    9641                      .dwattr $C$DW$1009, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    9642                      .dwattr $C$DW$1009, DW_AT_accessibility(DW_ACCESS_public)
    9643              
    9644              $C$DW$1010      .dwtag  DW_TAG_member
    9645                      .dwattr $C$DW$1010, DW_AT_type(*$C$DW$T$35)
    9646                      .dwattr $C$DW$1010, DW_AT_name("Kp_Iq")
    9647                      .dwattr $C$DW$1010, DW_AT_TI_symbol_name("_Kp_Iq")
    9648                      .dwattr $C$DW$1010, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    9649                      .dwattr $C$DW$1010, DW_AT_accessibility(DW_ACCESS_public)
    9650              
    9651              $C$DW$1011      .dwtag  DW_TAG_member
    9652                      .dwattr $C$DW$1011, DW_AT_type(*$C$DW$T$35)
    9653                      .dwattr $C$DW$1011, DW_AT_name("Kp_spd")
    9654                      .dwattr $C$DW$1011, DW_AT_TI_symbol_name("_Kp_spd")
    9655                      .dwattr $C$DW$1011, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    9656                      .dwattr $C$DW$1011, DW_AT_accessibility(DW_ACCESS_public)
    9657              
    9658              $C$DW$1012      .dwtag  DW_TAG_member
    9659                      .dwattr $C$DW$1012, DW_AT_type(*$C$DW$T$35)
    9660                      .dwattr $C$DW$1012, DW_AT_name("Ki_Id")
    9661                      .dwattr $C$DW$1012, DW_AT_TI_symbol_name("_Ki_Id")
TMS320C2000 Assembler PC v22.6.0 Thu Feb 16 09:13:12 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{BAFF65D2-0E2D-4A9B-88E7-9F24ECAE7FAA} PAGE  189

    9662                      .dwattr $C$DW$1012, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    9663                      .dwattr $C$DW$1012, DW_AT_accessibility(DW_ACCESS_public)
    9664              
    9665              $C$DW$1013      .dwtag  DW_TAG_member
    9666                      .dwattr $C$DW$1013, DW_AT_type(*$C$DW$T$35)
    9667                      .dwattr $C$DW$1013, DW_AT_name("Ki_Iq")
    9668                      .dwattr $C$DW$1013, DW_AT_TI_symbol_name("_Ki_Iq")
    9669                      .dwattr $C$DW$1013, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    9670                      .dwattr $C$DW$1013, DW_AT_accessibility(DW_ACCESS_public)
    9671              
    9672              $C$DW$1014      .dwtag  DW_TAG_member
    9673                      .dwattr $C$DW$1014, DW_AT_type(*$C$DW$T$35)
    9674                      .dwattr $C$DW$1014, DW_AT_name("Ki_spd")
    9675                      .dwattr $C$DW$1014, DW_AT_TI_symbol_name("_Ki_spd")
    9676                      .dwattr $C$DW$1014, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    9677                      .dwattr $C$DW$1014, DW_AT_accessibility(DW_ACCESS_public)
    9678              
    9679              $C$DW$1015      .dwtag  DW_TAG_member
    9680                      .dwattr $C$DW$1015, DW_AT_type(*$C$DW$T$35)
    9681                      .dwattr $C$DW$1015, DW_AT_name("Kd_Id")
    9682                      .dwattr $C$DW$1015, DW_AT_TI_symbol_name("_Kd_Id")
    9683                      .dwattr $C$DW$1015, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    9684                      .dwattr $C$DW$1015, DW_AT_accessibility(DW_ACCESS_public)
    9685              
    9686              $C$DW$1016      .dwtag  DW_TAG_member
    9687                      .dwattr $C$DW$1016, DW_AT_type(*$C$DW$T$35)
    9688                      .dwattr $C$DW$1016, DW_AT_name("Kd_Iq")
    9689                      .dwattr $C$DW$1016, DW_AT_TI_symbol_name("_Kd_Iq")
    9690                      .dwattr $C$DW$1016, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    9691                      .dwattr $C$DW$1016, DW_AT_accessibility(DW_ACCESS_public)
    9692              
    9693              $C$DW$1017      .dwtag  DW_TAG_member
    9694                      .dwattr $C$DW$1017, DW_AT_type(*$C$DW$T$35)
    9695                      .dwattr $C$DW$1017, DW_AT_name("Kd_spd")
    9696                      .dwattr $C$DW$1017, DW_AT_TI_symbol_name("_Kd_spd")
    9697                      .dwattr $C$DW$1017, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    9698                      .dwattr $C$DW$1017, DW_AT_accessibility(DW_ACCESS_public)
    9699              
    9700              $C$DW$1018      .dwtag  DW_TAG_member
    9701                      .dwattr $C$DW$1018, DW_AT_type(*$C$DW$T$35)
    9702                      .dwattr $C$DW$1018, DW_AT_name("Ui_Id")
    9703                      .dwattr $C$DW$1018, DW_AT_TI_symbol_name("_Ui_Id")
    9704                      .dwattr $C$DW$1018, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    9705                      .dwattr $C$DW$1018, DW_AT_accessibility(DW_ACCESS_public)
    9706              
    9707              $C$DW$1019      .dwtag  DW_TAG_member
    9708                      .dwattr $C$DW$1019, DW_AT_type(*$C$DW$T$35)
    9709                      .dwattr $C$DW$1019, DW_AT_name("Ui_Iq")
    9710                      .dwattr $C$DW$1019, DW_AT_TI_symbol_name("_Ui_Iq")
    9711                      .dwattr $C$DW$1019, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    9712                      .dwattr $C$DW$1019, DW_AT_accessibility(DW_ACCESS_public)
    9713              
    9714              $C$DW$1020      .dwtag  DW_TAG_member
    9715                      .dwattr $C$DW$1020, DW_AT_type(*$C$DW$T$35)
    9716                      .dwattr $C$DW$1020, DW_AT_name("Ui_spd")
TMS320C2000 Assembler PC v22.6.0 Thu Feb 16 09:13:12 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{BAFF65D2-0E2D-4A9B-88E7-9F24ECAE7FAA} PAGE  190

    9717                      .dwattr $C$DW$1020, DW_AT_TI_symbol_name("_Ui_spd")
    9718                      .dwattr $C$DW$1020, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    9719                      .dwattr $C$DW$1020, DW_AT_accessibility(DW_ACCESS_public)
    9720              
    9721              $C$DW$1021      .dwtag  DW_TAG_member
    9722                      .dwattr $C$DW$1021, DW_AT_type(*$C$DW$T$75)
    9723                      .dwattr $C$DW$1021, DW_AT_name("Idq_ref")
    9724                      .dwattr $C$DW$1021, DW_AT_TI_symbol_name("_Idq_ref")
    9725                      .dwattr $C$DW$1021, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    9726                      .dwattr $C$DW$1021, DW_AT_accessibility(DW_ACCESS_public)
    9727              
    9728              $C$DW$1022      .dwtag  DW_TAG_member
    9729                      .dwattr $C$DW$1022, DW_AT_type(*$C$DW$T$35)
    9730                      .dwattr $C$DW$1022, DW_AT_name("IdRated")
    9731                      .dwattr $C$DW$1022, DW_AT_TI_symbol_name("_IdRated")
    9732                      .dwattr $C$DW$1022, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    9733                      .dwattr $C$DW$1022, DW_AT_accessibility(DW_ACCESS_public)
    9734              
    9735              $C$DW$1023      .dwtag  DW_TAG_member
    9736                      .dwattr $C$DW$1023, DW_AT_type(*$C$DW$T$35)
    9737                      .dwattr $C$DW$1023, DW_AT_name("spd_ref")
    9738                      .dwattr $C$DW$1023, DW_AT_TI_symbol_name("_spd_ref")
    9739                      .dwattr $C$DW$1023, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    9740                      .dwattr $C$DW$1023, DW_AT_accessibility(DW_ACCESS_public)
    9741              
    9742              $C$DW$1024      .dwtag  DW_TAG_member
    9743                      .dwattr $C$DW$1024, DW_AT_type(*$C$DW$T$35)
    9744                      .dwattr $C$DW$1024, DW_AT_name("spd_max")
    9745                      .dwattr $C$DW$1024, DW_AT_TI_symbol_name("_spd_max")
    9746                      .dwattr $C$DW$1024, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    9747                      .dwattr $C$DW$1024, DW_AT_accessibility(DW_ACCESS_public)
    9748              
    9749              $C$DW$1025      .dwtag  DW_TAG_member
    9750                      .dwattr $C$DW$1025, DW_AT_type(*$C$DW$T$73)
    9751                      .dwattr $C$DW$1025, DW_AT_name("counter_current")
    9752                      .dwattr $C$DW$1025, DW_AT_TI_symbol_name("_counter_current")
    9753                      .dwattr $C$DW$1025, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    9754                      .dwattr $C$DW$1025, DW_AT_accessibility(DW_ACCESS_public)
    9755              
    9756              $C$DW$1026      .dwtag  DW_TAG_member
    9757                      .dwattr $C$DW$1026, DW_AT_type(*$C$DW$T$73)
    9758                      .dwattr $C$DW$1026, DW_AT_name("counter_isr")
    9759                      .dwattr $C$DW$1026, DW_AT_TI_symbol_name("_counter_isr")
    9760                      .dwattr $C$DW$1026, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    9761                      .dwattr $C$DW$1026, DW_AT_accessibility(DW_ACCESS_public)
    9762              
    9763              $C$DW$1027      .dwtag  DW_TAG_member
    9764                      .dwattr $C$DW$1027, DW_AT_type(*$C$DW$T$73)
    9765                      .dwattr $C$DW$1027, DW_AT_name("counter_speed")
    9766                      .dwattr $C$DW$1027, DW_AT_TI_symbol_name("_counter_speed")
    9767                      .dwattr $C$DW$1027, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    9768                      .dwattr $C$DW$1027, DW_AT_accessibility(DW_ACCESS_public)
    9769              
    9770              $C$DW$1028      .dwtag  DW_TAG_member
    9771                      .dwattr $C$DW$1028, DW_AT_type(*$C$DW$T$73)
TMS320C2000 Assembler PC v22.6.0 Thu Feb 16 09:13:12 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{BAFF65D2-0E2D-4A9B-88E7-9F24ECAE7FAA} PAGE  191

    9772                      .dwattr $C$DW$1028, DW_AT_name("counter_traj")
    9773                      .dwattr $C$DW$1028, DW_AT_TI_symbol_name("_counter_traj")
    9774                      .dwattr $C$DW$1028, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    9775                      .dwattr $C$DW$1028, DW_AT_accessibility(DW_ACCESS_public)
    9776              
    9777              $C$DW$1029      .dwtag  DW_TAG_member
    9778                      .dwattr $C$DW$1029, DW_AT_type(*$C$DW$T$76)
    9779                      .dwattr $C$DW$1029, DW_AT_name("flag_enableCtrl")
    9780                      .dwattr $C$DW$1029, DW_AT_TI_symbol_name("_flag_enableCtrl")
    9781                      .dwattr $C$DW$1029, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    9782                      .dwattr $C$DW$1029, DW_AT_accessibility(DW_ACCESS_public)
    9783              
    9784              $C$DW$1030      .dwtag  DW_TAG_member
    9785                      .dwattr $C$DW$1030, DW_AT_type(*$C$DW$T$76)
    9786                      .dwattr $C$DW$1030, DW_AT_name("flag_enableDcBusComp")
    9787                      .dwattr $C$DW$1030, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    9788                      .dwattr $C$DW$1030, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    9789                      .dwattr $C$DW$1030, DW_AT_accessibility(DW_ACCESS_public)
    9790              
    9791              $C$DW$1031      .dwtag  DW_TAG_member
    9792                      .dwattr $C$DW$1031, DW_AT_type(*$C$DW$T$76)
    9793                      .dwattr $C$DW$1031, DW_AT_name("flag_enablePowerWarp")
    9794                      .dwattr $C$DW$1031, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    9795                      .dwattr $C$DW$1031, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    9796                      .dwattr $C$DW$1031, DW_AT_accessibility(DW_ACCESS_public)
    9797              
    9798              $C$DW$1032      .dwtag  DW_TAG_member
    9799                      .dwattr $C$DW$1032, DW_AT_type(*$C$DW$T$76)
    9800                      .dwattr $C$DW$1032, DW_AT_name("flag_enableOffset")
    9801                      .dwattr $C$DW$1032, DW_AT_TI_symbol_name("_flag_enableOffset")
    9802                      .dwattr $C$DW$1032, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    9803                      .dwattr $C$DW$1032, DW_AT_accessibility(DW_ACCESS_public)
    9804              
    9805              $C$DW$1033      .dwtag  DW_TAG_member
    9806                      .dwattr $C$DW$1033, DW_AT_type(*$C$DW$T$76)
    9807                      .dwattr $C$DW$1033, DW_AT_name("flag_enableSpeedCtrl")
    9808                      .dwattr $C$DW$1033, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    9809                      .dwattr $C$DW$1033, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    9810                      .dwattr $C$DW$1033, DW_AT_accessibility(DW_ACCESS_public)
    9811              
    9812              $C$DW$1034      .dwtag  DW_TAG_member
    9813                      .dwattr $C$DW$1034, DW_AT_type(*$C$DW$T$76)
    9814                      .dwattr $C$DW$1034, DW_AT_name("flag_enableUserMotorParams")
    9815                      .dwattr $C$DW$1034, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    9816                      .dwattr $C$DW$1034, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    9817                      .dwattr $C$DW$1034, DW_AT_accessibility(DW_ACCESS_public)
    9818              
    9819              $C$DW$1035      .dwtag  DW_TAG_member
    9820                      .dwattr $C$DW$1035, DW_AT_type(*$C$DW$T$75)
    9821                      .dwattr $C$DW$1035, DW_AT_name("Idq_offset_pu")
    9822                      .dwattr $C$DW$1035, DW_AT_TI_symbol_name("_Idq_offset_pu")
    9823                      .dwattr $C$DW$1035, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    9824                      .dwattr $C$DW$1035, DW_AT_accessibility(DW_ACCESS_public)
    9825              
    9826              $C$DW$1036      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Thu Feb 16 09:13:12 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{BAFF65D2-0E2D-4A9B-88E7-9F24ECAE7FAA} PAGE  192

    9827                      .dwattr $C$DW$1036, DW_AT_type(*$C$DW$T$75)
    9828                      .dwattr $C$DW$1036, DW_AT_name("Vdq_offset_pu")
    9829                      .dwattr $C$DW$1036, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    9830                      .dwattr $C$DW$1036, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    9831                      .dwattr $C$DW$1036, DW_AT_accessibility(DW_ACCESS_public)
    9832              
    9833              $C$DW$1037      .dwtag  DW_TAG_member
    9834                      .dwattr $C$DW$1037, DW_AT_type(*$C$DW$T$35)
    9835                      .dwattr $C$DW$1037, DW_AT_name("angle_pu")
    9836                      .dwattr $C$DW$1037, DW_AT_TI_symbol_name("_angle_pu")
    9837                      .dwattr $C$DW$1037, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    9838                      .dwattr $C$DW$1037, DW_AT_accessibility(DW_ACCESS_public)
    9839              
    9840              $C$DW$1038      .dwtag  DW_TAG_member
    9841                      .dwattr $C$DW$1038, DW_AT_type(*$C$DW$T$35)
    9842                      .dwattr $C$DW$1038, DW_AT_name("speed_ref_pu")
    9843                      .dwattr $C$DW$1038, DW_AT_TI_symbol_name("_speed_ref_pu")
    9844                      .dwattr $C$DW$1038, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    9845                      .dwattr $C$DW$1038, DW_AT_accessibility(DW_ACCESS_public)
    9846              
    9847              $C$DW$1039      .dwtag  DW_TAG_member
    9848                      .dwattr $C$DW$1039, DW_AT_type(*$C$DW$T$35)
    9849                      .dwattr $C$DW$1039, DW_AT_name("speed_fb_pu")
    9850                      .dwattr $C$DW$1039, DW_AT_TI_symbol_name("_speed_fb_pu")
    9851                      .dwattr $C$DW$1039, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    9852                      .dwattr $C$DW$1039, DW_AT_accessibility(DW_ACCESS_public)
    9853              
    9854              $C$DW$1040      .dwtag  DW_TAG_member
    9855                      .dwattr $C$DW$1040, DW_AT_type(*$C$DW$T$35)
    9856                      .dwattr $C$DW$1040, DW_AT_name("speed_outMax_pu")
    9857                      .dwattr $C$DW$1040, DW_AT_TI_symbol_name("_speed_outMax_pu")
    9858                      .dwattr $C$DW$1040, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    9859                      .dwattr $C$DW$1040, DW_AT_accessibility(DW_ACCESS_public)
    9860              
    9861              $C$DW$1041      .dwtag  DW_TAG_member
    9862                      .dwattr $C$DW$1041, DW_AT_type(*$C$DW$T$76)
    9863                      .dwattr $C$DW$1041, DW_AT_name("flag_enableCurrentCtrl")
    9864                      .dwattr $C$DW$1041, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    9865                      .dwattr $C$DW$1041, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    9866                      .dwattr $C$DW$1041, DW_AT_accessibility(DW_ACCESS_public)
    9867              
    9868              $C$DW$1042      .dwtag  DW_TAG_member
    9869                      .dwattr $C$DW$1042, DW_AT_type(*$C$DW$T$35)
    9870                      .dwattr $C$DW$1042, DW_AT_name("torque_head_comm")
    9871                      .dwattr $C$DW$1042, DW_AT_TI_symbol_name("_torque_head_comm")
    9872                      .dwattr $C$DW$1042, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    9873                      .dwattr $C$DW$1042, DW_AT_accessibility(DW_ACCESS_public)
    9874              
    9875                      .dwendtag $C$DW$T$77
    9876              
    9877              $C$DW$T$251     .dwtag  DW_TAG_typedef
    9878                      .dwattr $C$DW$T$251, DW_AT_name("CTRL_Obj")
    9879                      .dwattr $C$DW$T$251, DW_AT_type(*$C$DW$T$77)
    9880                      .dwattr $C$DW$T$251, DW_AT_language(DW_LANG_C)
    9881              
TMS320C2000 Assembler PC v22.6.0 Thu Feb 16 09:13:12 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{BAFF65D2-0E2D-4A9B-88E7-9F24ECAE7FAA} PAGE  193

    9882              $C$DW$T$252     .dwtag  DW_TAG_pointer_type
    9883                      .dwattr $C$DW$T$252, DW_AT_type(*$C$DW$T$251)
    9884                      .dwattr $C$DW$T$252, DW_AT_address_class(0x20)
    9885              
    9886              $C$DW$T$206     .dwtag  DW_TAG_pointer_type
    9887                      .dwattr $C$DW$T$206, DW_AT_type(*$C$DW$T$77)
    9888                      .dwattr $C$DW$T$206, DW_AT_address_class(0x20)
    9889              
    9890              $C$DW$T$207     .dwtag  DW_TAG_typedef
    9891                      .dwattr $C$DW$T$207, DW_AT_name("CTRL_Handle")
    9892                      .dwattr $C$DW$T$207, DW_AT_type(*$C$DW$T$206)
    9893                      .dwattr $C$DW$T$207, DW_AT_language(DW_LANG_C)
    9894              
    9895              $C$DW$1043      .dwtag  DW_TAG_TI_far_type
    9896                      .dwattr $C$DW$1043, DW_AT_type(*$C$DW$T$207)
    9897              
    9898              $C$DW$T$253     .dwtag  DW_TAG_const_type
    9899                      .dwattr $C$DW$T$253, DW_AT_type(*$C$DW$1043)
    9900              
    9901              
    9902              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    9903                      .dwattr $C$DW$T$80, DW_AT_name("_CTRL_Version_")
    9904                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x04)
    9905              $C$DW$1044      .dwtag  DW_TAG_member
    9906                      .dwattr $C$DW$1044, DW_AT_type(*$C$DW$T$26)
    9907                      .dwattr $C$DW$1044, DW_AT_name("rsvd")
    9908                      .dwattr $C$DW$1044, DW_AT_TI_symbol_name("_rsvd")
    9909                      .dwattr $C$DW$1044, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9910                      .dwattr $C$DW$1044, DW_AT_accessibility(DW_ACCESS_public)
    9911              
    9912              $C$DW$1045      .dwtag  DW_TAG_member
    9913                      .dwattr $C$DW$1045, DW_AT_type(*$C$DW$T$79)
    9914                      .dwattr $C$DW$1045, DW_AT_name("targetProc")
    9915                      .dwattr $C$DW$1045, DW_AT_TI_symbol_name("_targetProc")
    9916                      .dwattr $C$DW$1045, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9917                      .dwattr $C$DW$1045, DW_AT_accessibility(DW_ACCESS_public)
    9918              
    9919              $C$DW$1046      .dwtag  DW_TAG_member
    9920                      .dwattr $C$DW$1046, DW_AT_type(*$C$DW$T$26)
    9921                      .dwattr $C$DW$1046, DW_AT_name("major")
    9922                      .dwattr $C$DW$1046, DW_AT_TI_symbol_name("_major")
    9923                      .dwattr $C$DW$1046, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9924                      .dwattr $C$DW$1046, DW_AT_accessibility(DW_ACCESS_public)
    9925              
    9926              $C$DW$1047      .dwtag  DW_TAG_member
    9927                      .dwattr $C$DW$1047, DW_AT_type(*$C$DW$T$26)
    9928                      .dwattr $C$DW$1047, DW_AT_name("minor")
    9929                      .dwattr $C$DW$1047, DW_AT_TI_symbol_name("_minor")
    9930                      .dwattr $C$DW$1047, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9931                      .dwattr $C$DW$1047, DW_AT_accessibility(DW_ACCESS_public)
    9932              
    9933                      .dwendtag $C$DW$T$80
    9934              
    9935              $C$DW$T$42      .dwtag  DW_TAG_typedef
    9936                      .dwattr $C$DW$T$42, DW_AT_name("CTRL_Version")
TMS320C2000 Assembler PC v22.6.0 Thu Feb 16 09:13:12 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{BAFF65D2-0E2D-4A9B-88E7-9F24ECAE7FAA} PAGE  194

    9937                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$80)
    9938                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    9939              
    9940              $C$DW$T$259     .dwtag  DW_TAG_pointer_type
    9941                      .dwattr $C$DW$T$259, DW_AT_type(*$C$DW$T$42)
    9942                      .dwattr $C$DW$T$259, DW_AT_address_class(0x20)
    9943              
    9944              
    9945              $C$DW$T$87      .dwtag  DW_TAG_structure_type
    9946                      .dwattr $C$DW$T$87, DW_AT_name("_DRV8301_Obj_")
    9947                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x08)
    9948              $C$DW$1048      .dwtag  DW_TAG_member
    9949                      .dwattr $C$DW$1048, DW_AT_type(*$C$DW$T$82)
    9950                      .dwattr $C$DW$1048, DW_AT_name("spiHandle")
    9951                      .dwattr $C$DW$1048, DW_AT_TI_symbol_name("_spiHandle")
    9952                      .dwattr $C$DW$1048, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9953                      .dwattr $C$DW$1048, DW_AT_accessibility(DW_ACCESS_public)
    9954              
    9955              $C$DW$1049      .dwtag  DW_TAG_member
    9956                      .dwattr $C$DW$1049, DW_AT_type(*$C$DW$T$84)
    9957                      .dwattr $C$DW$1049, DW_AT_name("gpioHandle")
    9958                      .dwattr $C$DW$1049, DW_AT_TI_symbol_name("_gpioHandle")
    9959                      .dwattr $C$DW$1049, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9960                      .dwattr $C$DW$1049, DW_AT_accessibility(DW_ACCESS_public)
    9961              
    9962              $C$DW$1050      .dwtag  DW_TAG_member
    9963                      .dwattr $C$DW$1050, DW_AT_type(*$C$DW$T$86)
    9964                      .dwattr $C$DW$1050, DW_AT_name("gpioNumber")
    9965                      .dwattr $C$DW$1050, DW_AT_TI_symbol_name("_gpioNumber")
    9966                      .dwattr $C$DW$1050, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9967                      .dwattr $C$DW$1050, DW_AT_accessibility(DW_ACCESS_public)
    9968              
    9969              $C$DW$1051      .dwtag  DW_TAG_member
    9970                      .dwattr $C$DW$1051, DW_AT_type(*$C$DW$T$76)
    9971                      .dwattr $C$DW$1051, DW_AT_name("RxTimeOut")
    9972                      .dwattr $C$DW$1051, DW_AT_TI_symbol_name("_RxTimeOut")
    9973                      .dwattr $C$DW$1051, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9974                      .dwattr $C$DW$1051, DW_AT_accessibility(DW_ACCESS_public)
    9975              
    9976              $C$DW$1052      .dwtag  DW_TAG_member
    9977                      .dwattr $C$DW$1052, DW_AT_type(*$C$DW$T$76)
    9978                      .dwattr $C$DW$1052, DW_AT_name("enableTimeOut")
    9979                      .dwattr $C$DW$1052, DW_AT_TI_symbol_name("_enableTimeOut")
    9980                      .dwattr $C$DW$1052, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9981                      .dwattr $C$DW$1052, DW_AT_accessibility(DW_ACCESS_public)
    9982              
    9983                      .dwendtag $C$DW$T$87
    9984              
    9985              $C$DW$T$156     .dwtag  DW_TAG_typedef
    9986                      .dwattr $C$DW$T$156, DW_AT_name("DRV8301_Obj")
    9987                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$87)
    9988                      .dwattr $C$DW$T$156, DW_AT_language(DW_LANG_C)
    9989              
    9990              $C$DW$T$154     .dwtag  DW_TAG_pointer_type
    9991                      .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$87)
TMS320C2000 Assembler PC v22.6.0 Thu Feb 16 09:13:12 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{BAFF65D2-0E2D-4A9B-88E7-9F24ECAE7FAA} PAGE  195

    9992                      .dwattr $C$DW$T$154, DW_AT_address_class(0x20)
    9993              
    9994              $C$DW$T$155     .dwtag  DW_TAG_typedef
    9995                      .dwattr $C$DW$T$155, DW_AT_name("DRV8301_Handle")
    9996                      .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$154)
    9997                      .dwattr $C$DW$T$155, DW_AT_language(DW_LANG_C)
    9998              
    9999              
   10000              $C$DW$T$98      .dwtag  DW_TAG_structure_type
   10001                      .dwattr $C$DW$T$98, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
   10002                      .dwattr $C$DW$T$98, DW_AT_byte_size(0x05)
   10003              $C$DW$1053      .dwtag  DW_TAG_member
   10004                      .dwattr $C$DW$1053, DW_AT_type(*$C$DW$T$89)
   10005                      .dwattr $C$DW$1053, DW_AT_name("DRV8301_CURRENT")
   10006                      .dwattr $C$DW$1053, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
   10007                      .dwattr $C$DW$1053, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10008                      .dwattr $C$DW$1053, DW_AT_accessibility(DW_ACCESS_public)
   10009              
   10010              $C$DW$1054      .dwtag  DW_TAG_member
   10011                      .dwattr $C$DW$1054, DW_AT_type(*$C$DW$T$91)
   10012                      .dwattr $C$DW$1054, DW_AT_name("DRV8301_RESET")
   10013                      .dwattr $C$DW$1054, DW_AT_TI_symbol_name("_DRV8301_RESET")
   10014                      .dwattr $C$DW$1054, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10015                      .dwattr $C$DW$1054, DW_AT_accessibility(DW_ACCESS_public)
   10016              
   10017              $C$DW$1055      .dwtag  DW_TAG_member
   10018                      .dwattr $C$DW$1055, DW_AT_type(*$C$DW$T$93)
   10019                      .dwattr $C$DW$1055, DW_AT_name("PWM_MODE")
   10020                      .dwattr $C$DW$1055, DW_AT_TI_symbol_name("_PWM_MODE")
   10021                      .dwattr $C$DW$1055, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10022                      .dwattr $C$DW$1055, DW_AT_accessibility(DW_ACCESS_public)
   10023              
   10024              $C$DW$1056      .dwtag  DW_TAG_member
   10025                      .dwattr $C$DW$1056, DW_AT_type(*$C$DW$T$95)
   10026                      .dwattr $C$DW$1056, DW_AT_name("OC_MODE")
   10027                      .dwattr $C$DW$1056, DW_AT_TI_symbol_name("_OC_MODE")
   10028                      .dwattr $C$DW$1056, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10029                      .dwattr $C$DW$1056, DW_AT_accessibility(DW_ACCESS_public)
   10030              
   10031              $C$DW$1057      .dwtag  DW_TAG_member
   10032                      .dwattr $C$DW$1057, DW_AT_type(*$C$DW$T$97)
   10033                      .dwattr $C$DW$1057, DW_AT_name("OC_ADJ_SET")
   10034                      .dwattr $C$DW$1057, DW_AT_TI_symbol_name("_OC_ADJ_SET")
   10035                      .dwattr $C$DW$1057, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10036                      .dwattr $C$DW$1057, DW_AT_accessibility(DW_ACCESS_public)
   10037              
   10038                      .dwendtag $C$DW$T$98
   10039              
   10040              $C$DW$T$112     .dwtag  DW_TAG_typedef
   10041                      .dwattr $C$DW$T$112, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
   10042                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$98)
   10043                      .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
   10044              
   10045              
   10046              $C$DW$T$107     .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v22.6.0 Thu Feb 16 09:13:12 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{BAFF65D2-0E2D-4A9B-88E7-9F24ECAE7FAA} PAGE  196

   10047                      .dwattr $C$DW$T$107, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
   10048                      .dwattr $C$DW$T$107, DW_AT_byte_size(0x04)
   10049              $C$DW$1058      .dwtag  DW_TAG_member
   10050                      .dwattr $C$DW$1058, DW_AT_type(*$C$DW$T$100)
   10051                      .dwattr $C$DW$1058, DW_AT_name("OCTW_SET")
   10052                      .dwattr $C$DW$1058, DW_AT_TI_symbol_name("_OCTW_SET")
   10053                      .dwattr $C$DW$1058, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10054                      .dwattr $C$DW$1058, DW_AT_accessibility(DW_ACCESS_public)
   10055              
   10056              $C$DW$1059      .dwtag  DW_TAG_member
   10057                      .dwattr $C$DW$1059, DW_AT_type(*$C$DW$T$102)
   10058                      .dwattr $C$DW$1059, DW_AT_name("GAIN")
   10059                      .dwattr $C$DW$1059, DW_AT_TI_symbol_name("_GAIN")
   10060                      .dwattr $C$DW$1059, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10061                      .dwattr $C$DW$1059, DW_AT_accessibility(DW_ACCESS_public)
   10062              
   10063              $C$DW$1060      .dwtag  DW_TAG_member
   10064                      .dwattr $C$DW$1060, DW_AT_type(*$C$DW$T$104)
   10065                      .dwattr $C$DW$1060, DW_AT_name("DC_CAL_CH1p2")
   10066                      .dwattr $C$DW$1060, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
   10067                      .dwattr $C$DW$1060, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10068                      .dwattr $C$DW$1060, DW_AT_accessibility(DW_ACCESS_public)
   10069              
   10070              $C$DW$1061      .dwtag  DW_TAG_member
   10071                      .dwattr $C$DW$1061, DW_AT_type(*$C$DW$T$106)
   10072                      .dwattr $C$DW$1061, DW_AT_name("OC_TOFF")
   10073                      .dwattr $C$DW$1061, DW_AT_TI_symbol_name("_OC_TOFF")
   10074                      .dwattr $C$DW$1061, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10075                      .dwattr $C$DW$1061, DW_AT_accessibility(DW_ACCESS_public)
   10076              
   10077                      .dwendtag $C$DW$T$107
   10078              
   10079              $C$DW$T$113     .dwtag  DW_TAG_typedef
   10080                      .dwattr $C$DW$T$113, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
   10081                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$107)
   10082                      .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
   10083              
   10084              
   10085              $C$DW$T$108     .dwtag  DW_TAG_structure_type
   10086                      .dwattr $C$DW$T$108, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
   10087                      .dwattr $C$DW$T$108, DW_AT_byte_size(0x0b)
   10088              $C$DW$1062      .dwtag  DW_TAG_member
   10089                      .dwattr $C$DW$1062, DW_AT_type(*$C$DW$T$76)
   10090                      .dwattr $C$DW$1062, DW_AT_name("FAULT")
   10091                      .dwattr $C$DW$1062, DW_AT_TI_symbol_name("_FAULT")
   10092                      .dwattr $C$DW$1062, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10093                      .dwattr $C$DW$1062, DW_AT_accessibility(DW_ACCESS_public)
   10094              
   10095              $C$DW$1063      .dwtag  DW_TAG_member
   10096                      .dwattr $C$DW$1063, DW_AT_type(*$C$DW$T$76)
   10097                      .dwattr $C$DW$1063, DW_AT_name("GVDD_UV")
   10098                      .dwattr $C$DW$1063, DW_AT_TI_symbol_name("_GVDD_UV")
   10099                      .dwattr $C$DW$1063, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10100                      .dwattr $C$DW$1063, DW_AT_accessibility(DW_ACCESS_public)
   10101              
TMS320C2000 Assembler PC v22.6.0 Thu Feb 16 09:13:12 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{BAFF65D2-0E2D-4A9B-88E7-9F24ECAE7FAA} PAGE  197

   10102              $C$DW$1064      .dwtag  DW_TAG_member
   10103                      .dwattr $C$DW$1064, DW_AT_type(*$C$DW$T$76)
   10104                      .dwattr $C$DW$1064, DW_AT_name("PVDD_UV")
   10105                      .dwattr $C$DW$1064, DW_AT_TI_symbol_name("_PVDD_UV")
   10106                      .dwattr $C$DW$1064, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10107                      .dwattr $C$DW$1064, DW_AT_accessibility(DW_ACCESS_public)
   10108              
   10109              $C$DW$1065      .dwtag  DW_TAG_member
   10110                      .dwattr $C$DW$1065, DW_AT_type(*$C$DW$T$76)
   10111                      .dwattr $C$DW$1065, DW_AT_name("OTSD")
   10112                      .dwattr $C$DW$1065, DW_AT_TI_symbol_name("_OTSD")
   10113                      .dwattr $C$DW$1065, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10114                      .dwattr $C$DW$1065, DW_AT_accessibility(DW_ACCESS_public)
   10115              
   10116              $C$DW$1066      .dwtag  DW_TAG_member
   10117                      .dwattr $C$DW$1066, DW_AT_type(*$C$DW$T$76)
   10118                      .dwattr $C$DW$1066, DW_AT_name("OTW")
   10119                      .dwattr $C$DW$1066, DW_AT_TI_symbol_name("_OTW")
   10120                      .dwattr $C$DW$1066, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10121                      .dwattr $C$DW$1066, DW_AT_accessibility(DW_ACCESS_public)
   10122              
   10123              $C$DW$1067      .dwtag  DW_TAG_member
   10124                      .dwattr $C$DW$1067, DW_AT_type(*$C$DW$T$76)
   10125                      .dwattr $C$DW$1067, DW_AT_name("FETHA_OC")
   10126                      .dwattr $C$DW$1067, DW_AT_TI_symbol_name("_FETHA_OC")
   10127                      .dwattr $C$DW$1067, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10128                      .dwattr $C$DW$1067, DW_AT_accessibility(DW_ACCESS_public)
   10129              
   10130              $C$DW$1068      .dwtag  DW_TAG_member
   10131                      .dwattr $C$DW$1068, DW_AT_type(*$C$DW$T$76)
   10132                      .dwattr $C$DW$1068, DW_AT_name("FETLA_OC")
   10133                      .dwattr $C$DW$1068, DW_AT_TI_symbol_name("_FETLA_OC")
   10134                      .dwattr $C$DW$1068, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10135                      .dwattr $C$DW$1068, DW_AT_accessibility(DW_ACCESS_public)
   10136              
   10137              $C$DW$1069      .dwtag  DW_TAG_member
   10138                      .dwattr $C$DW$1069, DW_AT_type(*$C$DW$T$76)
   10139                      .dwattr $C$DW$1069, DW_AT_name("FETHB_OC")
   10140                      .dwattr $C$DW$1069, DW_AT_TI_symbol_name("_FETHB_OC")
   10141                      .dwattr $C$DW$1069, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   10142                      .dwattr $C$DW$1069, DW_AT_accessibility(DW_ACCESS_public)
   10143              
   10144              $C$DW$1070      .dwtag  DW_TAG_member
   10145                      .dwattr $C$DW$1070, DW_AT_type(*$C$DW$T$76)
   10146                      .dwattr $C$DW$1070, DW_AT_name("FETLB_OC")
   10147                      .dwattr $C$DW$1070, DW_AT_TI_symbol_name("_FETLB_OC")
   10148                      .dwattr $C$DW$1070, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10149                      .dwattr $C$DW$1070, DW_AT_accessibility(DW_ACCESS_public)
   10150              
   10151              $C$DW$1071      .dwtag  DW_TAG_member
