TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{0F3B45B3-DA78-405D-822B-4C4264E94F96} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.0.LTS *
       3              ;* Date/Time created: Mon May  8 16:16:33 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/GIANT/GiantNEO/motorware/motorware_1_01_00_18/sw/solutions/instaspin
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.0.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\GIANT\GiantNEO\motorware\motorware_1_01_00_18\sw\solutions\insta
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    9034              $C$DW$915       .dwtag  DW_TAG_enumerator
    9035                      .dwattr $C$DW$915, DW_AT_name("PIE_GroupNumber_7")
    9036                      .dwattr $C$DW$915, DW_AT_const_value(0x06)
    9037              
    9038              $C$DW$916       .dwtag  DW_TAG_enumerator
    9039                      .dwattr $C$DW$916, DW_AT_name("PIE_GroupNumber_8")
    9040                      .dwattr $C$DW$916, DW_AT_const_value(0x07)
    9041              
    9042              $C$DW$917       .dwtag  DW_TAG_enumerator
    9043                      .dwattr $C$DW$917, DW_AT_name("PIE_GroupNumber_9")
    9044                      .dwattr $C$DW$917, DW_AT_const_value(0x08)
    9045              
    9046              $C$DW$918       .dwtag  DW_TAG_enumerator
    9047                      .dwattr $C$DW$918, DW_AT_name("PIE_GroupNumber_10")
    9048                      .dwattr $C$DW$918, DW_AT_const_value(0x09)
    9049              
    9050              $C$DW$919       .dwtag  DW_TAG_enumerator
    9051                      .dwattr $C$DW$919, DW_AT_name("PIE_GroupNumber_11")
    9052                      .dwattr $C$DW$919, DW_AT_const_value(0x0a)
    9053              
    9054              $C$DW$920       .dwtag  DW_TAG_enumerator
    9055                      .dwattr $C$DW$920, DW_AT_name("PIE_GroupNumber_12")
    9056                      .dwattr $C$DW$920, DW_AT_const_value(0x0b)
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{0F3B45B3-DA78-405D-822B-4C4264E94F96} PAGE  179

    9057              
    9058                      .dwendtag $C$DW$T$224
    9059              
    9060              $C$DW$T$225     .dwtag  DW_TAG_typedef
    9061                      .dwattr $C$DW$T$225, DW_AT_name("PIE_GroupNumber_e")
    9062                      .dwattr $C$DW$T$225, DW_AT_type(*$C$DW$T$224)
    9063                      .dwattr $C$DW$T$225, DW_AT_language(DW_LANG_C)
    9064              
    9065              
    9066              $C$DW$T$227     .dwtag  DW_TAG_enumeration_type
    9067                      .dwattr $C$DW$T$227, DW_AT_byte_size(0x01)
    9068              $C$DW$921       .dwtag  DW_TAG_enumerator
    9069                      .dwattr $C$DW$921, DW_AT_name("CTRL_Type_PID_spd")
    9070                      .dwattr $C$DW$921, DW_AT_const_value(0x00)
    9071              
    9072              $C$DW$922       .dwtag  DW_TAG_enumerator
    9073                      .dwattr $C$DW$922, DW_AT_name("CTRL_Type_PID_Id")
    9074                      .dwattr $C$DW$922, DW_AT_const_value(0x01)
    9075              
    9076              $C$DW$923       .dwtag  DW_TAG_enumerator
    9077                      .dwattr $C$DW$923, DW_AT_name("CTRL_Type_PID_Iq")
    9078                      .dwattr $C$DW$923, DW_AT_const_value(0x02)
    9079              
    9080                      .dwendtag $C$DW$T$227
    9081              
    9082              $C$DW$T$228     .dwtag  DW_TAG_typedef
    9083                      .dwattr $C$DW$T$228, DW_AT_name("CTRL_Type_e")
    9084                      .dwattr $C$DW$T$228, DW_AT_type(*$C$DW$T$227)
    9085                      .dwattr $C$DW$T$228, DW_AT_language(DW_LANG_C)
    9086              
    9087              
    9088              $C$DW$T$230     .dwtag  DW_TAG_enumeration_type
    9089                      .dwattr $C$DW$T$230, DW_AT_byte_size(0x01)
    9090              $C$DW$924       .dwtag  DW_TAG_enumerator
    9091                      .dwattr $C$DW$924, DW_AT_name("HAL_SensorType_Current")
    9092                      .dwattr $C$DW$924, DW_AT_const_value(0x00)
    9093              
    9094              $C$DW$925       .dwtag  DW_TAG_enumerator
    9095                      .dwattr $C$DW$925, DW_AT_name("HAL_SensorType_Voltage")
    9096                      .dwattr $C$DW$925, DW_AT_const_value(0x01)
    9097              
    9098                      .dwendtag $C$DW$T$230
    9099              
    9100              $C$DW$T$231     .dwtag  DW_TAG_typedef
    9101                      .dwattr $C$DW$T$231, DW_AT_name("HAL_SensorType_e")
    9102                      .dwattr $C$DW$T$231, DW_AT_type(*$C$DW$T$230)
    9103                      .dwattr $C$DW$T$231, DW_AT_language(DW_LANG_C)
    9104              
    9105              
    9106              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    9107                      .dwattr $C$DW$T$19, DW_AT_name("IPD_HFI_Obj")
    9108                      .dwattr $C$DW$T$19, DW_AT_declaration
    9109                      .dwendtag $C$DW$T$19
    9110              
    9111              $C$DW$T$233     .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{0F3B45B3-DA78-405D-822B-4C4264E94F96} PAGE  180

    9112                      .dwattr $C$DW$T$233, DW_AT_type(*$C$DW$T$19)
    9113                      .dwattr $C$DW$T$233, DW_AT_address_class(0x20)
    9114              
    9115              $C$DW$T$234     .dwtag  DW_TAG_typedef
    9116                      .dwattr $C$DW$T$234, DW_AT_name("IPD_HFI_Handle")
    9117                      .dwattr $C$DW$T$234, DW_AT_type(*$C$DW$T$233)
    9118                      .dwattr $C$DW$T$234, DW_AT_language(DW_LANG_C)
    9119              
    9120              
    9121              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    9122                      .dwattr $C$DW$T$34, DW_AT_name("_ADC_Obj_")
    9123                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x6650)
    9124              $C$DW$926       .dwtag  DW_TAG_member
    9125                      .dwattr $C$DW$926, DW_AT_type(*$C$DW$T$28)
    9126                      .dwattr $C$DW$926, DW_AT_name("ADCRESULT")
    9127                      .dwattr $C$DW$926, DW_AT_TI_symbol_name("_ADCRESULT")
    9128                      .dwattr $C$DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9129                      .dwattr $C$DW$926, DW_AT_accessibility(DW_ACCESS_public)
    9130              
    9131              $C$DW$927       .dwtag  DW_TAG_member
    9132                      .dwattr $C$DW$927, DW_AT_type(*$C$DW$T$29)
    9133                      .dwattr $C$DW$927, DW_AT_name("resvd_1")
    9134                      .dwattr $C$DW$927, DW_AT_TI_symbol_name("_resvd_1")
    9135                      .dwattr $C$DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9136                      .dwattr $C$DW$927, DW_AT_accessibility(DW_ACCESS_public)
    9137              
    9138              $C$DW$928       .dwtag  DW_TAG_member
    9139                      .dwattr $C$DW$928, DW_AT_type(*$C$DW$T$27)
    9140                      .dwattr $C$DW$928, DW_AT_name("ADCCTL1")
    9141                      .dwattr $C$DW$928, DW_AT_TI_symbol_name("_ADCCTL1")
    9142                      .dwattr $C$DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    9143                      .dwattr $C$DW$928, DW_AT_accessibility(DW_ACCESS_public)
    9144              
    9145              $C$DW$929       .dwtag  DW_TAG_member
    9146                      .dwattr $C$DW$929, DW_AT_type(*$C$DW$T$27)
    9147                      .dwattr $C$DW$929, DW_AT_name("ADCCTL2")
    9148                      .dwattr $C$DW$929, DW_AT_TI_symbol_name("_ADCCTL2")
    9149                      .dwattr $C$DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    9150                      .dwattr $C$DW$929, DW_AT_accessibility(DW_ACCESS_public)
    9151              
    9152              $C$DW$930       .dwtag  DW_TAG_member
    9153                      .dwattr $C$DW$930, DW_AT_type(*$C$DW$T$30)
    9154                      .dwattr $C$DW$930, DW_AT_name("rsvd_2")
    9155                      .dwattr $C$DW$930, DW_AT_TI_symbol_name("_rsvd_2")
    9156                      .dwattr $C$DW$930, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    9157                      .dwattr $C$DW$930, DW_AT_accessibility(DW_ACCESS_public)
    9158              
    9159              $C$DW$931       .dwtag  DW_TAG_member
    9160                      .dwattr $C$DW$931, DW_AT_type(*$C$DW$T$27)
    9161                      .dwattr $C$DW$931, DW_AT_name("ADCINTFLG")
    9162                      .dwattr $C$DW$931, DW_AT_TI_symbol_name("_ADCINTFLG")
    9163                      .dwattr $C$DW$931, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    9164                      .dwattr $C$DW$931, DW_AT_accessibility(DW_ACCESS_public)
    9165              
    9166              $C$DW$932       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{0F3B45B3-DA78-405D-822B-4C4264E94F96} PAGE  181

    9167                      .dwattr $C$DW$932, DW_AT_type(*$C$DW$T$27)
    9168                      .dwattr $C$DW$932, DW_AT_name("ADCINTFLGCLR")
    9169                      .dwattr $C$DW$932, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    9170                      .dwattr $C$DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    9171                      .dwattr $C$DW$932, DW_AT_accessibility(DW_ACCESS_public)
    9172              
    9173              $C$DW$933       .dwtag  DW_TAG_member
    9174                      .dwattr $C$DW$933, DW_AT_type(*$C$DW$T$27)
    9175                      .dwattr $C$DW$933, DW_AT_name("ADCINTOVF")
    9176                      .dwattr $C$DW$933, DW_AT_TI_symbol_name("_ADCINTOVF")
    9177                      .dwattr $C$DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    9178                      .dwattr $C$DW$933, DW_AT_accessibility(DW_ACCESS_public)
    9179              
    9180              $C$DW$934       .dwtag  DW_TAG_member
    9181                      .dwattr $C$DW$934, DW_AT_type(*$C$DW$T$27)
    9182                      .dwattr $C$DW$934, DW_AT_name("ADCINTOVFCLR")
    9183                      .dwattr $C$DW$934, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    9184                      .dwattr $C$DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    9185                      .dwattr $C$DW$934, DW_AT_accessibility(DW_ACCESS_public)
    9186              
    9187              $C$DW$935       .dwtag  DW_TAG_member
    9188                      .dwattr $C$DW$935, DW_AT_type(*$C$DW$T$31)
    9189                      .dwattr $C$DW$935, DW_AT_name("INTSELxNy")
    9190                      .dwattr $C$DW$935, DW_AT_TI_symbol_name("_INTSELxNy")
    9191                      .dwattr $C$DW$935, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    9192                      .dwattr $C$DW$935, DW_AT_accessibility(DW_ACCESS_public)
    9193              
    9194              $C$DW$936       .dwtag  DW_TAG_member
    9195                      .dwattr $C$DW$936, DW_AT_type(*$C$DW$T$32)
    9196                      .dwattr $C$DW$936, DW_AT_name("rsvd_3")
    9197                      .dwattr $C$DW$936, DW_AT_TI_symbol_name("_rsvd_3")
    9198                      .dwattr $C$DW$936, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    9199                      .dwattr $C$DW$936, DW_AT_accessibility(DW_ACCESS_public)
    9200              
    9201              $C$DW$937       .dwtag  DW_TAG_member
    9202                      .dwattr $C$DW$937, DW_AT_type(*$C$DW$T$27)
    9203                      .dwattr $C$DW$937, DW_AT_name("SOCPRICTRL")
    9204                      .dwattr $C$DW$937, DW_AT_TI_symbol_name("_SOCPRICTRL")
    9205                      .dwattr $C$DW$937, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    9206                      .dwattr $C$DW$937, DW_AT_accessibility(DW_ACCESS_public)
    9207              
    9208              $C$DW$938       .dwtag  DW_TAG_member
    9209                      .dwattr $C$DW$938, DW_AT_type(*$C$DW$T$27)
    9210                      .dwattr $C$DW$938, DW_AT_name("rsvd_4")
    9211                      .dwattr $C$DW$938, DW_AT_TI_symbol_name("_rsvd_4")
    9212                      .dwattr $C$DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    9213                      .dwattr $C$DW$938, DW_AT_accessibility(DW_ACCESS_public)
    9214              
    9215              $C$DW$939       .dwtag  DW_TAG_member
    9216                      .dwattr $C$DW$939, DW_AT_type(*$C$DW$T$27)
    9217                      .dwattr $C$DW$939, DW_AT_name("ADCSAMPLEMODE")
    9218                      .dwattr $C$DW$939, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    9219                      .dwattr $C$DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    9220                      .dwattr $C$DW$939, DW_AT_accessibility(DW_ACCESS_public)
    9221              
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{0F3B45B3-DA78-405D-822B-4C4264E94F96} PAGE  182

    9222              $C$DW$940       .dwtag  DW_TAG_member
    9223                      .dwattr $C$DW$940, DW_AT_type(*$C$DW$T$27)
    9224                      .dwattr $C$DW$940, DW_AT_name("rsvd_5")
    9225                      .dwattr $C$DW$940, DW_AT_TI_symbol_name("_rsvd_5")
    9226                      .dwattr $C$DW$940, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    9227                      .dwattr $C$DW$940, DW_AT_accessibility(DW_ACCESS_public)
    9228              
    9229              $C$DW$941       .dwtag  DW_TAG_member
    9230                      .dwattr $C$DW$941, DW_AT_type(*$C$DW$T$27)
    9231                      .dwattr $C$DW$941, DW_AT_name("ADCINTSOCSEL1")
    9232                      .dwattr $C$DW$941, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    9233                      .dwattr $C$DW$941, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    9234                      .dwattr $C$DW$941, DW_AT_accessibility(DW_ACCESS_public)
    9235              
    9236              $C$DW$942       .dwtag  DW_TAG_member
    9237                      .dwattr $C$DW$942, DW_AT_type(*$C$DW$T$27)
    9238                      .dwattr $C$DW$942, DW_AT_name("ADCINTSOCSEL2")
    9239                      .dwattr $C$DW$942, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    9240                      .dwattr $C$DW$942, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    9241                      .dwattr $C$DW$942, DW_AT_accessibility(DW_ACCESS_public)
    9242              
    9243              $C$DW$943       .dwtag  DW_TAG_member
    9244                      .dwattr $C$DW$943, DW_AT_type(*$C$DW$T$30)
    9245                      .dwattr $C$DW$943, DW_AT_name("rsvd_6")
    9246                      .dwattr $C$DW$943, DW_AT_TI_symbol_name("_rsvd_6")
    9247                      .dwattr $C$DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    9248                      .dwattr $C$DW$943, DW_AT_accessibility(DW_ACCESS_public)
    9249              
    9250              $C$DW$944       .dwtag  DW_TAG_member
    9251                      .dwattr $C$DW$944, DW_AT_type(*$C$DW$T$27)
    9252                      .dwattr $C$DW$944, DW_AT_name("ADCSOCFLG1")
    9253                      .dwattr $C$DW$944, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    9254                      .dwattr $C$DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    9255                      .dwattr $C$DW$944, DW_AT_accessibility(DW_ACCESS_public)
    9256              
    9257              $C$DW$945       .dwtag  DW_TAG_member
    9258                      .dwattr $C$DW$945, DW_AT_type(*$C$DW$T$27)
    9259                      .dwattr $C$DW$945, DW_AT_name("rsvd_7")
    9260                      .dwattr $C$DW$945, DW_AT_TI_symbol_name("_rsvd_7")
    9261                      .dwattr $C$DW$945, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    9262                      .dwattr $C$DW$945, DW_AT_accessibility(DW_ACCESS_public)
    9263              
    9264              $C$DW$946       .dwtag  DW_TAG_member
    9265                      .dwattr $C$DW$946, DW_AT_type(*$C$DW$T$27)
    9266                      .dwattr $C$DW$946, DW_AT_name("ADCSOCFRC1")
    9267                      .dwattr $C$DW$946, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    9268                      .dwattr $C$DW$946, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    9269                      .dwattr $C$DW$946, DW_AT_accessibility(DW_ACCESS_public)
    9270              
    9271              $C$DW$947       .dwtag  DW_TAG_member
    9272                      .dwattr $C$DW$947, DW_AT_type(*$C$DW$T$27)
    9273                      .dwattr $C$DW$947, DW_AT_name("rsvd_8")
    9274                      .dwattr $C$DW$947, DW_AT_TI_symbol_name("_rsvd_8")
    9275                      .dwattr $C$DW$947, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    9276                      .dwattr $C$DW$947, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{0F3B45B3-DA78-405D-822B-4C4264E94F96} PAGE  183

    9277              
    9278              $C$DW$948       .dwtag  DW_TAG_member
    9279                      .dwattr $C$DW$948, DW_AT_type(*$C$DW$T$27)
    9280                      .dwattr $C$DW$948, DW_AT_name("ADCSOCOVF1")
    9281                      .dwattr $C$DW$948, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    9282                      .dwattr $C$DW$948, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    9283                      .dwattr $C$DW$948, DW_AT_accessibility(DW_ACCESS_public)
    9284              
    9285              $C$DW$949       .dwtag  DW_TAG_member
    9286                      .dwattr $C$DW$949, DW_AT_type(*$C$DW$T$27)
    9287                      .dwattr $C$DW$949, DW_AT_name("rsvd_9")
    9288                      .dwattr $C$DW$949, DW_AT_TI_symbol_name("_rsvd_9")
    9289                      .dwattr $C$DW$949, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    9290                      .dwattr $C$DW$949, DW_AT_accessibility(DW_ACCESS_public)
    9291              
    9292              $C$DW$950       .dwtag  DW_TAG_member
    9293                      .dwattr $C$DW$950, DW_AT_type(*$C$DW$T$27)
    9294                      .dwattr $C$DW$950, DW_AT_name("ADCSOCOVFCLR1")
    9295                      .dwattr $C$DW$950, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    9296                      .dwattr $C$DW$950, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    9297                      .dwattr $C$DW$950, DW_AT_accessibility(DW_ACCESS_public)
    9298              
    9299              $C$DW$951       .dwtag  DW_TAG_member
    9300                      .dwattr $C$DW$951, DW_AT_type(*$C$DW$T$27)
    9301                      .dwattr $C$DW$951, DW_AT_name("rsvd_10")
    9302                      .dwattr $C$DW$951, DW_AT_TI_symbol_name("_rsvd_10")
    9303                      .dwattr $C$DW$951, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    9304                      .dwattr $C$DW$951, DW_AT_accessibility(DW_ACCESS_public)
    9305              
    9306              $C$DW$952       .dwtag  DW_TAG_member
    9307                      .dwattr $C$DW$952, DW_AT_type(*$C$DW$T$28)
    9308                      .dwattr $C$DW$952, DW_AT_name("ADCSOCxCTL")
    9309                      .dwattr $C$DW$952, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    9310                      .dwattr $C$DW$952, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    9311                      .dwattr $C$DW$952, DW_AT_accessibility(DW_ACCESS_public)
    9312              
    9313              $C$DW$953       .dwtag  DW_TAG_member
    9314                      .dwattr $C$DW$953, DW_AT_type(*$C$DW$T$28)
    9315                      .dwattr $C$DW$953, DW_AT_name("rsvd_11")
    9316                      .dwattr $C$DW$953, DW_AT_TI_symbol_name("_rsvd_11")
    9317                      .dwattr $C$DW$953, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    9318                      .dwattr $C$DW$953, DW_AT_accessibility(DW_ACCESS_public)
    9319              
    9320              $C$DW$954       .dwtag  DW_TAG_member
    9321                      .dwattr $C$DW$954, DW_AT_type(*$C$DW$T$27)
    9322                      .dwattr $C$DW$954, DW_AT_name("ADCREFTRIM")
    9323                      .dwattr $C$DW$954, DW_AT_TI_symbol_name("_ADCREFTRIM")
    9324                      .dwattr $C$DW$954, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    9325                      .dwattr $C$DW$954, DW_AT_accessibility(DW_ACCESS_public)
    9326              
    9327              $C$DW$955       .dwtag  DW_TAG_member
    9328                      .dwattr $C$DW$955, DW_AT_type(*$C$DW$T$27)
    9329                      .dwattr $C$DW$955, DW_AT_name("ADCOFFTRIM")
    9330                      .dwattr $C$DW$955, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    9331                      .dwattr $C$DW$955, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{0F3B45B3-DA78-405D-822B-4C4264E94F96} PAGE  184

    9332                      .dwattr $C$DW$955, DW_AT_accessibility(DW_ACCESS_public)
    9333              
    9334              $C$DW$956       .dwtag  DW_TAG_member
    9335                      .dwattr $C$DW$956, DW_AT_type(*$C$DW$T$33)
    9336                      .dwattr $C$DW$956, DW_AT_name("resvd_12")
    9337                      .dwattr $C$DW$956, DW_AT_TI_symbol_name("_resvd_12")
    9338                      .dwattr $C$DW$956, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    9339                      .dwattr $C$DW$956, DW_AT_accessibility(DW_ACCESS_public)
    9340              
    9341              $C$DW$957       .dwtag  DW_TAG_member
    9342                      .dwattr $C$DW$957, DW_AT_type(*$C$DW$T$27)
    9343                      .dwattr $C$DW$957, DW_AT_name("ADCREV")
    9344                      .dwattr $C$DW$957, DW_AT_TI_symbol_name("_ADCREV")
    9345                      .dwattr $C$DW$957, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    9346                      .dwattr $C$DW$957, DW_AT_accessibility(DW_ACCESS_public)
    9347              
    9348                      .dwendtag $C$DW$T$34
    9349              
    9350              $C$DW$T$238     .dwtag  DW_TAG_typedef
    9351                      .dwattr $C$DW$T$238, DW_AT_name("ADC_Obj")
    9352                      .dwattr $C$DW$T$238, DW_AT_type(*$C$DW$T$34)
    9353                      .dwattr $C$DW$T$238, DW_AT_language(DW_LANG_C)
    9354              
    9355              $C$DW$T$124     .dwtag  DW_TAG_pointer_type
    9356                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$34)
    9357                      .dwattr $C$DW$T$124, DW_AT_address_class(0x20)
    9358              
    9359              $C$DW$T$125     .dwtag  DW_TAG_typedef
    9360                      .dwattr $C$DW$T$125, DW_AT_name("ADC_Handle")
    9361                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
    9362                      .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    9363              
    9364              
    9365              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    9366                      .dwattr $C$DW$T$20, DW_AT_name("_AFSEL_Obj_")
    9367                      .dwattr $C$DW$T$20, DW_AT_declaration
    9368                      .dwendtag $C$DW$T$20
    9369              
    9370              $C$DW$T$239     .dwtag  DW_TAG_pointer_type
    9371                      .dwattr $C$DW$T$239, DW_AT_type(*$C$DW$T$20)
    9372                      .dwattr $C$DW$T$239, DW_AT_address_class(0x20)
    9373              
    9374              $C$DW$T$240     .dwtag  DW_TAG_typedef
    9375                      .dwattr $C$DW$T$240, DW_AT_name("AFSEL_Handle")
    9376                      .dwattr $C$DW$T$240, DW_AT_type(*$C$DW$T$239)
    9377                      .dwattr $C$DW$T$240, DW_AT_language(DW_LANG_C)
    9378              
    9379              
    9380              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    9381                      .dwattr $C$DW$T$38, DW_AT_name("_CLARKE_Obj_")
    9382                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x06)
    9383              $C$DW$958       .dwtag  DW_TAG_member
    9384                      .dwattr $C$DW$958, DW_AT_type(*$C$DW$T$35)
    9385                      .dwattr $C$DW$958, DW_AT_name("alpha_sf")
    9386                      .dwattr $C$DW$958, DW_AT_TI_symbol_name("_alpha_sf")
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{0F3B45B3-DA78-405D-822B-4C4264E94F96} PAGE  185

    9387                      .dwattr $C$DW$958, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9388                      .dwattr $C$DW$958, DW_AT_accessibility(DW_ACCESS_public)
    9389              
    9390              $C$DW$959       .dwtag  DW_TAG_member
    9391                      .dwattr $C$DW$959, DW_AT_type(*$C$DW$T$35)
    9392                      .dwattr $C$DW$959, DW_AT_name("beta_sf")
    9393                      .dwattr $C$DW$959, DW_AT_TI_symbol_name("_beta_sf")
    9394                      .dwattr $C$DW$959, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9395                      .dwattr $C$DW$959, DW_AT_accessibility(DW_ACCESS_public)
    9396              
    9397              $C$DW$960       .dwtag  DW_TAG_member
    9398                      .dwattr $C$DW$960, DW_AT_type(*$C$DW$T$37)
    9399                      .dwattr $C$DW$960, DW_AT_name("numSensors")
    9400                      .dwattr $C$DW$960, DW_AT_TI_symbol_name("_numSensors")
    9401                      .dwattr $C$DW$960, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9402                      .dwattr $C$DW$960, DW_AT_accessibility(DW_ACCESS_public)
    9403              
    9404                      .dwendtag $C$DW$T$38
    9405              
    9406              $C$DW$T$49      .dwtag  DW_TAG_typedef
    9407                      .dwattr $C$DW$T$49, DW_AT_name("CLARKE_Obj")
    9408                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$38)
    9409                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    9410              
    9411              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    9412                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$38)
    9413                      .dwattr $C$DW$T$47, DW_AT_address_class(0x20)
    9414              
    9415              $C$DW$T$48      .dwtag  DW_TAG_typedef
    9416                      .dwattr $C$DW$T$48, DW_AT_name("CLARKE_Handle")
    9417                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    9418                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    9419              
    9420              $C$DW$961       .dwtag  DW_TAG_TI_far_type
    9421                      .dwattr $C$DW$961, DW_AT_type(*$C$DW$T$48)
    9422              
    9423              $C$DW$T$244     .dwtag  DW_TAG_const_type
    9424                      .dwattr $C$DW$T$244, DW_AT_type(*$C$DW$961)
    9425              
    9426              
    9427              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    9428                      .dwattr $C$DW$T$40, DW_AT_name("_CLK_Obj_")
    9429                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x11)
    9430              $C$DW$962       .dwtag  DW_TAG_member
    9431                      .dwattr $C$DW$962, DW_AT_type(*$C$DW$T$27)
    9432                      .dwattr $C$DW$962, DW_AT_name("XCLK")
    9433                      .dwattr $C$DW$962, DW_AT_TI_symbol_name("_XCLK")
    9434                      .dwattr $C$DW$962, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9435                      .dwattr $C$DW$962, DW_AT_accessibility(DW_ACCESS_public)
    9436              
    9437              $C$DW$963       .dwtag  DW_TAG_member
    9438                      .dwattr $C$DW$963, DW_AT_type(*$C$DW$T$27)
    9439                      .dwattr $C$DW$963, DW_AT_name("rsvd_1")
    9440                      .dwattr $C$DW$963, DW_AT_TI_symbol_name("_rsvd_1")
    9441                      .dwattr $C$DW$963, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{0F3B45B3-DA78-405D-822B-4C4264E94F96} PAGE  186

    9442                      .dwattr $C$DW$963, DW_AT_accessibility(DW_ACCESS_public)
    9443              
    9444              $C$DW$964       .dwtag  DW_TAG_member
    9445                      .dwattr $C$DW$964, DW_AT_type(*$C$DW$T$27)
    9446                      .dwattr $C$DW$964, DW_AT_name("CLKCTL")
    9447                      .dwattr $C$DW$964, DW_AT_TI_symbol_name("_CLKCTL")
    9448                      .dwattr $C$DW$964, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9449                      .dwattr $C$DW$964, DW_AT_accessibility(DW_ACCESS_public)
    9450              
    9451              $C$DW$965       .dwtag  DW_TAG_member
    9452                      .dwattr $C$DW$965, DW_AT_type(*$C$DW$T$39)
    9453                      .dwattr $C$DW$965, DW_AT_name("rsvd_2")
    9454                      .dwattr $C$DW$965, DW_AT_TI_symbol_name("_rsvd_2")
    9455                      .dwattr $C$DW$965, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9456                      .dwattr $C$DW$965, DW_AT_accessibility(DW_ACCESS_public)
    9457              
    9458              $C$DW$966       .dwtag  DW_TAG_member
    9459                      .dwattr $C$DW$966, DW_AT_type(*$C$DW$T$27)
    9460                      .dwattr $C$DW$966, DW_AT_name("LOSPCP")
    9461                      .dwattr $C$DW$966, DW_AT_TI_symbol_name("_LOSPCP")
    9462                      .dwattr $C$DW$966, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    9463                      .dwattr $C$DW$966, DW_AT_accessibility(DW_ACCESS_public)
    9464              
    9465              $C$DW$967       .dwtag  DW_TAG_member
    9466                      .dwattr $C$DW$967, DW_AT_type(*$C$DW$T$27)
    9467                      .dwattr $C$DW$967, DW_AT_name("PCLKCR0")
    9468                      .dwattr $C$DW$967, DW_AT_TI_symbol_name("_PCLKCR0")
    9469                      .dwattr $C$DW$967, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9470                      .dwattr $C$DW$967, DW_AT_accessibility(DW_ACCESS_public)
    9471              
    9472              $C$DW$968       .dwtag  DW_TAG_member
    9473                      .dwattr $C$DW$968, DW_AT_type(*$C$DW$T$27)
    9474                      .dwattr $C$DW$968, DW_AT_name("PCLKCR1")
    9475                      .dwattr $C$DW$968, DW_AT_TI_symbol_name("_PCLKCR1")
    9476                      .dwattr $C$DW$968, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    9477                      .dwattr $C$DW$968, DW_AT_accessibility(DW_ACCESS_public)
    9478              
    9479              $C$DW$969       .dwtag  DW_TAG_member
    9480                      .dwattr $C$DW$969, DW_AT_type(*$C$DW$T$30)
    9481                      .dwattr $C$DW$969, DW_AT_name("rsvd_3")
    9482                      .dwattr $C$DW$969, DW_AT_TI_symbol_name("_rsvd_3")
    9483                      .dwattr $C$DW$969, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9484                      .dwattr $C$DW$969, DW_AT_accessibility(DW_ACCESS_public)
    9485              
    9486              $C$DW$970       .dwtag  DW_TAG_member
    9487                      .dwattr $C$DW$970, DW_AT_type(*$C$DW$T$27)
    9488                      .dwattr $C$DW$970, DW_AT_name("PCLKCR3")
    9489                      .dwattr $C$DW$970, DW_AT_TI_symbol_name("_PCLKCR3")
    9490                      .dwattr $C$DW$970, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9491                      .dwattr $C$DW$970, DW_AT_accessibility(DW_ACCESS_public)
    9492              
    9493                      .dwendtag $C$DW$T$40
    9494              
    9495              $C$DW$T$126     .dwtag  DW_TAG_pointer_type
    9496                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$40)
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{0F3B45B3-DA78-405D-822B-4C4264E94F96} PAGE  187

    9497                      .dwattr $C$DW$T$126, DW_AT_address_class(0x20)
    9498              
    9499              $C$DW$T$127     .dwtag  DW_TAG_typedef
    9500                      .dwattr $C$DW$T$127, DW_AT_name("CLK_Handle")
    9501                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
    9502                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    9503              
    9504              
    9505              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    9506                      .dwattr $C$DW$T$41, DW_AT_name("_CPU_Obj_")
    9507                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    9508              $C$DW$971       .dwtag  DW_TAG_member
    9509                      .dwattr $C$DW$971, DW_AT_type(*$C$DW$T$37)
    9510                      .dwattr $C$DW$971, DW_AT_name("tmp")
    9511                      .dwattr $C$DW$971, DW_AT_TI_symbol_name("_tmp")
    9512                      .dwattr $C$DW$971, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9513                      .dwattr $C$DW$971, DW_AT_accessibility(DW_ACCESS_public)
    9514              
    9515                      .dwendtag $C$DW$T$41
    9516              
    9517              $C$DW$T$128     .dwtag  DW_TAG_pointer_type
    9518                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$41)
    9519                      .dwattr $C$DW$T$128, DW_AT_address_class(0x20)
    9520              
    9521              $C$DW$T$129     .dwtag  DW_TAG_typedef
    9522                      .dwattr $C$DW$T$129, DW_AT_name("CPU_Handle")
    9523                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$128)
    9524                      .dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
    9525              
    9526              
    9527              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    9528                      .dwattr $C$DW$T$77, DW_AT_name("_CTRL_Obj_")
    9529                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x10a)
    9530              $C$DW$972       .dwtag  DW_TAG_member
    9531                      .dwattr $C$DW$972, DW_AT_type(*$C$DW$T$42)
    9532                      .dwattr $C$DW$972, DW_AT_name("version")
    9533                      .dwattr $C$DW$972, DW_AT_TI_symbol_name("_version")
    9534                      .dwattr $C$DW$972, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9535                      .dwattr $C$DW$972, DW_AT_accessibility(DW_ACCESS_public)
    9536              
    9537              $C$DW$973       .dwtag  DW_TAG_member
    9538                      .dwattr $C$DW$973, DW_AT_type(*$C$DW$T$44)
    9539                      .dwattr $C$DW$973, DW_AT_name("state")
    9540                      .dwattr $C$DW$973, DW_AT_TI_symbol_name("_state")
    9541                      .dwattr $C$DW$973, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9542                      .dwattr $C$DW$973, DW_AT_accessibility(DW_ACCESS_public)
    9543              
    9544              $C$DW$974       .dwtag  DW_TAG_member
    9545                      .dwattr $C$DW$974, DW_AT_type(*$C$DW$T$44)
    9546                      .dwattr $C$DW$974, DW_AT_name("prevState")
    9547                      .dwattr $C$DW$974, DW_AT_TI_symbol_name("_prevState")
    9548                      .dwattr $C$DW$974, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9549                      .dwattr $C$DW$974, DW_AT_accessibility(DW_ACCESS_public)
    9550              
    9551              $C$DW$975       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{0F3B45B3-DA78-405D-822B-4C4264E94F96} PAGE  188

    9552                      .dwattr $C$DW$975, DW_AT_type(*$C$DW$T$46)
    9553                      .dwattr $C$DW$975, DW_AT_name("errorCode")
    9554                      .dwattr $C$DW$975, DW_AT_TI_symbol_name("_errorCode")
    9555                      .dwattr $C$DW$975, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9556                      .dwattr $C$DW$975, DW_AT_accessibility(DW_ACCESS_public)
    9557              
    9558              $C$DW$976       .dwtag  DW_TAG_member
    9559                      .dwattr $C$DW$976, DW_AT_type(*$C$DW$T$48)
    9560                      .dwattr $C$DW$976, DW_AT_name("clarkeHandle_I")
    9561                      .dwattr $C$DW$976, DW_AT_TI_symbol_name("_clarkeHandle_I")
    9562                      .dwattr $C$DW$976, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9563                      .dwattr $C$DW$976, DW_AT_accessibility(DW_ACCESS_public)
    9564              
    9565              $C$DW$977       .dwtag  DW_TAG_member
    9566                      .dwattr $C$DW$977, DW_AT_type(*$C$DW$T$49)
    9567                      .dwattr $C$DW$977, DW_AT_name("clarke_I")
    9568                      .dwattr $C$DW$977, DW_AT_TI_symbol_name("_clarke_I")
    9569                      .dwattr $C$DW$977, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9570                      .dwattr $C$DW$977, DW_AT_accessibility(DW_ACCESS_public)
    9571              
    9572              $C$DW$978       .dwtag  DW_TAG_member
    9573                      .dwattr $C$DW$978, DW_AT_type(*$C$DW$T$48)
    9574                      .dwattr $C$DW$978, DW_AT_name("clarkeHandle_V")
    9575                      .dwattr $C$DW$978, DW_AT_TI_symbol_name("_clarkeHandle_V")
    9576                      .dwattr $C$DW$978, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9577                      .dwattr $C$DW$978, DW_AT_accessibility(DW_ACCESS_public)
    9578              
    9579              $C$DW$979       .dwtag  DW_TAG_member
    9580                      .dwattr $C$DW$979, DW_AT_type(*$C$DW$T$49)
    9581                      .dwattr $C$DW$979, DW_AT_name("clarke_V")
    9582                      .dwattr $C$DW$979, DW_AT_TI_symbol_name("_clarke_V")
    9583                      .dwattr $C$DW$979, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9584                      .dwattr $C$DW$979, DW_AT_accessibility(DW_ACCESS_public)
    9585              
    9586              $C$DW$980       .dwtag  DW_TAG_member
    9587                      .dwattr $C$DW$980, DW_AT_type(*$C$DW$T$51)
    9588                      .dwattr $C$DW$980, DW_AT_name("estHandle")
    9589                      .dwattr $C$DW$980, DW_AT_TI_symbol_name("_estHandle")
    9590                      .dwattr $C$DW$980, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9591                      .dwattr $C$DW$980, DW_AT_accessibility(DW_ACCESS_public)
    9592              
    9593              $C$DW$981       .dwtag  DW_TAG_member
    9594                      .dwattr $C$DW$981, DW_AT_type(*$C$DW$T$53)
    9595                      .dwattr $C$DW$981, DW_AT_name("parkHandle")
    9596                      .dwattr $C$DW$981, DW_AT_TI_symbol_name("_parkHandle")
    9597                      .dwattr $C$DW$981, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9598                      .dwattr $C$DW$981, DW_AT_accessibility(DW_ACCESS_public)
    9599              
    9600              $C$DW$982       .dwtag  DW_TAG_member
    9601                      .dwattr $C$DW$982, DW_AT_type(*$C$DW$T$54)
    9602                      .dwattr $C$DW$982, DW_AT_name("park")
    9603                      .dwattr $C$DW$982, DW_AT_TI_symbol_name("_park")
    9604                      .dwattr $C$DW$982, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9605                      .dwattr $C$DW$982, DW_AT_accessibility(DW_ACCESS_public)
    9606              
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{0F3B45B3-DA78-405D-822B-4C4264E94F96} PAGE  189

    9607              $C$DW$983       .dwtag  DW_TAG_member
    9608                      .dwattr $C$DW$983, DW_AT_type(*$C$DW$T$56)
    9609                      .dwattr $C$DW$983, DW_AT_name("pidHandle_Id")
    9610                      .dwattr $C$DW$983, DW_AT_TI_symbol_name("_pidHandle_Id")
    9611                      .dwattr $C$DW$983, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    9612                      .dwattr $C$DW$983, DW_AT_accessibility(DW_ACCESS_public)
    9613              
    9614              $C$DW$984       .dwtag  DW_TAG_member
    9615                      .dwattr $C$DW$984, DW_AT_type(*$C$DW$T$57)
    9616                      .dwattr $C$DW$984, DW_AT_name("pid_Id")
    9617                      .dwattr $C$DW$984, DW_AT_TI_symbol_name("_pid_Id")
    9618                      .dwattr $C$DW$984, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    9619                      .dwattr $C$DW$984, DW_AT_accessibility(DW_ACCESS_public)
    9620              
    9621              $C$DW$985       .dwtag  DW_TAG_member
    9622                      .dwattr $C$DW$985, DW_AT_type(*$C$DW$T$56)
    9623                      .dwattr $C$DW$985, DW_AT_name("pidHandle_Iq")
    9624                      .dwattr $C$DW$985, DW_AT_TI_symbol_name("_pidHandle_Iq")
    9625                      .dwattr $C$DW$985, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    9626                      .dwattr $C$DW$985, DW_AT_accessibility(DW_ACCESS_public)
    9627              
    9628              $C$DW$986       .dwtag  DW_TAG_member
    9629                      .dwattr $C$DW$986, DW_AT_type(*$C$DW$T$57)
    9630                      .dwattr $C$DW$986, DW_AT_name("pid_Iq")
    9631                      .dwattr $C$DW$986, DW_AT_TI_symbol_name("_pid_Iq")
    9632                      .dwattr $C$DW$986, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    9633                      .dwattr $C$DW$986, DW_AT_accessibility(DW_ACCESS_public)
    9634              
    9635              $C$DW$987       .dwtag  DW_TAG_member
    9636                      .dwattr $C$DW$987, DW_AT_type(*$C$DW$T$56)
    9637                      .dwattr $C$DW$987, DW_AT_name("pidHandle_spd")
    9638                      .dwattr $C$DW$987, DW_AT_TI_symbol_name("_pidHandle_spd")
    9639                      .dwattr $C$DW$987, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    9640                      .dwattr $C$DW$987, DW_AT_accessibility(DW_ACCESS_public)
    9641              
    9642              $C$DW$988       .dwtag  DW_TAG_member
    9643                      .dwattr $C$DW$988, DW_AT_type(*$C$DW$T$57)
    9644                      .dwattr $C$DW$988, DW_AT_name("pid_spd")
    9645                      .dwattr $C$DW$988, DW_AT_TI_symbol_name("_pid_spd")
    9646                      .dwattr $C$DW$988, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    9647                      .dwattr $C$DW$988, DW_AT_accessibility(DW_ACCESS_public)
    9648              
    9649              $C$DW$989       .dwtag  DW_TAG_member
    9650                      .dwattr $C$DW$989, DW_AT_type(*$C$DW$T$59)
    9651                      .dwattr $C$DW$989, DW_AT_name("iparkHandle")
    9652                      .dwattr $C$DW$989, DW_AT_TI_symbol_name("_iparkHandle")
    9653                      .dwattr $C$DW$989, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    9654                      .dwattr $C$DW$989, DW_AT_accessibility(DW_ACCESS_public)
    9655              
    9656              $C$DW$990       .dwtag  DW_TAG_member
    9657                      .dwattr $C$DW$990, DW_AT_type(*$C$DW$T$60)
    9658                      .dwattr $C$DW$990, DW_AT_name("ipark")
    9659                      .dwattr $C$DW$990, DW_AT_TI_symbol_name("_ipark")
    9660                      .dwattr $C$DW$990, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    9661                      .dwattr $C$DW$990, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{0F3B45B3-DA78-405D-822B-4C4264E94F96} PAGE  190

    9662              
    9663              $C$DW$991       .dwtag  DW_TAG_member
    9664                      .dwattr $C$DW$991, DW_AT_type(*$C$DW$T$62)
    9665                      .dwattr $C$DW$991, DW_AT_name("svgenHandle")
    9666                      .dwattr $C$DW$991, DW_AT_TI_symbol_name("_svgenHandle")
    9667                      .dwattr $C$DW$991, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    9668                      .dwattr $C$DW$991, DW_AT_accessibility(DW_ACCESS_public)
    9669              
    9670              $C$DW$992       .dwtag  DW_TAG_member
    9671                      .dwattr $C$DW$992, DW_AT_type(*$C$DW$T$63)
    9672                      .dwattr $C$DW$992, DW_AT_name("svgen")
    9673                      .dwattr $C$DW$992, DW_AT_TI_symbol_name("_svgen")
    9674                      .dwattr $C$DW$992, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    9675                      .dwattr $C$DW$992, DW_AT_accessibility(DW_ACCESS_public)
    9676              
    9677              $C$DW$993       .dwtag  DW_TAG_member
    9678                      .dwattr $C$DW$993, DW_AT_type(*$C$DW$T$65)
    9679                      .dwattr $C$DW$993, DW_AT_name("trajHandle_Id")
    9680                      .dwattr $C$DW$993, DW_AT_TI_symbol_name("_trajHandle_Id")
    9681                      .dwattr $C$DW$993, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    9682                      .dwattr $C$DW$993, DW_AT_accessibility(DW_ACCESS_public)
    9683              
    9684              $C$DW$994       .dwtag  DW_TAG_member
    9685                      .dwattr $C$DW$994, DW_AT_type(*$C$DW$T$66)
    9686                      .dwattr $C$DW$994, DW_AT_name("traj_Id")
    9687                      .dwattr $C$DW$994, DW_AT_TI_symbol_name("_traj_Id")
    9688                      .dwattr $C$DW$994, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    9689                      .dwattr $C$DW$994, DW_AT_accessibility(DW_ACCESS_public)
    9690              
    9691              $C$DW$995       .dwtag  DW_TAG_member
    9692                      .dwattr $C$DW$995, DW_AT_type(*$C$DW$T$65)
    9693                      .dwattr $C$DW$995, DW_AT_name("trajHandle_spd")
    9694                      .dwattr $C$DW$995, DW_AT_TI_symbol_name("_trajHandle_spd")
    9695                      .dwattr $C$DW$995, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    9696                      .dwattr $C$DW$995, DW_AT_accessibility(DW_ACCESS_public)
    9697              
    9698              $C$DW$996       .dwtag  DW_TAG_member
    9699                      .dwattr $C$DW$996, DW_AT_type(*$C$DW$T$66)
    9700                      .dwattr $C$DW$996, DW_AT_name("traj_spd")
    9701                      .dwattr $C$DW$996, DW_AT_TI_symbol_name("_traj_spd")
    9702                      .dwattr $C$DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    9703                      .dwattr $C$DW$996, DW_AT_accessibility(DW_ACCESS_public)
    9704              
    9705              $C$DW$997       .dwtag  DW_TAG_member
    9706                      .dwattr $C$DW$997, DW_AT_type(*$C$DW$T$65)
    9707                      .dwattr $C$DW$997, DW_AT_name("trajHandle_spdMax")
    9708                      .dwattr $C$DW$997, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    9709                      .dwattr $C$DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    9710                      .dwattr $C$DW$997, DW_AT_accessibility(DW_ACCESS_public)
    9711              
    9712              $C$DW$998       .dwtag  DW_TAG_member
    9713                      .dwattr $C$DW$998, DW_AT_type(*$C$DW$T$66)
    9714                      .dwattr $C$DW$998, DW_AT_name("traj_spdMax")
    9715                      .dwattr $C$DW$998, DW_AT_TI_symbol_name("_traj_spdMax")
    9716                      .dwattr $C$DW$998, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{0F3B45B3-DA78-405D-822B-4C4264E94F96} PAGE  191

    9717                      .dwattr $C$DW$998, DW_AT_accessibility(DW_ACCESS_public)
    9718              
    9719              $C$DW$999       .dwtag  DW_TAG_member
    9720                      .dwattr $C$DW$999, DW_AT_type(*$C$DW$T$67)
    9721                      .dwattr $C$DW$999, DW_AT_name("motorParams")
    9722                      .dwattr $C$DW$999, DW_AT_TI_symbol_name("_motorParams")
    9723                      .dwattr $C$DW$999, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    9724                      .dwattr $C$DW$999, DW_AT_accessibility(DW_ACCESS_public)
    9725              
    9726              $C$DW$1000      .dwtag  DW_TAG_member
    9727                      .dwattr $C$DW$1000, DW_AT_type(*$C$DW$T$71)
    9728                      .dwattr $C$DW$1000, DW_AT_name("waitTimes")
    9729                      .dwattr $C$DW$1000, DW_AT_TI_symbol_name("_waitTimes")
    9730                      .dwattr $C$DW$1000, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    9731                      .dwattr $C$DW$1000, DW_AT_accessibility(DW_ACCESS_public)
    9732              
    9733              $C$DW$1001      .dwtag  DW_TAG_member
    9734                      .dwattr $C$DW$1001, DW_AT_type(*$C$DW$T$70)
    9735                      .dwattr $C$DW$1001, DW_AT_name("counter_state")
    9736                      .dwattr $C$DW$1001, DW_AT_TI_symbol_name("_counter_state")
    9737                      .dwattr $C$DW$1001, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    9738                      .dwattr $C$DW$1001, DW_AT_accessibility(DW_ACCESS_public)
    9739              
    9740              $C$DW$1002      .dwtag  DW_TAG_member
    9741                      .dwattr $C$DW$1002, DW_AT_type(*$C$DW$T$73)
    9742                      .dwattr $C$DW$1002, DW_AT_name("numIsrTicksPerCtrlTick")
    9743                      .dwattr $C$DW$1002, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    9744                      .dwattr $C$DW$1002, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    9745                      .dwattr $C$DW$1002, DW_AT_accessibility(DW_ACCESS_public)
    9746              
    9747              $C$DW$1003      .dwtag  DW_TAG_member
    9748                      .dwattr $C$DW$1003, DW_AT_type(*$C$DW$T$73)
    9749                      .dwattr $C$DW$1003, DW_AT_name("numCtrlTicksPerCurrentTick")
    9750                      .dwattr $C$DW$1003, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    9751                      .dwattr $C$DW$1003, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    9752                      .dwattr $C$DW$1003, DW_AT_accessibility(DW_ACCESS_public)
    9753              
    9754              $C$DW$1004      .dwtag  DW_TAG_member
    9755                      .dwattr $C$DW$1004, DW_AT_type(*$C$DW$T$73)
    9756                      .dwattr $C$DW$1004, DW_AT_name("numCtrlTicksPerSpeedTick")
    9757                      .dwattr $C$DW$1004, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    9758                      .dwattr $C$DW$1004, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    9759                      .dwattr $C$DW$1004, DW_AT_accessibility(DW_ACCESS_public)
    9760              
    9761              $C$DW$1005      .dwtag  DW_TAG_member
    9762                      .dwattr $C$DW$1005, DW_AT_type(*$C$DW$T$73)
    9763                      .dwattr $C$DW$1005, DW_AT_name("numCtrlTicksPerTrajTick")
    9764                      .dwattr $C$DW$1005, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    9765                      .dwattr $C$DW$1005, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    9766                      .dwattr $C$DW$1005, DW_AT_accessibility(DW_ACCESS_public)
    9767              
    9768              $C$DW$1006      .dwtag  DW_TAG_member
    9769                      .dwattr $C$DW$1006, DW_AT_type(*$C$DW$T$70)
    9770                      .dwattr $C$DW$1006, DW_AT_name("ctrlFreq_Hz")
    9771                      .dwattr $C$DW$1006, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{0F3B45B3-DA78-405D-822B-4C4264E94F96} PAGE  192

    9772                      .dwattr $C$DW$1006, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    9773                      .dwattr $C$DW$1006, DW_AT_accessibility(DW_ACCESS_public)
    9774              
    9775              $C$DW$1007      .dwtag  DW_TAG_member
    9776                      .dwattr $C$DW$1007, DW_AT_type(*$C$DW$T$70)
    9777                      .dwattr $C$DW$1007, DW_AT_name("trajFreq_Hz")
    9778                      .dwattr $C$DW$1007, DW_AT_TI_symbol_name("_trajFreq_Hz")
    9779                      .dwattr $C$DW$1007, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    9780                      .dwattr $C$DW$1007, DW_AT_accessibility(DW_ACCESS_public)
    9781              
    9782              $C$DW$1008      .dwtag  DW_TAG_member
    9783                      .dwattr $C$DW$1008, DW_AT_type(*$C$DW$T$35)
    9784                      .dwattr $C$DW$1008, DW_AT_name("trajPeriod_sec")
    9785                      .dwattr $C$DW$1008, DW_AT_TI_symbol_name("_trajPeriod_sec")
    9786                      .dwattr $C$DW$1008, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    9787                      .dwattr $C$DW$1008, DW_AT_accessibility(DW_ACCESS_public)
    9788              
    9789              $C$DW$1009      .dwtag  DW_TAG_member
    9790                      .dwattr $C$DW$1009, DW_AT_type(*$C$DW$T$74)
    9791                      .dwattr $C$DW$1009, DW_AT_name("ctrlPeriod_sec")
    9792                      .dwattr $C$DW$1009, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    9793                      .dwattr $C$DW$1009, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    9794                      .dwattr $C$DW$1009, DW_AT_accessibility(DW_ACCESS_public)
    9795              
    9796              $C$DW$1010      .dwtag  DW_TAG_member
    9797                      .dwattr $C$DW$1010, DW_AT_type(*$C$DW$T$35)
    9798                      .dwattr $C$DW$1010, DW_AT_name("maxVsMag_pu")
    9799                      .dwattr $C$DW$1010, DW_AT_TI_symbol_name("_maxVsMag_pu")
    9800                      .dwattr $C$DW$1010, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    9801                      .dwattr $C$DW$1010, DW_AT_accessibility(DW_ACCESS_public)
    9802              
    9803              $C$DW$1011      .dwtag  DW_TAG_member
    9804                      .dwattr $C$DW$1011, DW_AT_type(*$C$DW$T$75)
    9805                      .dwattr $C$DW$1011, DW_AT_name("Iab_in")
    9806                      .dwattr $C$DW$1011, DW_AT_TI_symbol_name("_Iab_in")
    9807                      .dwattr $C$DW$1011, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    9808                      .dwattr $C$DW$1011, DW_AT_accessibility(DW_ACCESS_public)
    9809              
    9810              $C$DW$1012      .dwtag  DW_TAG_member
    9811                      .dwattr $C$DW$1012, DW_AT_type(*$C$DW$T$75)
    9812                      .dwattr $C$DW$1012, DW_AT_name("Iab_filt")
    9813                      .dwattr $C$DW$1012, DW_AT_TI_symbol_name("_Iab_filt")
    9814                      .dwattr $C$DW$1012, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    9815                      .dwattr $C$DW$1012, DW_AT_accessibility(DW_ACCESS_public)
    9816              
    9817              $C$DW$1013      .dwtag  DW_TAG_member
    9818                      .dwattr $C$DW$1013, DW_AT_type(*$C$DW$T$75)
    9819                      .dwattr $C$DW$1013, DW_AT_name("Idq_in")
    9820                      .dwattr $C$DW$1013, DW_AT_TI_symbol_name("_Idq_in")
    9821                      .dwattr $C$DW$1013, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    9822                      .dwattr $C$DW$1013, DW_AT_accessibility(DW_ACCESS_public)
    9823              
    9824              $C$DW$1014      .dwtag  DW_TAG_member
    9825                      .dwattr $C$DW$1014, DW_AT_type(*$C$DW$T$75)
    9826                      .dwattr $C$DW$1014, DW_AT_name("Vab_in")
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{0F3B45B3-DA78-405D-822B-4C4264E94F96} PAGE  193

    9827                      .dwattr $C$DW$1014, DW_AT_TI_symbol_name("_Vab_in")
    9828                      .dwattr $C$DW$1014, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    9829                      .dwattr $C$DW$1014, DW_AT_accessibility(DW_ACCESS_public)
    9830              
    9831              $C$DW$1015      .dwtag  DW_TAG_member
    9832                      .dwattr $C$DW$1015, DW_AT_type(*$C$DW$T$35)
    9833                      .dwattr $C$DW$1015, DW_AT_name("spd_out")
    9834                      .dwattr $C$DW$1015, DW_AT_TI_symbol_name("_spd_out")
    9835                      .dwattr $C$DW$1015, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    9836                      .dwattr $C$DW$1015, DW_AT_accessibility(DW_ACCESS_public)
    9837              
    9838              $C$DW$1016      .dwtag  DW_TAG_member
    9839                      .dwattr $C$DW$1016, DW_AT_type(*$C$DW$T$75)
    9840                      .dwattr $C$DW$1016, DW_AT_name("Vab_out")
    9841                      .dwattr $C$DW$1016, DW_AT_TI_symbol_name("_Vab_out")
    9842                      .dwattr $C$DW$1016, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    9843                      .dwattr $C$DW$1016, DW_AT_accessibility(DW_ACCESS_public)
    9844              
    9845              $C$DW$1017      .dwtag  DW_TAG_member
    9846                      .dwattr $C$DW$1017, DW_AT_type(*$C$DW$T$75)
    9847                      .dwattr $C$DW$1017, DW_AT_name("Vdq_out")
    9848                      .dwattr $C$DW$1017, DW_AT_TI_symbol_name("_Vdq_out")
    9849                      .dwattr $C$DW$1017, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    9850                      .dwattr $C$DW$1017, DW_AT_accessibility(DW_ACCESS_public)
    9851              
    9852              $C$DW$1018      .dwtag  DW_TAG_member
    9853                      .dwattr $C$DW$1018, DW_AT_type(*$C$DW$T$74)
    9854                      .dwattr $C$DW$1018, DW_AT_name("Rhf")
    9855                      .dwattr $C$DW$1018, DW_AT_TI_symbol_name("_Rhf")
    9856                      .dwattr $C$DW$1018, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    9857                      .dwattr $C$DW$1018, DW_AT_accessibility(DW_ACCESS_public)
    9858              
    9859              $C$DW$1019      .dwtag  DW_TAG_member
    9860                      .dwattr $C$DW$1019, DW_AT_type(*$C$DW$T$74)
    9861                      .dwattr $C$DW$1019, DW_AT_name("Lhf")
    9862                      .dwattr $C$DW$1019, DW_AT_TI_symbol_name("_Lhf")
    9863                      .dwattr $C$DW$1019, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    9864                      .dwattr $C$DW$1019, DW_AT_accessibility(DW_ACCESS_public)
    9865              
    9866              $C$DW$1020      .dwtag  DW_TAG_member
    9867                      .dwattr $C$DW$1020, DW_AT_type(*$C$DW$T$74)
    9868                      .dwattr $C$DW$1020, DW_AT_name("RoverL")
    9869                      .dwattr $C$DW$1020, DW_AT_TI_symbol_name("_RoverL")
    9870                      .dwattr $C$DW$1020, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    9871                      .dwattr $C$DW$1020, DW_AT_accessibility(DW_ACCESS_public)
    9872              
    9873              $C$DW$1021      .dwtag  DW_TAG_member
    9874                      .dwattr $C$DW$1021, DW_AT_type(*$C$DW$T$35)
    9875                      .dwattr $C$DW$1021, DW_AT_name("Kp_Id")
    9876                      .dwattr $C$DW$1021, DW_AT_TI_symbol_name("_Kp_Id")
    9877                      .dwattr $C$DW$1021, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    9878                      .dwattr $C$DW$1021, DW_AT_accessibility(DW_ACCESS_public)
    9879              
    9880              $C$DW$1022      .dwtag  DW_TAG_member
    9881                      .dwattr $C$DW$1022, DW_AT_type(*$C$DW$T$35)
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{0F3B45B3-DA78-405D-822B-4C4264E94F96} PAGE  194

    9882                      .dwattr $C$DW$1022, DW_AT_name("Kp_Iq")
    9883                      .dwattr $C$DW$1022, DW_AT_TI_symbol_name("_Kp_Iq")
    9884                      .dwattr $C$DW$1022, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    9885                      .dwattr $C$DW$1022, DW_AT_accessibility(DW_ACCESS_public)
    9886              
    9887              $C$DW$1023      .dwtag  DW_TAG_member
    9888                      .dwattr $C$DW$1023, DW_AT_type(*$C$DW$T$35)
    9889                      .dwattr $C$DW$1023, DW_AT_name("Kp_spd")
    9890                      .dwattr $C$DW$1023, DW_AT_TI_symbol_name("_Kp_spd")
    9891                      .dwattr $C$DW$1023, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    9892                      .dwattr $C$DW$1023, DW_AT_accessibility(DW_ACCESS_public)
    9893              
    9894              $C$DW$1024      .dwtag  DW_TAG_member
    9895                      .dwattr $C$DW$1024, DW_AT_type(*$C$DW$T$35)
    9896                      .dwattr $C$DW$1024, DW_AT_name("Ki_Id")
    9897                      .dwattr $C$DW$1024, DW_AT_TI_symbol_name("_Ki_Id")
    9898                      .dwattr $C$DW$1024, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    9899                      .dwattr $C$DW$1024, DW_AT_accessibility(DW_ACCESS_public)
    9900              
    9901              $C$DW$1025      .dwtag  DW_TAG_member
    9902                      .dwattr $C$DW$1025, DW_AT_type(*$C$DW$T$35)
    9903                      .dwattr $C$DW$1025, DW_AT_name("Ki_Iq")
    9904                      .dwattr $C$DW$1025, DW_AT_TI_symbol_name("_Ki_Iq")
    9905                      .dwattr $C$DW$1025, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    9906                      .dwattr $C$DW$1025, DW_AT_accessibility(DW_ACCESS_public)
    9907              
    9908              $C$DW$1026      .dwtag  DW_TAG_member
    9909                      .dwattr $C$DW$1026, DW_AT_type(*$C$DW$T$35)
    9910                      .dwattr $C$DW$1026, DW_AT_name("Ki_spd")
    9911                      .dwattr $C$DW$1026, DW_AT_TI_symbol_name("_Ki_spd")
    9912                      .dwattr $C$DW$1026, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    9913                      .dwattr $C$DW$1026, DW_AT_accessibility(DW_ACCESS_public)
    9914              
    9915              $C$DW$1027      .dwtag  DW_TAG_member
    9916                      .dwattr $C$DW$1027, DW_AT_type(*$C$DW$T$35)
    9917                      .dwattr $C$DW$1027, DW_AT_name("Kd_Id")
    9918                      .dwattr $C$DW$1027, DW_AT_TI_symbol_name("_Kd_Id")
    9919                      .dwattr $C$DW$1027, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    9920                      .dwattr $C$DW$1027, DW_AT_accessibility(DW_ACCESS_public)
    9921              
    9922              $C$DW$1028      .dwtag  DW_TAG_member
    9923                      .dwattr $C$DW$1028, DW_AT_type(*$C$DW$T$35)
    9924                      .dwattr $C$DW$1028, DW_AT_name("Kd_Iq")
    9925                      .dwattr $C$DW$1028, DW_AT_TI_symbol_name("_Kd_Iq")
    9926                      .dwattr $C$DW$1028, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    9927                      .dwattr $C$DW$1028, DW_AT_accessibility(DW_ACCESS_public)
    9928              
    9929              $C$DW$1029      .dwtag  DW_TAG_member
    9930                      .dwattr $C$DW$1029, DW_AT_type(*$C$DW$T$35)
    9931                      .dwattr $C$DW$1029, DW_AT_name("Kd_spd")
    9932                      .dwattr $C$DW$1029, DW_AT_TI_symbol_name("_Kd_spd")
    9933                      .dwattr $C$DW$1029, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    9934                      .dwattr $C$DW$1029, DW_AT_accessibility(DW_ACCESS_public)
    9935              
    9936              $C$DW$1030      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{0F3B45B3-DA78-405D-822B-4C4264E94F96} PAGE  195

    9937                      .dwattr $C$DW$1030, DW_AT_type(*$C$DW$T$35)
    9938                      .dwattr $C$DW$1030, DW_AT_name("Ui_Id")
    9939                      .dwattr $C$DW$1030, DW_AT_TI_symbol_name("_Ui_Id")
    9940                      .dwattr $C$DW$1030, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    9941                      .dwattr $C$DW$1030, DW_AT_accessibility(DW_ACCESS_public)
    9942              
    9943              $C$DW$1031      .dwtag  DW_TAG_member
    9944                      .dwattr $C$DW$1031, DW_AT_type(*$C$DW$T$35)
    9945                      .dwattr $C$DW$1031, DW_AT_name("Ui_Iq")
    9946                      .dwattr $C$DW$1031, DW_AT_TI_symbol_name("_Ui_Iq")
    9947                      .dwattr $C$DW$1031, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    9948                      .dwattr $C$DW$1031, DW_AT_accessibility(DW_ACCESS_public)
    9949              
    9950              $C$DW$1032      .dwtag  DW_TAG_member
    9951                      .dwattr $C$DW$1032, DW_AT_type(*$C$DW$T$35)
    9952                      .dwattr $C$DW$1032, DW_AT_name("Ui_spd")
    9953                      .dwattr $C$DW$1032, DW_AT_TI_symbol_name("_Ui_spd")
    9954                      .dwattr $C$DW$1032, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    9955                      .dwattr $C$DW$1032, DW_AT_accessibility(DW_ACCESS_public)
    9956              
    9957              $C$DW$1033      .dwtag  DW_TAG_member
    9958                      .dwattr $C$DW$1033, DW_AT_type(*$C$DW$T$75)
    9959                      .dwattr $C$DW$1033, DW_AT_name("Idq_ref")
    9960                      .dwattr $C$DW$1033, DW_AT_TI_symbol_name("_Idq_ref")
    9961                      .dwattr $C$DW$1033, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    9962                      .dwattr $C$DW$1033, DW_AT_accessibility(DW_ACCESS_public)
    9963              
    9964              $C$DW$1034      .dwtag  DW_TAG_member
    9965                      .dwattr $C$DW$1034, DW_AT_type(*$C$DW$T$35)
    9966                      .dwattr $C$DW$1034, DW_AT_name("IdRated")
    9967                      .dwattr $C$DW$1034, DW_AT_TI_symbol_name("_IdRated")
    9968                      .dwattr $C$DW$1034, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    9969                      .dwattr $C$DW$1034, DW_AT_accessibility(DW_ACCESS_public)
    9970              
    9971              $C$DW$1035      .dwtag  DW_TAG_member
    9972                      .dwattr $C$DW$1035, DW_AT_type(*$C$DW$T$35)
    9973                      .dwattr $C$DW$1035, DW_AT_name("spd_ref")
    9974                      .dwattr $C$DW$1035, DW_AT_TI_symbol_name("_spd_ref")
    9975                      .dwattr $C$DW$1035, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    9976                      .dwattr $C$DW$1035, DW_AT_accessibility(DW_ACCESS_public)
    9977              
    9978              $C$DW$1036      .dwtag  DW_TAG_member
    9979                      .dwattr $C$DW$1036, DW_AT_type(*$C$DW$T$35)
    9980                      .dwattr $C$DW$1036, DW_AT_name("spd_max")
    9981                      .dwattr $C$DW$1036, DW_AT_TI_symbol_name("_spd_max")
    9982                      .dwattr $C$DW$1036, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    9983                      .dwattr $C$DW$1036, DW_AT_accessibility(DW_ACCESS_public)
    9984              
    9985              $C$DW$1037      .dwtag  DW_TAG_member
    9986                      .dwattr $C$DW$1037, DW_AT_type(*$C$DW$T$73)
    9987                      .dwattr $C$DW$1037, DW_AT_name("counter_current")
    9988                      .dwattr $C$DW$1037, DW_AT_TI_symbol_name("_counter_current")
    9989                      .dwattr $C$DW$1037, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    9990                      .dwattr $C$DW$1037, DW_AT_accessibility(DW_ACCESS_public)
    9991              
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{0F3B45B3-DA78-405D-822B-4C4264E94F96} PAGE  196

    9992              $C$DW$1038      .dwtag  DW_TAG_member
    9993                      .dwattr $C$DW$1038, DW_AT_type(*$C$DW$T$73)
    9994                      .dwattr $C$DW$1038, DW_AT_name("counter_isr")
    9995                      .dwattr $C$DW$1038, DW_AT_TI_symbol_name("_counter_isr")
    9996                      .dwattr $C$DW$1038, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    9997                      .dwattr $C$DW$1038, DW_AT_accessibility(DW_ACCESS_public)
    9998              
    9999              $C$DW$1039      .dwtag  DW_TAG_member
   10000                      .dwattr $C$DW$1039, DW_AT_type(*$C$DW$T$73)
   10001                      .dwattr $C$DW$1039, DW_AT_name("counter_speed")
   10002                      .dwattr $C$DW$1039, DW_AT_TI_symbol_name("_counter_speed")
   10003                      .dwattr $C$DW$1039, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
   10004                      .dwattr $C$DW$1039, DW_AT_accessibility(DW_ACCESS_public)
   10005              
   10006              $C$DW$1040      .dwtag  DW_TAG_member
   10007                      .dwattr $C$DW$1040, DW_AT_type(*$C$DW$T$73)
   10008                      .dwattr $C$DW$1040, DW_AT_name("counter_traj")
   10009                      .dwattr $C$DW$1040, DW_AT_TI_symbol_name("_counter_traj")
   10010                      .dwattr $C$DW$1040, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
   10011                      .dwattr $C$DW$1040, DW_AT_accessibility(DW_ACCESS_public)
   10012              
   10013              $C$DW$1041      .dwtag  DW_TAG_member
   10014                      .dwattr $C$DW$1041, DW_AT_type(*$C$DW$T$76)
   10015                      .dwattr $C$DW$1041, DW_AT_name("flag_enableCtrl")
   10016                      .dwattr $C$DW$1041, DW_AT_TI_symbol_name("_flag_enableCtrl")
   10017                      .dwattr $C$DW$1041, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
   10018                      .dwattr $C$DW$1041, DW_AT_accessibility(DW_ACCESS_public)
   10019              
   10020              $C$DW$1042      .dwtag  DW_TAG_member
   10021                      .dwattr $C$DW$1042, DW_AT_type(*$C$DW$T$76)
   10022                      .dwattr $C$DW$1042, DW_AT_name("flag_enableDcBusComp")
   10023                      .dwattr $C$DW$1042, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
   10024                      .dwattr $C$DW$1042, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
   10025                      .dwattr $C$DW$1042, DW_AT_accessibility(DW_ACCESS_public)
   10026              
   10027              $C$DW$1043      .dwtag  DW_TAG_member
   10028                      .dwattr $C$DW$1043, DW_AT_type(*$C$DW$T$76)
   10029                      .dwattr $C$DW$1043, DW_AT_name("flag_enablePowerWarp")
   10030                      .dwattr $C$DW$1043, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
   10031                      .dwattr $C$DW$1043, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
   10032                      .dwattr $C$DW$1043, DW_AT_accessibility(DW_ACCESS_public)
   10033              
   10034              $C$DW$1044      .dwtag  DW_TAG_member
   10035                      .dwattr $C$DW$1044, DW_AT_type(*$C$DW$T$76)
   10036                      .dwattr $C$DW$1044, DW_AT_name("flag_enableOffset")
   10037                      .dwattr $C$DW$1044, DW_AT_TI_symbol_name("_flag_enableOffset")
   10038                      .dwattr $C$DW$1044, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
   10039                      .dwattr $C$DW$1044, DW_AT_accessibility(DW_ACCESS_public)
   10040              
   10041              $C$DW$1045      .dwtag  DW_TAG_member
   10042                      .dwattr $C$DW$1045, DW_AT_type(*$C$DW$T$76)
   10043                      .dwattr $C$DW$1045, DW_AT_name("flag_enableSpeedCtrl")
   10044                      .dwattr $C$DW$1045, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
   10045                      .dwattr $C$DW$1045, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
   10046                      .dwattr $C$DW$1045, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{0F3B45B3-DA78-405D-822B-4C4264E94F96} PAGE  197

   10047              
   10048              $C$DW$1046      .dwtag  DW_TAG_member
   10049                      .dwattr $C$DW$1046, DW_AT_type(*$C$DW$T$76)
   10050                      .dwattr $C$DW$1046, DW_AT_name("flag_enableUserMotorParams")
   10051                      .dwattr $C$DW$1046, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
   10052                      .dwattr $C$DW$1046, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
   10053                      .dwattr $C$DW$1046, DW_AT_accessibility(DW_ACCESS_public)
   10054              
   10055              $C$DW$1047      .dwtag  DW_TAG_member
   10056                      .dwattr $C$DW$1047, DW_AT_type(*$C$DW$T$75)
   10057                      .dwattr $C$DW$1047, DW_AT_name("Idq_offset_pu")
   10058                      .dwattr $C$DW$1047, DW_AT_TI_symbol_name("_Idq_offset_pu")
   10059                      .dwattr $C$DW$1047, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
   10060                      .dwattr $C$DW$1047, DW_AT_accessibility(DW_ACCESS_public)
   10061              
   10062              $C$DW$1048      .dwtag  DW_TAG_member
   10063                      .dwattr $C$DW$1048, DW_AT_type(*$C$DW$T$75)
   10064                      .dwattr $C$DW$1048, DW_AT_name("Vdq_offset_pu")
   10065                      .dwattr $C$DW$1048, DW_AT_TI_symbol_name("_Vdq_offset_pu")
   10066                      .dwattr $C$DW$1048, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
   10067                      .dwattr $C$DW$1048, DW_AT_accessibility(DW_ACCESS_public)
   10068              
   10069              $C$DW$1049      .dwtag  DW_TAG_member
   10070                      .dwattr $C$DW$1049, DW_AT_type(*$C$DW$T$35)
   10071                      .dwattr $C$DW$1049, DW_AT_name("angle_pu")
   10072                      .dwattr $C$DW$1049, DW_AT_TI_symbol_name("_angle_pu")
   10073                      .dwattr $C$DW$1049, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
   10074                      .dwattr $C$DW$1049, DW_AT_accessibility(DW_ACCESS_public)
   10075              
   10076              $C$DW$1050      .dwtag  DW_TAG_member
   10077                      .dwattr $C$DW$1050, DW_AT_type(*$C$DW$T$35)
   10078                      .dwattr $C$DW$1050, DW_AT_name("speed_ref_pu")
   10079                      .dwattr $C$DW$1050, DW_AT_TI_symbol_name("_speed_ref_pu")
   10080                      .dwattr $C$DW$1050, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
   10081                      .dwattr $C$DW$1050, DW_AT_accessibility(DW_ACCESS_public)
   10082              
   10083              $C$DW$1051      .dwtag  DW_TAG_member
   10084                      .dwattr $C$DW$1051, DW_AT_type(*$C$DW$T$35)
   10085                      .dwattr $C$DW$1051, DW_AT_name("speed_fb_pu")
   10086                      .dwattr $C$DW$1051, DW_AT_TI_symbol_name("_speed_fb_pu")
   10087                      .dwattr $C$DW$1051, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
   10088                      .dwattr $C$DW$1051, DW_AT_accessibility(DW_ACCESS_public)
   10089              
   10090              $C$DW$1052      .dwtag  DW_TAG_member
   10091                      .dwattr $C$DW$1052, DW_AT_type(*$C$DW$T$35)
   10092                      .dwattr $C$DW$1052, DW_AT_name("speed_outMax_pu")
   10093                      .dwattr $C$DW$1052, DW_AT_TI_symbol_name("_speed_outMax_pu")
   10094                      .dwattr $C$DW$1052, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
   10095                      .dwattr $C$DW$1052, DW_AT_accessibility(DW_ACCESS_public)
   10096              
   10097              $C$DW$1053      .dwtag  DW_TAG_member
   10098                      .dwattr $C$DW$1053, DW_AT_type(*$C$DW$T$76)
   10099                      .dwattr $C$DW$1053, DW_AT_name("flag_enableCurrentCtrl")
   10100                      .dwattr $C$DW$1053, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
   10101                      .dwattr $C$DW$1053, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{0F3B45B3-DA78-405D-822B-4C4264E94F96} PAGE  198

   10102                      .dwattr $C$DW$1053, DW_AT_accessibility(DW_ACCESS_public)
   10103              
   10104              $C$DW$1054      .dwtag  DW_TAG_member
   10105                      .dwattr $C$DW$1054, DW_AT_type(*$C$DW$T$35)
   10106                      .dwattr $C$DW$1054, DW_AT_name("torque_head_comm")
   10107                      .dwattr $C$DW$1054, DW_AT_TI_symbol_name("_torque_head_comm")
   10108                      .dwattr $C$DW$1054, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
   10109                      .dwattr $C$DW$1054, DW_AT_accessibility(DW_ACCESS_public)
   10110              
   10111                      .dwendtag $C$DW$T$77
   10112              
   10113              $C$DW$T$251     .dwtag  DW_TAG_typedef
   10114                      .dwattr $C$DW$T$251, DW_AT_name("CTRL_Obj")
   10115                      .dwattr $C$DW$T$251, DW_AT_type(*$C$DW$T$77)
   10116                      .dwattr $C$DW$T$251, DW_AT_language(DW_LANG_C)
   10117              
   10118              $C$DW$T$252     .dwtag  DW_TAG_pointer_type
   10119                      .dwattr $C$DW$T$252, DW_AT_type(*$C$DW$T$251)
   10120                      .dwattr $C$DW$T$252, DW_AT_address_class(0x20)
   10121              
   10122              $C$DW$T$206     .dwtag  DW_TAG_pointer_type
   10123                      .dwattr $C$DW$T$206, DW_AT_type(*$C$DW$T$77)
   10124                      .dwattr $C$DW$T$206, DW_AT_address_class(0x20)
   10125              
   10126              $C$DW$T$207     .dwtag  DW_TAG_typedef
   10127                      .dwattr $C$DW$T$207, DW_AT_name("CTRL_Handle")
   10128                      .dwattr $C$DW$T$207, DW_AT_type(*$C$DW$T$206)
   10129                      .dwattr $C$DW$T$207, DW_AT_language(DW_LANG_C)
   10130              
   10131              $C$DW$1055      .dwtag  DW_TAG_TI_far_type
   10132                      .dwattr $C$DW$1055, DW_AT_type(*$C$DW$T$207)
   10133              
   10134              $C$DW$T$253     .dwtag  DW_TAG_const_type
   10135                      .dwattr $C$DW$T$253, DW_AT_type(*$C$DW$1055)
   10136              
   10137              
   10138              $C$DW$T$80      .dwtag  DW_TAG_structure_type
   10139                      .dwattr $C$DW$T$80, DW_AT_name("_CTRL_Version_")
   10140                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x04)
   10141              $C$DW$1056      .dwtag  DW_TAG_member
   10142                      .dwattr $C$DW$1056, DW_AT_type(*$C$DW$T$26)
   10143                      .dwattr $C$DW$1056, DW_AT_name("rsvd")
   10144                      .dwattr $C$DW$1056, DW_AT_TI_symbol_name("_rsvd")
   10145                      .dwattr $C$DW$1056, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10146                      .dwattr $C$DW$1056, DW_AT_accessibility(DW_ACCESS_public)
   10147              
   10148              $C$DW$1057      .dwtag  DW_TAG_member
   10149                      .dwattr $C$DW$1057, DW_AT_type(*$C$DW$T$79)
   10150                      .dwattr $C$DW$1057, DW_AT_name("targetProc")
   10151                      .dwattr $C$DW$1057, DW_AT_TI_symbol_name("_targetProc")
   10152                      .dwattr $C$DW$1057, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10153                      .dwattr $C$DW$1057, DW_AT_accessibility(DW_ACCESS_public)
   10154              
   10155              $C$DW$1058      .dwtag  DW_TAG_member
   10156                      .dwattr $C$DW$1058, DW_AT_type(*$C$DW$T$26)
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{0F3B45B3-DA78-405D-822B-4C4264E94F96} PAGE  199

   10157                      .dwattr $C$DW$1058, DW_AT_name("major")
   10158                      .dwattr $C$DW$1058, DW_AT_TI_symbol_name("_major")
   10159                      .dwattr $C$DW$1058, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10160                      .dwattr $C$DW$1058, DW_AT_accessibility(DW_ACCESS_public)
   10161              
   10162              $C$DW$1059      .dwtag  DW_TAG_member
   10163                      .dwattr $C$DW$1059, DW_AT_type(*$C$DW$T$26)
   10164                      .dwattr $C$DW$1059, DW_AT_name("minor")
   10165                      .dwattr $C$DW$1059, DW_AT_TI_symbol_name("_minor")
   10166                      .dwattr $C$DW$1059, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10167                      .dwattr $C$DW$1059, DW_AT_accessibility(DW_ACCESS_public)
   10168              
   10169                      .dwendtag $C$DW$T$80
   10170              
   10171              $C$DW$T$42      .dwtag  DW_TAG_typedef
   10172                      .dwattr $C$DW$T$42, DW_AT_name("CTRL_Version")
   10173                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$80)
   10174                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
   10175              
   10176              $C$DW$T$259     .dwtag  DW_TAG_pointer_type
   10177                      .dwattr $C$DW$T$259, DW_AT_type(*$C$DW$T$42)
   10178                      .dwattr $C$DW$T$259, DW_AT_address_class(0x20)
   10179              
   10180              
   10181              $C$DW$T$87      .dwtag  DW_TAG_structure_type
   10182                      .dwattr $C$DW$T$87, DW_AT_name("_DRV8301_Obj_")
   10183                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x08)
   10184              $C$DW$1060      .dwtag  DW_TAG_member
   10185                      .dwattr $C$DW$1060, DW_AT_type(*$C$DW$T$82)
   10186                      .dwattr $C$DW$1060, DW_AT_name("spiHandle")
   10187                      .dwattr $C$DW$1060, DW_AT_TI_symbol_name("_spiHandle")
   10188                      .dwattr $C$DW$1060, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10189                      .dwattr $C$DW$1060, DW_AT_accessibility(DW_ACCESS_public)
   10190              
   10191              $C$DW$1061      .dwtag  DW_TAG_member
   10192                      .dwattr $C$DW$1061, DW_AT_type(*$C$DW$T$84)
   10193                      .dwattr $C$DW$1061, DW_AT_name("gpioHandle")
   10194                      .dwattr $C$DW$1061, DW_AT_TI_symbol_name("_gpioHandle")
   10195                      .dwattr $C$DW$1061, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10196                      .dwattr $C$DW$1061, DW_AT_accessibility(DW_ACCESS_public)
   10197              
   10198              $C$DW$1062      .dwtag  DW_TAG_member
   10199                      .dwattr $C$DW$1062, DW_AT_type(*$C$DW$T$86)
   10200                      .dwattr $C$DW$1062, DW_AT_name("gpioNumber")
   10201                      .dwattr $C$DW$1062, DW_AT_TI_symbol_name("_gpioNumber")
   10202                      .dwattr $C$DW$1062, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10203                      .dwattr $C$DW$1062, DW_AT_accessibility(DW_ACCESS_public)
   10204              
   10205              $C$DW$1063      .dwtag  DW_TAG_member
   10206                      .dwattr $C$DW$1063, DW_AT_type(*$C$DW$T$76)
   10207                      .dwattr $C$DW$1063, DW_AT_name("RxTimeOut")
   10208                      .dwattr $C$DW$1063, DW_AT_TI_symbol_name("_RxTimeOut")
   10209                      .dwattr $C$DW$1063, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10210                      .dwattr $C$DW$1063, DW_AT_accessibility(DW_ACCESS_public)
   10211              
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{0F3B45B3-DA78-405D-822B-4C4264E94F96} PAGE  200

   10212              $C$DW$1064      .dwtag  DW_TAG_member
   10213                      .dwattr $C$DW$1064, DW_AT_type(*$C$DW$T$76)
   10214                      .dwattr $C$DW$1064, DW_AT_name("enableTimeOut")
   10215                      .dwattr $C$DW$1064, DW_AT_TI_symbol_name("_enableTimeOut")
   10216                      .dwattr $C$DW$1064, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10217                      .dwattr $C$DW$1064, DW_AT_accessibility(DW_ACCESS_public)
   10218              
   10219                      .dwendtag $C$DW$T$87
   10220              
   10221              $C$DW$T$156     .dwtag  DW_TAG_typedef
   10222                      .dwattr $C$DW$T$156, DW_AT_name("DRV8301_Obj")
   10223                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$87)
   10224                      .dwattr $C$DW$T$156, DW_AT_language(DW_LANG_C)
   10225              
   10226              $C$DW$T$154     .dwtag  DW_TAG_pointer_type
   10227                      .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$87)
   10228                      .dwattr $C$DW$T$154, DW_AT_address_class(0x20)
   10229              
   10230              $C$DW$T$155     .dwtag  DW_TAG_typedef
   10231                      .dwattr $C$DW$T$155, DW_AT_name("DRV8301_Handle")
   10232                      .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$154)
   10233                      .dwattr $C$DW$T$155, DW_AT_language(DW_LANG_C)
   10234              
   10235              
   10236              $C$DW$T$98      .dwtag  DW_TAG_structure_type
   10237                      .dwattr $C$DW$T$98, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
   10238                      .dwattr $C$DW$T$98, DW_AT_byte_size(0x05)
   10239              $C$DW$1065      .dwtag  DW_TAG_member
   10240                      .dwattr $C$DW$1065, DW_AT_type(*$C$DW$T$89)
   10241                      .dwattr $C$DW$1065, DW_AT_name("DRV8301_CURRENT")
   10242                      .dwattr $C$DW$1065, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
   10243                      .dwattr $C$DW$1065, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10244                      .dwattr $C$DW$1065, DW_AT_accessibility(DW_ACCESS_public)
   10245              
   10246              $C$DW$1066      .dwtag  DW_TAG_member
   10247                      .dwattr $C$DW$1066, DW_AT_type(*$C$DW$T$91)
   10248                      .dwattr $C$DW$1066, DW_AT_name("DRV8301_RESET")
   10249                      .dwattr $C$DW$1066, DW_AT_TI_symbol_name("_DRV8301_RESET")
   10250                      .dwattr $C$DW$1066, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10251                      .dwattr $C$DW$1066, DW_AT_accessibility(DW_ACCESS_public)
   10252              
   10253              $C$DW$1067      .dwtag  DW_TAG_member
   10254                      .dwattr $C$DW$1067, DW_AT_type(*$C$DW$T$93)
   10255                      .dwattr $C$DW$1067, DW_AT_name("PWM_MODE")
   10256                      .dwattr $C$DW$1067, DW_AT_TI_symbol_name("_PWM_MODE")
   10257                      .dwattr $C$DW$1067, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10258                      .dwattr $C$DW$1067, DW_AT_accessibility(DW_ACCESS_public)
   10259              
   10260              $C$DW$1068      .dwtag  DW_TAG_member
   10261                      .dwattr $C$DW$1068, DW_AT_type(*$C$DW$T$95)
   10262                      .dwattr $C$DW$1068, DW_AT_name("OC_MODE")
   10263                      .dwattr $C$DW$1068, DW_AT_TI_symbol_name("_OC_MODE")
   10264                      .dwattr $C$DW$1068, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10265                      .dwattr $C$DW$1068, DW_AT_accessibility(DW_ACCESS_public)
   10266              
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{0F3B45B3-DA78-405D-822B-4C4264E94F96} PAGE  201

   10267              $C$DW$1069      .dwtag  DW_TAG_member
   10268                      .dwattr $C$DW$1069, DW_AT_type(*$C$DW$T$97)
   10269                      .dwattr $C$DW$1069, DW_AT_name("OC_ADJ_SET")
   10270                      .dwattr $C$DW$1069, DW_AT_TI_symbol_name("_OC_ADJ_SET")
   10271                      .dwattr $C$DW$1069, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10272                      .dwattr $C$DW$1069, DW_AT_accessibility(DW_ACCESS_public)
   10273              
   10274                      .dwendtag $C$DW$T$98
   10275              
   10276              $C$DW$T$112     .dwtag  DW_TAG_typedef
   10277                      .dwattr $C$DW$T$112, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
   10278                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$98)
   10279                      .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
   10280              
   10281              
   10282              $C$DW$T$107     .dwtag  DW_TAG_structure_type
   10283                      .dwattr $C$DW$T$107, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
   10284                      .dwattr $C$DW$T$107, DW_AT_byte_size(0x04)
   10285              $C$DW$1070      .dwtag  DW_TAG_member
   10286                      .dwattr $C$DW$1070, DW_AT_type(*$C$DW$T$100)
   10287                      .dwattr $C$DW$1070, DW_AT_name("OCTW_SET")
   10288                      .dwattr $C$DW$1070, DW_AT_TI_symbol_name("_OCTW_SET")
   10289                      .dwattr $C$DW$1070, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10290                      .dwattr $C$DW$1070, DW_AT_accessibility(DW_ACCESS_public)
   10291              
   10292              $C$DW$1071      .dwtag  DW_TAG_member
   10293                      .dwattr $C$DW$1071, DW_AT_type(*$C$DW$T$102)
   10294                      .dwattr $C$DW$1071, DW_AT_name("GAIN")
   10295                      .dwattr $C$DW$1071, DW_AT_TI_symbol_name("_GAIN")
   10296                      .dwattr $C$DW$1071, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10297                      .dwattr $C$DW$1071, DW_AT_accessibility(DW_ACCESS_public)
   10298              
   10299              $C$DW$1072      .dwtag  DW_TAG_member
   10300                      .dwattr $C$DW$1072, DW_AT_type(*$C$DW$T$104)
   10301                      .dwattr $C$DW$1072, DW_AT_name("DC_CAL_CH1p2")
   10302                      .dwattr $C$DW$1072, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
   10303                      .dwattr $C$DW$1072, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10304                      .dwattr $C$DW$1072, DW_AT_accessibility(DW_ACCESS_public)
   10305              
   10306              $C$DW$1073      .dwtag  DW_TAG_member
   10307                      .dwattr $C$DW$1073, DW_AT_type(*$C$DW$T$106)
   10308                      .dwattr $C$DW$1073, DW_AT_name("OC_TOFF")
   10309                      .dwattr $C$DW$1073, DW_AT_TI_symbol_name("_OC_TOFF")
   10310                      .dwattr $C$DW$1073, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10311                      .dwattr $C$DW$1073, DW_AT_accessibility(DW_ACCESS_public)
   10312              
   10313                      .dwendtag $C$DW$T$107
   10314              
   10315              $C$DW$T$113     .dwtag  DW_TAG_typedef
   10316                      .dwattr $C$DW$T$113, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
   10317                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$107)
   10318                      .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
   10319              
   10320              
   10321              $C$DW$T$108     .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{0F3B45B3-DA78-405D-822B-4C4264E94F96} PAGE  202

   10322                      .dwattr $C$DW$T$108, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
   10323                      .dwattr $C$DW$T$108, DW_AT_byte_size(0x0b)
   10324              $C$DW$1074      .dwtag  DW_TAG_member
   10325                      .dwattr $C$DW$1074, DW_AT_type(*$C$DW$T$76)
   10326                      .dwattr $C$DW$1074, DW_AT_name("FAULT")
   10327                      .dwattr $C$DW$1074, DW_AT_TI_symbol_name("_FAULT")
   10328                      .dwattr $C$DW$1074, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10329                      .dwattr $C$DW$1074, DW_AT_accessibility(DW_ACCESS_public)
   10330              
   10331              $C$DW$1075      .dwtag  DW_TAG_member
   10332                      .dwattr $C$DW$1075, DW_AT_type(*$C$DW$T$76)
   10333                      .dwattr $C$DW$1075, DW_AT_name("GVDD_UV")
   10334                      .dwattr $C$DW$1075, DW_AT_TI_symbol_name("_GVDD_UV")
   10335                      .dwattr $C$DW$1075, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10336                      .dwattr $C$DW$1075, DW_AT_accessibility(DW_ACCESS_public)
   10337              
   10338              $C$DW$1076      .dwtag  DW_TAG_member
   10339                      .dwattr $C$DW$1076, DW_AT_type(*$C$DW$T$76)
   10340                      .dwattr $C$DW$1076, DW_AT_name("PVDD_UV")
   10341                      .dwattr $C$DW$1076, DW_AT_TI_symbol_name("_PVDD_UV")
   10342                      .dwattr $C$DW$1076, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10343                      .dwattr $C$DW$1076, DW_AT_accessibility(DW_ACCESS_public)
   10344              
   10345              $C$DW$1077      .dwtag  DW_TAG_member
   10346                      .dwattr $C$DW$1077, DW_AT_type(*$C$DW$T$76)
   10347                      .dwattr $C$DW$1077, DW_AT_name("OTSD")
   10348                      .dwattr $C$DW$1077, DW_AT_TI_symbol_name("_OTSD")
   10349                      .dwattr $C$DW$1077, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10350                      .dwattr $C$DW$1077, DW_AT_accessibility(DW_ACCESS_public)
   10351              
   10352              $C$DW$1078      .dwtag  DW_TAG_member
   10353                      .dwattr $C$DW$1078, DW_AT_type(*$C$DW$T$76)
   10354                      .dwattr $C$DW$1078, DW_AT_name("OTW")
   10355                      .dwattr $C$DW$1078, DW_AT_TI_symbol_name("_OTW")
   10356                      .dwattr $C$DW$1078, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10357                      .dwattr $C$DW$1078, DW_AT_accessibility(DW_ACCESS_public)
   10358              
   10359              $C$DW$1079      .dwtag  DW_TAG_member
   10360                      .dwattr $C$DW$1079, DW_AT_type(*$C$DW$T$76)
   10361                      .dwattr $C$DW$1079, DW_AT_name("FETHA_OC")
   10362                      .dwattr $C$DW$1079, DW_AT_TI_symbol_name("_FETHA_OC")
   10363                      .dwattr $C$DW$1079, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10364                      .dwattr $C$DW$1079, DW_AT_accessibility(DW_ACCESS_public)
   10365              
   10366              $C$DW$1080      .dwtag  DW_TAG_member
   10367                      .dwattr $C$DW$1080, DW_AT_type(*$C$DW$T$76)
   10368                      .dwattr $C$DW$1080, DW_AT_name("FETLA_OC")
   10369                      .dwattr $C$DW$1080, DW_AT_TI_symbol_name("_FETLA_OC")
   10370                      .dwattr $C$DW$1080, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10371                      .dwattr $C$DW$1080, DW_AT_accessibility(DW_ACCESS_public)
   10372              
   10373              $C$DW$1081      .dwtag  DW_TAG_member
   10374                      .dwattr $C$DW$1081, DW_AT_type(*$C$DW$T$76)
   10375                      .dwattr $C$DW$1081, DW_AT_name("FETHB_OC")
   10376                      .dwattr $C$DW$1081, DW_AT_TI_symbol_name("_FETHB_OC")
TMS320C2000 Assembler PC v22.6.0 Mon May  8 16:16:34 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{0F3B45B3-DA78-405D-822B-4C4264E94F96} PAGE  203

   10377                      .dwattr $C$DW$1081, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   10378                      .dwattr $C$DW$1081, DW_AT_accessibility(DW_ACCESS_public)
   10379              
   10380              $C$DW$1082      .dwtag  DW_TAG_member
   10381                      .dwattr $C$DW$1082, DW_AT_type(*$C$DW$T$76)
   10382                      .dwattr $C$DW$1082, DW_AT_name("FETLB_OC")
   10383                      .dwattr $C$DW$1082, DW_AT_TI_symbol_name("_FETLB_OC")
