TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{000C5A9C-8313-4B17-8989-087E1C444685} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.0.LTS *
       3              ;* Date/Time created: Tue Apr 18 11:09:50 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/GIANT/GIANT_TI_instaspin/TI_instaspin_indoor_smart_trainer/motorware
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.0.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\GIANT\GIANT_TI_instaspin\TI_instaspin_indoor_smart_trainer\motor
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    8778              $C$DW$895       .dwtag  DW_TAG_enumerator
    8779                      .dwattr $C$DW$895, DW_AT_name("PIE_GroupNumber_7")
    8780                      .dwattr $C$DW$895, DW_AT_const_value(0x06)
    8781              
    8782              $C$DW$896       .dwtag  DW_TAG_enumerator
    8783                      .dwattr $C$DW$896, DW_AT_name("PIE_GroupNumber_8")
    8784                      .dwattr $C$DW$896, DW_AT_const_value(0x07)
    8785              
    8786              $C$DW$897       .dwtag  DW_TAG_enumerator
    8787                      .dwattr $C$DW$897, DW_AT_name("PIE_GroupNumber_9")
    8788                      .dwattr $C$DW$897, DW_AT_const_value(0x08)
    8789              
    8790              $C$DW$898       .dwtag  DW_TAG_enumerator
    8791                      .dwattr $C$DW$898, DW_AT_name("PIE_GroupNumber_10")
    8792                      .dwattr $C$DW$898, DW_AT_const_value(0x09)
    8793              
    8794              $C$DW$899       .dwtag  DW_TAG_enumerator
    8795                      .dwattr $C$DW$899, DW_AT_name("PIE_GroupNumber_11")
    8796                      .dwattr $C$DW$899, DW_AT_const_value(0x0a)
    8797              
    8798              $C$DW$900       .dwtag  DW_TAG_enumerator
    8799                      .dwattr $C$DW$900, DW_AT_name("PIE_GroupNumber_12")
    8800                      .dwattr $C$DW$900, DW_AT_const_value(0x0b)
    8801              
    8802                      .dwendtag $C$DW$T$221
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{000C5A9C-8313-4B17-8989-087E1C444685} PAGE  174

    8803              
    8804              $C$DW$T$222     .dwtag  DW_TAG_typedef
    8805                      .dwattr $C$DW$T$222, DW_AT_name("PIE_GroupNumber_e")
    8806                      .dwattr $C$DW$T$222, DW_AT_type(*$C$DW$T$221)
    8807                      .dwattr $C$DW$T$222, DW_AT_language(DW_LANG_C)
    8808              
    8809              
    8810              $C$DW$T$224     .dwtag  DW_TAG_enumeration_type
    8811                      .dwattr $C$DW$T$224, DW_AT_byte_size(0x01)
    8812              $C$DW$901       .dwtag  DW_TAG_enumerator
    8813                      .dwattr $C$DW$901, DW_AT_name("CTRL_Type_PID_spd")
    8814                      .dwattr $C$DW$901, DW_AT_const_value(0x00)
    8815              
    8816              $C$DW$902       .dwtag  DW_TAG_enumerator
    8817                      .dwattr $C$DW$902, DW_AT_name("CTRL_Type_PID_Id")
    8818                      .dwattr $C$DW$902, DW_AT_const_value(0x01)
    8819              
    8820              $C$DW$903       .dwtag  DW_TAG_enumerator
    8821                      .dwattr $C$DW$903, DW_AT_name("CTRL_Type_PID_Iq")
    8822                      .dwattr $C$DW$903, DW_AT_const_value(0x02)
    8823              
    8824                      .dwendtag $C$DW$T$224
    8825              
    8826              $C$DW$T$225     .dwtag  DW_TAG_typedef
    8827                      .dwattr $C$DW$T$225, DW_AT_name("CTRL_Type_e")
    8828                      .dwattr $C$DW$T$225, DW_AT_type(*$C$DW$T$224)
    8829                      .dwattr $C$DW$T$225, DW_AT_language(DW_LANG_C)
    8830              
    8831              
    8832              $C$DW$T$227     .dwtag  DW_TAG_enumeration_type
    8833                      .dwattr $C$DW$T$227, DW_AT_byte_size(0x01)
    8834              $C$DW$904       .dwtag  DW_TAG_enumerator
    8835                      .dwattr $C$DW$904, DW_AT_name("HAL_SensorType_Current")
    8836                      .dwattr $C$DW$904, DW_AT_const_value(0x00)
    8837              
    8838              $C$DW$905       .dwtag  DW_TAG_enumerator
    8839                      .dwattr $C$DW$905, DW_AT_name("HAL_SensorType_Voltage")
    8840                      .dwattr $C$DW$905, DW_AT_const_value(0x01)
    8841              
    8842                      .dwendtag $C$DW$T$227
    8843              
    8844              $C$DW$T$228     .dwtag  DW_TAG_typedef
    8845                      .dwattr $C$DW$T$228, DW_AT_name("HAL_SensorType_e")
    8846                      .dwattr $C$DW$T$228, DW_AT_type(*$C$DW$T$227)
    8847                      .dwattr $C$DW$T$228, DW_AT_language(DW_LANG_C)
    8848              
    8849              
    8850              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    8851                      .dwattr $C$DW$T$19, DW_AT_name("IPD_HFI_Obj")
    8852                      .dwattr $C$DW$T$19, DW_AT_declaration
    8853                      .dwendtag $C$DW$T$19
    8854              
    8855              $C$DW$T$230     .dwtag  DW_TAG_pointer_type
    8856                      .dwattr $C$DW$T$230, DW_AT_type(*$C$DW$T$19)
    8857                      .dwattr $C$DW$T$230, DW_AT_address_class(0x20)
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{000C5A9C-8313-4B17-8989-087E1C444685} PAGE  175

    8858              
    8859              $C$DW$T$231     .dwtag  DW_TAG_typedef
    8860                      .dwattr $C$DW$T$231, DW_AT_name("IPD_HFI_Handle")
    8861                      .dwattr $C$DW$T$231, DW_AT_type(*$C$DW$T$230)
    8862                      .dwattr $C$DW$T$231, DW_AT_language(DW_LANG_C)
    8863              
    8864              
    8865              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    8866                      .dwattr $C$DW$T$34, DW_AT_name("_ADC_Obj_")
    8867                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x6650)
    8868              $C$DW$906       .dwtag  DW_TAG_member
    8869                      .dwattr $C$DW$906, DW_AT_type(*$C$DW$T$28)
    8870                      .dwattr $C$DW$906, DW_AT_name("ADCRESULT")
    8871                      .dwattr $C$DW$906, DW_AT_TI_symbol_name("_ADCRESULT")
    8872                      .dwattr $C$DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8873                      .dwattr $C$DW$906, DW_AT_accessibility(DW_ACCESS_public)
    8874              
    8875              $C$DW$907       .dwtag  DW_TAG_member
    8876                      .dwattr $C$DW$907, DW_AT_type(*$C$DW$T$29)
    8877                      .dwattr $C$DW$907, DW_AT_name("resvd_1")
    8878                      .dwattr $C$DW$907, DW_AT_TI_symbol_name("_resvd_1")
    8879                      .dwattr $C$DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8880                      .dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
    8881              
    8882              $C$DW$908       .dwtag  DW_TAG_member
    8883                      .dwattr $C$DW$908, DW_AT_type(*$C$DW$T$27)
    8884                      .dwattr $C$DW$908, DW_AT_name("ADCCTL1")
    8885                      .dwattr $C$DW$908, DW_AT_TI_symbol_name("_ADCCTL1")
    8886                      .dwattr $C$DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    8887                      .dwattr $C$DW$908, DW_AT_accessibility(DW_ACCESS_public)
    8888              
    8889              $C$DW$909       .dwtag  DW_TAG_member
    8890                      .dwattr $C$DW$909, DW_AT_type(*$C$DW$T$27)
    8891                      .dwattr $C$DW$909, DW_AT_name("ADCCTL2")
    8892                      .dwattr $C$DW$909, DW_AT_TI_symbol_name("_ADCCTL2")
    8893                      .dwattr $C$DW$909, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    8894                      .dwattr $C$DW$909, DW_AT_accessibility(DW_ACCESS_public)
    8895              
    8896              $C$DW$910       .dwtag  DW_TAG_member
    8897                      .dwattr $C$DW$910, DW_AT_type(*$C$DW$T$30)
    8898                      .dwattr $C$DW$910, DW_AT_name("rsvd_2")
    8899                      .dwattr $C$DW$910, DW_AT_TI_symbol_name("_rsvd_2")
    8900                      .dwattr $C$DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    8901                      .dwattr $C$DW$910, DW_AT_accessibility(DW_ACCESS_public)
    8902              
    8903              $C$DW$911       .dwtag  DW_TAG_member
    8904                      .dwattr $C$DW$911, DW_AT_type(*$C$DW$T$27)
    8905                      .dwattr $C$DW$911, DW_AT_name("ADCINTFLG")
    8906                      .dwattr $C$DW$911, DW_AT_TI_symbol_name("_ADCINTFLG")
    8907                      .dwattr $C$DW$911, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    8908                      .dwattr $C$DW$911, DW_AT_accessibility(DW_ACCESS_public)
    8909              
    8910              $C$DW$912       .dwtag  DW_TAG_member
    8911                      .dwattr $C$DW$912, DW_AT_type(*$C$DW$T$27)
    8912                      .dwattr $C$DW$912, DW_AT_name("ADCINTFLGCLR")
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{000C5A9C-8313-4B17-8989-087E1C444685} PAGE  176

    8913                      .dwattr $C$DW$912, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    8914                      .dwattr $C$DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    8915                      .dwattr $C$DW$912, DW_AT_accessibility(DW_ACCESS_public)
    8916              
    8917              $C$DW$913       .dwtag  DW_TAG_member
    8918                      .dwattr $C$DW$913, DW_AT_type(*$C$DW$T$27)
    8919                      .dwattr $C$DW$913, DW_AT_name("ADCINTOVF")
    8920                      .dwattr $C$DW$913, DW_AT_TI_symbol_name("_ADCINTOVF")
    8921                      .dwattr $C$DW$913, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    8922                      .dwattr $C$DW$913, DW_AT_accessibility(DW_ACCESS_public)
    8923              
    8924              $C$DW$914       .dwtag  DW_TAG_member
    8925                      .dwattr $C$DW$914, DW_AT_type(*$C$DW$T$27)
    8926                      .dwattr $C$DW$914, DW_AT_name("ADCINTOVFCLR")
    8927                      .dwattr $C$DW$914, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    8928                      .dwattr $C$DW$914, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    8929                      .dwattr $C$DW$914, DW_AT_accessibility(DW_ACCESS_public)
    8930              
    8931              $C$DW$915       .dwtag  DW_TAG_member
    8932                      .dwattr $C$DW$915, DW_AT_type(*$C$DW$T$31)
    8933                      .dwattr $C$DW$915, DW_AT_name("INTSELxNy")
    8934                      .dwattr $C$DW$915, DW_AT_TI_symbol_name("_INTSELxNy")
    8935                      .dwattr $C$DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    8936                      .dwattr $C$DW$915, DW_AT_accessibility(DW_ACCESS_public)
    8937              
    8938              $C$DW$916       .dwtag  DW_TAG_member
    8939                      .dwattr $C$DW$916, DW_AT_type(*$C$DW$T$32)
    8940                      .dwattr $C$DW$916, DW_AT_name("rsvd_3")
    8941                      .dwattr $C$DW$916, DW_AT_TI_symbol_name("_rsvd_3")
    8942                      .dwattr $C$DW$916, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    8943                      .dwattr $C$DW$916, DW_AT_accessibility(DW_ACCESS_public)
    8944              
    8945              $C$DW$917       .dwtag  DW_TAG_member
    8946                      .dwattr $C$DW$917, DW_AT_type(*$C$DW$T$27)
    8947                      .dwattr $C$DW$917, DW_AT_name("SOCPRICTRL")
    8948                      .dwattr $C$DW$917, DW_AT_TI_symbol_name("_SOCPRICTRL")
    8949                      .dwattr $C$DW$917, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    8950                      .dwattr $C$DW$917, DW_AT_accessibility(DW_ACCESS_public)
    8951              
    8952              $C$DW$918       .dwtag  DW_TAG_member
    8953                      .dwattr $C$DW$918, DW_AT_type(*$C$DW$T$27)
    8954                      .dwattr $C$DW$918, DW_AT_name("rsvd_4")
    8955                      .dwattr $C$DW$918, DW_AT_TI_symbol_name("_rsvd_4")
    8956                      .dwattr $C$DW$918, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    8957                      .dwattr $C$DW$918, DW_AT_accessibility(DW_ACCESS_public)
    8958              
    8959              $C$DW$919       .dwtag  DW_TAG_member
    8960                      .dwattr $C$DW$919, DW_AT_type(*$C$DW$T$27)
    8961                      .dwattr $C$DW$919, DW_AT_name("ADCSAMPLEMODE")
    8962                      .dwattr $C$DW$919, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    8963                      .dwattr $C$DW$919, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    8964                      .dwattr $C$DW$919, DW_AT_accessibility(DW_ACCESS_public)
    8965              
    8966              $C$DW$920       .dwtag  DW_TAG_member
    8967                      .dwattr $C$DW$920, DW_AT_type(*$C$DW$T$27)
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{000C5A9C-8313-4B17-8989-087E1C444685} PAGE  177

    8968                      .dwattr $C$DW$920, DW_AT_name("rsvd_5")
    8969                      .dwattr $C$DW$920, DW_AT_TI_symbol_name("_rsvd_5")
    8970                      .dwattr $C$DW$920, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    8971                      .dwattr $C$DW$920, DW_AT_accessibility(DW_ACCESS_public)
    8972              
    8973              $C$DW$921       .dwtag  DW_TAG_member
    8974                      .dwattr $C$DW$921, DW_AT_type(*$C$DW$T$27)
    8975                      .dwattr $C$DW$921, DW_AT_name("ADCINTSOCSEL1")
    8976                      .dwattr $C$DW$921, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    8977                      .dwattr $C$DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    8978                      .dwattr $C$DW$921, DW_AT_accessibility(DW_ACCESS_public)
    8979              
    8980              $C$DW$922       .dwtag  DW_TAG_member
    8981                      .dwattr $C$DW$922, DW_AT_type(*$C$DW$T$27)
    8982                      .dwattr $C$DW$922, DW_AT_name("ADCINTSOCSEL2")
    8983                      .dwattr $C$DW$922, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    8984                      .dwattr $C$DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    8985                      .dwattr $C$DW$922, DW_AT_accessibility(DW_ACCESS_public)
    8986              
    8987              $C$DW$923       .dwtag  DW_TAG_member
    8988                      .dwattr $C$DW$923, DW_AT_type(*$C$DW$T$30)
    8989                      .dwattr $C$DW$923, DW_AT_name("rsvd_6")
    8990                      .dwattr $C$DW$923, DW_AT_TI_symbol_name("_rsvd_6")
    8991                      .dwattr $C$DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    8992                      .dwattr $C$DW$923, DW_AT_accessibility(DW_ACCESS_public)
    8993              
    8994              $C$DW$924       .dwtag  DW_TAG_member
    8995                      .dwattr $C$DW$924, DW_AT_type(*$C$DW$T$27)
    8996                      .dwattr $C$DW$924, DW_AT_name("ADCSOCFLG1")
    8997                      .dwattr $C$DW$924, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    8998                      .dwattr $C$DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    8999                      .dwattr $C$DW$924, DW_AT_accessibility(DW_ACCESS_public)
    9000              
    9001              $C$DW$925       .dwtag  DW_TAG_member
    9002                      .dwattr $C$DW$925, DW_AT_type(*$C$DW$T$27)
    9003                      .dwattr $C$DW$925, DW_AT_name("rsvd_7")
    9004                      .dwattr $C$DW$925, DW_AT_TI_symbol_name("_rsvd_7")
    9005                      .dwattr $C$DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    9006                      .dwattr $C$DW$925, DW_AT_accessibility(DW_ACCESS_public)
    9007              
    9008              $C$DW$926       .dwtag  DW_TAG_member
    9009                      .dwattr $C$DW$926, DW_AT_type(*$C$DW$T$27)
    9010                      .dwattr $C$DW$926, DW_AT_name("ADCSOCFRC1")
    9011                      .dwattr $C$DW$926, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    9012                      .dwattr $C$DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    9013                      .dwattr $C$DW$926, DW_AT_accessibility(DW_ACCESS_public)
    9014              
    9015              $C$DW$927       .dwtag  DW_TAG_member
    9016                      .dwattr $C$DW$927, DW_AT_type(*$C$DW$T$27)
    9017                      .dwattr $C$DW$927, DW_AT_name("rsvd_8")
    9018                      .dwattr $C$DW$927, DW_AT_TI_symbol_name("_rsvd_8")
    9019                      .dwattr $C$DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    9020                      .dwattr $C$DW$927, DW_AT_accessibility(DW_ACCESS_public)
    9021              
    9022              $C$DW$928       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{000C5A9C-8313-4B17-8989-087E1C444685} PAGE  178

    9023                      .dwattr $C$DW$928, DW_AT_type(*$C$DW$T$27)
    9024                      .dwattr $C$DW$928, DW_AT_name("ADCSOCOVF1")
    9025                      .dwattr $C$DW$928, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    9026                      .dwattr $C$DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    9027                      .dwattr $C$DW$928, DW_AT_accessibility(DW_ACCESS_public)
    9028              
    9029              $C$DW$929       .dwtag  DW_TAG_member
    9030                      .dwattr $C$DW$929, DW_AT_type(*$C$DW$T$27)
    9031                      .dwattr $C$DW$929, DW_AT_name("rsvd_9")
    9032                      .dwattr $C$DW$929, DW_AT_TI_symbol_name("_rsvd_9")
    9033                      .dwattr $C$DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    9034                      .dwattr $C$DW$929, DW_AT_accessibility(DW_ACCESS_public)
    9035              
    9036              $C$DW$930       .dwtag  DW_TAG_member
    9037                      .dwattr $C$DW$930, DW_AT_type(*$C$DW$T$27)
    9038                      .dwattr $C$DW$930, DW_AT_name("ADCSOCOVFCLR1")
    9039                      .dwattr $C$DW$930, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    9040                      .dwattr $C$DW$930, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    9041                      .dwattr $C$DW$930, DW_AT_accessibility(DW_ACCESS_public)
    9042              
    9043              $C$DW$931       .dwtag  DW_TAG_member
    9044                      .dwattr $C$DW$931, DW_AT_type(*$C$DW$T$27)
    9045                      .dwattr $C$DW$931, DW_AT_name("rsvd_10")
    9046                      .dwattr $C$DW$931, DW_AT_TI_symbol_name("_rsvd_10")
    9047                      .dwattr $C$DW$931, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    9048                      .dwattr $C$DW$931, DW_AT_accessibility(DW_ACCESS_public)
    9049              
    9050              $C$DW$932       .dwtag  DW_TAG_member
    9051                      .dwattr $C$DW$932, DW_AT_type(*$C$DW$T$28)
    9052                      .dwattr $C$DW$932, DW_AT_name("ADCSOCxCTL")
    9053                      .dwattr $C$DW$932, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    9054                      .dwattr $C$DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    9055                      .dwattr $C$DW$932, DW_AT_accessibility(DW_ACCESS_public)
    9056              
    9057              $C$DW$933       .dwtag  DW_TAG_member
    9058                      .dwattr $C$DW$933, DW_AT_type(*$C$DW$T$28)
    9059                      .dwattr $C$DW$933, DW_AT_name("rsvd_11")
    9060                      .dwattr $C$DW$933, DW_AT_TI_symbol_name("_rsvd_11")
    9061                      .dwattr $C$DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    9062                      .dwattr $C$DW$933, DW_AT_accessibility(DW_ACCESS_public)
    9063              
    9064              $C$DW$934       .dwtag  DW_TAG_member
    9065                      .dwattr $C$DW$934, DW_AT_type(*$C$DW$T$27)
    9066                      .dwattr $C$DW$934, DW_AT_name("ADCREFTRIM")
    9067                      .dwattr $C$DW$934, DW_AT_TI_symbol_name("_ADCREFTRIM")
    9068                      .dwattr $C$DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    9069                      .dwattr $C$DW$934, DW_AT_accessibility(DW_ACCESS_public)
    9070              
    9071              $C$DW$935       .dwtag  DW_TAG_member
    9072                      .dwattr $C$DW$935, DW_AT_type(*$C$DW$T$27)
    9073                      .dwattr $C$DW$935, DW_AT_name("ADCOFFTRIM")
    9074                      .dwattr $C$DW$935, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    9075                      .dwattr $C$DW$935, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    9076                      .dwattr $C$DW$935, DW_AT_accessibility(DW_ACCESS_public)
    9077              
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{000C5A9C-8313-4B17-8989-087E1C444685} PAGE  179

    9078              $C$DW$936       .dwtag  DW_TAG_member
    9079                      .dwattr $C$DW$936, DW_AT_type(*$C$DW$T$33)
    9080                      .dwattr $C$DW$936, DW_AT_name("resvd_12")
    9081                      .dwattr $C$DW$936, DW_AT_TI_symbol_name("_resvd_12")
    9082                      .dwattr $C$DW$936, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    9083                      .dwattr $C$DW$936, DW_AT_accessibility(DW_ACCESS_public)
    9084              
    9085              $C$DW$937       .dwtag  DW_TAG_member
    9086                      .dwattr $C$DW$937, DW_AT_type(*$C$DW$T$27)
    9087                      .dwattr $C$DW$937, DW_AT_name("ADCREV")
    9088                      .dwattr $C$DW$937, DW_AT_TI_symbol_name("_ADCREV")
    9089                      .dwattr $C$DW$937, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    9090                      .dwattr $C$DW$937, DW_AT_accessibility(DW_ACCESS_public)
    9091              
    9092                      .dwendtag $C$DW$T$34
    9093              
    9094              $C$DW$T$235     .dwtag  DW_TAG_typedef
    9095                      .dwattr $C$DW$T$235, DW_AT_name("ADC_Obj")
    9096                      .dwattr $C$DW$T$235, DW_AT_type(*$C$DW$T$34)
    9097                      .dwattr $C$DW$T$235, DW_AT_language(DW_LANG_C)
    9098              
    9099              $C$DW$T$124     .dwtag  DW_TAG_pointer_type
    9100                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$34)
    9101                      .dwattr $C$DW$T$124, DW_AT_address_class(0x20)
    9102              
    9103              $C$DW$T$125     .dwtag  DW_TAG_typedef
    9104                      .dwattr $C$DW$T$125, DW_AT_name("ADC_Handle")
    9105                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
    9106                      .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    9107              
    9108              
    9109              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    9110                      .dwattr $C$DW$T$20, DW_AT_name("_AFSEL_Obj_")
    9111                      .dwattr $C$DW$T$20, DW_AT_declaration
    9112                      .dwendtag $C$DW$T$20
    9113              
    9114              $C$DW$T$236     .dwtag  DW_TAG_pointer_type
    9115                      .dwattr $C$DW$T$236, DW_AT_type(*$C$DW$T$20)
    9116                      .dwattr $C$DW$T$236, DW_AT_address_class(0x20)
    9117              
    9118              $C$DW$T$237     .dwtag  DW_TAG_typedef
    9119                      .dwattr $C$DW$T$237, DW_AT_name("AFSEL_Handle")
    9120                      .dwattr $C$DW$T$237, DW_AT_type(*$C$DW$T$236)
    9121                      .dwattr $C$DW$T$237, DW_AT_language(DW_LANG_C)
    9122              
    9123              
    9124              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    9125                      .dwattr $C$DW$T$38, DW_AT_name("_CLARKE_Obj_")
    9126                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x06)
    9127              $C$DW$938       .dwtag  DW_TAG_member
    9128                      .dwattr $C$DW$938, DW_AT_type(*$C$DW$T$35)
    9129                      .dwattr $C$DW$938, DW_AT_name("alpha_sf")
    9130                      .dwattr $C$DW$938, DW_AT_TI_symbol_name("_alpha_sf")
    9131                      .dwattr $C$DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9132                      .dwattr $C$DW$938, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{000C5A9C-8313-4B17-8989-087E1C444685} PAGE  180

    9133              
    9134              $C$DW$939       .dwtag  DW_TAG_member
    9135                      .dwattr $C$DW$939, DW_AT_type(*$C$DW$T$35)
    9136                      .dwattr $C$DW$939, DW_AT_name("beta_sf")
    9137                      .dwattr $C$DW$939, DW_AT_TI_symbol_name("_beta_sf")
    9138                      .dwattr $C$DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9139                      .dwattr $C$DW$939, DW_AT_accessibility(DW_ACCESS_public)
    9140              
    9141              $C$DW$940       .dwtag  DW_TAG_member
    9142                      .dwattr $C$DW$940, DW_AT_type(*$C$DW$T$37)
    9143                      .dwattr $C$DW$940, DW_AT_name("numSensors")
    9144                      .dwattr $C$DW$940, DW_AT_TI_symbol_name("_numSensors")
    9145                      .dwattr $C$DW$940, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9146                      .dwattr $C$DW$940, DW_AT_accessibility(DW_ACCESS_public)
    9147              
    9148                      .dwendtag $C$DW$T$38
    9149              
    9150              $C$DW$T$49      .dwtag  DW_TAG_typedef
    9151                      .dwattr $C$DW$T$49, DW_AT_name("CLARKE_Obj")
    9152                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$38)
    9153                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    9154              
    9155              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    9156                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$38)
    9157                      .dwattr $C$DW$T$47, DW_AT_address_class(0x20)
    9158              
    9159              $C$DW$T$48      .dwtag  DW_TAG_typedef
    9160                      .dwattr $C$DW$T$48, DW_AT_name("CLARKE_Handle")
    9161                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    9162                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    9163              
    9164              $C$DW$941       .dwtag  DW_TAG_TI_far_type
    9165                      .dwattr $C$DW$941, DW_AT_type(*$C$DW$T$48)
    9166              
    9167              $C$DW$T$241     .dwtag  DW_TAG_const_type
    9168                      .dwattr $C$DW$T$241, DW_AT_type(*$C$DW$941)
    9169              
    9170              
    9171              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    9172                      .dwattr $C$DW$T$40, DW_AT_name("_CLK_Obj_")
    9173                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x11)
    9174              $C$DW$942       .dwtag  DW_TAG_member
    9175                      .dwattr $C$DW$942, DW_AT_type(*$C$DW$T$27)
    9176                      .dwattr $C$DW$942, DW_AT_name("XCLK")
    9177                      .dwattr $C$DW$942, DW_AT_TI_symbol_name("_XCLK")
    9178                      .dwattr $C$DW$942, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9179                      .dwattr $C$DW$942, DW_AT_accessibility(DW_ACCESS_public)
    9180              
    9181              $C$DW$943       .dwtag  DW_TAG_member
    9182                      .dwattr $C$DW$943, DW_AT_type(*$C$DW$T$27)
    9183                      .dwattr $C$DW$943, DW_AT_name("rsvd_1")
    9184                      .dwattr $C$DW$943, DW_AT_TI_symbol_name("_rsvd_1")
    9185                      .dwattr $C$DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9186                      .dwattr $C$DW$943, DW_AT_accessibility(DW_ACCESS_public)
    9187              
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{000C5A9C-8313-4B17-8989-087E1C444685} PAGE  181

    9188              $C$DW$944       .dwtag  DW_TAG_member
    9189                      .dwattr $C$DW$944, DW_AT_type(*$C$DW$T$27)
    9190                      .dwattr $C$DW$944, DW_AT_name("CLKCTL")
    9191                      .dwattr $C$DW$944, DW_AT_TI_symbol_name("_CLKCTL")
    9192                      .dwattr $C$DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9193                      .dwattr $C$DW$944, DW_AT_accessibility(DW_ACCESS_public)
    9194              
    9195              $C$DW$945       .dwtag  DW_TAG_member
    9196                      .dwattr $C$DW$945, DW_AT_type(*$C$DW$T$39)
    9197                      .dwattr $C$DW$945, DW_AT_name("rsvd_2")
    9198                      .dwattr $C$DW$945, DW_AT_TI_symbol_name("_rsvd_2")
    9199                      .dwattr $C$DW$945, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9200                      .dwattr $C$DW$945, DW_AT_accessibility(DW_ACCESS_public)
    9201              
    9202              $C$DW$946       .dwtag  DW_TAG_member
    9203                      .dwattr $C$DW$946, DW_AT_type(*$C$DW$T$27)
    9204                      .dwattr $C$DW$946, DW_AT_name("LOSPCP")
    9205                      .dwattr $C$DW$946, DW_AT_TI_symbol_name("_LOSPCP")
    9206                      .dwattr $C$DW$946, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    9207                      .dwattr $C$DW$946, DW_AT_accessibility(DW_ACCESS_public)
    9208              
    9209              $C$DW$947       .dwtag  DW_TAG_member
    9210                      .dwattr $C$DW$947, DW_AT_type(*$C$DW$T$27)
    9211                      .dwattr $C$DW$947, DW_AT_name("PCLKCR0")
    9212                      .dwattr $C$DW$947, DW_AT_TI_symbol_name("_PCLKCR0")
    9213                      .dwattr $C$DW$947, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9214                      .dwattr $C$DW$947, DW_AT_accessibility(DW_ACCESS_public)
    9215              
    9216              $C$DW$948       .dwtag  DW_TAG_member
    9217                      .dwattr $C$DW$948, DW_AT_type(*$C$DW$T$27)
    9218                      .dwattr $C$DW$948, DW_AT_name("PCLKCR1")
    9219                      .dwattr $C$DW$948, DW_AT_TI_symbol_name("_PCLKCR1")
    9220                      .dwattr $C$DW$948, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    9221                      .dwattr $C$DW$948, DW_AT_accessibility(DW_ACCESS_public)
    9222              
    9223              $C$DW$949       .dwtag  DW_TAG_member
    9224                      .dwattr $C$DW$949, DW_AT_type(*$C$DW$T$30)
    9225                      .dwattr $C$DW$949, DW_AT_name("rsvd_3")
    9226                      .dwattr $C$DW$949, DW_AT_TI_symbol_name("_rsvd_3")
    9227                      .dwattr $C$DW$949, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9228                      .dwattr $C$DW$949, DW_AT_accessibility(DW_ACCESS_public)
    9229              
    9230              $C$DW$950       .dwtag  DW_TAG_member
    9231                      .dwattr $C$DW$950, DW_AT_type(*$C$DW$T$27)
    9232                      .dwattr $C$DW$950, DW_AT_name("PCLKCR3")
    9233                      .dwattr $C$DW$950, DW_AT_TI_symbol_name("_PCLKCR3")
    9234                      .dwattr $C$DW$950, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9235                      .dwattr $C$DW$950, DW_AT_accessibility(DW_ACCESS_public)
    9236              
    9237                      .dwendtag $C$DW$T$40
    9238              
    9239              $C$DW$T$126     .dwtag  DW_TAG_pointer_type
    9240                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$40)
    9241                      .dwattr $C$DW$T$126, DW_AT_address_class(0x20)
    9242              
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{000C5A9C-8313-4B17-8989-087E1C444685} PAGE  182

    9243              $C$DW$T$127     .dwtag  DW_TAG_typedef
    9244                      .dwattr $C$DW$T$127, DW_AT_name("CLK_Handle")
    9245                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
    9246                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    9247              
    9248              
    9249              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    9250                      .dwattr $C$DW$T$41, DW_AT_name("_CPU_Obj_")
    9251                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    9252              $C$DW$951       .dwtag  DW_TAG_member
    9253                      .dwattr $C$DW$951, DW_AT_type(*$C$DW$T$37)
    9254                      .dwattr $C$DW$951, DW_AT_name("tmp")
    9255                      .dwattr $C$DW$951, DW_AT_TI_symbol_name("_tmp")
    9256                      .dwattr $C$DW$951, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9257                      .dwattr $C$DW$951, DW_AT_accessibility(DW_ACCESS_public)
    9258              
    9259                      .dwendtag $C$DW$T$41
    9260              
    9261              $C$DW$T$128     .dwtag  DW_TAG_pointer_type
    9262                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$41)
    9263                      .dwattr $C$DW$T$128, DW_AT_address_class(0x20)
    9264              
    9265              $C$DW$T$129     .dwtag  DW_TAG_typedef
    9266                      .dwattr $C$DW$T$129, DW_AT_name("CPU_Handle")
    9267                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$128)
    9268                      .dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
    9269              
    9270              
    9271              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    9272                      .dwattr $C$DW$T$77, DW_AT_name("_CTRL_Obj_")
    9273                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x10a)
    9274              $C$DW$952       .dwtag  DW_TAG_member
    9275                      .dwattr $C$DW$952, DW_AT_type(*$C$DW$T$42)
    9276                      .dwattr $C$DW$952, DW_AT_name("version")
    9277                      .dwattr $C$DW$952, DW_AT_TI_symbol_name("_version")
    9278                      .dwattr $C$DW$952, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9279                      .dwattr $C$DW$952, DW_AT_accessibility(DW_ACCESS_public)
    9280              
    9281              $C$DW$953       .dwtag  DW_TAG_member
    9282                      .dwattr $C$DW$953, DW_AT_type(*$C$DW$T$44)
    9283                      .dwattr $C$DW$953, DW_AT_name("state")
    9284                      .dwattr $C$DW$953, DW_AT_TI_symbol_name("_state")
    9285                      .dwattr $C$DW$953, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9286                      .dwattr $C$DW$953, DW_AT_accessibility(DW_ACCESS_public)
    9287              
    9288              $C$DW$954       .dwtag  DW_TAG_member
    9289                      .dwattr $C$DW$954, DW_AT_type(*$C$DW$T$44)
    9290                      .dwattr $C$DW$954, DW_AT_name("prevState")
    9291                      .dwattr $C$DW$954, DW_AT_TI_symbol_name("_prevState")
    9292                      .dwattr $C$DW$954, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9293                      .dwattr $C$DW$954, DW_AT_accessibility(DW_ACCESS_public)
    9294              
    9295              $C$DW$955       .dwtag  DW_TAG_member
    9296                      .dwattr $C$DW$955, DW_AT_type(*$C$DW$T$46)
    9297                      .dwattr $C$DW$955, DW_AT_name("errorCode")
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{000C5A9C-8313-4B17-8989-087E1C444685} PAGE  183

    9298                      .dwattr $C$DW$955, DW_AT_TI_symbol_name("_errorCode")
    9299                      .dwattr $C$DW$955, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9300                      .dwattr $C$DW$955, DW_AT_accessibility(DW_ACCESS_public)
    9301              
    9302              $C$DW$956       .dwtag  DW_TAG_member
    9303                      .dwattr $C$DW$956, DW_AT_type(*$C$DW$T$48)
    9304                      .dwattr $C$DW$956, DW_AT_name("clarkeHandle_I")
    9305                      .dwattr $C$DW$956, DW_AT_TI_symbol_name("_clarkeHandle_I")
    9306                      .dwattr $C$DW$956, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9307                      .dwattr $C$DW$956, DW_AT_accessibility(DW_ACCESS_public)
    9308              
    9309              $C$DW$957       .dwtag  DW_TAG_member
    9310                      .dwattr $C$DW$957, DW_AT_type(*$C$DW$T$49)
    9311                      .dwattr $C$DW$957, DW_AT_name("clarke_I")
    9312                      .dwattr $C$DW$957, DW_AT_TI_symbol_name("_clarke_I")
    9313                      .dwattr $C$DW$957, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9314                      .dwattr $C$DW$957, DW_AT_accessibility(DW_ACCESS_public)
    9315              
    9316              $C$DW$958       .dwtag  DW_TAG_member
    9317                      .dwattr $C$DW$958, DW_AT_type(*$C$DW$T$48)
    9318                      .dwattr $C$DW$958, DW_AT_name("clarkeHandle_V")
    9319                      .dwattr $C$DW$958, DW_AT_TI_symbol_name("_clarkeHandle_V")
    9320                      .dwattr $C$DW$958, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9321                      .dwattr $C$DW$958, DW_AT_accessibility(DW_ACCESS_public)
    9322              
    9323              $C$DW$959       .dwtag  DW_TAG_member
    9324                      .dwattr $C$DW$959, DW_AT_type(*$C$DW$T$49)
    9325                      .dwattr $C$DW$959, DW_AT_name("clarke_V")
    9326                      .dwattr $C$DW$959, DW_AT_TI_symbol_name("_clarke_V")
    9327                      .dwattr $C$DW$959, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9328                      .dwattr $C$DW$959, DW_AT_accessibility(DW_ACCESS_public)
    9329              
    9330              $C$DW$960       .dwtag  DW_TAG_member
    9331                      .dwattr $C$DW$960, DW_AT_type(*$C$DW$T$51)
    9332                      .dwattr $C$DW$960, DW_AT_name("estHandle")
    9333                      .dwattr $C$DW$960, DW_AT_TI_symbol_name("_estHandle")
    9334                      .dwattr $C$DW$960, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9335                      .dwattr $C$DW$960, DW_AT_accessibility(DW_ACCESS_public)
    9336              
    9337              $C$DW$961       .dwtag  DW_TAG_member
    9338                      .dwattr $C$DW$961, DW_AT_type(*$C$DW$T$53)
    9339                      .dwattr $C$DW$961, DW_AT_name("parkHandle")
    9340                      .dwattr $C$DW$961, DW_AT_TI_symbol_name("_parkHandle")
    9341                      .dwattr $C$DW$961, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9342                      .dwattr $C$DW$961, DW_AT_accessibility(DW_ACCESS_public)
    9343              
    9344              $C$DW$962       .dwtag  DW_TAG_member
    9345                      .dwattr $C$DW$962, DW_AT_type(*$C$DW$T$54)
    9346                      .dwattr $C$DW$962, DW_AT_name("park")
    9347                      .dwattr $C$DW$962, DW_AT_TI_symbol_name("_park")
    9348                      .dwattr $C$DW$962, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9349                      .dwattr $C$DW$962, DW_AT_accessibility(DW_ACCESS_public)
    9350              
    9351              $C$DW$963       .dwtag  DW_TAG_member
    9352                      .dwattr $C$DW$963, DW_AT_type(*$C$DW$T$56)
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{000C5A9C-8313-4B17-8989-087E1C444685} PAGE  184

    9353                      .dwattr $C$DW$963, DW_AT_name("pidHandle_Id")
    9354                      .dwattr $C$DW$963, DW_AT_TI_symbol_name("_pidHandle_Id")
    9355                      .dwattr $C$DW$963, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    9356                      .dwattr $C$DW$963, DW_AT_accessibility(DW_ACCESS_public)
    9357              
    9358              $C$DW$964       .dwtag  DW_TAG_member
    9359                      .dwattr $C$DW$964, DW_AT_type(*$C$DW$T$57)
    9360                      .dwattr $C$DW$964, DW_AT_name("pid_Id")
    9361                      .dwattr $C$DW$964, DW_AT_TI_symbol_name("_pid_Id")
    9362                      .dwattr $C$DW$964, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    9363                      .dwattr $C$DW$964, DW_AT_accessibility(DW_ACCESS_public)
    9364              
    9365              $C$DW$965       .dwtag  DW_TAG_member
    9366                      .dwattr $C$DW$965, DW_AT_type(*$C$DW$T$56)
    9367                      .dwattr $C$DW$965, DW_AT_name("pidHandle_Iq")
    9368                      .dwattr $C$DW$965, DW_AT_TI_symbol_name("_pidHandle_Iq")
    9369                      .dwattr $C$DW$965, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    9370                      .dwattr $C$DW$965, DW_AT_accessibility(DW_ACCESS_public)
    9371              
    9372              $C$DW$966       .dwtag  DW_TAG_member
    9373                      .dwattr $C$DW$966, DW_AT_type(*$C$DW$T$57)
    9374                      .dwattr $C$DW$966, DW_AT_name("pid_Iq")
    9375                      .dwattr $C$DW$966, DW_AT_TI_symbol_name("_pid_Iq")
    9376                      .dwattr $C$DW$966, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    9377                      .dwattr $C$DW$966, DW_AT_accessibility(DW_ACCESS_public)
    9378              
    9379              $C$DW$967       .dwtag  DW_TAG_member
    9380                      .dwattr $C$DW$967, DW_AT_type(*$C$DW$T$56)
    9381                      .dwattr $C$DW$967, DW_AT_name("pidHandle_spd")
    9382                      .dwattr $C$DW$967, DW_AT_TI_symbol_name("_pidHandle_spd")
    9383                      .dwattr $C$DW$967, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    9384                      .dwattr $C$DW$967, DW_AT_accessibility(DW_ACCESS_public)
    9385              
    9386              $C$DW$968       .dwtag  DW_TAG_member
    9387                      .dwattr $C$DW$968, DW_AT_type(*$C$DW$T$57)
    9388                      .dwattr $C$DW$968, DW_AT_name("pid_spd")
    9389                      .dwattr $C$DW$968, DW_AT_TI_symbol_name("_pid_spd")
    9390                      .dwattr $C$DW$968, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    9391                      .dwattr $C$DW$968, DW_AT_accessibility(DW_ACCESS_public)
    9392              
    9393              $C$DW$969       .dwtag  DW_TAG_member
    9394                      .dwattr $C$DW$969, DW_AT_type(*$C$DW$T$59)
    9395                      .dwattr $C$DW$969, DW_AT_name("iparkHandle")
    9396                      .dwattr $C$DW$969, DW_AT_TI_symbol_name("_iparkHandle")
    9397                      .dwattr $C$DW$969, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    9398                      .dwattr $C$DW$969, DW_AT_accessibility(DW_ACCESS_public)
    9399              
    9400              $C$DW$970       .dwtag  DW_TAG_member
    9401                      .dwattr $C$DW$970, DW_AT_type(*$C$DW$T$60)
    9402                      .dwattr $C$DW$970, DW_AT_name("ipark")
    9403                      .dwattr $C$DW$970, DW_AT_TI_symbol_name("_ipark")
    9404                      .dwattr $C$DW$970, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    9405                      .dwattr $C$DW$970, DW_AT_accessibility(DW_ACCESS_public)
    9406              
    9407              $C$DW$971       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{000C5A9C-8313-4B17-8989-087E1C444685} PAGE  185

    9408                      .dwattr $C$DW$971, DW_AT_type(*$C$DW$T$62)
    9409                      .dwattr $C$DW$971, DW_AT_name("svgenHandle")
    9410                      .dwattr $C$DW$971, DW_AT_TI_symbol_name("_svgenHandle")
    9411                      .dwattr $C$DW$971, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    9412                      .dwattr $C$DW$971, DW_AT_accessibility(DW_ACCESS_public)
    9413              
    9414              $C$DW$972       .dwtag  DW_TAG_member
    9415                      .dwattr $C$DW$972, DW_AT_type(*$C$DW$T$63)
    9416                      .dwattr $C$DW$972, DW_AT_name("svgen")
    9417                      .dwattr $C$DW$972, DW_AT_TI_symbol_name("_svgen")
    9418                      .dwattr $C$DW$972, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    9419                      .dwattr $C$DW$972, DW_AT_accessibility(DW_ACCESS_public)
    9420              
    9421              $C$DW$973       .dwtag  DW_TAG_member
    9422                      .dwattr $C$DW$973, DW_AT_type(*$C$DW$T$65)
    9423                      .dwattr $C$DW$973, DW_AT_name("trajHandle_Id")
    9424                      .dwattr $C$DW$973, DW_AT_TI_symbol_name("_trajHandle_Id")
    9425                      .dwattr $C$DW$973, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    9426                      .dwattr $C$DW$973, DW_AT_accessibility(DW_ACCESS_public)
    9427              
    9428              $C$DW$974       .dwtag  DW_TAG_member
    9429                      .dwattr $C$DW$974, DW_AT_type(*$C$DW$T$66)
    9430                      .dwattr $C$DW$974, DW_AT_name("traj_Id")
    9431                      .dwattr $C$DW$974, DW_AT_TI_symbol_name("_traj_Id")
    9432                      .dwattr $C$DW$974, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    9433                      .dwattr $C$DW$974, DW_AT_accessibility(DW_ACCESS_public)
    9434              
    9435              $C$DW$975       .dwtag  DW_TAG_member
    9436                      .dwattr $C$DW$975, DW_AT_type(*$C$DW$T$65)
    9437                      .dwattr $C$DW$975, DW_AT_name("trajHandle_spd")
    9438                      .dwattr $C$DW$975, DW_AT_TI_symbol_name("_trajHandle_spd")
    9439                      .dwattr $C$DW$975, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    9440                      .dwattr $C$DW$975, DW_AT_accessibility(DW_ACCESS_public)
    9441              
    9442              $C$DW$976       .dwtag  DW_TAG_member
    9443                      .dwattr $C$DW$976, DW_AT_type(*$C$DW$T$66)
    9444                      .dwattr $C$DW$976, DW_AT_name("traj_spd")
    9445                      .dwattr $C$DW$976, DW_AT_TI_symbol_name("_traj_spd")
    9446                      .dwattr $C$DW$976, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    9447                      .dwattr $C$DW$976, DW_AT_accessibility(DW_ACCESS_public)
    9448              
    9449              $C$DW$977       .dwtag  DW_TAG_member
    9450                      .dwattr $C$DW$977, DW_AT_type(*$C$DW$T$65)
    9451                      .dwattr $C$DW$977, DW_AT_name("trajHandle_spdMax")
    9452                      .dwattr $C$DW$977, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    9453                      .dwattr $C$DW$977, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    9454                      .dwattr $C$DW$977, DW_AT_accessibility(DW_ACCESS_public)
    9455              
    9456              $C$DW$978       .dwtag  DW_TAG_member
    9457                      .dwattr $C$DW$978, DW_AT_type(*$C$DW$T$66)
    9458                      .dwattr $C$DW$978, DW_AT_name("traj_spdMax")
    9459                      .dwattr $C$DW$978, DW_AT_TI_symbol_name("_traj_spdMax")
    9460                      .dwattr $C$DW$978, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    9461                      .dwattr $C$DW$978, DW_AT_accessibility(DW_ACCESS_public)
    9462              
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{000C5A9C-8313-4B17-8989-087E1C444685} PAGE  186

    9463              $C$DW$979       .dwtag  DW_TAG_member
    9464                      .dwattr $C$DW$979, DW_AT_type(*$C$DW$T$67)
    9465                      .dwattr $C$DW$979, DW_AT_name("motorParams")
    9466                      .dwattr $C$DW$979, DW_AT_TI_symbol_name("_motorParams")
    9467                      .dwattr $C$DW$979, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    9468                      .dwattr $C$DW$979, DW_AT_accessibility(DW_ACCESS_public)
    9469              
    9470              $C$DW$980       .dwtag  DW_TAG_member
    9471                      .dwattr $C$DW$980, DW_AT_type(*$C$DW$T$71)
    9472                      .dwattr $C$DW$980, DW_AT_name("waitTimes")
    9473                      .dwattr $C$DW$980, DW_AT_TI_symbol_name("_waitTimes")
    9474                      .dwattr $C$DW$980, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    9475                      .dwattr $C$DW$980, DW_AT_accessibility(DW_ACCESS_public)
    9476              
    9477              $C$DW$981       .dwtag  DW_TAG_member
    9478                      .dwattr $C$DW$981, DW_AT_type(*$C$DW$T$70)
    9479                      .dwattr $C$DW$981, DW_AT_name("counter_state")
    9480                      .dwattr $C$DW$981, DW_AT_TI_symbol_name("_counter_state")
    9481                      .dwattr $C$DW$981, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    9482                      .dwattr $C$DW$981, DW_AT_accessibility(DW_ACCESS_public)
    9483              
    9484              $C$DW$982       .dwtag  DW_TAG_member
    9485                      .dwattr $C$DW$982, DW_AT_type(*$C$DW$T$73)
    9486                      .dwattr $C$DW$982, DW_AT_name("numIsrTicksPerCtrlTick")
    9487                      .dwattr $C$DW$982, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    9488                      .dwattr $C$DW$982, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    9489                      .dwattr $C$DW$982, DW_AT_accessibility(DW_ACCESS_public)
    9490              
    9491              $C$DW$983       .dwtag  DW_TAG_member
    9492                      .dwattr $C$DW$983, DW_AT_type(*$C$DW$T$73)
    9493                      .dwattr $C$DW$983, DW_AT_name("numCtrlTicksPerCurrentTick")
    9494                      .dwattr $C$DW$983, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    9495                      .dwattr $C$DW$983, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    9496                      .dwattr $C$DW$983, DW_AT_accessibility(DW_ACCESS_public)
    9497              
    9498              $C$DW$984       .dwtag  DW_TAG_member
    9499                      .dwattr $C$DW$984, DW_AT_type(*$C$DW$T$73)
    9500                      .dwattr $C$DW$984, DW_AT_name("numCtrlTicksPerSpeedTick")
    9501                      .dwattr $C$DW$984, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    9502                      .dwattr $C$DW$984, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    9503                      .dwattr $C$DW$984, DW_AT_accessibility(DW_ACCESS_public)
    9504              
    9505              $C$DW$985       .dwtag  DW_TAG_member
    9506                      .dwattr $C$DW$985, DW_AT_type(*$C$DW$T$73)
    9507                      .dwattr $C$DW$985, DW_AT_name("numCtrlTicksPerTrajTick")
    9508                      .dwattr $C$DW$985, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    9509                      .dwattr $C$DW$985, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    9510                      .dwattr $C$DW$985, DW_AT_accessibility(DW_ACCESS_public)
    9511              
    9512              $C$DW$986       .dwtag  DW_TAG_member
    9513                      .dwattr $C$DW$986, DW_AT_type(*$C$DW$T$70)
    9514                      .dwattr $C$DW$986, DW_AT_name("ctrlFreq_Hz")
    9515                      .dwattr $C$DW$986, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    9516                      .dwattr $C$DW$986, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    9517                      .dwattr $C$DW$986, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{000C5A9C-8313-4B17-8989-087E1C444685} PAGE  187

    9518              
    9519              $C$DW$987       .dwtag  DW_TAG_member
    9520                      .dwattr $C$DW$987, DW_AT_type(*$C$DW$T$70)
    9521                      .dwattr $C$DW$987, DW_AT_name("trajFreq_Hz")
    9522                      .dwattr $C$DW$987, DW_AT_TI_symbol_name("_trajFreq_Hz")
    9523                      .dwattr $C$DW$987, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    9524                      .dwattr $C$DW$987, DW_AT_accessibility(DW_ACCESS_public)
    9525              
    9526              $C$DW$988       .dwtag  DW_TAG_member
    9527                      .dwattr $C$DW$988, DW_AT_type(*$C$DW$T$35)
    9528                      .dwattr $C$DW$988, DW_AT_name("trajPeriod_sec")
    9529                      .dwattr $C$DW$988, DW_AT_TI_symbol_name("_trajPeriod_sec")
    9530                      .dwattr $C$DW$988, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    9531                      .dwattr $C$DW$988, DW_AT_accessibility(DW_ACCESS_public)
    9532              
    9533              $C$DW$989       .dwtag  DW_TAG_member
    9534                      .dwattr $C$DW$989, DW_AT_type(*$C$DW$T$74)
    9535                      .dwattr $C$DW$989, DW_AT_name("ctrlPeriod_sec")
    9536                      .dwattr $C$DW$989, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    9537                      .dwattr $C$DW$989, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    9538                      .dwattr $C$DW$989, DW_AT_accessibility(DW_ACCESS_public)
    9539              
    9540              $C$DW$990       .dwtag  DW_TAG_member
    9541                      .dwattr $C$DW$990, DW_AT_type(*$C$DW$T$35)
    9542                      .dwattr $C$DW$990, DW_AT_name("maxVsMag_pu")
    9543                      .dwattr $C$DW$990, DW_AT_TI_symbol_name("_maxVsMag_pu")
    9544                      .dwattr $C$DW$990, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    9545                      .dwattr $C$DW$990, DW_AT_accessibility(DW_ACCESS_public)
    9546              
    9547              $C$DW$991       .dwtag  DW_TAG_member
    9548                      .dwattr $C$DW$991, DW_AT_type(*$C$DW$T$75)
    9549                      .dwattr $C$DW$991, DW_AT_name("Iab_in")
    9550                      .dwattr $C$DW$991, DW_AT_TI_symbol_name("_Iab_in")
    9551                      .dwattr $C$DW$991, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    9552                      .dwattr $C$DW$991, DW_AT_accessibility(DW_ACCESS_public)
    9553              
    9554              $C$DW$992       .dwtag  DW_TAG_member
    9555                      .dwattr $C$DW$992, DW_AT_type(*$C$DW$T$75)
    9556                      .dwattr $C$DW$992, DW_AT_name("Iab_filt")
    9557                      .dwattr $C$DW$992, DW_AT_TI_symbol_name("_Iab_filt")
    9558                      .dwattr $C$DW$992, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    9559                      .dwattr $C$DW$992, DW_AT_accessibility(DW_ACCESS_public)
    9560              
    9561              $C$DW$993       .dwtag  DW_TAG_member
    9562                      .dwattr $C$DW$993, DW_AT_type(*$C$DW$T$75)
    9563                      .dwattr $C$DW$993, DW_AT_name("Idq_in")
    9564                      .dwattr $C$DW$993, DW_AT_TI_symbol_name("_Idq_in")
    9565                      .dwattr $C$DW$993, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    9566                      .dwattr $C$DW$993, DW_AT_accessibility(DW_ACCESS_public)
    9567              
    9568              $C$DW$994       .dwtag  DW_TAG_member
    9569                      .dwattr $C$DW$994, DW_AT_type(*$C$DW$T$75)
    9570                      .dwattr $C$DW$994, DW_AT_name("Vab_in")
    9571                      .dwattr $C$DW$994, DW_AT_TI_symbol_name("_Vab_in")
    9572                      .dwattr $C$DW$994, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{000C5A9C-8313-4B17-8989-087E1C444685} PAGE  188

    9573                      .dwattr $C$DW$994, DW_AT_accessibility(DW_ACCESS_public)
    9574              
    9575              $C$DW$995       .dwtag  DW_TAG_member
    9576                      .dwattr $C$DW$995, DW_AT_type(*$C$DW$T$35)
    9577                      .dwattr $C$DW$995, DW_AT_name("spd_out")
    9578                      .dwattr $C$DW$995, DW_AT_TI_symbol_name("_spd_out")
    9579                      .dwattr $C$DW$995, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    9580                      .dwattr $C$DW$995, DW_AT_accessibility(DW_ACCESS_public)
    9581              
    9582              $C$DW$996       .dwtag  DW_TAG_member
    9583                      .dwattr $C$DW$996, DW_AT_type(*$C$DW$T$75)
    9584                      .dwattr $C$DW$996, DW_AT_name("Vab_out")
    9585                      .dwattr $C$DW$996, DW_AT_TI_symbol_name("_Vab_out")
    9586                      .dwattr $C$DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    9587                      .dwattr $C$DW$996, DW_AT_accessibility(DW_ACCESS_public)
    9588              
    9589              $C$DW$997       .dwtag  DW_TAG_member
    9590                      .dwattr $C$DW$997, DW_AT_type(*$C$DW$T$75)
    9591                      .dwattr $C$DW$997, DW_AT_name("Vdq_out")
    9592                      .dwattr $C$DW$997, DW_AT_TI_symbol_name("_Vdq_out")
    9593                      .dwattr $C$DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    9594                      .dwattr $C$DW$997, DW_AT_accessibility(DW_ACCESS_public)
    9595              
    9596              $C$DW$998       .dwtag  DW_TAG_member
    9597                      .dwattr $C$DW$998, DW_AT_type(*$C$DW$T$74)
    9598                      .dwattr $C$DW$998, DW_AT_name("Rhf")
    9599                      .dwattr $C$DW$998, DW_AT_TI_symbol_name("_Rhf")
    9600                      .dwattr $C$DW$998, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    9601                      .dwattr $C$DW$998, DW_AT_accessibility(DW_ACCESS_public)
    9602              
    9603              $C$DW$999       .dwtag  DW_TAG_member
    9604                      .dwattr $C$DW$999, DW_AT_type(*$C$DW$T$74)
    9605                      .dwattr $C$DW$999, DW_AT_name("Lhf")
    9606                      .dwattr $C$DW$999, DW_AT_TI_symbol_name("_Lhf")
    9607                      .dwattr $C$DW$999, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    9608                      .dwattr $C$DW$999, DW_AT_accessibility(DW_ACCESS_public)
    9609              
    9610              $C$DW$1000      .dwtag  DW_TAG_member
    9611                      .dwattr $C$DW$1000, DW_AT_type(*$C$DW$T$74)
    9612                      .dwattr $C$DW$1000, DW_AT_name("RoverL")
    9613                      .dwattr $C$DW$1000, DW_AT_TI_symbol_name("_RoverL")
    9614                      .dwattr $C$DW$1000, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    9615                      .dwattr $C$DW$1000, DW_AT_accessibility(DW_ACCESS_public)
    9616              
    9617              $C$DW$1001      .dwtag  DW_TAG_member
    9618                      .dwattr $C$DW$1001, DW_AT_type(*$C$DW$T$35)
    9619                      .dwattr $C$DW$1001, DW_AT_name("Kp_Id")
    9620                      .dwattr $C$DW$1001, DW_AT_TI_symbol_name("_Kp_Id")
    9621                      .dwattr $C$DW$1001, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    9622                      .dwattr $C$DW$1001, DW_AT_accessibility(DW_ACCESS_public)
    9623              
    9624              $C$DW$1002      .dwtag  DW_TAG_member
    9625                      .dwattr $C$DW$1002, DW_AT_type(*$C$DW$T$35)
    9626                      .dwattr $C$DW$1002, DW_AT_name("Kp_Iq")
    9627                      .dwattr $C$DW$1002, DW_AT_TI_symbol_name("_Kp_Iq")
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{000C5A9C-8313-4B17-8989-087E1C444685} PAGE  189

    9628                      .dwattr $C$DW$1002, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    9629                      .dwattr $C$DW$1002, DW_AT_accessibility(DW_ACCESS_public)
    9630              
    9631              $C$DW$1003      .dwtag  DW_TAG_member
    9632                      .dwattr $C$DW$1003, DW_AT_type(*$C$DW$T$35)
    9633                      .dwattr $C$DW$1003, DW_AT_name("Kp_spd")
    9634                      .dwattr $C$DW$1003, DW_AT_TI_symbol_name("_Kp_spd")
    9635                      .dwattr $C$DW$1003, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    9636                      .dwattr $C$DW$1003, DW_AT_accessibility(DW_ACCESS_public)
    9637              
    9638              $C$DW$1004      .dwtag  DW_TAG_member
    9639                      .dwattr $C$DW$1004, DW_AT_type(*$C$DW$T$35)
    9640                      .dwattr $C$DW$1004, DW_AT_name("Ki_Id")
    9641                      .dwattr $C$DW$1004, DW_AT_TI_symbol_name("_Ki_Id")
    9642                      .dwattr $C$DW$1004, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    9643                      .dwattr $C$DW$1004, DW_AT_accessibility(DW_ACCESS_public)
    9644              
    9645              $C$DW$1005      .dwtag  DW_TAG_member
    9646                      .dwattr $C$DW$1005, DW_AT_type(*$C$DW$T$35)
    9647                      .dwattr $C$DW$1005, DW_AT_name("Ki_Iq")
    9648                      .dwattr $C$DW$1005, DW_AT_TI_symbol_name("_Ki_Iq")
    9649                      .dwattr $C$DW$1005, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    9650                      .dwattr $C$DW$1005, DW_AT_accessibility(DW_ACCESS_public)
    9651              
    9652              $C$DW$1006      .dwtag  DW_TAG_member
    9653                      .dwattr $C$DW$1006, DW_AT_type(*$C$DW$T$35)
    9654                      .dwattr $C$DW$1006, DW_AT_name("Ki_spd")
    9655                      .dwattr $C$DW$1006, DW_AT_TI_symbol_name("_Ki_spd")
    9656                      .dwattr $C$DW$1006, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    9657                      .dwattr $C$DW$1006, DW_AT_accessibility(DW_ACCESS_public)
    9658              
    9659              $C$DW$1007      .dwtag  DW_TAG_member
    9660                      .dwattr $C$DW$1007, DW_AT_type(*$C$DW$T$35)
    9661                      .dwattr $C$DW$1007, DW_AT_name("Kd_Id")
    9662                      .dwattr $C$DW$1007, DW_AT_TI_symbol_name("_Kd_Id")
    9663                      .dwattr $C$DW$1007, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    9664                      .dwattr $C$DW$1007, DW_AT_accessibility(DW_ACCESS_public)
    9665              
    9666              $C$DW$1008      .dwtag  DW_TAG_member
    9667                      .dwattr $C$DW$1008, DW_AT_type(*$C$DW$T$35)
    9668                      .dwattr $C$DW$1008, DW_AT_name("Kd_Iq")
    9669                      .dwattr $C$DW$1008, DW_AT_TI_symbol_name("_Kd_Iq")
    9670                      .dwattr $C$DW$1008, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    9671                      .dwattr $C$DW$1008, DW_AT_accessibility(DW_ACCESS_public)
    9672              
    9673              $C$DW$1009      .dwtag  DW_TAG_member
    9674                      .dwattr $C$DW$1009, DW_AT_type(*$C$DW$T$35)
    9675                      .dwattr $C$DW$1009, DW_AT_name("Kd_spd")
    9676                      .dwattr $C$DW$1009, DW_AT_TI_symbol_name("_Kd_spd")
    9677                      .dwattr $C$DW$1009, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    9678                      .dwattr $C$DW$1009, DW_AT_accessibility(DW_ACCESS_public)
    9679              
    9680              $C$DW$1010      .dwtag  DW_TAG_member
    9681                      .dwattr $C$DW$1010, DW_AT_type(*$C$DW$T$35)
    9682                      .dwattr $C$DW$1010, DW_AT_name("Ui_Id")
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{000C5A9C-8313-4B17-8989-087E1C444685} PAGE  190

    9683                      .dwattr $C$DW$1010, DW_AT_TI_symbol_name("_Ui_Id")
    9684                      .dwattr $C$DW$1010, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    9685                      .dwattr $C$DW$1010, DW_AT_accessibility(DW_ACCESS_public)
    9686              
    9687              $C$DW$1011      .dwtag  DW_TAG_member
    9688                      .dwattr $C$DW$1011, DW_AT_type(*$C$DW$T$35)
    9689                      .dwattr $C$DW$1011, DW_AT_name("Ui_Iq")
    9690                      .dwattr $C$DW$1011, DW_AT_TI_symbol_name("_Ui_Iq")
    9691                      .dwattr $C$DW$1011, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    9692                      .dwattr $C$DW$1011, DW_AT_accessibility(DW_ACCESS_public)
    9693              
    9694              $C$DW$1012      .dwtag  DW_TAG_member
    9695                      .dwattr $C$DW$1012, DW_AT_type(*$C$DW$T$35)
    9696                      .dwattr $C$DW$1012, DW_AT_name("Ui_spd")
    9697                      .dwattr $C$DW$1012, DW_AT_TI_symbol_name("_Ui_spd")
    9698                      .dwattr $C$DW$1012, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    9699                      .dwattr $C$DW$1012, DW_AT_accessibility(DW_ACCESS_public)
    9700              
    9701              $C$DW$1013      .dwtag  DW_TAG_member
    9702                      .dwattr $C$DW$1013, DW_AT_type(*$C$DW$T$75)
    9703                      .dwattr $C$DW$1013, DW_AT_name("Idq_ref")
    9704                      .dwattr $C$DW$1013, DW_AT_TI_symbol_name("_Idq_ref")
    9705                      .dwattr $C$DW$1013, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    9706                      .dwattr $C$DW$1013, DW_AT_accessibility(DW_ACCESS_public)
    9707              
    9708              $C$DW$1014      .dwtag  DW_TAG_member
    9709                      .dwattr $C$DW$1014, DW_AT_type(*$C$DW$T$35)
    9710                      .dwattr $C$DW$1014, DW_AT_name("IdRated")
    9711                      .dwattr $C$DW$1014, DW_AT_TI_symbol_name("_IdRated")
    9712                      .dwattr $C$DW$1014, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    9713                      .dwattr $C$DW$1014, DW_AT_accessibility(DW_ACCESS_public)
    9714              
    9715              $C$DW$1015      .dwtag  DW_TAG_member
    9716                      .dwattr $C$DW$1015, DW_AT_type(*$C$DW$T$35)
    9717                      .dwattr $C$DW$1015, DW_AT_name("spd_ref")
    9718                      .dwattr $C$DW$1015, DW_AT_TI_symbol_name("_spd_ref")
    9719                      .dwattr $C$DW$1015, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    9720                      .dwattr $C$DW$1015, DW_AT_accessibility(DW_ACCESS_public)
    9721              
    9722              $C$DW$1016      .dwtag  DW_TAG_member
    9723                      .dwattr $C$DW$1016, DW_AT_type(*$C$DW$T$35)
    9724                      .dwattr $C$DW$1016, DW_AT_name("spd_max")
    9725                      .dwattr $C$DW$1016, DW_AT_TI_symbol_name("_spd_max")
    9726                      .dwattr $C$DW$1016, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    9727                      .dwattr $C$DW$1016, DW_AT_accessibility(DW_ACCESS_public)
    9728              
    9729              $C$DW$1017      .dwtag  DW_TAG_member
    9730                      .dwattr $C$DW$1017, DW_AT_type(*$C$DW$T$73)
    9731                      .dwattr $C$DW$1017, DW_AT_name("counter_current")
    9732                      .dwattr $C$DW$1017, DW_AT_TI_symbol_name("_counter_current")
    9733                      .dwattr $C$DW$1017, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    9734                      .dwattr $C$DW$1017, DW_AT_accessibility(DW_ACCESS_public)
    9735              
    9736              $C$DW$1018      .dwtag  DW_TAG_member
    9737                      .dwattr $C$DW$1018, DW_AT_type(*$C$DW$T$73)
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{000C5A9C-8313-4B17-8989-087E1C444685} PAGE  191

    9738                      .dwattr $C$DW$1018, DW_AT_name("counter_isr")
    9739                      .dwattr $C$DW$1018, DW_AT_TI_symbol_name("_counter_isr")
    9740                      .dwattr $C$DW$1018, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    9741                      .dwattr $C$DW$1018, DW_AT_accessibility(DW_ACCESS_public)
    9742              
    9743              $C$DW$1019      .dwtag  DW_TAG_member
    9744                      .dwattr $C$DW$1019, DW_AT_type(*$C$DW$T$73)
    9745                      .dwattr $C$DW$1019, DW_AT_name("counter_speed")
    9746                      .dwattr $C$DW$1019, DW_AT_TI_symbol_name("_counter_speed")
    9747                      .dwattr $C$DW$1019, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    9748                      .dwattr $C$DW$1019, DW_AT_accessibility(DW_ACCESS_public)
    9749              
    9750              $C$DW$1020      .dwtag  DW_TAG_member
    9751                      .dwattr $C$DW$1020, DW_AT_type(*$C$DW$T$73)
    9752                      .dwattr $C$DW$1020, DW_AT_name("counter_traj")
    9753                      .dwattr $C$DW$1020, DW_AT_TI_symbol_name("_counter_traj")
    9754                      .dwattr $C$DW$1020, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    9755                      .dwattr $C$DW$1020, DW_AT_accessibility(DW_ACCESS_public)
    9756              
    9757              $C$DW$1021      .dwtag  DW_TAG_member
    9758                      .dwattr $C$DW$1021, DW_AT_type(*$C$DW$T$76)
    9759                      .dwattr $C$DW$1021, DW_AT_name("flag_enableCtrl")
    9760                      .dwattr $C$DW$1021, DW_AT_TI_symbol_name("_flag_enableCtrl")
    9761                      .dwattr $C$DW$1021, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    9762                      .dwattr $C$DW$1021, DW_AT_accessibility(DW_ACCESS_public)
    9763              
    9764              $C$DW$1022      .dwtag  DW_TAG_member
    9765                      .dwattr $C$DW$1022, DW_AT_type(*$C$DW$T$76)
    9766                      .dwattr $C$DW$1022, DW_AT_name("flag_enableDcBusComp")
    9767                      .dwattr $C$DW$1022, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    9768                      .dwattr $C$DW$1022, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    9769                      .dwattr $C$DW$1022, DW_AT_accessibility(DW_ACCESS_public)
    9770              
    9771              $C$DW$1023      .dwtag  DW_TAG_member
    9772                      .dwattr $C$DW$1023, DW_AT_type(*$C$DW$T$76)
    9773                      .dwattr $C$DW$1023, DW_AT_name("flag_enablePowerWarp")
    9774                      .dwattr $C$DW$1023, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    9775                      .dwattr $C$DW$1023, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    9776                      .dwattr $C$DW$1023, DW_AT_accessibility(DW_ACCESS_public)
    9777              
    9778              $C$DW$1024      .dwtag  DW_TAG_member
    9779                      .dwattr $C$DW$1024, DW_AT_type(*$C$DW$T$76)
    9780                      .dwattr $C$DW$1024, DW_AT_name("flag_enableOffset")
    9781                      .dwattr $C$DW$1024, DW_AT_TI_symbol_name("_flag_enableOffset")
    9782                      .dwattr $C$DW$1024, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    9783                      .dwattr $C$DW$1024, DW_AT_accessibility(DW_ACCESS_public)
    9784              
    9785              $C$DW$1025      .dwtag  DW_TAG_member
    9786                      .dwattr $C$DW$1025, DW_AT_type(*$C$DW$T$76)
    9787                      .dwattr $C$DW$1025, DW_AT_name("flag_enableSpeedCtrl")
    9788                      .dwattr $C$DW$1025, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    9789                      .dwattr $C$DW$1025, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    9790                      .dwattr $C$DW$1025, DW_AT_accessibility(DW_ACCESS_public)
    9791              
    9792              $C$DW$1026      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{000C5A9C-8313-4B17-8989-087E1C444685} PAGE  192

    9793                      .dwattr $C$DW$1026, DW_AT_type(*$C$DW$T$76)
    9794                      .dwattr $C$DW$1026, DW_AT_name("flag_enableUserMotorParams")
    9795                      .dwattr $C$DW$1026, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    9796                      .dwattr $C$DW$1026, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    9797                      .dwattr $C$DW$1026, DW_AT_accessibility(DW_ACCESS_public)
    9798              
    9799              $C$DW$1027      .dwtag  DW_TAG_member
    9800                      .dwattr $C$DW$1027, DW_AT_type(*$C$DW$T$75)
    9801                      .dwattr $C$DW$1027, DW_AT_name("Idq_offset_pu")
    9802                      .dwattr $C$DW$1027, DW_AT_TI_symbol_name("_Idq_offset_pu")
    9803                      .dwattr $C$DW$1027, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    9804                      .dwattr $C$DW$1027, DW_AT_accessibility(DW_ACCESS_public)
    9805              
    9806              $C$DW$1028      .dwtag  DW_TAG_member
    9807                      .dwattr $C$DW$1028, DW_AT_type(*$C$DW$T$75)
    9808                      .dwattr $C$DW$1028, DW_AT_name("Vdq_offset_pu")
    9809                      .dwattr $C$DW$1028, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    9810                      .dwattr $C$DW$1028, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    9811                      .dwattr $C$DW$1028, DW_AT_accessibility(DW_ACCESS_public)
    9812              
    9813              $C$DW$1029      .dwtag  DW_TAG_member
    9814                      .dwattr $C$DW$1029, DW_AT_type(*$C$DW$T$35)
    9815                      .dwattr $C$DW$1029, DW_AT_name("angle_pu")
    9816                      .dwattr $C$DW$1029, DW_AT_TI_symbol_name("_angle_pu")
    9817                      .dwattr $C$DW$1029, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    9818                      .dwattr $C$DW$1029, DW_AT_accessibility(DW_ACCESS_public)
    9819              
    9820              $C$DW$1030      .dwtag  DW_TAG_member
    9821                      .dwattr $C$DW$1030, DW_AT_type(*$C$DW$T$35)
    9822                      .dwattr $C$DW$1030, DW_AT_name("speed_ref_pu")
    9823                      .dwattr $C$DW$1030, DW_AT_TI_symbol_name("_speed_ref_pu")
    9824                      .dwattr $C$DW$1030, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    9825                      .dwattr $C$DW$1030, DW_AT_accessibility(DW_ACCESS_public)
    9826              
    9827              $C$DW$1031      .dwtag  DW_TAG_member
    9828                      .dwattr $C$DW$1031, DW_AT_type(*$C$DW$T$35)
    9829                      .dwattr $C$DW$1031, DW_AT_name("speed_fb_pu")
    9830                      .dwattr $C$DW$1031, DW_AT_TI_symbol_name("_speed_fb_pu")
    9831                      .dwattr $C$DW$1031, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    9832                      .dwattr $C$DW$1031, DW_AT_accessibility(DW_ACCESS_public)
    9833              
    9834              $C$DW$1032      .dwtag  DW_TAG_member
    9835                      .dwattr $C$DW$1032, DW_AT_type(*$C$DW$T$35)
    9836                      .dwattr $C$DW$1032, DW_AT_name("speed_outMax_pu")
    9837                      .dwattr $C$DW$1032, DW_AT_TI_symbol_name("_speed_outMax_pu")
    9838                      .dwattr $C$DW$1032, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    9839                      .dwattr $C$DW$1032, DW_AT_accessibility(DW_ACCESS_public)
    9840              
    9841              $C$DW$1033      .dwtag  DW_TAG_member
    9842                      .dwattr $C$DW$1033, DW_AT_type(*$C$DW$T$76)
    9843                      .dwattr $C$DW$1033, DW_AT_name("flag_enableCurrentCtrl")
    9844                      .dwattr $C$DW$1033, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    9845                      .dwattr $C$DW$1033, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    9846                      .dwattr $C$DW$1033, DW_AT_accessibility(DW_ACCESS_public)
    9847              
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{000C5A9C-8313-4B17-8989-087E1C444685} PAGE  193

    9848              $C$DW$1034      .dwtag  DW_TAG_member
    9849                      .dwattr $C$DW$1034, DW_AT_type(*$C$DW$T$35)
    9850                      .dwattr $C$DW$1034, DW_AT_name("torque_head_comm")
    9851                      .dwattr $C$DW$1034, DW_AT_TI_symbol_name("_torque_head_comm")
    9852                      .dwattr $C$DW$1034, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    9853                      .dwattr $C$DW$1034, DW_AT_accessibility(DW_ACCESS_public)
    9854              
    9855                      .dwendtag $C$DW$T$77
    9856              
    9857              $C$DW$T$248     .dwtag  DW_TAG_typedef
    9858                      .dwattr $C$DW$T$248, DW_AT_name("CTRL_Obj")
    9859                      .dwattr $C$DW$T$248, DW_AT_type(*$C$DW$T$77)
    9860                      .dwattr $C$DW$T$248, DW_AT_language(DW_LANG_C)
    9861              
    9862              $C$DW$T$249     .dwtag  DW_TAG_pointer_type
    9863                      .dwattr $C$DW$T$249, DW_AT_type(*$C$DW$T$248)
    9864                      .dwattr $C$DW$T$249, DW_AT_address_class(0x20)
    9865              
    9866              $C$DW$T$203     .dwtag  DW_TAG_pointer_type
    9867                      .dwattr $C$DW$T$203, DW_AT_type(*$C$DW$T$77)
    9868                      .dwattr $C$DW$T$203, DW_AT_address_class(0x20)
    9869              
    9870              $C$DW$T$204     .dwtag  DW_TAG_typedef
    9871                      .dwattr $C$DW$T$204, DW_AT_name("CTRL_Handle")
    9872                      .dwattr $C$DW$T$204, DW_AT_type(*$C$DW$T$203)
    9873                      .dwattr $C$DW$T$204, DW_AT_language(DW_LANG_C)
    9874              
    9875              $C$DW$1035      .dwtag  DW_TAG_TI_far_type
    9876                      .dwattr $C$DW$1035, DW_AT_type(*$C$DW$T$204)
    9877              
    9878              $C$DW$T$250     .dwtag  DW_TAG_const_type
    9879                      .dwattr $C$DW$T$250, DW_AT_type(*$C$DW$1035)
    9880              
    9881              
    9882              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    9883                      .dwattr $C$DW$T$80, DW_AT_name("_CTRL_Version_")
    9884                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x04)
    9885              $C$DW$1036      .dwtag  DW_TAG_member
    9886                      .dwattr $C$DW$1036, DW_AT_type(*$C$DW$T$26)
    9887                      .dwattr $C$DW$1036, DW_AT_name("rsvd")
    9888                      .dwattr $C$DW$1036, DW_AT_TI_symbol_name("_rsvd")
    9889                      .dwattr $C$DW$1036, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9890                      .dwattr $C$DW$1036, DW_AT_accessibility(DW_ACCESS_public)
    9891              
    9892              $C$DW$1037      .dwtag  DW_TAG_member
    9893                      .dwattr $C$DW$1037, DW_AT_type(*$C$DW$T$79)
    9894                      .dwattr $C$DW$1037, DW_AT_name("targetProc")
    9895                      .dwattr $C$DW$1037, DW_AT_TI_symbol_name("_targetProc")
    9896                      .dwattr $C$DW$1037, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9897                      .dwattr $C$DW$1037, DW_AT_accessibility(DW_ACCESS_public)
    9898              
    9899              $C$DW$1038      .dwtag  DW_TAG_member
    9900                      .dwattr $C$DW$1038, DW_AT_type(*$C$DW$T$26)
    9901                      .dwattr $C$DW$1038, DW_AT_name("major")
    9902                      .dwattr $C$DW$1038, DW_AT_TI_symbol_name("_major")
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{000C5A9C-8313-4B17-8989-087E1C444685} PAGE  194

    9903                      .dwattr $C$DW$1038, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9904                      .dwattr $C$DW$1038, DW_AT_accessibility(DW_ACCESS_public)
    9905              
    9906              $C$DW$1039      .dwtag  DW_TAG_member
    9907                      .dwattr $C$DW$1039, DW_AT_type(*$C$DW$T$26)
    9908                      .dwattr $C$DW$1039, DW_AT_name("minor")
    9909                      .dwattr $C$DW$1039, DW_AT_TI_symbol_name("_minor")
    9910                      .dwattr $C$DW$1039, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9911                      .dwattr $C$DW$1039, DW_AT_accessibility(DW_ACCESS_public)
    9912              
    9913                      .dwendtag $C$DW$T$80
    9914              
    9915              $C$DW$T$42      .dwtag  DW_TAG_typedef
    9916                      .dwattr $C$DW$T$42, DW_AT_name("CTRL_Version")
    9917                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$80)
    9918                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    9919              
    9920              $C$DW$T$256     .dwtag  DW_TAG_pointer_type
    9921                      .dwattr $C$DW$T$256, DW_AT_type(*$C$DW$T$42)
    9922                      .dwattr $C$DW$T$256, DW_AT_address_class(0x20)
    9923              
    9924              
    9925              $C$DW$T$87      .dwtag  DW_TAG_structure_type
    9926                      .dwattr $C$DW$T$87, DW_AT_name("_DRV8301_Obj_")
    9927                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x08)
    9928              $C$DW$1040      .dwtag  DW_TAG_member
    9929                      .dwattr $C$DW$1040, DW_AT_type(*$C$DW$T$82)
    9930                      .dwattr $C$DW$1040, DW_AT_name("spiHandle")
    9931                      .dwattr $C$DW$1040, DW_AT_TI_symbol_name("_spiHandle")
    9932                      .dwattr $C$DW$1040, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9933                      .dwattr $C$DW$1040, DW_AT_accessibility(DW_ACCESS_public)
    9934              
    9935              $C$DW$1041      .dwtag  DW_TAG_member
    9936                      .dwattr $C$DW$1041, DW_AT_type(*$C$DW$T$84)
    9937                      .dwattr $C$DW$1041, DW_AT_name("gpioHandle")
    9938                      .dwattr $C$DW$1041, DW_AT_TI_symbol_name("_gpioHandle")
    9939                      .dwattr $C$DW$1041, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9940                      .dwattr $C$DW$1041, DW_AT_accessibility(DW_ACCESS_public)
    9941              
    9942              $C$DW$1042      .dwtag  DW_TAG_member
    9943                      .dwattr $C$DW$1042, DW_AT_type(*$C$DW$T$86)
    9944                      .dwattr $C$DW$1042, DW_AT_name("gpioNumber")
    9945                      .dwattr $C$DW$1042, DW_AT_TI_symbol_name("_gpioNumber")
    9946                      .dwattr $C$DW$1042, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9947                      .dwattr $C$DW$1042, DW_AT_accessibility(DW_ACCESS_public)
    9948              
    9949              $C$DW$1043      .dwtag  DW_TAG_member
    9950                      .dwattr $C$DW$1043, DW_AT_type(*$C$DW$T$76)
    9951                      .dwattr $C$DW$1043, DW_AT_name("RxTimeOut")
    9952                      .dwattr $C$DW$1043, DW_AT_TI_symbol_name("_RxTimeOut")
    9953                      .dwattr $C$DW$1043, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9954                      .dwattr $C$DW$1043, DW_AT_accessibility(DW_ACCESS_public)
    9955              
    9956              $C$DW$1044      .dwtag  DW_TAG_member
    9957                      .dwattr $C$DW$1044, DW_AT_type(*$C$DW$T$76)
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{000C5A9C-8313-4B17-8989-087E1C444685} PAGE  195

    9958                      .dwattr $C$DW$1044, DW_AT_name("enableTimeOut")
    9959                      .dwattr $C$DW$1044, DW_AT_TI_symbol_name("_enableTimeOut")
    9960                      .dwattr $C$DW$1044, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9961                      .dwattr $C$DW$1044, DW_AT_accessibility(DW_ACCESS_public)
    9962              
    9963                      .dwendtag $C$DW$T$87
    9964              
    9965              $C$DW$T$156     .dwtag  DW_TAG_typedef
    9966                      .dwattr $C$DW$T$156, DW_AT_name("DRV8301_Obj")
    9967                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$87)
    9968                      .dwattr $C$DW$T$156, DW_AT_language(DW_LANG_C)
    9969              
    9970              $C$DW$T$154     .dwtag  DW_TAG_pointer_type
    9971                      .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$87)
    9972                      .dwattr $C$DW$T$154, DW_AT_address_class(0x20)
    9973              
    9974              $C$DW$T$155     .dwtag  DW_TAG_typedef
    9975                      .dwattr $C$DW$T$155, DW_AT_name("DRV8301_Handle")
    9976                      .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$154)
    9977                      .dwattr $C$DW$T$155, DW_AT_language(DW_LANG_C)
    9978              
    9979              
    9980              $C$DW$T$98      .dwtag  DW_TAG_structure_type
    9981                      .dwattr $C$DW$T$98, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    9982                      .dwattr $C$DW$T$98, DW_AT_byte_size(0x05)
    9983              $C$DW$1045      .dwtag  DW_TAG_member
    9984                      .dwattr $C$DW$1045, DW_AT_type(*$C$DW$T$89)
    9985                      .dwattr $C$DW$1045, DW_AT_name("DRV8301_CURRENT")
    9986                      .dwattr $C$DW$1045, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    9987                      .dwattr $C$DW$1045, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9988                      .dwattr $C$DW$1045, DW_AT_accessibility(DW_ACCESS_public)
    9989              
    9990              $C$DW$1046      .dwtag  DW_TAG_member
    9991                      .dwattr $C$DW$1046, DW_AT_type(*$C$DW$T$91)
    9992                      .dwattr $C$DW$1046, DW_AT_name("DRV8301_RESET")
    9993                      .dwattr $C$DW$1046, DW_AT_TI_symbol_name("_DRV8301_RESET")
    9994                      .dwattr $C$DW$1046, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9995                      .dwattr $C$DW$1046, DW_AT_accessibility(DW_ACCESS_public)
    9996              
    9997              $C$DW$1047      .dwtag  DW_TAG_member
    9998                      .dwattr $C$DW$1047, DW_AT_type(*$C$DW$T$93)
    9999                      .dwattr $C$DW$1047, DW_AT_name("PWM_MODE")
   10000                      .dwattr $C$DW$1047, DW_AT_TI_symbol_name("_PWM_MODE")
   10001                      .dwattr $C$DW$1047, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10002                      .dwattr $C$DW$1047, DW_AT_accessibility(DW_ACCESS_public)
   10003              
   10004              $C$DW$1048      .dwtag  DW_TAG_member
   10005                      .dwattr $C$DW$1048, DW_AT_type(*$C$DW$T$95)
   10006                      .dwattr $C$DW$1048, DW_AT_name("OC_MODE")
   10007                      .dwattr $C$DW$1048, DW_AT_TI_symbol_name("_OC_MODE")
   10008                      .dwattr $C$DW$1048, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10009                      .dwattr $C$DW$1048, DW_AT_accessibility(DW_ACCESS_public)
   10010              
   10011              $C$DW$1049      .dwtag  DW_TAG_member
   10012                      .dwattr $C$DW$1049, DW_AT_type(*$C$DW$T$97)
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{000C5A9C-8313-4B17-8989-087E1C444685} PAGE  196

   10013                      .dwattr $C$DW$1049, DW_AT_name("OC_ADJ_SET")
   10014                      .dwattr $C$DW$1049, DW_AT_TI_symbol_name("_OC_ADJ_SET")
   10015                      .dwattr $C$DW$1049, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10016                      .dwattr $C$DW$1049, DW_AT_accessibility(DW_ACCESS_public)
   10017              
   10018                      .dwendtag $C$DW$T$98
   10019              
   10020              $C$DW$T$112     .dwtag  DW_TAG_typedef
   10021                      .dwattr $C$DW$T$112, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
   10022                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$98)
   10023                      .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
   10024              
   10025              
   10026              $C$DW$T$107     .dwtag  DW_TAG_structure_type
   10027                      .dwattr $C$DW$T$107, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
   10028                      .dwattr $C$DW$T$107, DW_AT_byte_size(0x04)
   10029              $C$DW$1050      .dwtag  DW_TAG_member
   10030                      .dwattr $C$DW$1050, DW_AT_type(*$C$DW$T$100)
   10031                      .dwattr $C$DW$1050, DW_AT_name("OCTW_SET")
   10032                      .dwattr $C$DW$1050, DW_AT_TI_symbol_name("_OCTW_SET")
   10033                      .dwattr $C$DW$1050, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10034                      .dwattr $C$DW$1050, DW_AT_accessibility(DW_ACCESS_public)
   10035              
   10036              $C$DW$1051      .dwtag  DW_TAG_member
   10037                      .dwattr $C$DW$1051, DW_AT_type(*$C$DW$T$102)
   10038                      .dwattr $C$DW$1051, DW_AT_name("GAIN")
   10039                      .dwattr $C$DW$1051, DW_AT_TI_symbol_name("_GAIN")
   10040                      .dwattr $C$DW$1051, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10041                      .dwattr $C$DW$1051, DW_AT_accessibility(DW_ACCESS_public)
   10042              
   10043              $C$DW$1052      .dwtag  DW_TAG_member
   10044                      .dwattr $C$DW$1052, DW_AT_type(*$C$DW$T$104)
   10045                      .dwattr $C$DW$1052, DW_AT_name("DC_CAL_CH1p2")
   10046                      .dwattr $C$DW$1052, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
   10047                      .dwattr $C$DW$1052, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10048                      .dwattr $C$DW$1052, DW_AT_accessibility(DW_ACCESS_public)
   10049              
   10050              $C$DW$1053      .dwtag  DW_TAG_member
   10051                      .dwattr $C$DW$1053, DW_AT_type(*$C$DW$T$106)
   10052                      .dwattr $C$DW$1053, DW_AT_name("OC_TOFF")
   10053                      .dwattr $C$DW$1053, DW_AT_TI_symbol_name("_OC_TOFF")
   10054                      .dwattr $C$DW$1053, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10055                      .dwattr $C$DW$1053, DW_AT_accessibility(DW_ACCESS_public)
   10056              
   10057                      .dwendtag $C$DW$T$107
   10058              
   10059              $C$DW$T$113     .dwtag  DW_TAG_typedef
   10060                      .dwattr $C$DW$T$113, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
   10061                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$107)
   10062                      .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
   10063              
   10064              
   10065              $C$DW$T$108     .dwtag  DW_TAG_structure_type
   10066                      .dwattr $C$DW$T$108, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
   10067                      .dwattr $C$DW$T$108, DW_AT_byte_size(0x0b)
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{000C5A9C-8313-4B17-8989-087E1C444685} PAGE  197

   10068              $C$DW$1054      .dwtag  DW_TAG_member
   10069                      .dwattr $C$DW$1054, DW_AT_type(*$C$DW$T$76)
   10070                      .dwattr $C$DW$1054, DW_AT_name("FAULT")
   10071                      .dwattr $C$DW$1054, DW_AT_TI_symbol_name("_FAULT")
   10072                      .dwattr $C$DW$1054, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10073                      .dwattr $C$DW$1054, DW_AT_accessibility(DW_ACCESS_public)
   10074              
   10075              $C$DW$1055      .dwtag  DW_TAG_member
   10076                      .dwattr $C$DW$1055, DW_AT_type(*$C$DW$T$76)
   10077                      .dwattr $C$DW$1055, DW_AT_name("GVDD_UV")
   10078                      .dwattr $C$DW$1055, DW_AT_TI_symbol_name("_GVDD_UV")
   10079                      .dwattr $C$DW$1055, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10080                      .dwattr $C$DW$1055, DW_AT_accessibility(DW_ACCESS_public)
   10081              
   10082              $C$DW$1056      .dwtag  DW_TAG_member
   10083                      .dwattr $C$DW$1056, DW_AT_type(*$C$DW$T$76)
   10084                      .dwattr $C$DW$1056, DW_AT_name("PVDD_UV")
   10085                      .dwattr $C$DW$1056, DW_AT_TI_symbol_name("_PVDD_UV")
   10086                      .dwattr $C$DW$1056, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10087                      .dwattr $C$DW$1056, DW_AT_accessibility(DW_ACCESS_public)
   10088              
   10089              $C$DW$1057      .dwtag  DW_TAG_member
   10090                      .dwattr $C$DW$1057, DW_AT_type(*$C$DW$T$76)
   10091                      .dwattr $C$DW$1057, DW_AT_name("OTSD")
   10092                      .dwattr $C$DW$1057, DW_AT_TI_symbol_name("_OTSD")
   10093                      .dwattr $C$DW$1057, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10094                      .dwattr $C$DW$1057, DW_AT_accessibility(DW_ACCESS_public)
   10095              
   10096              $C$DW$1058      .dwtag  DW_TAG_member
   10097                      .dwattr $C$DW$1058, DW_AT_type(*$C$DW$T$76)
   10098                      .dwattr $C$DW$1058, DW_AT_name("OTW")
   10099                      .dwattr $C$DW$1058, DW_AT_TI_symbol_name("_OTW")
   10100                      .dwattr $C$DW$1058, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10101                      .dwattr $C$DW$1058, DW_AT_accessibility(DW_ACCESS_public)
   10102              
   10103              $C$DW$1059      .dwtag  DW_TAG_member
   10104                      .dwattr $C$DW$1059, DW_AT_type(*$C$DW$T$76)
   10105                      .dwattr $C$DW$1059, DW_AT_name("FETHA_OC")
   10106                      .dwattr $C$DW$1059, DW_AT_TI_symbol_name("_FETHA_OC")
   10107                      .dwattr $C$DW$1059, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10108                      .dwattr $C$DW$1059, DW_AT_accessibility(DW_ACCESS_public)
   10109              
   10110              $C$DW$1060      .dwtag  DW_TAG_member
   10111                      .dwattr $C$DW$1060, DW_AT_type(*$C$DW$T$76)
   10112                      .dwattr $C$DW$1060, DW_AT_name("FETLA_OC")
   10113                      .dwattr $C$DW$1060, DW_AT_TI_symbol_name("_FETLA_OC")
   10114                      .dwattr $C$DW$1060, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10115                      .dwattr $C$DW$1060, DW_AT_accessibility(DW_ACCESS_public)
   10116              
   10117              $C$DW$1061      .dwtag  DW_TAG_member
   10118                      .dwattr $C$DW$1061, DW_AT_type(*$C$DW$T$76)
   10119                      .dwattr $C$DW$1061, DW_AT_name("FETHB_OC")
   10120                      .dwattr $C$DW$1061, DW_AT_TI_symbol_name("_FETHB_OC")
   10121                      .dwattr $C$DW$1061, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   10122                      .dwattr $C$DW$1061, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Tue Apr 18 11:09:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{000C5A9C-8313-4B17-8989-087E1C444685} PAGE  198

   10123              
   10124              $C$DW$1062      .dwtag  DW_TAG_member
   10125                      .dwattr $C$DW$1062, DW_AT_type(*$C$DW$T$76)
   10126                      .dwattr $C$DW$1062, DW_AT_name("FETLB_OC")
   10127                      .dwattr $C$DW$1062, DW_AT_TI_symbol_name("_FETLB_OC")
   10128                      .dwattr $C$DW$1062, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10129                      .dwattr $C$DW$1062, DW_AT_accessibility(DW_ACCESS_public)
