TMS320C2000 Assembler PC v22.6.0 Fri Mar 10 12:50:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{01B77DF1-504C-473A-B828-ADD2AFD52A8B} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.0.LTS *
       3              ;* Date/Time created: Fri Mar 10 12:50:04 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/GIANT/TI_instaspin_indoor_smart_trainer/motorware/motorware_1_01_00_
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.0.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\GIANT\TI_instaspin_indoor_smart_trainer\motorware\motorware_1_01
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    8801              $C$DW$896       .dwtag  DW_TAG_enumerator
    8802                      .dwattr $C$DW$896, DW_AT_name("PIE_GroupNumber_7")
    8803                      .dwattr $C$DW$896, DW_AT_const_value(0x06)
    8804              
    8805              $C$DW$897       .dwtag  DW_TAG_enumerator
    8806                      .dwattr $C$DW$897, DW_AT_name("PIE_GroupNumber_8")
    8807                      .dwattr $C$DW$897, DW_AT_const_value(0x07)
    8808              
    8809              $C$DW$898       .dwtag  DW_TAG_enumerator
    8810                      .dwattr $C$DW$898, DW_AT_name("PIE_GroupNumber_9")
    8811                      .dwattr $C$DW$898, DW_AT_const_value(0x08)
    8812              
    8813              $C$DW$899       .dwtag  DW_TAG_enumerator
TMS320C2000 Assembler PC v22.6.0 Fri Mar 10 12:50:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{01B77DF1-504C-473A-B828-ADD2AFD52A8B} PAGE  174

    8814                      .dwattr $C$DW$899, DW_AT_name("PIE_GroupNumber_10")
    8815                      .dwattr $C$DW$899, DW_AT_const_value(0x09)
    8816              
    8817              $C$DW$900       .dwtag  DW_TAG_enumerator
    8818                      .dwattr $C$DW$900, DW_AT_name("PIE_GroupNumber_11")
    8819                      .dwattr $C$DW$900, DW_AT_const_value(0x0a)
    8820              
    8821              $C$DW$901       .dwtag  DW_TAG_enumerator
    8822                      .dwattr $C$DW$901, DW_AT_name("PIE_GroupNumber_12")
    8823                      .dwattr $C$DW$901, DW_AT_const_value(0x0b)
    8824              
    8825                      .dwendtag $C$DW$T$221
    8826              
    8827              $C$DW$T$222     .dwtag  DW_TAG_typedef
    8828                      .dwattr $C$DW$T$222, DW_AT_name("PIE_GroupNumber_e")
    8829                      .dwattr $C$DW$T$222, DW_AT_type(*$C$DW$T$221)
    8830                      .dwattr $C$DW$T$222, DW_AT_language(DW_LANG_C)
    8831              
    8832              
    8833              $C$DW$T$224     .dwtag  DW_TAG_enumeration_type
    8834                      .dwattr $C$DW$T$224, DW_AT_byte_size(0x01)
    8835              $C$DW$902       .dwtag  DW_TAG_enumerator
    8836                      .dwattr $C$DW$902, DW_AT_name("CTRL_Type_PID_spd")
    8837                      .dwattr $C$DW$902, DW_AT_const_value(0x00)
    8838              
    8839              $C$DW$903       .dwtag  DW_TAG_enumerator
    8840                      .dwattr $C$DW$903, DW_AT_name("CTRL_Type_PID_Id")
    8841                      .dwattr $C$DW$903, DW_AT_const_value(0x01)
    8842              
    8843              $C$DW$904       .dwtag  DW_TAG_enumerator
    8844                      .dwattr $C$DW$904, DW_AT_name("CTRL_Type_PID_Iq")
    8845                      .dwattr $C$DW$904, DW_AT_const_value(0x02)
    8846              
    8847                      .dwendtag $C$DW$T$224
    8848              
    8849              $C$DW$T$225     .dwtag  DW_TAG_typedef
    8850                      .dwattr $C$DW$T$225, DW_AT_name("CTRL_Type_e")
    8851                      .dwattr $C$DW$T$225, DW_AT_type(*$C$DW$T$224)
    8852                      .dwattr $C$DW$T$225, DW_AT_language(DW_LANG_C)
    8853              
    8854              
    8855              $C$DW$T$227     .dwtag  DW_TAG_enumeration_type
    8856                      .dwattr $C$DW$T$227, DW_AT_byte_size(0x01)
    8857              $C$DW$905       .dwtag  DW_TAG_enumerator
    8858                      .dwattr $C$DW$905, DW_AT_name("HAL_SensorType_Current")
    8859                      .dwattr $C$DW$905, DW_AT_const_value(0x00)
    8860              
    8861              $C$DW$906       .dwtag  DW_TAG_enumerator
    8862                      .dwattr $C$DW$906, DW_AT_name("HAL_SensorType_Voltage")
    8863                      .dwattr $C$DW$906, DW_AT_const_value(0x01)
    8864              
    8865                      .dwendtag $C$DW$T$227
    8866              
    8867              $C$DW$T$228     .dwtag  DW_TAG_typedef
    8868                      .dwattr $C$DW$T$228, DW_AT_name("HAL_SensorType_e")
TMS320C2000 Assembler PC v22.6.0 Fri Mar 10 12:50:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{01B77DF1-504C-473A-B828-ADD2AFD52A8B} PAGE  175

    8869                      .dwattr $C$DW$T$228, DW_AT_type(*$C$DW$T$227)
    8870                      .dwattr $C$DW$T$228, DW_AT_language(DW_LANG_C)
    8871              
    8872              
    8873              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    8874                      .dwattr $C$DW$T$19, DW_AT_name("IPD_HFI_Obj")
    8875                      .dwattr $C$DW$T$19, DW_AT_declaration
    8876                      .dwendtag $C$DW$T$19
    8877              
    8878              $C$DW$T$230     .dwtag  DW_TAG_pointer_type
    8879                      .dwattr $C$DW$T$230, DW_AT_type(*$C$DW$T$19)
    8880                      .dwattr $C$DW$T$230, DW_AT_address_class(0x20)
    8881              
    8882              $C$DW$T$231     .dwtag  DW_TAG_typedef
    8883                      .dwattr $C$DW$T$231, DW_AT_name("IPD_HFI_Handle")
    8884                      .dwattr $C$DW$T$231, DW_AT_type(*$C$DW$T$230)
    8885                      .dwattr $C$DW$T$231, DW_AT_language(DW_LANG_C)
    8886              
    8887              
    8888              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    8889                      .dwattr $C$DW$T$34, DW_AT_name("_ADC_Obj_")
    8890                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x6650)
    8891              $C$DW$907       .dwtag  DW_TAG_member
    8892                      .dwattr $C$DW$907, DW_AT_type(*$C$DW$T$28)
    8893                      .dwattr $C$DW$907, DW_AT_name("ADCRESULT")
    8894                      .dwattr $C$DW$907, DW_AT_TI_symbol_name("_ADCRESULT")
    8895                      .dwattr $C$DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8896                      .dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
    8897              
    8898              $C$DW$908       .dwtag  DW_TAG_member
    8899                      .dwattr $C$DW$908, DW_AT_type(*$C$DW$T$29)
    8900                      .dwattr $C$DW$908, DW_AT_name("resvd_1")
    8901                      .dwattr $C$DW$908, DW_AT_TI_symbol_name("_resvd_1")
    8902                      .dwattr $C$DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8903                      .dwattr $C$DW$908, DW_AT_accessibility(DW_ACCESS_public)
    8904              
    8905              $C$DW$909       .dwtag  DW_TAG_member
    8906                      .dwattr $C$DW$909, DW_AT_type(*$C$DW$T$27)
    8907                      .dwattr $C$DW$909, DW_AT_name("ADCCTL1")
    8908                      .dwattr $C$DW$909, DW_AT_TI_symbol_name("_ADCCTL1")
    8909                      .dwattr $C$DW$909, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    8910                      .dwattr $C$DW$909, DW_AT_accessibility(DW_ACCESS_public)
    8911              
    8912              $C$DW$910       .dwtag  DW_TAG_member
    8913                      .dwattr $C$DW$910, DW_AT_type(*$C$DW$T$27)
    8914                      .dwattr $C$DW$910, DW_AT_name("ADCCTL2")
    8915                      .dwattr $C$DW$910, DW_AT_TI_symbol_name("_ADCCTL2")
    8916                      .dwattr $C$DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    8917                      .dwattr $C$DW$910, DW_AT_accessibility(DW_ACCESS_public)
    8918              
    8919              $C$DW$911       .dwtag  DW_TAG_member
    8920                      .dwattr $C$DW$911, DW_AT_type(*$C$DW$T$30)
    8921                      .dwattr $C$DW$911, DW_AT_name("rsvd_2")
    8922                      .dwattr $C$DW$911, DW_AT_TI_symbol_name("_rsvd_2")
    8923                      .dwattr $C$DW$911, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
TMS320C2000 Assembler PC v22.6.0 Fri Mar 10 12:50:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{01B77DF1-504C-473A-B828-ADD2AFD52A8B} PAGE  176

    8924                      .dwattr $C$DW$911, DW_AT_accessibility(DW_ACCESS_public)
    8925              
    8926              $C$DW$912       .dwtag  DW_TAG_member
    8927                      .dwattr $C$DW$912, DW_AT_type(*$C$DW$T$27)
    8928                      .dwattr $C$DW$912, DW_AT_name("ADCINTFLG")
    8929                      .dwattr $C$DW$912, DW_AT_TI_symbol_name("_ADCINTFLG")
    8930                      .dwattr $C$DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    8931                      .dwattr $C$DW$912, DW_AT_accessibility(DW_ACCESS_public)
    8932              
    8933              $C$DW$913       .dwtag  DW_TAG_member
    8934                      .dwattr $C$DW$913, DW_AT_type(*$C$DW$T$27)
    8935                      .dwattr $C$DW$913, DW_AT_name("ADCINTFLGCLR")
    8936                      .dwattr $C$DW$913, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    8937                      .dwattr $C$DW$913, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    8938                      .dwattr $C$DW$913, DW_AT_accessibility(DW_ACCESS_public)
    8939              
    8940              $C$DW$914       .dwtag  DW_TAG_member
    8941                      .dwattr $C$DW$914, DW_AT_type(*$C$DW$T$27)
    8942                      .dwattr $C$DW$914, DW_AT_name("ADCINTOVF")
    8943                      .dwattr $C$DW$914, DW_AT_TI_symbol_name("_ADCINTOVF")
    8944                      .dwattr $C$DW$914, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    8945                      .dwattr $C$DW$914, DW_AT_accessibility(DW_ACCESS_public)
    8946              
    8947              $C$DW$915       .dwtag  DW_TAG_member
    8948                      .dwattr $C$DW$915, DW_AT_type(*$C$DW$T$27)
    8949                      .dwattr $C$DW$915, DW_AT_name("ADCINTOVFCLR")
    8950                      .dwattr $C$DW$915, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    8951                      .dwattr $C$DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    8952                      .dwattr $C$DW$915, DW_AT_accessibility(DW_ACCESS_public)
    8953              
    8954              $C$DW$916       .dwtag  DW_TAG_member
    8955                      .dwattr $C$DW$916, DW_AT_type(*$C$DW$T$31)
    8956                      .dwattr $C$DW$916, DW_AT_name("INTSELxNy")
    8957                      .dwattr $C$DW$916, DW_AT_TI_symbol_name("_INTSELxNy")
    8958                      .dwattr $C$DW$916, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    8959                      .dwattr $C$DW$916, DW_AT_accessibility(DW_ACCESS_public)
    8960              
    8961              $C$DW$917       .dwtag  DW_TAG_member
    8962                      .dwattr $C$DW$917, DW_AT_type(*$C$DW$T$32)
    8963                      .dwattr $C$DW$917, DW_AT_name("rsvd_3")
    8964                      .dwattr $C$DW$917, DW_AT_TI_symbol_name("_rsvd_3")
    8965                      .dwattr $C$DW$917, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    8966                      .dwattr $C$DW$917, DW_AT_accessibility(DW_ACCESS_public)
    8967              
    8968              $C$DW$918       .dwtag  DW_TAG_member
    8969                      .dwattr $C$DW$918, DW_AT_type(*$C$DW$T$27)
    8970                      .dwattr $C$DW$918, DW_AT_name("SOCPRICTRL")
    8971                      .dwattr $C$DW$918, DW_AT_TI_symbol_name("_SOCPRICTRL")
    8972                      .dwattr $C$DW$918, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    8973                      .dwattr $C$DW$918, DW_AT_accessibility(DW_ACCESS_public)
    8974              
    8975              $C$DW$919       .dwtag  DW_TAG_member
    8976                      .dwattr $C$DW$919, DW_AT_type(*$C$DW$T$27)
    8977                      .dwattr $C$DW$919, DW_AT_name("rsvd_4")
    8978                      .dwattr $C$DW$919, DW_AT_TI_symbol_name("_rsvd_4")
TMS320C2000 Assembler PC v22.6.0 Fri Mar 10 12:50:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{01B77DF1-504C-473A-B828-ADD2AFD52A8B} PAGE  177

    8979                      .dwattr $C$DW$919, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    8980                      .dwattr $C$DW$919, DW_AT_accessibility(DW_ACCESS_public)
    8981              
    8982              $C$DW$920       .dwtag  DW_TAG_member
    8983                      .dwattr $C$DW$920, DW_AT_type(*$C$DW$T$27)
    8984                      .dwattr $C$DW$920, DW_AT_name("ADCSAMPLEMODE")
    8985                      .dwattr $C$DW$920, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    8986                      .dwattr $C$DW$920, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    8987                      .dwattr $C$DW$920, DW_AT_accessibility(DW_ACCESS_public)
    8988              
    8989              $C$DW$921       .dwtag  DW_TAG_member
    8990                      .dwattr $C$DW$921, DW_AT_type(*$C$DW$T$27)
    8991                      .dwattr $C$DW$921, DW_AT_name("rsvd_5")
    8992                      .dwattr $C$DW$921, DW_AT_TI_symbol_name("_rsvd_5")
    8993                      .dwattr $C$DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    8994                      .dwattr $C$DW$921, DW_AT_accessibility(DW_ACCESS_public)
    8995              
    8996              $C$DW$922       .dwtag  DW_TAG_member
    8997                      .dwattr $C$DW$922, DW_AT_type(*$C$DW$T$27)
    8998                      .dwattr $C$DW$922, DW_AT_name("ADCINTSOCSEL1")
    8999                      .dwattr $C$DW$922, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    9000                      .dwattr $C$DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    9001                      .dwattr $C$DW$922, DW_AT_accessibility(DW_ACCESS_public)
    9002              
    9003              $C$DW$923       .dwtag  DW_TAG_member
    9004                      .dwattr $C$DW$923, DW_AT_type(*$C$DW$T$27)
    9005                      .dwattr $C$DW$923, DW_AT_name("ADCINTSOCSEL2")
    9006                      .dwattr $C$DW$923, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    9007                      .dwattr $C$DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    9008                      .dwattr $C$DW$923, DW_AT_accessibility(DW_ACCESS_public)
    9009              
    9010              $C$DW$924       .dwtag  DW_TAG_member
    9011                      .dwattr $C$DW$924, DW_AT_type(*$C$DW$T$30)
    9012                      .dwattr $C$DW$924, DW_AT_name("rsvd_6")
    9013                      .dwattr $C$DW$924, DW_AT_TI_symbol_name("_rsvd_6")
    9014                      .dwattr $C$DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    9015                      .dwattr $C$DW$924, DW_AT_accessibility(DW_ACCESS_public)
    9016              
    9017              $C$DW$925       .dwtag  DW_TAG_member
    9018                      .dwattr $C$DW$925, DW_AT_type(*$C$DW$T$27)
    9019                      .dwattr $C$DW$925, DW_AT_name("ADCSOCFLG1")
    9020                      .dwattr $C$DW$925, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    9021                      .dwattr $C$DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    9022                      .dwattr $C$DW$925, DW_AT_accessibility(DW_ACCESS_public)
    9023              
    9024              $C$DW$926       .dwtag  DW_TAG_member
    9025                      .dwattr $C$DW$926, DW_AT_type(*$C$DW$T$27)
    9026                      .dwattr $C$DW$926, DW_AT_name("rsvd_7")
    9027                      .dwattr $C$DW$926, DW_AT_TI_symbol_name("_rsvd_7")
    9028                      .dwattr $C$DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    9029                      .dwattr $C$DW$926, DW_AT_accessibility(DW_ACCESS_public)
    9030              
    9031              $C$DW$927       .dwtag  DW_TAG_member
    9032                      .dwattr $C$DW$927, DW_AT_type(*$C$DW$T$27)
    9033                      .dwattr $C$DW$927, DW_AT_name("ADCSOCFRC1")
TMS320C2000 Assembler PC v22.6.0 Fri Mar 10 12:50:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{01B77DF1-504C-473A-B828-ADD2AFD52A8B} PAGE  178

    9034                      .dwattr $C$DW$927, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    9035                      .dwattr $C$DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    9036                      .dwattr $C$DW$927, DW_AT_accessibility(DW_ACCESS_public)
    9037              
    9038              $C$DW$928       .dwtag  DW_TAG_member
    9039                      .dwattr $C$DW$928, DW_AT_type(*$C$DW$T$27)
    9040                      .dwattr $C$DW$928, DW_AT_name("rsvd_8")
    9041                      .dwattr $C$DW$928, DW_AT_TI_symbol_name("_rsvd_8")
    9042                      .dwattr $C$DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    9043                      .dwattr $C$DW$928, DW_AT_accessibility(DW_ACCESS_public)
    9044              
    9045              $C$DW$929       .dwtag  DW_TAG_member
    9046                      .dwattr $C$DW$929, DW_AT_type(*$C$DW$T$27)
    9047                      .dwattr $C$DW$929, DW_AT_name("ADCSOCOVF1")
    9048                      .dwattr $C$DW$929, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    9049                      .dwattr $C$DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    9050                      .dwattr $C$DW$929, DW_AT_accessibility(DW_ACCESS_public)
    9051              
    9052              $C$DW$930       .dwtag  DW_TAG_member
    9053                      .dwattr $C$DW$930, DW_AT_type(*$C$DW$T$27)
    9054                      .dwattr $C$DW$930, DW_AT_name("rsvd_9")
    9055                      .dwattr $C$DW$930, DW_AT_TI_symbol_name("_rsvd_9")
    9056                      .dwattr $C$DW$930, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    9057                      .dwattr $C$DW$930, DW_AT_accessibility(DW_ACCESS_public)
    9058              
    9059              $C$DW$931       .dwtag  DW_TAG_member
    9060                      .dwattr $C$DW$931, DW_AT_type(*$C$DW$T$27)
    9061                      .dwattr $C$DW$931, DW_AT_name("ADCSOCOVFCLR1")
    9062                      .dwattr $C$DW$931, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    9063                      .dwattr $C$DW$931, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    9064                      .dwattr $C$DW$931, DW_AT_accessibility(DW_ACCESS_public)
    9065              
    9066              $C$DW$932       .dwtag  DW_TAG_member
    9067                      .dwattr $C$DW$932, DW_AT_type(*$C$DW$T$27)
    9068                      .dwattr $C$DW$932, DW_AT_name("rsvd_10")
    9069                      .dwattr $C$DW$932, DW_AT_TI_symbol_name("_rsvd_10")
    9070                      .dwattr $C$DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    9071                      .dwattr $C$DW$932, DW_AT_accessibility(DW_ACCESS_public)
    9072              
    9073              $C$DW$933       .dwtag  DW_TAG_member
    9074                      .dwattr $C$DW$933, DW_AT_type(*$C$DW$T$28)
    9075                      .dwattr $C$DW$933, DW_AT_name("ADCSOCxCTL")
    9076                      .dwattr $C$DW$933, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    9077                      .dwattr $C$DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    9078                      .dwattr $C$DW$933, DW_AT_accessibility(DW_ACCESS_public)
    9079              
    9080              $C$DW$934       .dwtag  DW_TAG_member
    9081                      .dwattr $C$DW$934, DW_AT_type(*$C$DW$T$28)
    9082                      .dwattr $C$DW$934, DW_AT_name("rsvd_11")
    9083                      .dwattr $C$DW$934, DW_AT_TI_symbol_name("_rsvd_11")
    9084                      .dwattr $C$DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    9085                      .dwattr $C$DW$934, DW_AT_accessibility(DW_ACCESS_public)
    9086              
    9087              $C$DW$935       .dwtag  DW_TAG_member
    9088                      .dwattr $C$DW$935, DW_AT_type(*$C$DW$T$27)
TMS320C2000 Assembler PC v22.6.0 Fri Mar 10 12:50:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{01B77DF1-504C-473A-B828-ADD2AFD52A8B} PAGE  179

    9089                      .dwattr $C$DW$935, DW_AT_name("ADCREFTRIM")
    9090                      .dwattr $C$DW$935, DW_AT_TI_symbol_name("_ADCREFTRIM")
    9091                      .dwattr $C$DW$935, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    9092                      .dwattr $C$DW$935, DW_AT_accessibility(DW_ACCESS_public)
    9093              
    9094              $C$DW$936       .dwtag  DW_TAG_member
    9095                      .dwattr $C$DW$936, DW_AT_type(*$C$DW$T$27)
    9096                      .dwattr $C$DW$936, DW_AT_name("ADCOFFTRIM")
    9097                      .dwattr $C$DW$936, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    9098                      .dwattr $C$DW$936, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    9099                      .dwattr $C$DW$936, DW_AT_accessibility(DW_ACCESS_public)
    9100              
    9101              $C$DW$937       .dwtag  DW_TAG_member
    9102                      .dwattr $C$DW$937, DW_AT_type(*$C$DW$T$33)
    9103                      .dwattr $C$DW$937, DW_AT_name("resvd_12")
    9104                      .dwattr $C$DW$937, DW_AT_TI_symbol_name("_resvd_12")
    9105                      .dwattr $C$DW$937, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    9106                      .dwattr $C$DW$937, DW_AT_accessibility(DW_ACCESS_public)
    9107              
    9108              $C$DW$938       .dwtag  DW_TAG_member
    9109                      .dwattr $C$DW$938, DW_AT_type(*$C$DW$T$27)
    9110                      .dwattr $C$DW$938, DW_AT_name("ADCREV")
    9111                      .dwattr $C$DW$938, DW_AT_TI_symbol_name("_ADCREV")
    9112                      .dwattr $C$DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    9113                      .dwattr $C$DW$938, DW_AT_accessibility(DW_ACCESS_public)
    9114              
    9115                      .dwendtag $C$DW$T$34
    9116              
    9117              $C$DW$T$235     .dwtag  DW_TAG_typedef
    9118                      .dwattr $C$DW$T$235, DW_AT_name("ADC_Obj")
    9119                      .dwattr $C$DW$T$235, DW_AT_type(*$C$DW$T$34)
    9120                      .dwattr $C$DW$T$235, DW_AT_language(DW_LANG_C)
    9121              
    9122              $C$DW$T$124     .dwtag  DW_TAG_pointer_type
    9123                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$34)
    9124                      .dwattr $C$DW$T$124, DW_AT_address_class(0x20)
    9125              
    9126              $C$DW$T$125     .dwtag  DW_TAG_typedef
    9127                      .dwattr $C$DW$T$125, DW_AT_name("ADC_Handle")
    9128                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
    9129                      .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    9130              
    9131              
    9132              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    9133                      .dwattr $C$DW$T$20, DW_AT_name("_AFSEL_Obj_")
    9134                      .dwattr $C$DW$T$20, DW_AT_declaration
    9135                      .dwendtag $C$DW$T$20
    9136              
    9137              $C$DW$T$236     .dwtag  DW_TAG_pointer_type
    9138                      .dwattr $C$DW$T$236, DW_AT_type(*$C$DW$T$20)
    9139                      .dwattr $C$DW$T$236, DW_AT_address_class(0x20)
    9140              
    9141              $C$DW$T$237     .dwtag  DW_TAG_typedef
    9142                      .dwattr $C$DW$T$237, DW_AT_name("AFSEL_Handle")
    9143                      .dwattr $C$DW$T$237, DW_AT_type(*$C$DW$T$236)
TMS320C2000 Assembler PC v22.6.0 Fri Mar 10 12:50:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{01B77DF1-504C-473A-B828-ADD2AFD52A8B} PAGE  180

    9144                      .dwattr $C$DW$T$237, DW_AT_language(DW_LANG_C)
    9145              
    9146              
    9147              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    9148                      .dwattr $C$DW$T$38, DW_AT_name("_CLARKE_Obj_")
    9149                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x06)
    9150              $C$DW$939       .dwtag  DW_TAG_member
    9151                      .dwattr $C$DW$939, DW_AT_type(*$C$DW$T$35)
    9152                      .dwattr $C$DW$939, DW_AT_name("alpha_sf")
    9153                      .dwattr $C$DW$939, DW_AT_TI_symbol_name("_alpha_sf")
    9154                      .dwattr $C$DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9155                      .dwattr $C$DW$939, DW_AT_accessibility(DW_ACCESS_public)
    9156              
    9157              $C$DW$940       .dwtag  DW_TAG_member
    9158                      .dwattr $C$DW$940, DW_AT_type(*$C$DW$T$35)
    9159                      .dwattr $C$DW$940, DW_AT_name("beta_sf")
    9160                      .dwattr $C$DW$940, DW_AT_TI_symbol_name("_beta_sf")
    9161                      .dwattr $C$DW$940, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9162                      .dwattr $C$DW$940, DW_AT_accessibility(DW_ACCESS_public)
    9163              
    9164              $C$DW$941       .dwtag  DW_TAG_member
    9165                      .dwattr $C$DW$941, DW_AT_type(*$C$DW$T$37)
    9166                      .dwattr $C$DW$941, DW_AT_name("numSensors")
    9167                      .dwattr $C$DW$941, DW_AT_TI_symbol_name("_numSensors")
    9168                      .dwattr $C$DW$941, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9169                      .dwattr $C$DW$941, DW_AT_accessibility(DW_ACCESS_public)
    9170              
    9171                      .dwendtag $C$DW$T$38
    9172              
    9173              $C$DW$T$49      .dwtag  DW_TAG_typedef
    9174                      .dwattr $C$DW$T$49, DW_AT_name("CLARKE_Obj")
    9175                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$38)
    9176                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    9177              
    9178              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    9179                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$38)
    9180                      .dwattr $C$DW$T$47, DW_AT_address_class(0x20)
    9181              
    9182              $C$DW$T$48      .dwtag  DW_TAG_typedef
    9183                      .dwattr $C$DW$T$48, DW_AT_name("CLARKE_Handle")
    9184                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    9185                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    9186              
    9187              $C$DW$942       .dwtag  DW_TAG_TI_far_type
    9188                      .dwattr $C$DW$942, DW_AT_type(*$C$DW$T$48)
    9189              
    9190              $C$DW$T$241     .dwtag  DW_TAG_const_type
    9191                      .dwattr $C$DW$T$241, DW_AT_type(*$C$DW$942)
    9192              
    9193              
    9194              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    9195                      .dwattr $C$DW$T$40, DW_AT_name("_CLK_Obj_")
    9196                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x11)
    9197              $C$DW$943       .dwtag  DW_TAG_member
    9198                      .dwattr $C$DW$943, DW_AT_type(*$C$DW$T$27)
TMS320C2000 Assembler PC v22.6.0 Fri Mar 10 12:50:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{01B77DF1-504C-473A-B828-ADD2AFD52A8B} PAGE  181

    9199                      .dwattr $C$DW$943, DW_AT_name("XCLK")
    9200                      .dwattr $C$DW$943, DW_AT_TI_symbol_name("_XCLK")
    9201                      .dwattr $C$DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9202                      .dwattr $C$DW$943, DW_AT_accessibility(DW_ACCESS_public)
    9203              
    9204              $C$DW$944       .dwtag  DW_TAG_member
    9205                      .dwattr $C$DW$944, DW_AT_type(*$C$DW$T$27)
    9206                      .dwattr $C$DW$944, DW_AT_name("rsvd_1")
    9207                      .dwattr $C$DW$944, DW_AT_TI_symbol_name("_rsvd_1")
    9208                      .dwattr $C$DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9209                      .dwattr $C$DW$944, DW_AT_accessibility(DW_ACCESS_public)
    9210              
    9211              $C$DW$945       .dwtag  DW_TAG_member
    9212                      .dwattr $C$DW$945, DW_AT_type(*$C$DW$T$27)
    9213                      .dwattr $C$DW$945, DW_AT_name("CLKCTL")
    9214                      .dwattr $C$DW$945, DW_AT_TI_symbol_name("_CLKCTL")
    9215                      .dwattr $C$DW$945, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9216                      .dwattr $C$DW$945, DW_AT_accessibility(DW_ACCESS_public)
    9217              
    9218              $C$DW$946       .dwtag  DW_TAG_member
    9219                      .dwattr $C$DW$946, DW_AT_type(*$C$DW$T$39)
    9220                      .dwattr $C$DW$946, DW_AT_name("rsvd_2")
    9221                      .dwattr $C$DW$946, DW_AT_TI_symbol_name("_rsvd_2")
    9222                      .dwattr $C$DW$946, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9223                      .dwattr $C$DW$946, DW_AT_accessibility(DW_ACCESS_public)
    9224              
    9225              $C$DW$947       .dwtag  DW_TAG_member
    9226                      .dwattr $C$DW$947, DW_AT_type(*$C$DW$T$27)
    9227                      .dwattr $C$DW$947, DW_AT_name("LOSPCP")
    9228                      .dwattr $C$DW$947, DW_AT_TI_symbol_name("_LOSPCP")
    9229                      .dwattr $C$DW$947, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    9230                      .dwattr $C$DW$947, DW_AT_accessibility(DW_ACCESS_public)
    9231              
    9232              $C$DW$948       .dwtag  DW_TAG_member
    9233                      .dwattr $C$DW$948, DW_AT_type(*$C$DW$T$27)
    9234                      .dwattr $C$DW$948, DW_AT_name("PCLKCR0")
    9235                      .dwattr $C$DW$948, DW_AT_TI_symbol_name("_PCLKCR0")
    9236                      .dwattr $C$DW$948, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9237                      .dwattr $C$DW$948, DW_AT_accessibility(DW_ACCESS_public)
    9238              
    9239              $C$DW$949       .dwtag  DW_TAG_member
    9240                      .dwattr $C$DW$949, DW_AT_type(*$C$DW$T$27)
    9241                      .dwattr $C$DW$949, DW_AT_name("PCLKCR1")
    9242                      .dwattr $C$DW$949, DW_AT_TI_symbol_name("_PCLKCR1")
    9243                      .dwattr $C$DW$949, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    9244                      .dwattr $C$DW$949, DW_AT_accessibility(DW_ACCESS_public)
    9245              
    9246              $C$DW$950       .dwtag  DW_TAG_member
    9247                      .dwattr $C$DW$950, DW_AT_type(*$C$DW$T$30)
    9248                      .dwattr $C$DW$950, DW_AT_name("rsvd_3")
    9249                      .dwattr $C$DW$950, DW_AT_TI_symbol_name("_rsvd_3")
    9250                      .dwattr $C$DW$950, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9251                      .dwattr $C$DW$950, DW_AT_accessibility(DW_ACCESS_public)
    9252              
    9253              $C$DW$951       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Fri Mar 10 12:50:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{01B77DF1-504C-473A-B828-ADD2AFD52A8B} PAGE  182

    9254                      .dwattr $C$DW$951, DW_AT_type(*$C$DW$T$27)
    9255                      .dwattr $C$DW$951, DW_AT_name("PCLKCR3")
    9256                      .dwattr $C$DW$951, DW_AT_TI_symbol_name("_PCLKCR3")
    9257                      .dwattr $C$DW$951, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9258                      .dwattr $C$DW$951, DW_AT_accessibility(DW_ACCESS_public)
    9259              
    9260                      .dwendtag $C$DW$T$40
    9261              
    9262              $C$DW$T$126     .dwtag  DW_TAG_pointer_type
    9263                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$40)
    9264                      .dwattr $C$DW$T$126, DW_AT_address_class(0x20)
    9265              
    9266              $C$DW$T$127     .dwtag  DW_TAG_typedef
    9267                      .dwattr $C$DW$T$127, DW_AT_name("CLK_Handle")
    9268                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
    9269                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    9270              
    9271              
    9272              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    9273                      .dwattr $C$DW$T$41, DW_AT_name("_CPU_Obj_")
    9274                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    9275              $C$DW$952       .dwtag  DW_TAG_member
    9276                      .dwattr $C$DW$952, DW_AT_type(*$C$DW$T$37)
    9277                      .dwattr $C$DW$952, DW_AT_name("tmp")
    9278                      .dwattr $C$DW$952, DW_AT_TI_symbol_name("_tmp")
    9279                      .dwattr $C$DW$952, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9280                      .dwattr $C$DW$952, DW_AT_accessibility(DW_ACCESS_public)
    9281              
    9282                      .dwendtag $C$DW$T$41
    9283              
    9284              $C$DW$T$128     .dwtag  DW_TAG_pointer_type
    9285                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$41)
    9286                      .dwattr $C$DW$T$128, DW_AT_address_class(0x20)
    9287              
    9288              $C$DW$T$129     .dwtag  DW_TAG_typedef
    9289                      .dwattr $C$DW$T$129, DW_AT_name("CPU_Handle")
    9290                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$128)
    9291                      .dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
    9292              
    9293              
    9294              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    9295                      .dwattr $C$DW$T$77, DW_AT_name("_CTRL_Obj_")
    9296                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x10a)
    9297              $C$DW$953       .dwtag  DW_TAG_member
    9298                      .dwattr $C$DW$953, DW_AT_type(*$C$DW$T$42)
    9299                      .dwattr $C$DW$953, DW_AT_name("version")
    9300                      .dwattr $C$DW$953, DW_AT_TI_symbol_name("_version")
    9301                      .dwattr $C$DW$953, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9302                      .dwattr $C$DW$953, DW_AT_accessibility(DW_ACCESS_public)
    9303              
    9304              $C$DW$954       .dwtag  DW_TAG_member
    9305                      .dwattr $C$DW$954, DW_AT_type(*$C$DW$T$44)
    9306                      .dwattr $C$DW$954, DW_AT_name("state")
    9307                      .dwattr $C$DW$954, DW_AT_TI_symbol_name("_state")
    9308                      .dwattr $C$DW$954, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler PC v22.6.0 Fri Mar 10 12:50:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{01B77DF1-504C-473A-B828-ADD2AFD52A8B} PAGE  183

    9309                      .dwattr $C$DW$954, DW_AT_accessibility(DW_ACCESS_public)
    9310              
    9311              $C$DW$955       .dwtag  DW_TAG_member
    9312                      .dwattr $C$DW$955, DW_AT_type(*$C$DW$T$44)
    9313                      .dwattr $C$DW$955, DW_AT_name("prevState")
    9314                      .dwattr $C$DW$955, DW_AT_TI_symbol_name("_prevState")
    9315                      .dwattr $C$DW$955, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9316                      .dwattr $C$DW$955, DW_AT_accessibility(DW_ACCESS_public)
    9317              
    9318              $C$DW$956       .dwtag  DW_TAG_member
    9319                      .dwattr $C$DW$956, DW_AT_type(*$C$DW$T$46)
    9320                      .dwattr $C$DW$956, DW_AT_name("errorCode")
    9321                      .dwattr $C$DW$956, DW_AT_TI_symbol_name("_errorCode")
    9322                      .dwattr $C$DW$956, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9323                      .dwattr $C$DW$956, DW_AT_accessibility(DW_ACCESS_public)
    9324              
    9325              $C$DW$957       .dwtag  DW_TAG_member
    9326                      .dwattr $C$DW$957, DW_AT_type(*$C$DW$T$48)
    9327                      .dwattr $C$DW$957, DW_AT_name("clarkeHandle_I")
    9328                      .dwattr $C$DW$957, DW_AT_TI_symbol_name("_clarkeHandle_I")
    9329                      .dwattr $C$DW$957, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9330                      .dwattr $C$DW$957, DW_AT_accessibility(DW_ACCESS_public)
    9331              
    9332              $C$DW$958       .dwtag  DW_TAG_member
    9333                      .dwattr $C$DW$958, DW_AT_type(*$C$DW$T$49)
    9334                      .dwattr $C$DW$958, DW_AT_name("clarke_I")
    9335                      .dwattr $C$DW$958, DW_AT_TI_symbol_name("_clarke_I")
    9336                      .dwattr $C$DW$958, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9337                      .dwattr $C$DW$958, DW_AT_accessibility(DW_ACCESS_public)
    9338              
    9339              $C$DW$959       .dwtag  DW_TAG_member
    9340                      .dwattr $C$DW$959, DW_AT_type(*$C$DW$T$48)
    9341                      .dwattr $C$DW$959, DW_AT_name("clarkeHandle_V")
    9342                      .dwattr $C$DW$959, DW_AT_TI_symbol_name("_clarkeHandle_V")
    9343                      .dwattr $C$DW$959, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9344                      .dwattr $C$DW$959, DW_AT_accessibility(DW_ACCESS_public)
    9345              
    9346              $C$DW$960       .dwtag  DW_TAG_member
    9347                      .dwattr $C$DW$960, DW_AT_type(*$C$DW$T$49)
    9348                      .dwattr $C$DW$960, DW_AT_name("clarke_V")
    9349                      .dwattr $C$DW$960, DW_AT_TI_symbol_name("_clarke_V")
    9350                      .dwattr $C$DW$960, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9351                      .dwattr $C$DW$960, DW_AT_accessibility(DW_ACCESS_public)
    9352              
    9353              $C$DW$961       .dwtag  DW_TAG_member
    9354                      .dwattr $C$DW$961, DW_AT_type(*$C$DW$T$51)
    9355                      .dwattr $C$DW$961, DW_AT_name("estHandle")
    9356                      .dwattr $C$DW$961, DW_AT_TI_symbol_name("_estHandle")
    9357                      .dwattr $C$DW$961, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9358                      .dwattr $C$DW$961, DW_AT_accessibility(DW_ACCESS_public)
    9359              
    9360              $C$DW$962       .dwtag  DW_TAG_member
    9361                      .dwattr $C$DW$962, DW_AT_type(*$C$DW$T$53)
    9362                      .dwattr $C$DW$962, DW_AT_name("parkHandle")
    9363                      .dwattr $C$DW$962, DW_AT_TI_symbol_name("_parkHandle")
TMS320C2000 Assembler PC v22.6.0 Fri Mar 10 12:50:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{01B77DF1-504C-473A-B828-ADD2AFD52A8B} PAGE  184

    9364                      .dwattr $C$DW$962, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9365                      .dwattr $C$DW$962, DW_AT_accessibility(DW_ACCESS_public)
    9366              
    9367              $C$DW$963       .dwtag  DW_TAG_member
    9368                      .dwattr $C$DW$963, DW_AT_type(*$C$DW$T$54)
    9369                      .dwattr $C$DW$963, DW_AT_name("park")
    9370                      .dwattr $C$DW$963, DW_AT_TI_symbol_name("_park")
    9371                      .dwattr $C$DW$963, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9372                      .dwattr $C$DW$963, DW_AT_accessibility(DW_ACCESS_public)
    9373              
    9374              $C$DW$964       .dwtag  DW_TAG_member
    9375                      .dwattr $C$DW$964, DW_AT_type(*$C$DW$T$56)
    9376                      .dwattr $C$DW$964, DW_AT_name("pidHandle_Id")
    9377                      .dwattr $C$DW$964, DW_AT_TI_symbol_name("_pidHandle_Id")
    9378                      .dwattr $C$DW$964, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    9379                      .dwattr $C$DW$964, DW_AT_accessibility(DW_ACCESS_public)
    9380              
    9381              $C$DW$965       .dwtag  DW_TAG_member
    9382                      .dwattr $C$DW$965, DW_AT_type(*$C$DW$T$57)
    9383                      .dwattr $C$DW$965, DW_AT_name("pid_Id")
    9384                      .dwattr $C$DW$965, DW_AT_TI_symbol_name("_pid_Id")
    9385                      .dwattr $C$DW$965, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    9386                      .dwattr $C$DW$965, DW_AT_accessibility(DW_ACCESS_public)
    9387              
    9388              $C$DW$966       .dwtag  DW_TAG_member
    9389                      .dwattr $C$DW$966, DW_AT_type(*$C$DW$T$56)
    9390                      .dwattr $C$DW$966, DW_AT_name("pidHandle_Iq")
    9391                      .dwattr $C$DW$966, DW_AT_TI_symbol_name("_pidHandle_Iq")
    9392                      .dwattr $C$DW$966, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    9393                      .dwattr $C$DW$966, DW_AT_accessibility(DW_ACCESS_public)
    9394              
    9395              $C$DW$967       .dwtag  DW_TAG_member
    9396                      .dwattr $C$DW$967, DW_AT_type(*$C$DW$T$57)
    9397                      .dwattr $C$DW$967, DW_AT_name("pid_Iq")
    9398                      .dwattr $C$DW$967, DW_AT_TI_symbol_name("_pid_Iq")
    9399                      .dwattr $C$DW$967, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    9400                      .dwattr $C$DW$967, DW_AT_accessibility(DW_ACCESS_public)
    9401              
    9402              $C$DW$968       .dwtag  DW_TAG_member
    9403                      .dwattr $C$DW$968, DW_AT_type(*$C$DW$T$56)
    9404                      .dwattr $C$DW$968, DW_AT_name("pidHandle_spd")
    9405                      .dwattr $C$DW$968, DW_AT_TI_symbol_name("_pidHandle_spd")
    9406                      .dwattr $C$DW$968, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    9407                      .dwattr $C$DW$968, DW_AT_accessibility(DW_ACCESS_public)
    9408              
    9409              $C$DW$969       .dwtag  DW_TAG_member
    9410                      .dwattr $C$DW$969, DW_AT_type(*$C$DW$T$57)
    9411                      .dwattr $C$DW$969, DW_AT_name("pid_spd")
    9412                      .dwattr $C$DW$969, DW_AT_TI_symbol_name("_pid_spd")
    9413                      .dwattr $C$DW$969, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    9414                      .dwattr $C$DW$969, DW_AT_accessibility(DW_ACCESS_public)
    9415              
    9416              $C$DW$970       .dwtag  DW_TAG_member
    9417                      .dwattr $C$DW$970, DW_AT_type(*$C$DW$T$59)
    9418                      .dwattr $C$DW$970, DW_AT_name("iparkHandle")
TMS320C2000 Assembler PC v22.6.0 Fri Mar 10 12:50:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{01B77DF1-504C-473A-B828-ADD2AFD52A8B} PAGE  185

    9419                      .dwattr $C$DW$970, DW_AT_TI_symbol_name("_iparkHandle")
    9420                      .dwattr $C$DW$970, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    9421                      .dwattr $C$DW$970, DW_AT_accessibility(DW_ACCESS_public)
    9422              
    9423              $C$DW$971       .dwtag  DW_TAG_member
    9424                      .dwattr $C$DW$971, DW_AT_type(*$C$DW$T$60)
    9425                      .dwattr $C$DW$971, DW_AT_name("ipark")
    9426                      .dwattr $C$DW$971, DW_AT_TI_symbol_name("_ipark")
    9427                      .dwattr $C$DW$971, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    9428                      .dwattr $C$DW$971, DW_AT_accessibility(DW_ACCESS_public)
    9429              
    9430              $C$DW$972       .dwtag  DW_TAG_member
    9431                      .dwattr $C$DW$972, DW_AT_type(*$C$DW$T$62)
    9432                      .dwattr $C$DW$972, DW_AT_name("svgenHandle")
    9433                      .dwattr $C$DW$972, DW_AT_TI_symbol_name("_svgenHandle")
    9434                      .dwattr $C$DW$972, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    9435                      .dwattr $C$DW$972, DW_AT_accessibility(DW_ACCESS_public)
    9436              
    9437              $C$DW$973       .dwtag  DW_TAG_member
    9438                      .dwattr $C$DW$973, DW_AT_type(*$C$DW$T$63)
    9439                      .dwattr $C$DW$973, DW_AT_name("svgen")
    9440                      .dwattr $C$DW$973, DW_AT_TI_symbol_name("_svgen")
    9441                      .dwattr $C$DW$973, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    9442                      .dwattr $C$DW$973, DW_AT_accessibility(DW_ACCESS_public)
    9443              
    9444              $C$DW$974       .dwtag  DW_TAG_member
    9445                      .dwattr $C$DW$974, DW_AT_type(*$C$DW$T$65)
    9446                      .dwattr $C$DW$974, DW_AT_name("trajHandle_Id")
    9447                      .dwattr $C$DW$974, DW_AT_TI_symbol_name("_trajHandle_Id")
    9448                      .dwattr $C$DW$974, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    9449                      .dwattr $C$DW$974, DW_AT_accessibility(DW_ACCESS_public)
    9450              
    9451              $C$DW$975       .dwtag  DW_TAG_member
    9452                      .dwattr $C$DW$975, DW_AT_type(*$C$DW$T$66)
    9453                      .dwattr $C$DW$975, DW_AT_name("traj_Id")
    9454                      .dwattr $C$DW$975, DW_AT_TI_symbol_name("_traj_Id")
    9455                      .dwattr $C$DW$975, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    9456                      .dwattr $C$DW$975, DW_AT_accessibility(DW_ACCESS_public)
    9457              
    9458              $C$DW$976       .dwtag  DW_TAG_member
    9459                      .dwattr $C$DW$976, DW_AT_type(*$C$DW$T$65)
    9460                      .dwattr $C$DW$976, DW_AT_name("trajHandle_spd")
    9461                      .dwattr $C$DW$976, DW_AT_TI_symbol_name("_trajHandle_spd")
    9462                      .dwattr $C$DW$976, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    9463                      .dwattr $C$DW$976, DW_AT_accessibility(DW_ACCESS_public)
    9464              
    9465              $C$DW$977       .dwtag  DW_TAG_member
    9466                      .dwattr $C$DW$977, DW_AT_type(*$C$DW$T$66)
    9467                      .dwattr $C$DW$977, DW_AT_name("traj_spd")
    9468                      .dwattr $C$DW$977, DW_AT_TI_symbol_name("_traj_spd")
    9469                      .dwattr $C$DW$977, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    9470                      .dwattr $C$DW$977, DW_AT_accessibility(DW_ACCESS_public)
    9471              
    9472              $C$DW$978       .dwtag  DW_TAG_member
    9473                      .dwattr $C$DW$978, DW_AT_type(*$C$DW$T$65)
TMS320C2000 Assembler PC v22.6.0 Fri Mar 10 12:50:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{01B77DF1-504C-473A-B828-ADD2AFD52A8B} PAGE  186

    9474                      .dwattr $C$DW$978, DW_AT_name("trajHandle_spdMax")
    9475                      .dwattr $C$DW$978, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    9476                      .dwattr $C$DW$978, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    9477                      .dwattr $C$DW$978, DW_AT_accessibility(DW_ACCESS_public)
    9478              
    9479              $C$DW$979       .dwtag  DW_TAG_member
    9480                      .dwattr $C$DW$979, DW_AT_type(*$C$DW$T$66)
    9481                      .dwattr $C$DW$979, DW_AT_name("traj_spdMax")
    9482                      .dwattr $C$DW$979, DW_AT_TI_symbol_name("_traj_spdMax")
    9483                      .dwattr $C$DW$979, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    9484                      .dwattr $C$DW$979, DW_AT_accessibility(DW_ACCESS_public)
    9485              
    9486              $C$DW$980       .dwtag  DW_TAG_member
    9487                      .dwattr $C$DW$980, DW_AT_type(*$C$DW$T$67)
    9488                      .dwattr $C$DW$980, DW_AT_name("motorParams")
    9489                      .dwattr $C$DW$980, DW_AT_TI_symbol_name("_motorParams")
    9490                      .dwattr $C$DW$980, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    9491                      .dwattr $C$DW$980, DW_AT_accessibility(DW_ACCESS_public)
    9492              
    9493              $C$DW$981       .dwtag  DW_TAG_member
    9494                      .dwattr $C$DW$981, DW_AT_type(*$C$DW$T$71)
    9495                      .dwattr $C$DW$981, DW_AT_name("waitTimes")
    9496                      .dwattr $C$DW$981, DW_AT_TI_symbol_name("_waitTimes")
    9497                      .dwattr $C$DW$981, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    9498                      .dwattr $C$DW$981, DW_AT_accessibility(DW_ACCESS_public)
    9499              
    9500              $C$DW$982       .dwtag  DW_TAG_member
    9501                      .dwattr $C$DW$982, DW_AT_type(*$C$DW$T$70)
    9502                      .dwattr $C$DW$982, DW_AT_name("counter_state")
    9503                      .dwattr $C$DW$982, DW_AT_TI_symbol_name("_counter_state")
    9504                      .dwattr $C$DW$982, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    9505                      .dwattr $C$DW$982, DW_AT_accessibility(DW_ACCESS_public)
    9506              
    9507              $C$DW$983       .dwtag  DW_TAG_member
    9508                      .dwattr $C$DW$983, DW_AT_type(*$C$DW$T$73)
    9509                      .dwattr $C$DW$983, DW_AT_name("numIsrTicksPerCtrlTick")
    9510                      .dwattr $C$DW$983, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    9511                      .dwattr $C$DW$983, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    9512                      .dwattr $C$DW$983, DW_AT_accessibility(DW_ACCESS_public)
    9513              
    9514              $C$DW$984       .dwtag  DW_TAG_member
    9515                      .dwattr $C$DW$984, DW_AT_type(*$C$DW$T$73)
    9516                      .dwattr $C$DW$984, DW_AT_name("numCtrlTicksPerCurrentTick")
    9517                      .dwattr $C$DW$984, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    9518                      .dwattr $C$DW$984, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    9519                      .dwattr $C$DW$984, DW_AT_accessibility(DW_ACCESS_public)
    9520              
    9521              $C$DW$985       .dwtag  DW_TAG_member
    9522                      .dwattr $C$DW$985, DW_AT_type(*$C$DW$T$73)
    9523                      .dwattr $C$DW$985, DW_AT_name("numCtrlTicksPerSpeedTick")
    9524                      .dwattr $C$DW$985, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    9525                      .dwattr $C$DW$985, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    9526                      .dwattr $C$DW$985, DW_AT_accessibility(DW_ACCESS_public)
    9527              
    9528              $C$DW$986       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Fri Mar 10 12:50:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{01B77DF1-504C-473A-B828-ADD2AFD52A8B} PAGE  187

    9529                      .dwattr $C$DW$986, DW_AT_type(*$C$DW$T$73)
    9530                      .dwattr $C$DW$986, DW_AT_name("numCtrlTicksPerTrajTick")
    9531                      .dwattr $C$DW$986, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    9532                      .dwattr $C$DW$986, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    9533                      .dwattr $C$DW$986, DW_AT_accessibility(DW_ACCESS_public)
    9534              
    9535              $C$DW$987       .dwtag  DW_TAG_member
    9536                      .dwattr $C$DW$987, DW_AT_type(*$C$DW$T$70)
    9537                      .dwattr $C$DW$987, DW_AT_name("ctrlFreq_Hz")
    9538                      .dwattr $C$DW$987, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    9539                      .dwattr $C$DW$987, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    9540                      .dwattr $C$DW$987, DW_AT_accessibility(DW_ACCESS_public)
    9541              
    9542              $C$DW$988       .dwtag  DW_TAG_member
    9543                      .dwattr $C$DW$988, DW_AT_type(*$C$DW$T$70)
    9544                      .dwattr $C$DW$988, DW_AT_name("trajFreq_Hz")
    9545                      .dwattr $C$DW$988, DW_AT_TI_symbol_name("_trajFreq_Hz")
    9546                      .dwattr $C$DW$988, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    9547                      .dwattr $C$DW$988, DW_AT_accessibility(DW_ACCESS_public)
    9548              
    9549              $C$DW$989       .dwtag  DW_TAG_member
    9550                      .dwattr $C$DW$989, DW_AT_type(*$C$DW$T$35)
    9551                      .dwattr $C$DW$989, DW_AT_name("trajPeriod_sec")
    9552                      .dwattr $C$DW$989, DW_AT_TI_symbol_name("_trajPeriod_sec")
    9553                      .dwattr $C$DW$989, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    9554                      .dwattr $C$DW$989, DW_AT_accessibility(DW_ACCESS_public)
    9555              
    9556              $C$DW$990       .dwtag  DW_TAG_member
    9557                      .dwattr $C$DW$990, DW_AT_type(*$C$DW$T$74)
    9558                      .dwattr $C$DW$990, DW_AT_name("ctrlPeriod_sec")
    9559                      .dwattr $C$DW$990, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    9560                      .dwattr $C$DW$990, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    9561                      .dwattr $C$DW$990, DW_AT_accessibility(DW_ACCESS_public)
    9562              
    9563              $C$DW$991       .dwtag  DW_TAG_member
    9564                      .dwattr $C$DW$991, DW_AT_type(*$C$DW$T$35)
    9565                      .dwattr $C$DW$991, DW_AT_name("maxVsMag_pu")
    9566                      .dwattr $C$DW$991, DW_AT_TI_symbol_name("_maxVsMag_pu")
    9567                      .dwattr $C$DW$991, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    9568                      .dwattr $C$DW$991, DW_AT_accessibility(DW_ACCESS_public)
    9569              
    9570              $C$DW$992       .dwtag  DW_TAG_member
    9571                      .dwattr $C$DW$992, DW_AT_type(*$C$DW$T$75)
    9572                      .dwattr $C$DW$992, DW_AT_name("Iab_in")
    9573                      .dwattr $C$DW$992, DW_AT_TI_symbol_name("_Iab_in")
    9574                      .dwattr $C$DW$992, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    9575                      .dwattr $C$DW$992, DW_AT_accessibility(DW_ACCESS_public)
    9576              
    9577              $C$DW$993       .dwtag  DW_TAG_member
    9578                      .dwattr $C$DW$993, DW_AT_type(*$C$DW$T$75)
    9579                      .dwattr $C$DW$993, DW_AT_name("Iab_filt")
    9580                      .dwattr $C$DW$993, DW_AT_TI_symbol_name("_Iab_filt")
    9581                      .dwattr $C$DW$993, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    9582                      .dwattr $C$DW$993, DW_AT_accessibility(DW_ACCESS_public)
    9583              
TMS320C2000 Assembler PC v22.6.0 Fri Mar 10 12:50:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{01B77DF1-504C-473A-B828-ADD2AFD52A8B} PAGE  188

    9584              $C$DW$994       .dwtag  DW_TAG_member
    9585                      .dwattr $C$DW$994, DW_AT_type(*$C$DW$T$75)
    9586                      .dwattr $C$DW$994, DW_AT_name("Idq_in")
    9587                      .dwattr $C$DW$994, DW_AT_TI_symbol_name("_Idq_in")
    9588                      .dwattr $C$DW$994, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    9589                      .dwattr $C$DW$994, DW_AT_accessibility(DW_ACCESS_public)
    9590              
    9591              $C$DW$995       .dwtag  DW_TAG_member
    9592                      .dwattr $C$DW$995, DW_AT_type(*$C$DW$T$75)
    9593                      .dwattr $C$DW$995, DW_AT_name("Vab_in")
    9594                      .dwattr $C$DW$995, DW_AT_TI_symbol_name("_Vab_in")
    9595                      .dwattr $C$DW$995, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    9596                      .dwattr $C$DW$995, DW_AT_accessibility(DW_ACCESS_public)
    9597              
    9598              $C$DW$996       .dwtag  DW_TAG_member
    9599                      .dwattr $C$DW$996, DW_AT_type(*$C$DW$T$35)
    9600                      .dwattr $C$DW$996, DW_AT_name("spd_out")
    9601                      .dwattr $C$DW$996, DW_AT_TI_symbol_name("_spd_out")
    9602                      .dwattr $C$DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    9603                      .dwattr $C$DW$996, DW_AT_accessibility(DW_ACCESS_public)
    9604              
    9605              $C$DW$997       .dwtag  DW_TAG_member
    9606                      .dwattr $C$DW$997, DW_AT_type(*$C$DW$T$75)
    9607                      .dwattr $C$DW$997, DW_AT_name("Vab_out")
    9608                      .dwattr $C$DW$997, DW_AT_TI_symbol_name("_Vab_out")
    9609                      .dwattr $C$DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    9610                      .dwattr $C$DW$997, DW_AT_accessibility(DW_ACCESS_public)
    9611              
    9612              $C$DW$998       .dwtag  DW_TAG_member
    9613                      .dwattr $C$DW$998, DW_AT_type(*$C$DW$T$75)
    9614                      .dwattr $C$DW$998, DW_AT_name("Vdq_out")
    9615                      .dwattr $C$DW$998, DW_AT_TI_symbol_name("_Vdq_out")
    9616                      .dwattr $C$DW$998, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    9617                      .dwattr $C$DW$998, DW_AT_accessibility(DW_ACCESS_public)
    9618              
    9619              $C$DW$999       .dwtag  DW_TAG_member
    9620                      .dwattr $C$DW$999, DW_AT_type(*$C$DW$T$74)
    9621                      .dwattr $C$DW$999, DW_AT_name("Rhf")
    9622                      .dwattr $C$DW$999, DW_AT_TI_symbol_name("_Rhf")
    9623                      .dwattr $C$DW$999, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    9624                      .dwattr $C$DW$999, DW_AT_accessibility(DW_ACCESS_public)
    9625              
    9626              $C$DW$1000      .dwtag  DW_TAG_member
    9627                      .dwattr $C$DW$1000, DW_AT_type(*$C$DW$T$74)
    9628                      .dwattr $C$DW$1000, DW_AT_name("Lhf")
    9629                      .dwattr $C$DW$1000, DW_AT_TI_symbol_name("_Lhf")
    9630                      .dwattr $C$DW$1000, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    9631                      .dwattr $C$DW$1000, DW_AT_accessibility(DW_ACCESS_public)
    9632              
    9633              $C$DW$1001      .dwtag  DW_TAG_member
    9634                      .dwattr $C$DW$1001, DW_AT_type(*$C$DW$T$74)
    9635                      .dwattr $C$DW$1001, DW_AT_name("RoverL")
    9636                      .dwattr $C$DW$1001, DW_AT_TI_symbol_name("_RoverL")
    9637                      .dwattr $C$DW$1001, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    9638                      .dwattr $C$DW$1001, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Fri Mar 10 12:50:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{01B77DF1-504C-473A-B828-ADD2AFD52A8B} PAGE  189

    9639              
    9640              $C$DW$1002      .dwtag  DW_TAG_member
    9641                      .dwattr $C$DW$1002, DW_AT_type(*$C$DW$T$35)
    9642                      .dwattr $C$DW$1002, DW_AT_name("Kp_Id")
    9643                      .dwattr $C$DW$1002, DW_AT_TI_symbol_name("_Kp_Id")
    9644                      .dwattr $C$DW$1002, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    9645                      .dwattr $C$DW$1002, DW_AT_accessibility(DW_ACCESS_public)
    9646              
    9647              $C$DW$1003      .dwtag  DW_TAG_member
    9648                      .dwattr $C$DW$1003, DW_AT_type(*$C$DW$T$35)
    9649                      .dwattr $C$DW$1003, DW_AT_name("Kp_Iq")
    9650                      .dwattr $C$DW$1003, DW_AT_TI_symbol_name("_Kp_Iq")
    9651                      .dwattr $C$DW$1003, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    9652                      .dwattr $C$DW$1003, DW_AT_accessibility(DW_ACCESS_public)
    9653              
    9654              $C$DW$1004      .dwtag  DW_TAG_member
    9655                      .dwattr $C$DW$1004, DW_AT_type(*$C$DW$T$35)
    9656                      .dwattr $C$DW$1004, DW_AT_name("Kp_spd")
    9657                      .dwattr $C$DW$1004, DW_AT_TI_symbol_name("_Kp_spd")
    9658                      .dwattr $C$DW$1004, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    9659                      .dwattr $C$DW$1004, DW_AT_accessibility(DW_ACCESS_public)
    9660              
    9661              $C$DW$1005      .dwtag  DW_TAG_member
    9662                      .dwattr $C$DW$1005, DW_AT_type(*$C$DW$T$35)
    9663                      .dwattr $C$DW$1005, DW_AT_name("Ki_Id")
    9664                      .dwattr $C$DW$1005, DW_AT_TI_symbol_name("_Ki_Id")
    9665                      .dwattr $C$DW$1005, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    9666                      .dwattr $C$DW$1005, DW_AT_accessibility(DW_ACCESS_public)
    9667              
    9668              $C$DW$1006      .dwtag  DW_TAG_member
    9669                      .dwattr $C$DW$1006, DW_AT_type(*$C$DW$T$35)
    9670                      .dwattr $C$DW$1006, DW_AT_name("Ki_Iq")
    9671                      .dwattr $C$DW$1006, DW_AT_TI_symbol_name("_Ki_Iq")
    9672                      .dwattr $C$DW$1006, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    9673                      .dwattr $C$DW$1006, DW_AT_accessibility(DW_ACCESS_public)
    9674              
    9675              $C$DW$1007      .dwtag  DW_TAG_member
    9676                      .dwattr $C$DW$1007, DW_AT_type(*$C$DW$T$35)
    9677                      .dwattr $C$DW$1007, DW_AT_name("Ki_spd")
    9678                      .dwattr $C$DW$1007, DW_AT_TI_symbol_name("_Ki_spd")
    9679                      .dwattr $C$DW$1007, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    9680                      .dwattr $C$DW$1007, DW_AT_accessibility(DW_ACCESS_public)
    9681              
    9682              $C$DW$1008      .dwtag  DW_TAG_member
    9683                      .dwattr $C$DW$1008, DW_AT_type(*$C$DW$T$35)
    9684                      .dwattr $C$DW$1008, DW_AT_name("Kd_Id")
    9685                      .dwattr $C$DW$1008, DW_AT_TI_symbol_name("_Kd_Id")
    9686                      .dwattr $C$DW$1008, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    9687                      .dwattr $C$DW$1008, DW_AT_accessibility(DW_ACCESS_public)
    9688              
    9689              $C$DW$1009      .dwtag  DW_TAG_member
    9690                      .dwattr $C$DW$1009, DW_AT_type(*$C$DW$T$35)
    9691                      .dwattr $C$DW$1009, DW_AT_name("Kd_Iq")
    9692                      .dwattr $C$DW$1009, DW_AT_TI_symbol_name("_Kd_Iq")
    9693                      .dwattr $C$DW$1009, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
TMS320C2000 Assembler PC v22.6.0 Fri Mar 10 12:50:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{01B77DF1-504C-473A-B828-ADD2AFD52A8B} PAGE  190

    9694                      .dwattr $C$DW$1009, DW_AT_accessibility(DW_ACCESS_public)
    9695              
    9696              $C$DW$1010      .dwtag  DW_TAG_member
    9697                      .dwattr $C$DW$1010, DW_AT_type(*$C$DW$T$35)
    9698                      .dwattr $C$DW$1010, DW_AT_name("Kd_spd")
    9699                      .dwattr $C$DW$1010, DW_AT_TI_symbol_name("_Kd_spd")
    9700                      .dwattr $C$DW$1010, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    9701                      .dwattr $C$DW$1010, DW_AT_accessibility(DW_ACCESS_public)
    9702              
    9703              $C$DW$1011      .dwtag  DW_TAG_member
    9704                      .dwattr $C$DW$1011, DW_AT_type(*$C$DW$T$35)
    9705                      .dwattr $C$DW$1011, DW_AT_name("Ui_Id")
    9706                      .dwattr $C$DW$1011, DW_AT_TI_symbol_name("_Ui_Id")
    9707                      .dwattr $C$DW$1011, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    9708                      .dwattr $C$DW$1011, DW_AT_accessibility(DW_ACCESS_public)
    9709              
    9710              $C$DW$1012      .dwtag  DW_TAG_member
    9711                      .dwattr $C$DW$1012, DW_AT_type(*$C$DW$T$35)
    9712                      .dwattr $C$DW$1012, DW_AT_name("Ui_Iq")
    9713                      .dwattr $C$DW$1012, DW_AT_TI_symbol_name("_Ui_Iq")
    9714                      .dwattr $C$DW$1012, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    9715                      .dwattr $C$DW$1012, DW_AT_accessibility(DW_ACCESS_public)
    9716              
    9717              $C$DW$1013      .dwtag  DW_TAG_member
    9718                      .dwattr $C$DW$1013, DW_AT_type(*$C$DW$T$35)
    9719                      .dwattr $C$DW$1013, DW_AT_name("Ui_spd")
    9720                      .dwattr $C$DW$1013, DW_AT_TI_symbol_name("_Ui_spd")
    9721                      .dwattr $C$DW$1013, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    9722                      .dwattr $C$DW$1013, DW_AT_accessibility(DW_ACCESS_public)
    9723              
    9724              $C$DW$1014      .dwtag  DW_TAG_member
    9725                      .dwattr $C$DW$1014, DW_AT_type(*$C$DW$T$75)
    9726                      .dwattr $C$DW$1014, DW_AT_name("Idq_ref")
    9727                      .dwattr $C$DW$1014, DW_AT_TI_symbol_name("_Idq_ref")
    9728                      .dwattr $C$DW$1014, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    9729                      .dwattr $C$DW$1014, DW_AT_accessibility(DW_ACCESS_public)
    9730              
    9731              $C$DW$1015      .dwtag  DW_TAG_member
    9732                      .dwattr $C$DW$1015, DW_AT_type(*$C$DW$T$35)
    9733                      .dwattr $C$DW$1015, DW_AT_name("IdRated")
    9734                      .dwattr $C$DW$1015, DW_AT_TI_symbol_name("_IdRated")
    9735                      .dwattr $C$DW$1015, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    9736                      .dwattr $C$DW$1015, DW_AT_accessibility(DW_ACCESS_public)
    9737              
    9738              $C$DW$1016      .dwtag  DW_TAG_member
    9739                      .dwattr $C$DW$1016, DW_AT_type(*$C$DW$T$35)
    9740                      .dwattr $C$DW$1016, DW_AT_name("spd_ref")
    9741                      .dwattr $C$DW$1016, DW_AT_TI_symbol_name("_spd_ref")
    9742                      .dwattr $C$DW$1016, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    9743                      .dwattr $C$DW$1016, DW_AT_accessibility(DW_ACCESS_public)
    9744              
    9745              $C$DW$1017      .dwtag  DW_TAG_member
    9746                      .dwattr $C$DW$1017, DW_AT_type(*$C$DW$T$35)
    9747                      .dwattr $C$DW$1017, DW_AT_name("spd_max")
    9748                      .dwattr $C$DW$1017, DW_AT_TI_symbol_name("_spd_max")
TMS320C2000 Assembler PC v22.6.0 Fri Mar 10 12:50:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{01B77DF1-504C-473A-B828-ADD2AFD52A8B} PAGE  191

    9749                      .dwattr $C$DW$1017, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    9750                      .dwattr $C$DW$1017, DW_AT_accessibility(DW_ACCESS_public)
    9751              
    9752              $C$DW$1018      .dwtag  DW_TAG_member
    9753                      .dwattr $C$DW$1018, DW_AT_type(*$C$DW$T$73)
    9754                      .dwattr $C$DW$1018, DW_AT_name("counter_current")
    9755                      .dwattr $C$DW$1018, DW_AT_TI_symbol_name("_counter_current")
    9756                      .dwattr $C$DW$1018, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    9757                      .dwattr $C$DW$1018, DW_AT_accessibility(DW_ACCESS_public)
    9758              
    9759              $C$DW$1019      .dwtag  DW_TAG_member
    9760                      .dwattr $C$DW$1019, DW_AT_type(*$C$DW$T$73)
    9761                      .dwattr $C$DW$1019, DW_AT_name("counter_isr")
    9762                      .dwattr $C$DW$1019, DW_AT_TI_symbol_name("_counter_isr")
    9763                      .dwattr $C$DW$1019, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    9764                      .dwattr $C$DW$1019, DW_AT_accessibility(DW_ACCESS_public)
    9765              
    9766              $C$DW$1020      .dwtag  DW_TAG_member
    9767                      .dwattr $C$DW$1020, DW_AT_type(*$C$DW$T$73)
    9768                      .dwattr $C$DW$1020, DW_AT_name("counter_speed")
    9769                      .dwattr $C$DW$1020, DW_AT_TI_symbol_name("_counter_speed")
    9770                      .dwattr $C$DW$1020, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    9771                      .dwattr $C$DW$1020, DW_AT_accessibility(DW_ACCESS_public)
    9772              
    9773              $C$DW$1021      .dwtag  DW_TAG_member
    9774                      .dwattr $C$DW$1021, DW_AT_type(*$C$DW$T$73)
    9775                      .dwattr $C$DW$1021, DW_AT_name("counter_traj")
    9776                      .dwattr $C$DW$1021, DW_AT_TI_symbol_name("_counter_traj")
    9777                      .dwattr $C$DW$1021, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    9778                      .dwattr $C$DW$1021, DW_AT_accessibility(DW_ACCESS_public)
    9779              
    9780              $C$DW$1022      .dwtag  DW_TAG_member
    9781                      .dwattr $C$DW$1022, DW_AT_type(*$C$DW$T$76)
    9782                      .dwattr $C$DW$1022, DW_AT_name("flag_enableCtrl")
    9783                      .dwattr $C$DW$1022, DW_AT_TI_symbol_name("_flag_enableCtrl")
    9784                      .dwattr $C$DW$1022, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    9785                      .dwattr $C$DW$1022, DW_AT_accessibility(DW_ACCESS_public)
    9786              
    9787              $C$DW$1023      .dwtag  DW_TAG_member
    9788                      .dwattr $C$DW$1023, DW_AT_type(*$C$DW$T$76)
    9789                      .dwattr $C$DW$1023, DW_AT_name("flag_enableDcBusComp")
    9790                      .dwattr $C$DW$1023, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    9791                      .dwattr $C$DW$1023, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    9792                      .dwattr $C$DW$1023, DW_AT_accessibility(DW_ACCESS_public)
    9793              
    9794              $C$DW$1024      .dwtag  DW_TAG_member
    9795                      .dwattr $C$DW$1024, DW_AT_type(*$C$DW$T$76)
    9796                      .dwattr $C$DW$1024, DW_AT_name("flag_enablePowerWarp")
    9797                      .dwattr $C$DW$1024, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    9798                      .dwattr $C$DW$1024, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    9799                      .dwattr $C$DW$1024, DW_AT_accessibility(DW_ACCESS_public)
    9800              
    9801              $C$DW$1025      .dwtag  DW_TAG_member
    9802                      .dwattr $C$DW$1025, DW_AT_type(*$C$DW$T$76)
    9803                      .dwattr $C$DW$1025, DW_AT_name("flag_enableOffset")
TMS320C2000 Assembler PC v22.6.0 Fri Mar 10 12:50:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{01B77DF1-504C-473A-B828-ADD2AFD52A8B} PAGE  192

    9804                      .dwattr $C$DW$1025, DW_AT_TI_symbol_name("_flag_enableOffset")
    9805                      .dwattr $C$DW$1025, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    9806                      .dwattr $C$DW$1025, DW_AT_accessibility(DW_ACCESS_public)
    9807              
    9808              $C$DW$1026      .dwtag  DW_TAG_member
    9809                      .dwattr $C$DW$1026, DW_AT_type(*$C$DW$T$76)
    9810                      .dwattr $C$DW$1026, DW_AT_name("flag_enableSpeedCtrl")
    9811                      .dwattr $C$DW$1026, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    9812                      .dwattr $C$DW$1026, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    9813                      .dwattr $C$DW$1026, DW_AT_accessibility(DW_ACCESS_public)
    9814              
    9815              $C$DW$1027      .dwtag  DW_TAG_member
    9816                      .dwattr $C$DW$1027, DW_AT_type(*$C$DW$T$76)
    9817                      .dwattr $C$DW$1027, DW_AT_name("flag_enableUserMotorParams")
    9818                      .dwattr $C$DW$1027, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    9819                      .dwattr $C$DW$1027, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    9820                      .dwattr $C$DW$1027, DW_AT_accessibility(DW_ACCESS_public)
    9821              
    9822              $C$DW$1028      .dwtag  DW_TAG_member
    9823                      .dwattr $C$DW$1028, DW_AT_type(*$C$DW$T$75)
    9824                      .dwattr $C$DW$1028, DW_AT_name("Idq_offset_pu")
    9825                      .dwattr $C$DW$1028, DW_AT_TI_symbol_name("_Idq_offset_pu")
    9826                      .dwattr $C$DW$1028, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    9827                      .dwattr $C$DW$1028, DW_AT_accessibility(DW_ACCESS_public)
    9828              
    9829              $C$DW$1029      .dwtag  DW_TAG_member
    9830                      .dwattr $C$DW$1029, DW_AT_type(*$C$DW$T$75)
    9831                      .dwattr $C$DW$1029, DW_AT_name("Vdq_offset_pu")
    9832                      .dwattr $C$DW$1029, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    9833                      .dwattr $C$DW$1029, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    9834                      .dwattr $C$DW$1029, DW_AT_accessibility(DW_ACCESS_public)
    9835              
    9836              $C$DW$1030      .dwtag  DW_TAG_member
    9837                      .dwattr $C$DW$1030, DW_AT_type(*$C$DW$T$35)
    9838                      .dwattr $C$DW$1030, DW_AT_name("angle_pu")
    9839                      .dwattr $C$DW$1030, DW_AT_TI_symbol_name("_angle_pu")
    9840                      .dwattr $C$DW$1030, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    9841                      .dwattr $C$DW$1030, DW_AT_accessibility(DW_ACCESS_public)
    9842              
    9843              $C$DW$1031      .dwtag  DW_TAG_member
    9844                      .dwattr $C$DW$1031, DW_AT_type(*$C$DW$T$35)
    9845                      .dwattr $C$DW$1031, DW_AT_name("speed_ref_pu")
    9846                      .dwattr $C$DW$1031, DW_AT_TI_symbol_name("_speed_ref_pu")
    9847                      .dwattr $C$DW$1031, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    9848                      .dwattr $C$DW$1031, DW_AT_accessibility(DW_ACCESS_public)
    9849              
    9850              $C$DW$1032      .dwtag  DW_TAG_member
    9851                      .dwattr $C$DW$1032, DW_AT_type(*$C$DW$T$35)
    9852                      .dwattr $C$DW$1032, DW_AT_name("speed_fb_pu")
    9853                      .dwattr $C$DW$1032, DW_AT_TI_symbol_name("_speed_fb_pu")
    9854                      .dwattr $C$DW$1032, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    9855                      .dwattr $C$DW$1032, DW_AT_accessibility(DW_ACCESS_public)
    9856              
    9857              $C$DW$1033      .dwtag  DW_TAG_member
    9858                      .dwattr $C$DW$1033, DW_AT_type(*$C$DW$T$35)
TMS320C2000 Assembler PC v22.6.0 Fri Mar 10 12:50:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{01B77DF1-504C-473A-B828-ADD2AFD52A8B} PAGE  193

    9859                      .dwattr $C$DW$1033, DW_AT_name("speed_outMax_pu")
    9860                      .dwattr $C$DW$1033, DW_AT_TI_symbol_name("_speed_outMax_pu")
    9861                      .dwattr $C$DW$1033, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    9862                      .dwattr $C$DW$1033, DW_AT_accessibility(DW_ACCESS_public)
    9863              
    9864              $C$DW$1034      .dwtag  DW_TAG_member
    9865                      .dwattr $C$DW$1034, DW_AT_type(*$C$DW$T$76)
    9866                      .dwattr $C$DW$1034, DW_AT_name("flag_enableCurrentCtrl")
    9867                      .dwattr $C$DW$1034, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    9868                      .dwattr $C$DW$1034, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    9869                      .dwattr $C$DW$1034, DW_AT_accessibility(DW_ACCESS_public)
    9870              
    9871              $C$DW$1035      .dwtag  DW_TAG_member
    9872                      .dwattr $C$DW$1035, DW_AT_type(*$C$DW$T$35)
    9873                      .dwattr $C$DW$1035, DW_AT_name("torque_head_comm")
    9874                      .dwattr $C$DW$1035, DW_AT_TI_symbol_name("_torque_head_comm")
    9875                      .dwattr $C$DW$1035, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    9876                      .dwattr $C$DW$1035, DW_AT_accessibility(DW_ACCESS_public)
    9877              
    9878                      .dwendtag $C$DW$T$77
    9879              
    9880              $C$DW$T$248     .dwtag  DW_TAG_typedef
    9881                      .dwattr $C$DW$T$248, DW_AT_name("CTRL_Obj")
    9882                      .dwattr $C$DW$T$248, DW_AT_type(*$C$DW$T$77)
    9883                      .dwattr $C$DW$T$248, DW_AT_language(DW_LANG_C)
    9884              
    9885              $C$DW$T$249     .dwtag  DW_TAG_pointer_type
    9886                      .dwattr $C$DW$T$249, DW_AT_type(*$C$DW$T$248)
    9887                      .dwattr $C$DW$T$249, DW_AT_address_class(0x20)
    9888              
    9889              $C$DW$T$203     .dwtag  DW_TAG_pointer_type
    9890                      .dwattr $C$DW$T$203, DW_AT_type(*$C$DW$T$77)
    9891                      .dwattr $C$DW$T$203, DW_AT_address_class(0x20)
    9892              
    9893              $C$DW$T$204     .dwtag  DW_TAG_typedef
    9894                      .dwattr $C$DW$T$204, DW_AT_name("CTRL_Handle")
    9895                      .dwattr $C$DW$T$204, DW_AT_type(*$C$DW$T$203)
    9896                      .dwattr $C$DW$T$204, DW_AT_language(DW_LANG_C)
    9897              
    9898              $C$DW$1036      .dwtag  DW_TAG_TI_far_type
    9899                      .dwattr $C$DW$1036, DW_AT_type(*$C$DW$T$204)
    9900              
    9901              $C$DW$T$250     .dwtag  DW_TAG_const_type
    9902                      .dwattr $C$DW$T$250, DW_AT_type(*$C$DW$1036)
    9903              
    9904              
    9905              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    9906                      .dwattr $C$DW$T$80, DW_AT_name("_CTRL_Version_")
    9907                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x04)
    9908              $C$DW$1037      .dwtag  DW_TAG_member
    9909                      .dwattr $C$DW$1037, DW_AT_type(*$C$DW$T$26)
    9910                      .dwattr $C$DW$1037, DW_AT_name("rsvd")
    9911                      .dwattr $C$DW$1037, DW_AT_TI_symbol_name("_rsvd")
    9912                      .dwattr $C$DW$1037, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9913                      .dwattr $C$DW$1037, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Fri Mar 10 12:50:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{01B77DF1-504C-473A-B828-ADD2AFD52A8B} PAGE  194

    9914              
    9915              $C$DW$1038      .dwtag  DW_TAG_member
    9916                      .dwattr $C$DW$1038, DW_AT_type(*$C$DW$T$79)
    9917                      .dwattr $C$DW$1038, DW_AT_name("targetProc")
    9918                      .dwattr $C$DW$1038, DW_AT_TI_symbol_name("_targetProc")
    9919                      .dwattr $C$DW$1038, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9920                      .dwattr $C$DW$1038, DW_AT_accessibility(DW_ACCESS_public)
    9921              
    9922              $C$DW$1039      .dwtag  DW_TAG_member
    9923                      .dwattr $C$DW$1039, DW_AT_type(*$C$DW$T$26)
    9924                      .dwattr $C$DW$1039, DW_AT_name("major")
    9925                      .dwattr $C$DW$1039, DW_AT_TI_symbol_name("_major")
    9926                      .dwattr $C$DW$1039, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9927                      .dwattr $C$DW$1039, DW_AT_accessibility(DW_ACCESS_public)
    9928              
    9929              $C$DW$1040      .dwtag  DW_TAG_member
    9930                      .dwattr $C$DW$1040, DW_AT_type(*$C$DW$T$26)
    9931                      .dwattr $C$DW$1040, DW_AT_name("minor")
    9932                      .dwattr $C$DW$1040, DW_AT_TI_symbol_name("_minor")
    9933                      .dwattr $C$DW$1040, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9934                      .dwattr $C$DW$1040, DW_AT_accessibility(DW_ACCESS_public)
    9935              
    9936                      .dwendtag $C$DW$T$80
    9937              
    9938              $C$DW$T$42      .dwtag  DW_TAG_typedef
    9939                      .dwattr $C$DW$T$42, DW_AT_name("CTRL_Version")
    9940                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$80)
    9941                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    9942              
    9943              $C$DW$T$256     .dwtag  DW_TAG_pointer_type
    9944                      .dwattr $C$DW$T$256, DW_AT_type(*$C$DW$T$42)
    9945                      .dwattr $C$DW$T$256, DW_AT_address_class(0x20)
    9946              
    9947              
    9948              $C$DW$T$87      .dwtag  DW_TAG_structure_type
    9949                      .dwattr $C$DW$T$87, DW_AT_name("_DRV8301_Obj_")
    9950                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x08)
    9951              $C$DW$1041      .dwtag  DW_TAG_member
    9952                      .dwattr $C$DW$1041, DW_AT_type(*$C$DW$T$82)
    9953                      .dwattr $C$DW$1041, DW_AT_name("spiHandle")
    9954                      .dwattr $C$DW$1041, DW_AT_TI_symbol_name("_spiHandle")
    9955                      .dwattr $C$DW$1041, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9956                      .dwattr $C$DW$1041, DW_AT_accessibility(DW_ACCESS_public)
    9957              
    9958              $C$DW$1042      .dwtag  DW_TAG_member
    9959                      .dwattr $C$DW$1042, DW_AT_type(*$C$DW$T$84)
    9960                      .dwattr $C$DW$1042, DW_AT_name("gpioHandle")
    9961                      .dwattr $C$DW$1042, DW_AT_TI_symbol_name("_gpioHandle")
    9962                      .dwattr $C$DW$1042, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9963                      .dwattr $C$DW$1042, DW_AT_accessibility(DW_ACCESS_public)
    9964              
    9965              $C$DW$1043      .dwtag  DW_TAG_member
    9966                      .dwattr $C$DW$1043, DW_AT_type(*$C$DW$T$86)
    9967                      .dwattr $C$DW$1043, DW_AT_name("gpioNumber")
    9968                      .dwattr $C$DW$1043, DW_AT_TI_symbol_name("_gpioNumber")
TMS320C2000 Assembler PC v22.6.0 Fri Mar 10 12:50:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{01B77DF1-504C-473A-B828-ADD2AFD52A8B} PAGE  195

    9969                      .dwattr $C$DW$1043, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9970                      .dwattr $C$DW$1043, DW_AT_accessibility(DW_ACCESS_public)
    9971              
    9972              $C$DW$1044      .dwtag  DW_TAG_member
    9973                      .dwattr $C$DW$1044, DW_AT_type(*$C$DW$T$76)
    9974                      .dwattr $C$DW$1044, DW_AT_name("RxTimeOut")
    9975                      .dwattr $C$DW$1044, DW_AT_TI_symbol_name("_RxTimeOut")
    9976                      .dwattr $C$DW$1044, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9977                      .dwattr $C$DW$1044, DW_AT_accessibility(DW_ACCESS_public)
    9978              
    9979              $C$DW$1045      .dwtag  DW_TAG_member
    9980                      .dwattr $C$DW$1045, DW_AT_type(*$C$DW$T$76)
    9981                      .dwattr $C$DW$1045, DW_AT_name("enableTimeOut")
    9982                      .dwattr $C$DW$1045, DW_AT_TI_symbol_name("_enableTimeOut")
    9983                      .dwattr $C$DW$1045, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9984                      .dwattr $C$DW$1045, DW_AT_accessibility(DW_ACCESS_public)
    9985              
    9986                      .dwendtag $C$DW$T$87
    9987              
    9988              $C$DW$T$156     .dwtag  DW_TAG_typedef
    9989                      .dwattr $C$DW$T$156, DW_AT_name("DRV8301_Obj")
    9990                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$87)
    9991                      .dwattr $C$DW$T$156, DW_AT_language(DW_LANG_C)
    9992              
    9993              $C$DW$T$154     .dwtag  DW_TAG_pointer_type
    9994                      .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$87)
    9995                      .dwattr $C$DW$T$154, DW_AT_address_class(0x20)
    9996              
    9997              $C$DW$T$155     .dwtag  DW_TAG_typedef
    9998                      .dwattr $C$DW$T$155, DW_AT_name("DRV8301_Handle")
    9999                      .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$154)
   10000                      .dwattr $C$DW$T$155, DW_AT_language(DW_LANG_C)
   10001              
   10002              
   10003              $C$DW$T$98      .dwtag  DW_TAG_structure_type
   10004                      .dwattr $C$DW$T$98, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
   10005                      .dwattr $C$DW$T$98, DW_AT_byte_size(0x05)
   10006              $C$DW$1046      .dwtag  DW_TAG_member
   10007                      .dwattr $C$DW$1046, DW_AT_type(*$C$DW$T$89)
   10008                      .dwattr $C$DW$1046, DW_AT_name("DRV8301_CURRENT")
   10009                      .dwattr $C$DW$1046, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
   10010                      .dwattr $C$DW$1046, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10011                      .dwattr $C$DW$1046, DW_AT_accessibility(DW_ACCESS_public)
   10012              
   10013              $C$DW$1047      .dwtag  DW_TAG_member
   10014                      .dwattr $C$DW$1047, DW_AT_type(*$C$DW$T$91)
   10015                      .dwattr $C$DW$1047, DW_AT_name("DRV8301_RESET")
   10016                      .dwattr $C$DW$1047, DW_AT_TI_symbol_name("_DRV8301_RESET")
   10017                      .dwattr $C$DW$1047, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10018                      .dwattr $C$DW$1047, DW_AT_accessibility(DW_ACCESS_public)
   10019              
   10020              $C$DW$1048      .dwtag  DW_TAG_member
   10021                      .dwattr $C$DW$1048, DW_AT_type(*$C$DW$T$93)
   10022                      .dwattr $C$DW$1048, DW_AT_name("PWM_MODE")
   10023                      .dwattr $C$DW$1048, DW_AT_TI_symbol_name("_PWM_MODE")
TMS320C2000 Assembler PC v22.6.0 Fri Mar 10 12:50:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{01B77DF1-504C-473A-B828-ADD2AFD52A8B} PAGE  196

   10024                      .dwattr $C$DW$1048, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10025                      .dwattr $C$DW$1048, DW_AT_accessibility(DW_ACCESS_public)
   10026              
   10027              $C$DW$1049      .dwtag  DW_TAG_member
   10028                      .dwattr $C$DW$1049, DW_AT_type(*$C$DW$T$95)
   10029                      .dwattr $C$DW$1049, DW_AT_name("OC_MODE")
   10030                      .dwattr $C$DW$1049, DW_AT_TI_symbol_name("_OC_MODE")
   10031                      .dwattr $C$DW$1049, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10032                      .dwattr $C$DW$1049, DW_AT_accessibility(DW_ACCESS_public)
   10033              
   10034              $C$DW$1050      .dwtag  DW_TAG_member
   10035                      .dwattr $C$DW$1050, DW_AT_type(*$C$DW$T$97)
   10036                      .dwattr $C$DW$1050, DW_AT_name("OC_ADJ_SET")
   10037                      .dwattr $C$DW$1050, DW_AT_TI_symbol_name("_OC_ADJ_SET")
   10038                      .dwattr $C$DW$1050, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10039                      .dwattr $C$DW$1050, DW_AT_accessibility(DW_ACCESS_public)
   10040              
   10041                      .dwendtag $C$DW$T$98
   10042              
   10043              $C$DW$T$112     .dwtag  DW_TAG_typedef
   10044                      .dwattr $C$DW$T$112, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
   10045                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$98)
   10046                      .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
   10047              
   10048              
   10049              $C$DW$T$107     .dwtag  DW_TAG_structure_type
   10050                      .dwattr $C$DW$T$107, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
   10051                      .dwattr $C$DW$T$107, DW_AT_byte_size(0x04)
   10052              $C$DW$1051      .dwtag  DW_TAG_member
   10053                      .dwattr $C$DW$1051, DW_AT_type(*$C$DW$T$100)
   10054                      .dwattr $C$DW$1051, DW_AT_name("OCTW_SET")
   10055                      .dwattr $C$DW$1051, DW_AT_TI_symbol_name("_OCTW_SET")
   10056                      .dwattr $C$DW$1051, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10057                      .dwattr $C$DW$1051, DW_AT_accessibility(DW_ACCESS_public)
   10058              
   10059              $C$DW$1052      .dwtag  DW_TAG_member
   10060                      .dwattr $C$DW$1052, DW_AT_type(*$C$DW$T$102)
   10061                      .dwattr $C$DW$1052, DW_AT_name("GAIN")
   10062                      .dwattr $C$DW$1052, DW_AT_TI_symbol_name("_GAIN")
   10063                      .dwattr $C$DW$1052, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10064                      .dwattr $C$DW$1052, DW_AT_accessibility(DW_ACCESS_public)
   10065              
   10066              $C$DW$1053      .dwtag  DW_TAG_member
   10067                      .dwattr $C$DW$1053, DW_AT_type(*$C$DW$T$104)
   10068                      .dwattr $C$DW$1053, DW_AT_name("DC_CAL_CH1p2")
   10069                      .dwattr $C$DW$1053, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
   10070                      .dwattr $C$DW$1053, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10071                      .dwattr $C$DW$1053, DW_AT_accessibility(DW_ACCESS_public)
   10072              
   10073              $C$DW$1054      .dwtag  DW_TAG_member
   10074                      .dwattr $C$DW$1054, DW_AT_type(*$C$DW$T$106)
   10075                      .dwattr $C$DW$1054, DW_AT_name("OC_TOFF")
   10076                      .dwattr $C$DW$1054, DW_AT_TI_symbol_name("_OC_TOFF")
   10077                      .dwattr $C$DW$1054, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10078                      .dwattr $C$DW$1054, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Fri Mar 10 12:50:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{01B77DF1-504C-473A-B828-ADD2AFD52A8B} PAGE  197

   10079              
   10080                      .dwendtag $C$DW$T$107
   10081              
   10082              $C$DW$T$113     .dwtag  DW_TAG_typedef
   10083                      .dwattr $C$DW$T$113, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
   10084                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$107)
   10085                      .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
   10086              
   10087              
   10088              $C$DW$T$108     .dwtag  DW_TAG_structure_type
   10089                      .dwattr $C$DW$T$108, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
   10090                      .dwattr $C$DW$T$108, DW_AT_byte_size(0x0b)
   10091              $C$DW$1055      .dwtag  DW_TAG_member
   10092                      .dwattr $C$DW$1055, DW_AT_type(*$C$DW$T$76)
   10093                      .dwattr $C$DW$1055, DW_AT_name("FAULT")
   10094                      .dwattr $C$DW$1055, DW_AT_TI_symbol_name("_FAULT")
   10095                      .dwattr $C$DW$1055, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10096                      .dwattr $C$DW$1055, DW_AT_accessibility(DW_ACCESS_public)
   10097              
   10098              $C$DW$1056      .dwtag  DW_TAG_member
   10099                      .dwattr $C$DW$1056, DW_AT_type(*$C$DW$T$76)
   10100                      .dwattr $C$DW$1056, DW_AT_name("GVDD_UV")
   10101                      .dwattr $C$DW$1056, DW_AT_TI_symbol_name("_GVDD_UV")
   10102                      .dwattr $C$DW$1056, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10103                      .dwattr $C$DW$1056, DW_AT_accessibility(DW_ACCESS_public)
   10104              
   10105              $C$DW$1057      .dwtag  DW_TAG_member
   10106                      .dwattr $C$DW$1057, DW_AT_type(*$C$DW$T$76)
   10107                      .dwattr $C$DW$1057, DW_AT_name("PVDD_UV")
   10108                      .dwattr $C$DW$1057, DW_AT_TI_symbol_name("_PVDD_UV")
   10109                      .dwattr $C$DW$1057, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10110                      .dwattr $C$DW$1057, DW_AT_accessibility(DW_ACCESS_public)
   10111              
   10112              $C$DW$1058      .dwtag  DW_TAG_member
   10113                      .dwattr $C$DW$1058, DW_AT_type(*$C$DW$T$76)
   10114                      .dwattr $C$DW$1058, DW_AT_name("OTSD")
   10115                      .dwattr $C$DW$1058, DW_AT_TI_symbol_name("_OTSD")
   10116                      .dwattr $C$DW$1058, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10117                      .dwattr $C$DW$1058, DW_AT_accessibility(DW_ACCESS_public)
   10118              
   10119              $C$DW$1059      .dwtag  DW_TAG_member
   10120                      .dwattr $C$DW$1059, DW_AT_type(*$C$DW$T$76)
   10121                      .dwattr $C$DW$1059, DW_AT_name("OTW")
   10122                      .dwattr $C$DW$1059, DW_AT_TI_symbol_name("_OTW")
   10123                      .dwattr $C$DW$1059, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10124                      .dwattr $C$DW$1059, DW_AT_accessibility(DW_ACCESS_public)
   10125              
   10126              $C$DW$1060      .dwtag  DW_TAG_member
   10127                      .dwattr $C$DW$1060, DW_AT_type(*$C$DW$T$76)
   10128                      .dwattr $C$DW$1060, DW_AT_name("FETHA_OC")
   10129                      .dwattr $C$DW$1060, DW_AT_TI_symbol_name("_FETHA_OC")
   10130                      .dwattr $C$DW$1060, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10131                      .dwattr $C$DW$1060, DW_AT_accessibility(DW_ACCESS_public)
   10132              
   10133              $C$DW$1061      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Fri Mar 10 12:50:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{01B77DF1-504C-473A-B828-ADD2AFD52A8B} PAGE  198

   10134                      .dwattr $C$DW$1061, DW_AT_type(*$C$DW$T$76)
   10135                      .dwattr $C$DW$1061, DW_AT_name("FETLA_OC")
   10136                      .dwattr $C$DW$1061, DW_AT_TI_symbol_name("_FETLA_OC")
   10137                      .dwattr $C$DW$1061, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10138                      .dwattr $C$DW$1061, DW_AT_accessibility(DW_ACCESS_public)
   10139              
   10140              $C$DW$1062      .dwtag  DW_TAG_member
   10141                      .dwattr $C$DW$1062, DW_AT_type(*$C$DW$T$76)
   10142                      .dwattr $C$DW$1062, DW_AT_name("FETHB_OC")
   10143                      .dwattr $C$DW$1062, DW_AT_TI_symbol_name("_FETHB_OC")
   10144                      .dwattr $C$DW$1062, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   10145                      .dwattr $C$DW$1062, DW_AT_accessibility(DW_ACCESS_public)
   10146              
   10147              $C$DW$1063      .dwtag  DW_TAG_member
   10148                      .dwattr $C$DW$1063, DW_AT_type(*$C$DW$T$76)
   10149                      .dwattr $C$DW$1063, DW_AT_name("FETLB_OC")
   10150                      .dwattr $C$DW$1063, DW_AT_TI_symbol_name("_FETLB_OC")
   10151                      .dwattr $C$DW$1063, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
