TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:53:58 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2613842F-80FE-4F6A-B731-29B9211AC451} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.0.LTS *
       3              ;* Date/Time created: Fri Apr 14 02:53:57 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/GIANT/GIANT_TI_instaspin/TI_instaspin_indoor_smart_trainer/motorware
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.0.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\GIANT\GIANT_TI_instaspin\TI_instaspin_indoor_smart_trainer\motor
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    8612              $C$DW$891       .dwtag  DW_TAG_enumerator
    8613                      .dwattr $C$DW$891, DW_AT_name("PIE_GroupNumber_7")
    8614                      .dwattr $C$DW$891, DW_AT_const_value(0x06)
    8615              
    8616              $C$DW$892       .dwtag  DW_TAG_enumerator
    8617                      .dwattr $C$DW$892, DW_AT_name("PIE_GroupNumber_8")
    8618                      .dwattr $C$DW$892, DW_AT_const_value(0x07)
    8619              
    8620              $C$DW$893       .dwtag  DW_TAG_enumerator
    8621                      .dwattr $C$DW$893, DW_AT_name("PIE_GroupNumber_9")
    8622                      .dwattr $C$DW$893, DW_AT_const_value(0x08)
    8623              
    8624              $C$DW$894       .dwtag  DW_TAG_enumerator
    8625                      .dwattr $C$DW$894, DW_AT_name("PIE_GroupNumber_10")
    8626                      .dwattr $C$DW$894, DW_AT_const_value(0x09)
    8627              
    8628              $C$DW$895       .dwtag  DW_TAG_enumerator
    8629                      .dwattr $C$DW$895, DW_AT_name("PIE_GroupNumber_11")
    8630                      .dwattr $C$DW$895, DW_AT_const_value(0x0a)
    8631              
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:53:58 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2613842F-80FE-4F6A-B731-29B9211AC451} PAGE  170

    8632              $C$DW$896       .dwtag  DW_TAG_enumerator
    8633                      .dwattr $C$DW$896, DW_AT_name("PIE_GroupNumber_12")
    8634                      .dwattr $C$DW$896, DW_AT_const_value(0x0b)
    8635              
    8636                      .dwendtag $C$DW$T$224
    8637              
    8638              $C$DW$T$225     .dwtag  DW_TAG_typedef
    8639                      .dwattr $C$DW$T$225, DW_AT_name("PIE_GroupNumber_e")
    8640                      .dwattr $C$DW$T$225, DW_AT_type(*$C$DW$T$224)
    8641                      .dwattr $C$DW$T$225, DW_AT_language(DW_LANG_C)
    8642              
    8643              
    8644              $C$DW$T$227     .dwtag  DW_TAG_enumeration_type
    8645                      .dwattr $C$DW$T$227, DW_AT_byte_size(0x01)
    8646              $C$DW$897       .dwtag  DW_TAG_enumerator
    8647                      .dwattr $C$DW$897, DW_AT_name("CTRL_Type_PID_spd")
    8648                      .dwattr $C$DW$897, DW_AT_const_value(0x00)
    8649              
    8650              $C$DW$898       .dwtag  DW_TAG_enumerator
    8651                      .dwattr $C$DW$898, DW_AT_name("CTRL_Type_PID_Id")
    8652                      .dwattr $C$DW$898, DW_AT_const_value(0x01)
    8653              
    8654              $C$DW$899       .dwtag  DW_TAG_enumerator
    8655                      .dwattr $C$DW$899, DW_AT_name("CTRL_Type_PID_Iq")
    8656                      .dwattr $C$DW$899, DW_AT_const_value(0x02)
    8657              
    8658                      .dwendtag $C$DW$T$227
    8659              
    8660              $C$DW$T$228     .dwtag  DW_TAG_typedef
    8661                      .dwattr $C$DW$T$228, DW_AT_name("CTRL_Type_e")
    8662                      .dwattr $C$DW$T$228, DW_AT_type(*$C$DW$T$227)
    8663                      .dwattr $C$DW$T$228, DW_AT_language(DW_LANG_C)
    8664              
    8665              
    8666              $C$DW$T$230     .dwtag  DW_TAG_enumeration_type
    8667                      .dwattr $C$DW$T$230, DW_AT_byte_size(0x01)
    8668              $C$DW$900       .dwtag  DW_TAG_enumerator
    8669                      .dwattr $C$DW$900, DW_AT_name("HAL_SensorType_Current")
    8670                      .dwattr $C$DW$900, DW_AT_const_value(0x00)
    8671              
    8672              $C$DW$901       .dwtag  DW_TAG_enumerator
    8673                      .dwattr $C$DW$901, DW_AT_name("HAL_SensorType_Voltage")
    8674                      .dwattr $C$DW$901, DW_AT_const_value(0x01)
    8675              
    8676                      .dwendtag $C$DW$T$230
    8677              
    8678              $C$DW$T$231     .dwtag  DW_TAG_typedef
    8679                      .dwattr $C$DW$T$231, DW_AT_name("HAL_SensorType_e")
    8680                      .dwattr $C$DW$T$231, DW_AT_type(*$C$DW$T$230)
    8681                      .dwattr $C$DW$T$231, DW_AT_language(DW_LANG_C)
    8682              
    8683              
    8684              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    8685                      .dwattr $C$DW$T$19, DW_AT_name("IPD_HFI_Obj")
    8686                      .dwattr $C$DW$T$19, DW_AT_declaration
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:53:58 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2613842F-80FE-4F6A-B731-29B9211AC451} PAGE  171

    8687                      .dwendtag $C$DW$T$19
    8688              
    8689              $C$DW$T$233     .dwtag  DW_TAG_pointer_type
    8690                      .dwattr $C$DW$T$233, DW_AT_type(*$C$DW$T$19)
    8691                      .dwattr $C$DW$T$233, DW_AT_address_class(0x20)
    8692              
    8693              $C$DW$T$234     .dwtag  DW_TAG_typedef
    8694                      .dwattr $C$DW$T$234, DW_AT_name("IPD_HFI_Handle")
    8695                      .dwattr $C$DW$T$234, DW_AT_type(*$C$DW$T$233)
    8696                      .dwattr $C$DW$T$234, DW_AT_language(DW_LANG_C)
    8697              
    8698              
    8699              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    8700                      .dwattr $C$DW$T$34, DW_AT_name("_ADC_Obj_")
    8701                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x6650)
    8702              $C$DW$902       .dwtag  DW_TAG_member
    8703                      .dwattr $C$DW$902, DW_AT_type(*$C$DW$T$28)
    8704                      .dwattr $C$DW$902, DW_AT_name("ADCRESULT")
    8705                      .dwattr $C$DW$902, DW_AT_TI_symbol_name("_ADCRESULT")
    8706                      .dwattr $C$DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8707                      .dwattr $C$DW$902, DW_AT_accessibility(DW_ACCESS_public)
    8708              
    8709              $C$DW$903       .dwtag  DW_TAG_member
    8710                      .dwattr $C$DW$903, DW_AT_type(*$C$DW$T$29)
    8711                      .dwattr $C$DW$903, DW_AT_name("resvd_1")
    8712                      .dwattr $C$DW$903, DW_AT_TI_symbol_name("_resvd_1")
    8713                      .dwattr $C$DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8714                      .dwattr $C$DW$903, DW_AT_accessibility(DW_ACCESS_public)
    8715              
    8716              $C$DW$904       .dwtag  DW_TAG_member
    8717                      .dwattr $C$DW$904, DW_AT_type(*$C$DW$T$27)
    8718                      .dwattr $C$DW$904, DW_AT_name("ADCCTL1")
    8719                      .dwattr $C$DW$904, DW_AT_TI_symbol_name("_ADCCTL1")
    8720                      .dwattr $C$DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    8721                      .dwattr $C$DW$904, DW_AT_accessibility(DW_ACCESS_public)
    8722              
    8723              $C$DW$905       .dwtag  DW_TAG_member
    8724                      .dwattr $C$DW$905, DW_AT_type(*$C$DW$T$27)
    8725                      .dwattr $C$DW$905, DW_AT_name("ADCCTL2")
    8726                      .dwattr $C$DW$905, DW_AT_TI_symbol_name("_ADCCTL2")
    8727                      .dwattr $C$DW$905, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    8728                      .dwattr $C$DW$905, DW_AT_accessibility(DW_ACCESS_public)
    8729              
    8730              $C$DW$906       .dwtag  DW_TAG_member
    8731                      .dwattr $C$DW$906, DW_AT_type(*$C$DW$T$30)
    8732                      .dwattr $C$DW$906, DW_AT_name("rsvd_2")
    8733                      .dwattr $C$DW$906, DW_AT_TI_symbol_name("_rsvd_2")
    8734                      .dwattr $C$DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    8735                      .dwattr $C$DW$906, DW_AT_accessibility(DW_ACCESS_public)
    8736              
    8737              $C$DW$907       .dwtag  DW_TAG_member
    8738                      .dwattr $C$DW$907, DW_AT_type(*$C$DW$T$27)
    8739                      .dwattr $C$DW$907, DW_AT_name("ADCINTFLG")
    8740                      .dwattr $C$DW$907, DW_AT_TI_symbol_name("_ADCINTFLG")
    8741                      .dwattr $C$DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:53:58 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2613842F-80FE-4F6A-B731-29B9211AC451} PAGE  172

    8742                      .dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
    8743              
    8744              $C$DW$908       .dwtag  DW_TAG_member
    8745                      .dwattr $C$DW$908, DW_AT_type(*$C$DW$T$27)
    8746                      .dwattr $C$DW$908, DW_AT_name("ADCINTFLGCLR")
    8747                      .dwattr $C$DW$908, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    8748                      .dwattr $C$DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    8749                      .dwattr $C$DW$908, DW_AT_accessibility(DW_ACCESS_public)
    8750              
    8751              $C$DW$909       .dwtag  DW_TAG_member
    8752                      .dwattr $C$DW$909, DW_AT_type(*$C$DW$T$27)
    8753                      .dwattr $C$DW$909, DW_AT_name("ADCINTOVF")
    8754                      .dwattr $C$DW$909, DW_AT_TI_symbol_name("_ADCINTOVF")
    8755                      .dwattr $C$DW$909, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    8756                      .dwattr $C$DW$909, DW_AT_accessibility(DW_ACCESS_public)
    8757              
    8758              $C$DW$910       .dwtag  DW_TAG_member
    8759                      .dwattr $C$DW$910, DW_AT_type(*$C$DW$T$27)
    8760                      .dwattr $C$DW$910, DW_AT_name("ADCINTOVFCLR")
    8761                      .dwattr $C$DW$910, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    8762                      .dwattr $C$DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    8763                      .dwattr $C$DW$910, DW_AT_accessibility(DW_ACCESS_public)
    8764              
    8765              $C$DW$911       .dwtag  DW_TAG_member
    8766                      .dwattr $C$DW$911, DW_AT_type(*$C$DW$T$31)
    8767                      .dwattr $C$DW$911, DW_AT_name("INTSELxNy")
    8768                      .dwattr $C$DW$911, DW_AT_TI_symbol_name("_INTSELxNy")
    8769                      .dwattr $C$DW$911, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    8770                      .dwattr $C$DW$911, DW_AT_accessibility(DW_ACCESS_public)
    8771              
    8772              $C$DW$912       .dwtag  DW_TAG_member
    8773                      .dwattr $C$DW$912, DW_AT_type(*$C$DW$T$32)
    8774                      .dwattr $C$DW$912, DW_AT_name("rsvd_3")
    8775                      .dwattr $C$DW$912, DW_AT_TI_symbol_name("_rsvd_3")
    8776                      .dwattr $C$DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    8777                      .dwattr $C$DW$912, DW_AT_accessibility(DW_ACCESS_public)
    8778              
    8779              $C$DW$913       .dwtag  DW_TAG_member
    8780                      .dwattr $C$DW$913, DW_AT_type(*$C$DW$T$27)
    8781                      .dwattr $C$DW$913, DW_AT_name("SOCPRICTRL")
    8782                      .dwattr $C$DW$913, DW_AT_TI_symbol_name("_SOCPRICTRL")
    8783                      .dwattr $C$DW$913, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    8784                      .dwattr $C$DW$913, DW_AT_accessibility(DW_ACCESS_public)
    8785              
    8786              $C$DW$914       .dwtag  DW_TAG_member
    8787                      .dwattr $C$DW$914, DW_AT_type(*$C$DW$T$27)
    8788                      .dwattr $C$DW$914, DW_AT_name("rsvd_4")
    8789                      .dwattr $C$DW$914, DW_AT_TI_symbol_name("_rsvd_4")
    8790                      .dwattr $C$DW$914, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    8791                      .dwattr $C$DW$914, DW_AT_accessibility(DW_ACCESS_public)
    8792              
    8793              $C$DW$915       .dwtag  DW_TAG_member
    8794                      .dwattr $C$DW$915, DW_AT_type(*$C$DW$T$27)
    8795                      .dwattr $C$DW$915, DW_AT_name("ADCSAMPLEMODE")
    8796                      .dwattr $C$DW$915, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:53:58 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2613842F-80FE-4F6A-B731-29B9211AC451} PAGE  173

    8797                      .dwattr $C$DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    8798                      .dwattr $C$DW$915, DW_AT_accessibility(DW_ACCESS_public)
    8799              
    8800              $C$DW$916       .dwtag  DW_TAG_member
    8801                      .dwattr $C$DW$916, DW_AT_type(*$C$DW$T$27)
    8802                      .dwattr $C$DW$916, DW_AT_name("rsvd_5")
    8803                      .dwattr $C$DW$916, DW_AT_TI_symbol_name("_rsvd_5")
    8804                      .dwattr $C$DW$916, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    8805                      .dwattr $C$DW$916, DW_AT_accessibility(DW_ACCESS_public)
    8806              
    8807              $C$DW$917       .dwtag  DW_TAG_member
    8808                      .dwattr $C$DW$917, DW_AT_type(*$C$DW$T$27)
    8809                      .dwattr $C$DW$917, DW_AT_name("ADCINTSOCSEL1")
    8810                      .dwattr $C$DW$917, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    8811                      .dwattr $C$DW$917, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    8812                      .dwattr $C$DW$917, DW_AT_accessibility(DW_ACCESS_public)
    8813              
    8814              $C$DW$918       .dwtag  DW_TAG_member
    8815                      .dwattr $C$DW$918, DW_AT_type(*$C$DW$T$27)
    8816                      .dwattr $C$DW$918, DW_AT_name("ADCINTSOCSEL2")
    8817                      .dwattr $C$DW$918, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    8818                      .dwattr $C$DW$918, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    8819                      .dwattr $C$DW$918, DW_AT_accessibility(DW_ACCESS_public)
    8820              
    8821              $C$DW$919       .dwtag  DW_TAG_member
    8822                      .dwattr $C$DW$919, DW_AT_type(*$C$DW$T$30)
    8823                      .dwattr $C$DW$919, DW_AT_name("rsvd_6")
    8824                      .dwattr $C$DW$919, DW_AT_TI_symbol_name("_rsvd_6")
    8825                      .dwattr $C$DW$919, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    8826                      .dwattr $C$DW$919, DW_AT_accessibility(DW_ACCESS_public)
    8827              
    8828              $C$DW$920       .dwtag  DW_TAG_member
    8829                      .dwattr $C$DW$920, DW_AT_type(*$C$DW$T$27)
    8830                      .dwattr $C$DW$920, DW_AT_name("ADCSOCFLG1")
    8831                      .dwattr $C$DW$920, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    8832                      .dwattr $C$DW$920, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    8833                      .dwattr $C$DW$920, DW_AT_accessibility(DW_ACCESS_public)
    8834              
    8835              $C$DW$921       .dwtag  DW_TAG_member
    8836                      .dwattr $C$DW$921, DW_AT_type(*$C$DW$T$27)
    8837                      .dwattr $C$DW$921, DW_AT_name("rsvd_7")
    8838                      .dwattr $C$DW$921, DW_AT_TI_symbol_name("_rsvd_7")
    8839                      .dwattr $C$DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    8840                      .dwattr $C$DW$921, DW_AT_accessibility(DW_ACCESS_public)
    8841              
    8842              $C$DW$922       .dwtag  DW_TAG_member
    8843                      .dwattr $C$DW$922, DW_AT_type(*$C$DW$T$27)
    8844                      .dwattr $C$DW$922, DW_AT_name("ADCSOCFRC1")
    8845                      .dwattr $C$DW$922, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    8846                      .dwattr $C$DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    8847                      .dwattr $C$DW$922, DW_AT_accessibility(DW_ACCESS_public)
    8848              
    8849              $C$DW$923       .dwtag  DW_TAG_member
    8850                      .dwattr $C$DW$923, DW_AT_type(*$C$DW$T$27)
    8851                      .dwattr $C$DW$923, DW_AT_name("rsvd_8")
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:53:58 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2613842F-80FE-4F6A-B731-29B9211AC451} PAGE  174

    8852                      .dwattr $C$DW$923, DW_AT_TI_symbol_name("_rsvd_8")
    8853                      .dwattr $C$DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    8854                      .dwattr $C$DW$923, DW_AT_accessibility(DW_ACCESS_public)
    8855              
    8856              $C$DW$924       .dwtag  DW_TAG_member
    8857                      .dwattr $C$DW$924, DW_AT_type(*$C$DW$T$27)
    8858                      .dwattr $C$DW$924, DW_AT_name("ADCSOCOVF1")
    8859                      .dwattr $C$DW$924, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    8860                      .dwattr $C$DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    8861                      .dwattr $C$DW$924, DW_AT_accessibility(DW_ACCESS_public)
    8862              
    8863              $C$DW$925       .dwtag  DW_TAG_member
    8864                      .dwattr $C$DW$925, DW_AT_type(*$C$DW$T$27)
    8865                      .dwattr $C$DW$925, DW_AT_name("rsvd_9")
    8866                      .dwattr $C$DW$925, DW_AT_TI_symbol_name("_rsvd_9")
    8867                      .dwattr $C$DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    8868                      .dwattr $C$DW$925, DW_AT_accessibility(DW_ACCESS_public)
    8869              
    8870              $C$DW$926       .dwtag  DW_TAG_member
    8871                      .dwattr $C$DW$926, DW_AT_type(*$C$DW$T$27)
    8872                      .dwattr $C$DW$926, DW_AT_name("ADCSOCOVFCLR1")
    8873                      .dwattr $C$DW$926, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    8874                      .dwattr $C$DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    8875                      .dwattr $C$DW$926, DW_AT_accessibility(DW_ACCESS_public)
    8876              
    8877              $C$DW$927       .dwtag  DW_TAG_member
    8878                      .dwattr $C$DW$927, DW_AT_type(*$C$DW$T$27)
    8879                      .dwattr $C$DW$927, DW_AT_name("rsvd_10")
    8880                      .dwattr $C$DW$927, DW_AT_TI_symbol_name("_rsvd_10")
    8881                      .dwattr $C$DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    8882                      .dwattr $C$DW$927, DW_AT_accessibility(DW_ACCESS_public)
    8883              
    8884              $C$DW$928       .dwtag  DW_TAG_member
    8885                      .dwattr $C$DW$928, DW_AT_type(*$C$DW$T$28)
    8886                      .dwattr $C$DW$928, DW_AT_name("ADCSOCxCTL")
    8887                      .dwattr $C$DW$928, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    8888                      .dwattr $C$DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    8889                      .dwattr $C$DW$928, DW_AT_accessibility(DW_ACCESS_public)
    8890              
    8891              $C$DW$929       .dwtag  DW_TAG_member
    8892                      .dwattr $C$DW$929, DW_AT_type(*$C$DW$T$28)
    8893                      .dwattr $C$DW$929, DW_AT_name("rsvd_11")
    8894                      .dwattr $C$DW$929, DW_AT_TI_symbol_name("_rsvd_11")
    8895                      .dwattr $C$DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    8896                      .dwattr $C$DW$929, DW_AT_accessibility(DW_ACCESS_public)
    8897              
    8898              $C$DW$930       .dwtag  DW_TAG_member
    8899                      .dwattr $C$DW$930, DW_AT_type(*$C$DW$T$27)
    8900                      .dwattr $C$DW$930, DW_AT_name("ADCREFTRIM")
    8901                      .dwattr $C$DW$930, DW_AT_TI_symbol_name("_ADCREFTRIM")
    8902                      .dwattr $C$DW$930, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    8903                      .dwattr $C$DW$930, DW_AT_accessibility(DW_ACCESS_public)
    8904              
    8905              $C$DW$931       .dwtag  DW_TAG_member
    8906                      .dwattr $C$DW$931, DW_AT_type(*$C$DW$T$27)
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:53:58 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2613842F-80FE-4F6A-B731-29B9211AC451} PAGE  175

    8907                      .dwattr $C$DW$931, DW_AT_name("ADCOFFTRIM")
    8908                      .dwattr $C$DW$931, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    8909                      .dwattr $C$DW$931, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    8910                      .dwattr $C$DW$931, DW_AT_accessibility(DW_ACCESS_public)
    8911              
    8912              $C$DW$932       .dwtag  DW_TAG_member
    8913                      .dwattr $C$DW$932, DW_AT_type(*$C$DW$T$33)
    8914                      .dwattr $C$DW$932, DW_AT_name("resvd_12")
    8915                      .dwattr $C$DW$932, DW_AT_TI_symbol_name("_resvd_12")
    8916                      .dwattr $C$DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    8917                      .dwattr $C$DW$932, DW_AT_accessibility(DW_ACCESS_public)
    8918              
    8919              $C$DW$933       .dwtag  DW_TAG_member
    8920                      .dwattr $C$DW$933, DW_AT_type(*$C$DW$T$27)
    8921                      .dwattr $C$DW$933, DW_AT_name("ADCREV")
    8922                      .dwattr $C$DW$933, DW_AT_TI_symbol_name("_ADCREV")
    8923                      .dwattr $C$DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    8924                      .dwattr $C$DW$933, DW_AT_accessibility(DW_ACCESS_public)
    8925              
    8926                      .dwendtag $C$DW$T$34
    8927              
    8928              $C$DW$T$238     .dwtag  DW_TAG_typedef
    8929                      .dwattr $C$DW$T$238, DW_AT_name("ADC_Obj")
    8930                      .dwattr $C$DW$T$238, DW_AT_type(*$C$DW$T$34)
    8931                      .dwattr $C$DW$T$238, DW_AT_language(DW_LANG_C)
    8932              
    8933              $C$DW$T$124     .dwtag  DW_TAG_pointer_type
    8934                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$34)
    8935                      .dwattr $C$DW$T$124, DW_AT_address_class(0x20)
    8936              
    8937              $C$DW$T$125     .dwtag  DW_TAG_typedef
    8938                      .dwattr $C$DW$T$125, DW_AT_name("ADC_Handle")
    8939                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
    8940                      .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    8941              
    8942              
    8943              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    8944                      .dwattr $C$DW$T$20, DW_AT_name("_AFSEL_Obj_")
    8945                      .dwattr $C$DW$T$20, DW_AT_declaration
    8946                      .dwendtag $C$DW$T$20
    8947              
    8948              $C$DW$T$239     .dwtag  DW_TAG_pointer_type
    8949                      .dwattr $C$DW$T$239, DW_AT_type(*$C$DW$T$20)
    8950                      .dwattr $C$DW$T$239, DW_AT_address_class(0x20)
    8951              
    8952              $C$DW$T$240     .dwtag  DW_TAG_typedef
    8953                      .dwattr $C$DW$T$240, DW_AT_name("AFSEL_Handle")
    8954                      .dwattr $C$DW$T$240, DW_AT_type(*$C$DW$T$239)
    8955                      .dwattr $C$DW$T$240, DW_AT_language(DW_LANG_C)
    8956              
    8957              
    8958              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    8959                      .dwattr $C$DW$T$38, DW_AT_name("_CLARKE_Obj_")
    8960                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x06)
    8961              $C$DW$934       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:53:58 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2613842F-80FE-4F6A-B731-29B9211AC451} PAGE  176

    8962                      .dwattr $C$DW$934, DW_AT_type(*$C$DW$T$35)
    8963                      .dwattr $C$DW$934, DW_AT_name("alpha_sf")
    8964                      .dwattr $C$DW$934, DW_AT_TI_symbol_name("_alpha_sf")
    8965                      .dwattr $C$DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8966                      .dwattr $C$DW$934, DW_AT_accessibility(DW_ACCESS_public)
    8967              
    8968              $C$DW$935       .dwtag  DW_TAG_member
    8969                      .dwattr $C$DW$935, DW_AT_type(*$C$DW$T$35)
    8970                      .dwattr $C$DW$935, DW_AT_name("beta_sf")
    8971                      .dwattr $C$DW$935, DW_AT_TI_symbol_name("_beta_sf")
    8972                      .dwattr $C$DW$935, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8973                      .dwattr $C$DW$935, DW_AT_accessibility(DW_ACCESS_public)
    8974              
    8975              $C$DW$936       .dwtag  DW_TAG_member
    8976                      .dwattr $C$DW$936, DW_AT_type(*$C$DW$T$37)
    8977                      .dwattr $C$DW$936, DW_AT_name("numSensors")
    8978                      .dwattr $C$DW$936, DW_AT_TI_symbol_name("_numSensors")
    8979                      .dwattr $C$DW$936, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8980                      .dwattr $C$DW$936, DW_AT_accessibility(DW_ACCESS_public)
    8981              
    8982                      .dwendtag $C$DW$T$38
    8983              
    8984              $C$DW$T$49      .dwtag  DW_TAG_typedef
    8985                      .dwattr $C$DW$T$49, DW_AT_name("CLARKE_Obj")
    8986                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$38)
    8987                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    8988              
    8989              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    8990                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$38)
    8991                      .dwattr $C$DW$T$47, DW_AT_address_class(0x20)
    8992              
    8993              $C$DW$T$48      .dwtag  DW_TAG_typedef
    8994                      .dwattr $C$DW$T$48, DW_AT_name("CLARKE_Handle")
    8995                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    8996                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    8997              
    8998              $C$DW$937       .dwtag  DW_TAG_TI_far_type
    8999                      .dwattr $C$DW$937, DW_AT_type(*$C$DW$T$48)
    9000              
    9001              $C$DW$T$244     .dwtag  DW_TAG_const_type
    9002                      .dwattr $C$DW$T$244, DW_AT_type(*$C$DW$937)
    9003              
    9004              
    9005              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    9006                      .dwattr $C$DW$T$40, DW_AT_name("_CLK_Obj_")
    9007                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x11)
    9008              $C$DW$938       .dwtag  DW_TAG_member
    9009                      .dwattr $C$DW$938, DW_AT_type(*$C$DW$T$27)
    9010                      .dwattr $C$DW$938, DW_AT_name("XCLK")
    9011                      .dwattr $C$DW$938, DW_AT_TI_symbol_name("_XCLK")
    9012                      .dwattr $C$DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9013                      .dwattr $C$DW$938, DW_AT_accessibility(DW_ACCESS_public)
    9014              
    9015              $C$DW$939       .dwtag  DW_TAG_member
    9016                      .dwattr $C$DW$939, DW_AT_type(*$C$DW$T$27)
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:53:58 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2613842F-80FE-4F6A-B731-29B9211AC451} PAGE  177

    9017                      .dwattr $C$DW$939, DW_AT_name("rsvd_1")
    9018                      .dwattr $C$DW$939, DW_AT_TI_symbol_name("_rsvd_1")
    9019                      .dwattr $C$DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9020                      .dwattr $C$DW$939, DW_AT_accessibility(DW_ACCESS_public)
    9021              
    9022              $C$DW$940       .dwtag  DW_TAG_member
    9023                      .dwattr $C$DW$940, DW_AT_type(*$C$DW$T$27)
    9024                      .dwattr $C$DW$940, DW_AT_name("CLKCTL")
    9025                      .dwattr $C$DW$940, DW_AT_TI_symbol_name("_CLKCTL")
    9026                      .dwattr $C$DW$940, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9027                      .dwattr $C$DW$940, DW_AT_accessibility(DW_ACCESS_public)
    9028              
    9029              $C$DW$941       .dwtag  DW_TAG_member
    9030                      .dwattr $C$DW$941, DW_AT_type(*$C$DW$T$39)
    9031                      .dwattr $C$DW$941, DW_AT_name("rsvd_2")
    9032                      .dwattr $C$DW$941, DW_AT_TI_symbol_name("_rsvd_2")
    9033                      .dwattr $C$DW$941, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9034                      .dwattr $C$DW$941, DW_AT_accessibility(DW_ACCESS_public)
    9035              
    9036              $C$DW$942       .dwtag  DW_TAG_member
    9037                      .dwattr $C$DW$942, DW_AT_type(*$C$DW$T$27)
    9038                      .dwattr $C$DW$942, DW_AT_name("LOSPCP")
    9039                      .dwattr $C$DW$942, DW_AT_TI_symbol_name("_LOSPCP")
    9040                      .dwattr $C$DW$942, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    9041                      .dwattr $C$DW$942, DW_AT_accessibility(DW_ACCESS_public)
    9042              
    9043              $C$DW$943       .dwtag  DW_TAG_member
    9044                      .dwattr $C$DW$943, DW_AT_type(*$C$DW$T$27)
    9045                      .dwattr $C$DW$943, DW_AT_name("PCLKCR0")
    9046                      .dwattr $C$DW$943, DW_AT_TI_symbol_name("_PCLKCR0")
    9047                      .dwattr $C$DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9048                      .dwattr $C$DW$943, DW_AT_accessibility(DW_ACCESS_public)
    9049              
    9050              $C$DW$944       .dwtag  DW_TAG_member
    9051                      .dwattr $C$DW$944, DW_AT_type(*$C$DW$T$27)
    9052                      .dwattr $C$DW$944, DW_AT_name("PCLKCR1")
    9053                      .dwattr $C$DW$944, DW_AT_TI_symbol_name("_PCLKCR1")
    9054                      .dwattr $C$DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    9055                      .dwattr $C$DW$944, DW_AT_accessibility(DW_ACCESS_public)
    9056              
    9057              $C$DW$945       .dwtag  DW_TAG_member
    9058                      .dwattr $C$DW$945, DW_AT_type(*$C$DW$T$30)
    9059                      .dwattr $C$DW$945, DW_AT_name("rsvd_3")
    9060                      .dwattr $C$DW$945, DW_AT_TI_symbol_name("_rsvd_3")
    9061                      .dwattr $C$DW$945, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9062                      .dwattr $C$DW$945, DW_AT_accessibility(DW_ACCESS_public)
    9063              
    9064              $C$DW$946       .dwtag  DW_TAG_member
    9065                      .dwattr $C$DW$946, DW_AT_type(*$C$DW$T$27)
    9066                      .dwattr $C$DW$946, DW_AT_name("PCLKCR3")
    9067                      .dwattr $C$DW$946, DW_AT_TI_symbol_name("_PCLKCR3")
    9068                      .dwattr $C$DW$946, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9069                      .dwattr $C$DW$946, DW_AT_accessibility(DW_ACCESS_public)
    9070              
    9071                      .dwendtag $C$DW$T$40
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:53:58 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2613842F-80FE-4F6A-B731-29B9211AC451} PAGE  178

    9072              
    9073              $C$DW$T$126     .dwtag  DW_TAG_pointer_type
    9074                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$40)
    9075                      .dwattr $C$DW$T$126, DW_AT_address_class(0x20)
    9076              
    9077              $C$DW$T$127     .dwtag  DW_TAG_typedef
    9078                      .dwattr $C$DW$T$127, DW_AT_name("CLK_Handle")
    9079                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
    9080                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    9081              
    9082              
    9083              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    9084                      .dwattr $C$DW$T$41, DW_AT_name("_CPU_Obj_")
    9085                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    9086              $C$DW$947       .dwtag  DW_TAG_member
    9087                      .dwattr $C$DW$947, DW_AT_type(*$C$DW$T$37)
    9088                      .dwattr $C$DW$947, DW_AT_name("tmp")
    9089                      .dwattr $C$DW$947, DW_AT_TI_symbol_name("_tmp")
    9090                      .dwattr $C$DW$947, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9091                      .dwattr $C$DW$947, DW_AT_accessibility(DW_ACCESS_public)
    9092              
    9093                      .dwendtag $C$DW$T$41
    9094              
    9095              $C$DW$T$128     .dwtag  DW_TAG_pointer_type
    9096                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$41)
    9097                      .dwattr $C$DW$T$128, DW_AT_address_class(0x20)
    9098              
    9099              $C$DW$T$129     .dwtag  DW_TAG_typedef
    9100                      .dwattr $C$DW$T$129, DW_AT_name("CPU_Handle")
    9101                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$128)
    9102                      .dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
    9103              
    9104              
    9105              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    9106                      .dwattr $C$DW$T$77, DW_AT_name("_CTRL_Obj_")
    9107                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x10a)
    9108              $C$DW$948       .dwtag  DW_TAG_member
    9109                      .dwattr $C$DW$948, DW_AT_type(*$C$DW$T$42)
    9110                      .dwattr $C$DW$948, DW_AT_name("version")
    9111                      .dwattr $C$DW$948, DW_AT_TI_symbol_name("_version")
    9112                      .dwattr $C$DW$948, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9113                      .dwattr $C$DW$948, DW_AT_accessibility(DW_ACCESS_public)
    9114              
    9115              $C$DW$949       .dwtag  DW_TAG_member
    9116                      .dwattr $C$DW$949, DW_AT_type(*$C$DW$T$44)
    9117                      .dwattr $C$DW$949, DW_AT_name("state")
    9118                      .dwattr $C$DW$949, DW_AT_TI_symbol_name("_state")
    9119                      .dwattr $C$DW$949, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9120                      .dwattr $C$DW$949, DW_AT_accessibility(DW_ACCESS_public)
    9121              
    9122              $C$DW$950       .dwtag  DW_TAG_member
    9123                      .dwattr $C$DW$950, DW_AT_type(*$C$DW$T$44)
    9124                      .dwattr $C$DW$950, DW_AT_name("prevState")
    9125                      .dwattr $C$DW$950, DW_AT_TI_symbol_name("_prevState")
    9126                      .dwattr $C$DW$950, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:53:58 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2613842F-80FE-4F6A-B731-29B9211AC451} PAGE  179

    9127                      .dwattr $C$DW$950, DW_AT_accessibility(DW_ACCESS_public)
    9128              
    9129              $C$DW$951       .dwtag  DW_TAG_member
    9130                      .dwattr $C$DW$951, DW_AT_type(*$C$DW$T$46)
    9131                      .dwattr $C$DW$951, DW_AT_name("errorCode")
    9132                      .dwattr $C$DW$951, DW_AT_TI_symbol_name("_errorCode")
    9133                      .dwattr $C$DW$951, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9134                      .dwattr $C$DW$951, DW_AT_accessibility(DW_ACCESS_public)
    9135              
    9136              $C$DW$952       .dwtag  DW_TAG_member
    9137                      .dwattr $C$DW$952, DW_AT_type(*$C$DW$T$48)
    9138                      .dwattr $C$DW$952, DW_AT_name("clarkeHandle_I")
    9139                      .dwattr $C$DW$952, DW_AT_TI_symbol_name("_clarkeHandle_I")
    9140                      .dwattr $C$DW$952, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9141                      .dwattr $C$DW$952, DW_AT_accessibility(DW_ACCESS_public)
    9142              
    9143              $C$DW$953       .dwtag  DW_TAG_member
    9144                      .dwattr $C$DW$953, DW_AT_type(*$C$DW$T$49)
    9145                      .dwattr $C$DW$953, DW_AT_name("clarke_I")
    9146                      .dwattr $C$DW$953, DW_AT_TI_symbol_name("_clarke_I")
    9147                      .dwattr $C$DW$953, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9148                      .dwattr $C$DW$953, DW_AT_accessibility(DW_ACCESS_public)
    9149              
    9150              $C$DW$954       .dwtag  DW_TAG_member
    9151                      .dwattr $C$DW$954, DW_AT_type(*$C$DW$T$48)
    9152                      .dwattr $C$DW$954, DW_AT_name("clarkeHandle_V")
    9153                      .dwattr $C$DW$954, DW_AT_TI_symbol_name("_clarkeHandle_V")
    9154                      .dwattr $C$DW$954, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9155                      .dwattr $C$DW$954, DW_AT_accessibility(DW_ACCESS_public)
    9156              
    9157              $C$DW$955       .dwtag  DW_TAG_member
    9158                      .dwattr $C$DW$955, DW_AT_type(*$C$DW$T$49)
    9159                      .dwattr $C$DW$955, DW_AT_name("clarke_V")
    9160                      .dwattr $C$DW$955, DW_AT_TI_symbol_name("_clarke_V")
    9161                      .dwattr $C$DW$955, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9162                      .dwattr $C$DW$955, DW_AT_accessibility(DW_ACCESS_public)
    9163              
    9164              $C$DW$956       .dwtag  DW_TAG_member
    9165                      .dwattr $C$DW$956, DW_AT_type(*$C$DW$T$51)
    9166                      .dwattr $C$DW$956, DW_AT_name("estHandle")
    9167                      .dwattr $C$DW$956, DW_AT_TI_symbol_name("_estHandle")
    9168                      .dwattr $C$DW$956, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9169                      .dwattr $C$DW$956, DW_AT_accessibility(DW_ACCESS_public)
    9170              
    9171              $C$DW$957       .dwtag  DW_TAG_member
    9172                      .dwattr $C$DW$957, DW_AT_type(*$C$DW$T$53)
    9173                      .dwattr $C$DW$957, DW_AT_name("parkHandle")
    9174                      .dwattr $C$DW$957, DW_AT_TI_symbol_name("_parkHandle")
    9175                      .dwattr $C$DW$957, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9176                      .dwattr $C$DW$957, DW_AT_accessibility(DW_ACCESS_public)
    9177              
    9178              $C$DW$958       .dwtag  DW_TAG_member
    9179                      .dwattr $C$DW$958, DW_AT_type(*$C$DW$T$54)
    9180                      .dwattr $C$DW$958, DW_AT_name("park")
    9181                      .dwattr $C$DW$958, DW_AT_TI_symbol_name("_park")
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:53:58 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2613842F-80FE-4F6A-B731-29B9211AC451} PAGE  180

    9182                      .dwattr $C$DW$958, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9183                      .dwattr $C$DW$958, DW_AT_accessibility(DW_ACCESS_public)
    9184              
    9185              $C$DW$959       .dwtag  DW_TAG_member
    9186                      .dwattr $C$DW$959, DW_AT_type(*$C$DW$T$56)
    9187                      .dwattr $C$DW$959, DW_AT_name("pidHandle_Id")
    9188                      .dwattr $C$DW$959, DW_AT_TI_symbol_name("_pidHandle_Id")
    9189                      .dwattr $C$DW$959, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    9190                      .dwattr $C$DW$959, DW_AT_accessibility(DW_ACCESS_public)
    9191              
    9192              $C$DW$960       .dwtag  DW_TAG_member
    9193                      .dwattr $C$DW$960, DW_AT_type(*$C$DW$T$57)
    9194                      .dwattr $C$DW$960, DW_AT_name("pid_Id")
    9195                      .dwattr $C$DW$960, DW_AT_TI_symbol_name("_pid_Id")
    9196                      .dwattr $C$DW$960, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    9197                      .dwattr $C$DW$960, DW_AT_accessibility(DW_ACCESS_public)
    9198              
    9199              $C$DW$961       .dwtag  DW_TAG_member
    9200                      .dwattr $C$DW$961, DW_AT_type(*$C$DW$T$56)
    9201                      .dwattr $C$DW$961, DW_AT_name("pidHandle_Iq")
    9202                      .dwattr $C$DW$961, DW_AT_TI_symbol_name("_pidHandle_Iq")
    9203                      .dwattr $C$DW$961, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    9204                      .dwattr $C$DW$961, DW_AT_accessibility(DW_ACCESS_public)
    9205              
    9206              $C$DW$962       .dwtag  DW_TAG_member
    9207                      .dwattr $C$DW$962, DW_AT_type(*$C$DW$T$57)
    9208                      .dwattr $C$DW$962, DW_AT_name("pid_Iq")
    9209                      .dwattr $C$DW$962, DW_AT_TI_symbol_name("_pid_Iq")
    9210                      .dwattr $C$DW$962, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    9211                      .dwattr $C$DW$962, DW_AT_accessibility(DW_ACCESS_public)
    9212              
    9213              $C$DW$963       .dwtag  DW_TAG_member
    9214                      .dwattr $C$DW$963, DW_AT_type(*$C$DW$T$56)
    9215                      .dwattr $C$DW$963, DW_AT_name("pidHandle_spd")
    9216                      .dwattr $C$DW$963, DW_AT_TI_symbol_name("_pidHandle_spd")
    9217                      .dwattr $C$DW$963, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    9218                      .dwattr $C$DW$963, DW_AT_accessibility(DW_ACCESS_public)
    9219              
    9220              $C$DW$964       .dwtag  DW_TAG_member
    9221                      .dwattr $C$DW$964, DW_AT_type(*$C$DW$T$57)
    9222                      .dwattr $C$DW$964, DW_AT_name("pid_spd")
    9223                      .dwattr $C$DW$964, DW_AT_TI_symbol_name("_pid_spd")
    9224                      .dwattr $C$DW$964, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    9225                      .dwattr $C$DW$964, DW_AT_accessibility(DW_ACCESS_public)
    9226              
    9227              $C$DW$965       .dwtag  DW_TAG_member
    9228                      .dwattr $C$DW$965, DW_AT_type(*$C$DW$T$59)
    9229                      .dwattr $C$DW$965, DW_AT_name("iparkHandle")
    9230                      .dwattr $C$DW$965, DW_AT_TI_symbol_name("_iparkHandle")
    9231                      .dwattr $C$DW$965, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    9232                      .dwattr $C$DW$965, DW_AT_accessibility(DW_ACCESS_public)
    9233              
    9234              $C$DW$966       .dwtag  DW_TAG_member
    9235                      .dwattr $C$DW$966, DW_AT_type(*$C$DW$T$60)
    9236                      .dwattr $C$DW$966, DW_AT_name("ipark")
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:53:58 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2613842F-80FE-4F6A-B731-29B9211AC451} PAGE  181

    9237                      .dwattr $C$DW$966, DW_AT_TI_symbol_name("_ipark")
    9238                      .dwattr $C$DW$966, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    9239                      .dwattr $C$DW$966, DW_AT_accessibility(DW_ACCESS_public)
    9240              
    9241              $C$DW$967       .dwtag  DW_TAG_member
    9242                      .dwattr $C$DW$967, DW_AT_type(*$C$DW$T$62)
    9243                      .dwattr $C$DW$967, DW_AT_name("svgenHandle")
    9244                      .dwattr $C$DW$967, DW_AT_TI_symbol_name("_svgenHandle")
    9245                      .dwattr $C$DW$967, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    9246                      .dwattr $C$DW$967, DW_AT_accessibility(DW_ACCESS_public)
    9247              
    9248              $C$DW$968       .dwtag  DW_TAG_member
    9249                      .dwattr $C$DW$968, DW_AT_type(*$C$DW$T$63)
    9250                      .dwattr $C$DW$968, DW_AT_name("svgen")
    9251                      .dwattr $C$DW$968, DW_AT_TI_symbol_name("_svgen")
    9252                      .dwattr $C$DW$968, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    9253                      .dwattr $C$DW$968, DW_AT_accessibility(DW_ACCESS_public)
    9254              
    9255              $C$DW$969       .dwtag  DW_TAG_member
    9256                      .dwattr $C$DW$969, DW_AT_type(*$C$DW$T$65)
    9257                      .dwattr $C$DW$969, DW_AT_name("trajHandle_Id")
    9258                      .dwattr $C$DW$969, DW_AT_TI_symbol_name("_trajHandle_Id")
    9259                      .dwattr $C$DW$969, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    9260                      .dwattr $C$DW$969, DW_AT_accessibility(DW_ACCESS_public)
    9261              
    9262              $C$DW$970       .dwtag  DW_TAG_member
    9263                      .dwattr $C$DW$970, DW_AT_type(*$C$DW$T$66)
    9264                      .dwattr $C$DW$970, DW_AT_name("traj_Id")
    9265                      .dwattr $C$DW$970, DW_AT_TI_symbol_name("_traj_Id")
    9266                      .dwattr $C$DW$970, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    9267                      .dwattr $C$DW$970, DW_AT_accessibility(DW_ACCESS_public)
    9268              
    9269              $C$DW$971       .dwtag  DW_TAG_member
    9270                      .dwattr $C$DW$971, DW_AT_type(*$C$DW$T$65)
    9271                      .dwattr $C$DW$971, DW_AT_name("trajHandle_spd")
    9272                      .dwattr $C$DW$971, DW_AT_TI_symbol_name("_trajHandle_spd")
    9273                      .dwattr $C$DW$971, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    9274                      .dwattr $C$DW$971, DW_AT_accessibility(DW_ACCESS_public)
    9275              
    9276              $C$DW$972       .dwtag  DW_TAG_member
    9277                      .dwattr $C$DW$972, DW_AT_type(*$C$DW$T$66)
    9278                      .dwattr $C$DW$972, DW_AT_name("traj_spd")
    9279                      .dwattr $C$DW$972, DW_AT_TI_symbol_name("_traj_spd")
    9280                      .dwattr $C$DW$972, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    9281                      .dwattr $C$DW$972, DW_AT_accessibility(DW_ACCESS_public)
    9282              
    9283              $C$DW$973       .dwtag  DW_TAG_member
    9284                      .dwattr $C$DW$973, DW_AT_type(*$C$DW$T$65)
    9285                      .dwattr $C$DW$973, DW_AT_name("trajHandle_spdMax")
    9286                      .dwattr $C$DW$973, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    9287                      .dwattr $C$DW$973, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    9288                      .dwattr $C$DW$973, DW_AT_accessibility(DW_ACCESS_public)
    9289              
    9290              $C$DW$974       .dwtag  DW_TAG_member
    9291                      .dwattr $C$DW$974, DW_AT_type(*$C$DW$T$66)
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:53:58 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2613842F-80FE-4F6A-B731-29B9211AC451} PAGE  182

    9292                      .dwattr $C$DW$974, DW_AT_name("traj_spdMax")
    9293                      .dwattr $C$DW$974, DW_AT_TI_symbol_name("_traj_spdMax")
    9294                      .dwattr $C$DW$974, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    9295                      .dwattr $C$DW$974, DW_AT_accessibility(DW_ACCESS_public)
    9296              
    9297              $C$DW$975       .dwtag  DW_TAG_member
    9298                      .dwattr $C$DW$975, DW_AT_type(*$C$DW$T$67)
    9299                      .dwattr $C$DW$975, DW_AT_name("motorParams")
    9300                      .dwattr $C$DW$975, DW_AT_TI_symbol_name("_motorParams")
    9301                      .dwattr $C$DW$975, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    9302                      .dwattr $C$DW$975, DW_AT_accessibility(DW_ACCESS_public)
    9303              
    9304              $C$DW$976       .dwtag  DW_TAG_member
    9305                      .dwattr $C$DW$976, DW_AT_type(*$C$DW$T$71)
    9306                      .dwattr $C$DW$976, DW_AT_name("waitTimes")
    9307                      .dwattr $C$DW$976, DW_AT_TI_symbol_name("_waitTimes")
    9308                      .dwattr $C$DW$976, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    9309                      .dwattr $C$DW$976, DW_AT_accessibility(DW_ACCESS_public)
    9310              
    9311              $C$DW$977       .dwtag  DW_TAG_member
    9312                      .dwattr $C$DW$977, DW_AT_type(*$C$DW$T$70)
    9313                      .dwattr $C$DW$977, DW_AT_name("counter_state")
    9314                      .dwattr $C$DW$977, DW_AT_TI_symbol_name("_counter_state")
    9315                      .dwattr $C$DW$977, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    9316                      .dwattr $C$DW$977, DW_AT_accessibility(DW_ACCESS_public)
    9317              
    9318              $C$DW$978       .dwtag  DW_TAG_member
    9319                      .dwattr $C$DW$978, DW_AT_type(*$C$DW$T$73)
    9320                      .dwattr $C$DW$978, DW_AT_name("numIsrTicksPerCtrlTick")
    9321                      .dwattr $C$DW$978, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    9322                      .dwattr $C$DW$978, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    9323                      .dwattr $C$DW$978, DW_AT_accessibility(DW_ACCESS_public)
    9324              
    9325              $C$DW$979       .dwtag  DW_TAG_member
    9326                      .dwattr $C$DW$979, DW_AT_type(*$C$DW$T$73)
    9327                      .dwattr $C$DW$979, DW_AT_name("numCtrlTicksPerCurrentTick")
    9328                      .dwattr $C$DW$979, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    9329                      .dwattr $C$DW$979, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    9330                      .dwattr $C$DW$979, DW_AT_accessibility(DW_ACCESS_public)
    9331              
    9332              $C$DW$980       .dwtag  DW_TAG_member
    9333                      .dwattr $C$DW$980, DW_AT_type(*$C$DW$T$73)
    9334                      .dwattr $C$DW$980, DW_AT_name("numCtrlTicksPerSpeedTick")
    9335                      .dwattr $C$DW$980, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    9336                      .dwattr $C$DW$980, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    9337                      .dwattr $C$DW$980, DW_AT_accessibility(DW_ACCESS_public)
    9338              
    9339              $C$DW$981       .dwtag  DW_TAG_member
    9340                      .dwattr $C$DW$981, DW_AT_type(*$C$DW$T$73)
    9341                      .dwattr $C$DW$981, DW_AT_name("numCtrlTicksPerTrajTick")
    9342                      .dwattr $C$DW$981, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    9343                      .dwattr $C$DW$981, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    9344                      .dwattr $C$DW$981, DW_AT_accessibility(DW_ACCESS_public)
    9345              
    9346              $C$DW$982       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:53:58 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2613842F-80FE-4F6A-B731-29B9211AC451} PAGE  183

    9347                      .dwattr $C$DW$982, DW_AT_type(*$C$DW$T$70)
    9348                      .dwattr $C$DW$982, DW_AT_name("ctrlFreq_Hz")
    9349                      .dwattr $C$DW$982, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    9350                      .dwattr $C$DW$982, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    9351                      .dwattr $C$DW$982, DW_AT_accessibility(DW_ACCESS_public)
    9352              
    9353              $C$DW$983       .dwtag  DW_TAG_member
    9354                      .dwattr $C$DW$983, DW_AT_type(*$C$DW$T$70)
    9355                      .dwattr $C$DW$983, DW_AT_name("trajFreq_Hz")
    9356                      .dwattr $C$DW$983, DW_AT_TI_symbol_name("_trajFreq_Hz")
    9357                      .dwattr $C$DW$983, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    9358                      .dwattr $C$DW$983, DW_AT_accessibility(DW_ACCESS_public)
    9359              
    9360              $C$DW$984       .dwtag  DW_TAG_member
    9361                      .dwattr $C$DW$984, DW_AT_type(*$C$DW$T$35)
    9362                      .dwattr $C$DW$984, DW_AT_name("trajPeriod_sec")
    9363                      .dwattr $C$DW$984, DW_AT_TI_symbol_name("_trajPeriod_sec")
    9364                      .dwattr $C$DW$984, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    9365                      .dwattr $C$DW$984, DW_AT_accessibility(DW_ACCESS_public)
    9366              
    9367              $C$DW$985       .dwtag  DW_TAG_member
    9368                      .dwattr $C$DW$985, DW_AT_type(*$C$DW$T$74)
    9369                      .dwattr $C$DW$985, DW_AT_name("ctrlPeriod_sec")
    9370                      .dwattr $C$DW$985, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    9371                      .dwattr $C$DW$985, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    9372                      .dwattr $C$DW$985, DW_AT_accessibility(DW_ACCESS_public)
    9373              
    9374              $C$DW$986       .dwtag  DW_TAG_member
    9375                      .dwattr $C$DW$986, DW_AT_type(*$C$DW$T$35)
    9376                      .dwattr $C$DW$986, DW_AT_name("maxVsMag_pu")
    9377                      .dwattr $C$DW$986, DW_AT_TI_symbol_name("_maxVsMag_pu")
    9378                      .dwattr $C$DW$986, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    9379                      .dwattr $C$DW$986, DW_AT_accessibility(DW_ACCESS_public)
    9380              
    9381              $C$DW$987       .dwtag  DW_TAG_member
    9382                      .dwattr $C$DW$987, DW_AT_type(*$C$DW$T$75)
    9383                      .dwattr $C$DW$987, DW_AT_name("Iab_in")
    9384                      .dwattr $C$DW$987, DW_AT_TI_symbol_name("_Iab_in")
    9385                      .dwattr $C$DW$987, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    9386                      .dwattr $C$DW$987, DW_AT_accessibility(DW_ACCESS_public)
    9387              
    9388              $C$DW$988       .dwtag  DW_TAG_member
    9389                      .dwattr $C$DW$988, DW_AT_type(*$C$DW$T$75)
    9390                      .dwattr $C$DW$988, DW_AT_name("Iab_filt")
    9391                      .dwattr $C$DW$988, DW_AT_TI_symbol_name("_Iab_filt")
    9392                      .dwattr $C$DW$988, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    9393                      .dwattr $C$DW$988, DW_AT_accessibility(DW_ACCESS_public)
    9394              
    9395              $C$DW$989       .dwtag  DW_TAG_member
    9396                      .dwattr $C$DW$989, DW_AT_type(*$C$DW$T$75)
    9397                      .dwattr $C$DW$989, DW_AT_name("Idq_in")
    9398                      .dwattr $C$DW$989, DW_AT_TI_symbol_name("_Idq_in")
    9399                      .dwattr $C$DW$989, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    9400                      .dwattr $C$DW$989, DW_AT_accessibility(DW_ACCESS_public)
    9401              
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:53:58 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2613842F-80FE-4F6A-B731-29B9211AC451} PAGE  184

    9402              $C$DW$990       .dwtag  DW_TAG_member
    9403                      .dwattr $C$DW$990, DW_AT_type(*$C$DW$T$75)
    9404                      .dwattr $C$DW$990, DW_AT_name("Vab_in")
    9405                      .dwattr $C$DW$990, DW_AT_TI_symbol_name("_Vab_in")
    9406                      .dwattr $C$DW$990, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    9407                      .dwattr $C$DW$990, DW_AT_accessibility(DW_ACCESS_public)
    9408              
    9409              $C$DW$991       .dwtag  DW_TAG_member
    9410                      .dwattr $C$DW$991, DW_AT_type(*$C$DW$T$35)
    9411                      .dwattr $C$DW$991, DW_AT_name("spd_out")
    9412                      .dwattr $C$DW$991, DW_AT_TI_symbol_name("_spd_out")
    9413                      .dwattr $C$DW$991, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    9414                      .dwattr $C$DW$991, DW_AT_accessibility(DW_ACCESS_public)
    9415              
    9416              $C$DW$992       .dwtag  DW_TAG_member
    9417                      .dwattr $C$DW$992, DW_AT_type(*$C$DW$T$75)
    9418                      .dwattr $C$DW$992, DW_AT_name("Vab_out")
    9419                      .dwattr $C$DW$992, DW_AT_TI_symbol_name("_Vab_out")
    9420                      .dwattr $C$DW$992, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    9421                      .dwattr $C$DW$992, DW_AT_accessibility(DW_ACCESS_public)
    9422              
    9423              $C$DW$993       .dwtag  DW_TAG_member
    9424                      .dwattr $C$DW$993, DW_AT_type(*$C$DW$T$75)
    9425                      .dwattr $C$DW$993, DW_AT_name("Vdq_out")
    9426                      .dwattr $C$DW$993, DW_AT_TI_symbol_name("_Vdq_out")
    9427                      .dwattr $C$DW$993, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    9428                      .dwattr $C$DW$993, DW_AT_accessibility(DW_ACCESS_public)
    9429              
    9430              $C$DW$994       .dwtag  DW_TAG_member
    9431                      .dwattr $C$DW$994, DW_AT_type(*$C$DW$T$74)
    9432                      .dwattr $C$DW$994, DW_AT_name("Rhf")
    9433                      .dwattr $C$DW$994, DW_AT_TI_symbol_name("_Rhf")
    9434                      .dwattr $C$DW$994, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    9435                      .dwattr $C$DW$994, DW_AT_accessibility(DW_ACCESS_public)
    9436              
    9437              $C$DW$995       .dwtag  DW_TAG_member
    9438                      .dwattr $C$DW$995, DW_AT_type(*$C$DW$T$74)
    9439                      .dwattr $C$DW$995, DW_AT_name("Lhf")
    9440                      .dwattr $C$DW$995, DW_AT_TI_symbol_name("_Lhf")
    9441                      .dwattr $C$DW$995, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    9442                      .dwattr $C$DW$995, DW_AT_accessibility(DW_ACCESS_public)
    9443              
    9444              $C$DW$996       .dwtag  DW_TAG_member
    9445                      .dwattr $C$DW$996, DW_AT_type(*$C$DW$T$74)
    9446                      .dwattr $C$DW$996, DW_AT_name("RoverL")
    9447                      .dwattr $C$DW$996, DW_AT_TI_symbol_name("_RoverL")
    9448                      .dwattr $C$DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    9449                      .dwattr $C$DW$996, DW_AT_accessibility(DW_ACCESS_public)
    9450              
    9451              $C$DW$997       .dwtag  DW_TAG_member
    9452                      .dwattr $C$DW$997, DW_AT_type(*$C$DW$T$35)
    9453                      .dwattr $C$DW$997, DW_AT_name("Kp_Id")
    9454                      .dwattr $C$DW$997, DW_AT_TI_symbol_name("_Kp_Id")
    9455                      .dwattr $C$DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    9456                      .dwattr $C$DW$997, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:53:58 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2613842F-80FE-4F6A-B731-29B9211AC451} PAGE  185

    9457              
    9458              $C$DW$998       .dwtag  DW_TAG_member
    9459                      .dwattr $C$DW$998, DW_AT_type(*$C$DW$T$35)
    9460                      .dwattr $C$DW$998, DW_AT_name("Kp_Iq")
    9461                      .dwattr $C$DW$998, DW_AT_TI_symbol_name("_Kp_Iq")
    9462                      .dwattr $C$DW$998, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    9463                      .dwattr $C$DW$998, DW_AT_accessibility(DW_ACCESS_public)
    9464              
    9465              $C$DW$999       .dwtag  DW_TAG_member
    9466                      .dwattr $C$DW$999, DW_AT_type(*$C$DW$T$35)
    9467                      .dwattr $C$DW$999, DW_AT_name("Kp_spd")
    9468                      .dwattr $C$DW$999, DW_AT_TI_symbol_name("_Kp_spd")
    9469                      .dwattr $C$DW$999, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    9470                      .dwattr $C$DW$999, DW_AT_accessibility(DW_ACCESS_public)
    9471              
    9472              $C$DW$1000      .dwtag  DW_TAG_member
    9473                      .dwattr $C$DW$1000, DW_AT_type(*$C$DW$T$35)
    9474                      .dwattr $C$DW$1000, DW_AT_name("Ki_Id")
    9475                      .dwattr $C$DW$1000, DW_AT_TI_symbol_name("_Ki_Id")
    9476                      .dwattr $C$DW$1000, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    9477                      .dwattr $C$DW$1000, DW_AT_accessibility(DW_ACCESS_public)
    9478              
    9479              $C$DW$1001      .dwtag  DW_TAG_member
    9480                      .dwattr $C$DW$1001, DW_AT_type(*$C$DW$T$35)
    9481                      .dwattr $C$DW$1001, DW_AT_name("Ki_Iq")
    9482                      .dwattr $C$DW$1001, DW_AT_TI_symbol_name("_Ki_Iq")
    9483                      .dwattr $C$DW$1001, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    9484                      .dwattr $C$DW$1001, DW_AT_accessibility(DW_ACCESS_public)
    9485              
    9486              $C$DW$1002      .dwtag  DW_TAG_member
    9487                      .dwattr $C$DW$1002, DW_AT_type(*$C$DW$T$35)
    9488                      .dwattr $C$DW$1002, DW_AT_name("Ki_spd")
    9489                      .dwattr $C$DW$1002, DW_AT_TI_symbol_name("_Ki_spd")
    9490                      .dwattr $C$DW$1002, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    9491                      .dwattr $C$DW$1002, DW_AT_accessibility(DW_ACCESS_public)
    9492              
    9493              $C$DW$1003      .dwtag  DW_TAG_member
    9494                      .dwattr $C$DW$1003, DW_AT_type(*$C$DW$T$35)
    9495                      .dwattr $C$DW$1003, DW_AT_name("Kd_Id")
    9496                      .dwattr $C$DW$1003, DW_AT_TI_symbol_name("_Kd_Id")
    9497                      .dwattr $C$DW$1003, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    9498                      .dwattr $C$DW$1003, DW_AT_accessibility(DW_ACCESS_public)
    9499              
    9500              $C$DW$1004      .dwtag  DW_TAG_member
    9501                      .dwattr $C$DW$1004, DW_AT_type(*$C$DW$T$35)
    9502                      .dwattr $C$DW$1004, DW_AT_name("Kd_Iq")
    9503                      .dwattr $C$DW$1004, DW_AT_TI_symbol_name("_Kd_Iq")
    9504                      .dwattr $C$DW$1004, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    9505                      .dwattr $C$DW$1004, DW_AT_accessibility(DW_ACCESS_public)
    9506              
    9507              $C$DW$1005      .dwtag  DW_TAG_member
    9508                      .dwattr $C$DW$1005, DW_AT_type(*$C$DW$T$35)
    9509                      .dwattr $C$DW$1005, DW_AT_name("Kd_spd")
    9510                      .dwattr $C$DW$1005, DW_AT_TI_symbol_name("_Kd_spd")
    9511                      .dwattr $C$DW$1005, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:53:58 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2613842F-80FE-4F6A-B731-29B9211AC451} PAGE  186

    9512                      .dwattr $C$DW$1005, DW_AT_accessibility(DW_ACCESS_public)
    9513              
    9514              $C$DW$1006      .dwtag  DW_TAG_member
    9515                      .dwattr $C$DW$1006, DW_AT_type(*$C$DW$T$35)
    9516                      .dwattr $C$DW$1006, DW_AT_name("Ui_Id")
    9517                      .dwattr $C$DW$1006, DW_AT_TI_symbol_name("_Ui_Id")
    9518                      .dwattr $C$DW$1006, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    9519                      .dwattr $C$DW$1006, DW_AT_accessibility(DW_ACCESS_public)
    9520              
    9521              $C$DW$1007      .dwtag  DW_TAG_member
    9522                      .dwattr $C$DW$1007, DW_AT_type(*$C$DW$T$35)
    9523                      .dwattr $C$DW$1007, DW_AT_name("Ui_Iq")
    9524                      .dwattr $C$DW$1007, DW_AT_TI_symbol_name("_Ui_Iq")
    9525                      .dwattr $C$DW$1007, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    9526                      .dwattr $C$DW$1007, DW_AT_accessibility(DW_ACCESS_public)
    9527              
    9528              $C$DW$1008      .dwtag  DW_TAG_member
    9529                      .dwattr $C$DW$1008, DW_AT_type(*$C$DW$T$35)
    9530                      .dwattr $C$DW$1008, DW_AT_name("Ui_spd")
    9531                      .dwattr $C$DW$1008, DW_AT_TI_symbol_name("_Ui_spd")
    9532                      .dwattr $C$DW$1008, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    9533                      .dwattr $C$DW$1008, DW_AT_accessibility(DW_ACCESS_public)
    9534              
    9535              $C$DW$1009      .dwtag  DW_TAG_member
    9536                      .dwattr $C$DW$1009, DW_AT_type(*$C$DW$T$75)
    9537                      .dwattr $C$DW$1009, DW_AT_name("Idq_ref")
    9538                      .dwattr $C$DW$1009, DW_AT_TI_symbol_name("_Idq_ref")
    9539                      .dwattr $C$DW$1009, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    9540                      .dwattr $C$DW$1009, DW_AT_accessibility(DW_ACCESS_public)
    9541              
    9542              $C$DW$1010      .dwtag  DW_TAG_member
    9543                      .dwattr $C$DW$1010, DW_AT_type(*$C$DW$T$35)
    9544                      .dwattr $C$DW$1010, DW_AT_name("IdRated")
    9545                      .dwattr $C$DW$1010, DW_AT_TI_symbol_name("_IdRated")
    9546                      .dwattr $C$DW$1010, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    9547                      .dwattr $C$DW$1010, DW_AT_accessibility(DW_ACCESS_public)
    9548              
    9549              $C$DW$1011      .dwtag  DW_TAG_member
    9550                      .dwattr $C$DW$1011, DW_AT_type(*$C$DW$T$35)
    9551                      .dwattr $C$DW$1011, DW_AT_name("spd_ref")
    9552                      .dwattr $C$DW$1011, DW_AT_TI_symbol_name("_spd_ref")
    9553                      .dwattr $C$DW$1011, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    9554                      .dwattr $C$DW$1011, DW_AT_accessibility(DW_ACCESS_public)
    9555              
    9556              $C$DW$1012      .dwtag  DW_TAG_member
    9557                      .dwattr $C$DW$1012, DW_AT_type(*$C$DW$T$35)
    9558                      .dwattr $C$DW$1012, DW_AT_name("spd_max")
    9559                      .dwattr $C$DW$1012, DW_AT_TI_symbol_name("_spd_max")
    9560                      .dwattr $C$DW$1012, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    9561                      .dwattr $C$DW$1012, DW_AT_accessibility(DW_ACCESS_public)
    9562              
    9563              $C$DW$1013      .dwtag  DW_TAG_member
    9564                      .dwattr $C$DW$1013, DW_AT_type(*$C$DW$T$73)
    9565                      .dwattr $C$DW$1013, DW_AT_name("counter_current")
    9566                      .dwattr $C$DW$1013, DW_AT_TI_symbol_name("_counter_current")
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:53:58 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2613842F-80FE-4F6A-B731-29B9211AC451} PAGE  187

    9567                      .dwattr $C$DW$1013, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    9568                      .dwattr $C$DW$1013, DW_AT_accessibility(DW_ACCESS_public)
    9569              
    9570              $C$DW$1014      .dwtag  DW_TAG_member
    9571                      .dwattr $C$DW$1014, DW_AT_type(*$C$DW$T$73)
    9572                      .dwattr $C$DW$1014, DW_AT_name("counter_isr")
    9573                      .dwattr $C$DW$1014, DW_AT_TI_symbol_name("_counter_isr")
    9574                      .dwattr $C$DW$1014, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    9575                      .dwattr $C$DW$1014, DW_AT_accessibility(DW_ACCESS_public)
    9576              
    9577              $C$DW$1015      .dwtag  DW_TAG_member
    9578                      .dwattr $C$DW$1015, DW_AT_type(*$C$DW$T$73)
    9579                      .dwattr $C$DW$1015, DW_AT_name("counter_speed")
    9580                      .dwattr $C$DW$1015, DW_AT_TI_symbol_name("_counter_speed")
    9581                      .dwattr $C$DW$1015, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    9582                      .dwattr $C$DW$1015, DW_AT_accessibility(DW_ACCESS_public)
    9583              
    9584              $C$DW$1016      .dwtag  DW_TAG_member
    9585                      .dwattr $C$DW$1016, DW_AT_type(*$C$DW$T$73)
    9586                      .dwattr $C$DW$1016, DW_AT_name("counter_traj")
    9587                      .dwattr $C$DW$1016, DW_AT_TI_symbol_name("_counter_traj")
    9588                      .dwattr $C$DW$1016, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    9589                      .dwattr $C$DW$1016, DW_AT_accessibility(DW_ACCESS_public)
    9590              
    9591              $C$DW$1017      .dwtag  DW_TAG_member
    9592                      .dwattr $C$DW$1017, DW_AT_type(*$C$DW$T$76)
    9593                      .dwattr $C$DW$1017, DW_AT_name("flag_enableCtrl")
    9594                      .dwattr $C$DW$1017, DW_AT_TI_symbol_name("_flag_enableCtrl")
    9595                      .dwattr $C$DW$1017, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    9596                      .dwattr $C$DW$1017, DW_AT_accessibility(DW_ACCESS_public)
    9597              
    9598              $C$DW$1018      .dwtag  DW_TAG_member
    9599                      .dwattr $C$DW$1018, DW_AT_type(*$C$DW$T$76)
    9600                      .dwattr $C$DW$1018, DW_AT_name("flag_enableDcBusComp")
    9601                      .dwattr $C$DW$1018, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    9602                      .dwattr $C$DW$1018, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    9603                      .dwattr $C$DW$1018, DW_AT_accessibility(DW_ACCESS_public)
    9604              
    9605              $C$DW$1019      .dwtag  DW_TAG_member
    9606                      .dwattr $C$DW$1019, DW_AT_type(*$C$DW$T$76)
    9607                      .dwattr $C$DW$1019, DW_AT_name("flag_enablePowerWarp")
    9608                      .dwattr $C$DW$1019, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    9609                      .dwattr $C$DW$1019, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    9610                      .dwattr $C$DW$1019, DW_AT_accessibility(DW_ACCESS_public)
    9611              
    9612              $C$DW$1020      .dwtag  DW_TAG_member
    9613                      .dwattr $C$DW$1020, DW_AT_type(*$C$DW$T$76)
    9614                      .dwattr $C$DW$1020, DW_AT_name("flag_enableOffset")
    9615                      .dwattr $C$DW$1020, DW_AT_TI_symbol_name("_flag_enableOffset")
    9616                      .dwattr $C$DW$1020, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    9617                      .dwattr $C$DW$1020, DW_AT_accessibility(DW_ACCESS_public)
    9618              
    9619              $C$DW$1021      .dwtag  DW_TAG_member
    9620                      .dwattr $C$DW$1021, DW_AT_type(*$C$DW$T$76)
    9621                      .dwattr $C$DW$1021, DW_AT_name("flag_enableSpeedCtrl")
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:53:58 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2613842F-80FE-4F6A-B731-29B9211AC451} PAGE  188

    9622                      .dwattr $C$DW$1021, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    9623                      .dwattr $C$DW$1021, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    9624                      .dwattr $C$DW$1021, DW_AT_accessibility(DW_ACCESS_public)
    9625              
    9626              $C$DW$1022      .dwtag  DW_TAG_member
    9627                      .dwattr $C$DW$1022, DW_AT_type(*$C$DW$T$76)
    9628                      .dwattr $C$DW$1022, DW_AT_name("flag_enableUserMotorParams")
    9629                      .dwattr $C$DW$1022, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    9630                      .dwattr $C$DW$1022, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    9631                      .dwattr $C$DW$1022, DW_AT_accessibility(DW_ACCESS_public)
    9632              
    9633              $C$DW$1023      .dwtag  DW_TAG_member
    9634                      .dwattr $C$DW$1023, DW_AT_type(*$C$DW$T$75)
    9635                      .dwattr $C$DW$1023, DW_AT_name("Idq_offset_pu")
    9636                      .dwattr $C$DW$1023, DW_AT_TI_symbol_name("_Idq_offset_pu")
    9637                      .dwattr $C$DW$1023, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    9638                      .dwattr $C$DW$1023, DW_AT_accessibility(DW_ACCESS_public)
    9639              
    9640              $C$DW$1024      .dwtag  DW_TAG_member
    9641                      .dwattr $C$DW$1024, DW_AT_type(*$C$DW$T$75)
    9642                      .dwattr $C$DW$1024, DW_AT_name("Vdq_offset_pu")
    9643                      .dwattr $C$DW$1024, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    9644                      .dwattr $C$DW$1024, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    9645                      .dwattr $C$DW$1024, DW_AT_accessibility(DW_ACCESS_public)
    9646              
    9647              $C$DW$1025      .dwtag  DW_TAG_member
    9648                      .dwattr $C$DW$1025, DW_AT_type(*$C$DW$T$35)
    9649                      .dwattr $C$DW$1025, DW_AT_name("angle_pu")
    9650                      .dwattr $C$DW$1025, DW_AT_TI_symbol_name("_angle_pu")
    9651                      .dwattr $C$DW$1025, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    9652                      .dwattr $C$DW$1025, DW_AT_accessibility(DW_ACCESS_public)
    9653              
    9654              $C$DW$1026      .dwtag  DW_TAG_member
    9655                      .dwattr $C$DW$1026, DW_AT_type(*$C$DW$T$35)
    9656                      .dwattr $C$DW$1026, DW_AT_name("speed_ref_pu")
    9657                      .dwattr $C$DW$1026, DW_AT_TI_symbol_name("_speed_ref_pu")
    9658                      .dwattr $C$DW$1026, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    9659                      .dwattr $C$DW$1026, DW_AT_accessibility(DW_ACCESS_public)
    9660              
    9661              $C$DW$1027      .dwtag  DW_TAG_member
    9662                      .dwattr $C$DW$1027, DW_AT_type(*$C$DW$T$35)
    9663                      .dwattr $C$DW$1027, DW_AT_name("speed_fb_pu")
    9664                      .dwattr $C$DW$1027, DW_AT_TI_symbol_name("_speed_fb_pu")
    9665                      .dwattr $C$DW$1027, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    9666                      .dwattr $C$DW$1027, DW_AT_accessibility(DW_ACCESS_public)
    9667              
    9668              $C$DW$1028      .dwtag  DW_TAG_member
    9669                      .dwattr $C$DW$1028, DW_AT_type(*$C$DW$T$35)
    9670                      .dwattr $C$DW$1028, DW_AT_name("speed_outMax_pu")
    9671                      .dwattr $C$DW$1028, DW_AT_TI_symbol_name("_speed_outMax_pu")
    9672                      .dwattr $C$DW$1028, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    9673                      .dwattr $C$DW$1028, DW_AT_accessibility(DW_ACCESS_public)
    9674              
    9675              $C$DW$1029      .dwtag  DW_TAG_member
    9676                      .dwattr $C$DW$1029, DW_AT_type(*$C$DW$T$76)
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:53:58 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2613842F-80FE-4F6A-B731-29B9211AC451} PAGE  189

    9677                      .dwattr $C$DW$1029, DW_AT_name("flag_enableCurrentCtrl")
    9678                      .dwattr $C$DW$1029, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    9679                      .dwattr $C$DW$1029, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    9680                      .dwattr $C$DW$1029, DW_AT_accessibility(DW_ACCESS_public)
    9681              
    9682              $C$DW$1030      .dwtag  DW_TAG_member
    9683                      .dwattr $C$DW$1030, DW_AT_type(*$C$DW$T$35)
    9684                      .dwattr $C$DW$1030, DW_AT_name("torque_head_comm")
    9685                      .dwattr $C$DW$1030, DW_AT_TI_symbol_name("_torque_head_comm")
    9686                      .dwattr $C$DW$1030, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    9687                      .dwattr $C$DW$1030, DW_AT_accessibility(DW_ACCESS_public)
    9688              
    9689                      .dwendtag $C$DW$T$77
    9690              
    9691              $C$DW$T$251     .dwtag  DW_TAG_typedef
    9692                      .dwattr $C$DW$T$251, DW_AT_name("CTRL_Obj")
    9693                      .dwattr $C$DW$T$251, DW_AT_type(*$C$DW$T$77)
    9694                      .dwattr $C$DW$T$251, DW_AT_language(DW_LANG_C)
    9695              
    9696              $C$DW$T$252     .dwtag  DW_TAG_pointer_type
    9697                      .dwattr $C$DW$T$252, DW_AT_type(*$C$DW$T$251)
    9698                      .dwattr $C$DW$T$252, DW_AT_address_class(0x20)
    9699              
    9700              $C$DW$T$206     .dwtag  DW_TAG_pointer_type
    9701                      .dwattr $C$DW$T$206, DW_AT_type(*$C$DW$T$77)
    9702                      .dwattr $C$DW$T$206, DW_AT_address_class(0x20)
    9703              
    9704              $C$DW$T$207     .dwtag  DW_TAG_typedef
    9705                      .dwattr $C$DW$T$207, DW_AT_name("CTRL_Handle")
    9706                      .dwattr $C$DW$T$207, DW_AT_type(*$C$DW$T$206)
    9707                      .dwattr $C$DW$T$207, DW_AT_language(DW_LANG_C)
    9708              
    9709              $C$DW$1031      .dwtag  DW_TAG_TI_far_type
    9710                      .dwattr $C$DW$1031, DW_AT_type(*$C$DW$T$207)
    9711              
    9712              $C$DW$T$253     .dwtag  DW_TAG_const_type
    9713                      .dwattr $C$DW$T$253, DW_AT_type(*$C$DW$1031)
    9714              
    9715              
    9716              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    9717                      .dwattr $C$DW$T$80, DW_AT_name("_CTRL_Version_")
    9718                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x04)
    9719              $C$DW$1032      .dwtag  DW_TAG_member
    9720                      .dwattr $C$DW$1032, DW_AT_type(*$C$DW$T$26)
    9721                      .dwattr $C$DW$1032, DW_AT_name("rsvd")
    9722                      .dwattr $C$DW$1032, DW_AT_TI_symbol_name("_rsvd")
    9723                      .dwattr $C$DW$1032, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9724                      .dwattr $C$DW$1032, DW_AT_accessibility(DW_ACCESS_public)
    9725              
    9726              $C$DW$1033      .dwtag  DW_TAG_member
    9727                      .dwattr $C$DW$1033, DW_AT_type(*$C$DW$T$79)
    9728                      .dwattr $C$DW$1033, DW_AT_name("targetProc")
    9729                      .dwattr $C$DW$1033, DW_AT_TI_symbol_name("_targetProc")
    9730                      .dwattr $C$DW$1033, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9731                      .dwattr $C$DW$1033, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:53:58 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2613842F-80FE-4F6A-B731-29B9211AC451} PAGE  190

    9732              
    9733              $C$DW$1034      .dwtag  DW_TAG_member
    9734                      .dwattr $C$DW$1034, DW_AT_type(*$C$DW$T$26)
    9735                      .dwattr $C$DW$1034, DW_AT_name("major")
    9736                      .dwattr $C$DW$1034, DW_AT_TI_symbol_name("_major")
    9737                      .dwattr $C$DW$1034, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9738                      .dwattr $C$DW$1034, DW_AT_accessibility(DW_ACCESS_public)
    9739              
    9740              $C$DW$1035      .dwtag  DW_TAG_member
    9741                      .dwattr $C$DW$1035, DW_AT_type(*$C$DW$T$26)
    9742                      .dwattr $C$DW$1035, DW_AT_name("minor")
    9743                      .dwattr $C$DW$1035, DW_AT_TI_symbol_name("_minor")
    9744                      .dwattr $C$DW$1035, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9745                      .dwattr $C$DW$1035, DW_AT_accessibility(DW_ACCESS_public)
    9746              
    9747                      .dwendtag $C$DW$T$80
    9748              
    9749              $C$DW$T$42      .dwtag  DW_TAG_typedef
    9750                      .dwattr $C$DW$T$42, DW_AT_name("CTRL_Version")
    9751                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$80)
    9752                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    9753              
    9754              $C$DW$T$259     .dwtag  DW_TAG_pointer_type
    9755                      .dwattr $C$DW$T$259, DW_AT_type(*$C$DW$T$42)
    9756                      .dwattr $C$DW$T$259, DW_AT_address_class(0x20)
    9757              
    9758              
    9759              $C$DW$T$87      .dwtag  DW_TAG_structure_type
    9760                      .dwattr $C$DW$T$87, DW_AT_name("_DRV8301_Obj_")
    9761                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x08)
    9762              $C$DW$1036      .dwtag  DW_TAG_member
    9763                      .dwattr $C$DW$1036, DW_AT_type(*$C$DW$T$82)
    9764                      .dwattr $C$DW$1036, DW_AT_name("spiHandle")
    9765                      .dwattr $C$DW$1036, DW_AT_TI_symbol_name("_spiHandle")
    9766                      .dwattr $C$DW$1036, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9767                      .dwattr $C$DW$1036, DW_AT_accessibility(DW_ACCESS_public)
    9768              
    9769              $C$DW$1037      .dwtag  DW_TAG_member
    9770                      .dwattr $C$DW$1037, DW_AT_type(*$C$DW$T$84)
    9771                      .dwattr $C$DW$1037, DW_AT_name("gpioHandle")
    9772                      .dwattr $C$DW$1037, DW_AT_TI_symbol_name("_gpioHandle")
    9773                      .dwattr $C$DW$1037, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9774                      .dwattr $C$DW$1037, DW_AT_accessibility(DW_ACCESS_public)
    9775              
    9776              $C$DW$1038      .dwtag  DW_TAG_member
    9777                      .dwattr $C$DW$1038, DW_AT_type(*$C$DW$T$86)
    9778                      .dwattr $C$DW$1038, DW_AT_name("gpioNumber")
    9779                      .dwattr $C$DW$1038, DW_AT_TI_symbol_name("_gpioNumber")
    9780                      .dwattr $C$DW$1038, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9781                      .dwattr $C$DW$1038, DW_AT_accessibility(DW_ACCESS_public)
    9782              
    9783              $C$DW$1039      .dwtag  DW_TAG_member
    9784                      .dwattr $C$DW$1039, DW_AT_type(*$C$DW$T$76)
    9785                      .dwattr $C$DW$1039, DW_AT_name("RxTimeOut")
    9786                      .dwattr $C$DW$1039, DW_AT_TI_symbol_name("_RxTimeOut")
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:53:58 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2613842F-80FE-4F6A-B731-29B9211AC451} PAGE  191

    9787                      .dwattr $C$DW$1039, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9788                      .dwattr $C$DW$1039, DW_AT_accessibility(DW_ACCESS_public)
    9789              
    9790              $C$DW$1040      .dwtag  DW_TAG_member
    9791                      .dwattr $C$DW$1040, DW_AT_type(*$C$DW$T$76)
    9792                      .dwattr $C$DW$1040, DW_AT_name("enableTimeOut")
    9793                      .dwattr $C$DW$1040, DW_AT_TI_symbol_name("_enableTimeOut")
    9794                      .dwattr $C$DW$1040, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9795                      .dwattr $C$DW$1040, DW_AT_accessibility(DW_ACCESS_public)
    9796              
    9797                      .dwendtag $C$DW$T$87
    9798              
    9799              $C$DW$T$156     .dwtag  DW_TAG_typedef
    9800                      .dwattr $C$DW$T$156, DW_AT_name("DRV8301_Obj")
    9801                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$87)
    9802                      .dwattr $C$DW$T$156, DW_AT_language(DW_LANG_C)
    9803              
    9804              $C$DW$T$154     .dwtag  DW_TAG_pointer_type
    9805                      .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$87)
    9806                      .dwattr $C$DW$T$154, DW_AT_address_class(0x20)
    9807              
    9808              $C$DW$T$155     .dwtag  DW_TAG_typedef
    9809                      .dwattr $C$DW$T$155, DW_AT_name("DRV8301_Handle")
    9810                      .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$154)
    9811                      .dwattr $C$DW$T$155, DW_AT_language(DW_LANG_C)
    9812              
    9813              
    9814              $C$DW$T$98      .dwtag  DW_TAG_structure_type
    9815                      .dwattr $C$DW$T$98, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    9816                      .dwattr $C$DW$T$98, DW_AT_byte_size(0x05)
    9817              $C$DW$1041      .dwtag  DW_TAG_member
    9818                      .dwattr $C$DW$1041, DW_AT_type(*$C$DW$T$89)
    9819                      .dwattr $C$DW$1041, DW_AT_name("DRV8301_CURRENT")
    9820                      .dwattr $C$DW$1041, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    9821                      .dwattr $C$DW$1041, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9822                      .dwattr $C$DW$1041, DW_AT_accessibility(DW_ACCESS_public)
    9823              
    9824              $C$DW$1042      .dwtag  DW_TAG_member
    9825                      .dwattr $C$DW$1042, DW_AT_type(*$C$DW$T$91)
    9826                      .dwattr $C$DW$1042, DW_AT_name("DRV8301_RESET")
    9827                      .dwattr $C$DW$1042, DW_AT_TI_symbol_name("_DRV8301_RESET")
    9828                      .dwattr $C$DW$1042, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9829                      .dwattr $C$DW$1042, DW_AT_accessibility(DW_ACCESS_public)
    9830              
    9831              $C$DW$1043      .dwtag  DW_TAG_member
    9832                      .dwattr $C$DW$1043, DW_AT_type(*$C$DW$T$93)
    9833                      .dwattr $C$DW$1043, DW_AT_name("PWM_MODE")
    9834                      .dwattr $C$DW$1043, DW_AT_TI_symbol_name("_PWM_MODE")
    9835                      .dwattr $C$DW$1043, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9836                      .dwattr $C$DW$1043, DW_AT_accessibility(DW_ACCESS_public)
    9837              
    9838              $C$DW$1044      .dwtag  DW_TAG_member
    9839                      .dwattr $C$DW$1044, DW_AT_type(*$C$DW$T$95)
    9840                      .dwattr $C$DW$1044, DW_AT_name("OC_MODE")
    9841                      .dwattr $C$DW$1044, DW_AT_TI_symbol_name("_OC_MODE")
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:53:58 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2613842F-80FE-4F6A-B731-29B9211AC451} PAGE  192

    9842                      .dwattr $C$DW$1044, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9843                      .dwattr $C$DW$1044, DW_AT_accessibility(DW_ACCESS_public)
    9844              
    9845              $C$DW$1045      .dwtag  DW_TAG_member
    9846                      .dwattr $C$DW$1045, DW_AT_type(*$C$DW$T$97)
    9847                      .dwattr $C$DW$1045, DW_AT_name("OC_ADJ_SET")
    9848                      .dwattr $C$DW$1045, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    9849                      .dwattr $C$DW$1045, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9850                      .dwattr $C$DW$1045, DW_AT_accessibility(DW_ACCESS_public)
    9851              
    9852                      .dwendtag $C$DW$T$98
    9853              
    9854              $C$DW$T$112     .dwtag  DW_TAG_typedef
    9855                      .dwattr $C$DW$T$112, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    9856                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$98)
    9857                      .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    9858              
    9859              
    9860              $C$DW$T$107     .dwtag  DW_TAG_structure_type
    9861                      .dwattr $C$DW$T$107, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    9862                      .dwattr $C$DW$T$107, DW_AT_byte_size(0x04)
    9863              $C$DW$1046      .dwtag  DW_TAG_member
    9864                      .dwattr $C$DW$1046, DW_AT_type(*$C$DW$T$100)
    9865                      .dwattr $C$DW$1046, DW_AT_name("OCTW_SET")
    9866                      .dwattr $C$DW$1046, DW_AT_TI_symbol_name("_OCTW_SET")
    9867                      .dwattr $C$DW$1046, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9868                      .dwattr $C$DW$1046, DW_AT_accessibility(DW_ACCESS_public)
    9869              
    9870              $C$DW$1047      .dwtag  DW_TAG_member
    9871                      .dwattr $C$DW$1047, DW_AT_type(*$C$DW$T$102)
    9872                      .dwattr $C$DW$1047, DW_AT_name("GAIN")
    9873                      .dwattr $C$DW$1047, DW_AT_TI_symbol_name("_GAIN")
    9874                      .dwattr $C$DW$1047, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9875                      .dwattr $C$DW$1047, DW_AT_accessibility(DW_ACCESS_public)
    9876              
    9877              $C$DW$1048      .dwtag  DW_TAG_member
    9878                      .dwattr $C$DW$1048, DW_AT_type(*$C$DW$T$104)
    9879                      .dwattr $C$DW$1048, DW_AT_name("DC_CAL_CH1p2")
    9880                      .dwattr $C$DW$1048, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    9881                      .dwattr $C$DW$1048, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9882                      .dwattr $C$DW$1048, DW_AT_accessibility(DW_ACCESS_public)
    9883              
    9884              $C$DW$1049      .dwtag  DW_TAG_member
    9885                      .dwattr $C$DW$1049, DW_AT_type(*$C$DW$T$106)
    9886                      .dwattr $C$DW$1049, DW_AT_name("OC_TOFF")
    9887                      .dwattr $C$DW$1049, DW_AT_TI_symbol_name("_OC_TOFF")
    9888                      .dwattr $C$DW$1049, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9889                      .dwattr $C$DW$1049, DW_AT_accessibility(DW_ACCESS_public)
    9890              
    9891                      .dwendtag $C$DW$T$107
    9892              
    9893              $C$DW$T$113     .dwtag  DW_TAG_typedef
    9894                      .dwattr $C$DW$T$113, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    9895                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$107)
    9896                      .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:53:58 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2613842F-80FE-4F6A-B731-29B9211AC451} PAGE  193

    9897              
    9898              
    9899              $C$DW$T$108     .dwtag  DW_TAG_structure_type
    9900                      .dwattr $C$DW$T$108, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    9901                      .dwattr $C$DW$T$108, DW_AT_byte_size(0x0b)
    9902              $C$DW$1050      .dwtag  DW_TAG_member
    9903                      .dwattr $C$DW$1050, DW_AT_type(*$C$DW$T$76)
    9904                      .dwattr $C$DW$1050, DW_AT_name("FAULT")
    9905                      .dwattr $C$DW$1050, DW_AT_TI_symbol_name("_FAULT")
    9906                      .dwattr $C$DW$1050, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9907                      .dwattr $C$DW$1050, DW_AT_accessibility(DW_ACCESS_public)
    9908              
    9909              $C$DW$1051      .dwtag  DW_TAG_member
    9910                      .dwattr $C$DW$1051, DW_AT_type(*$C$DW$T$76)
    9911                      .dwattr $C$DW$1051, DW_AT_name("GVDD_UV")
    9912                      .dwattr $C$DW$1051, DW_AT_TI_symbol_name("_GVDD_UV")
    9913                      .dwattr $C$DW$1051, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9914                      .dwattr $C$DW$1051, DW_AT_accessibility(DW_ACCESS_public)
    9915              
    9916              $C$DW$1052      .dwtag  DW_TAG_member
    9917                      .dwattr $C$DW$1052, DW_AT_type(*$C$DW$T$76)
    9918                      .dwattr $C$DW$1052, DW_AT_name("PVDD_UV")
    9919                      .dwattr $C$DW$1052, DW_AT_TI_symbol_name("_PVDD_UV")
    9920                      .dwattr $C$DW$1052, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9921                      .dwattr $C$DW$1052, DW_AT_accessibility(DW_ACCESS_public)
    9922              
    9923              $C$DW$1053      .dwtag  DW_TAG_member
    9924                      .dwattr $C$DW$1053, DW_AT_type(*$C$DW$T$76)
    9925                      .dwattr $C$DW$1053, DW_AT_name("OTSD")
    9926                      .dwattr $C$DW$1053, DW_AT_TI_symbol_name("_OTSD")
    9927                      .dwattr $C$DW$1053, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9928                      .dwattr $C$DW$1053, DW_AT_accessibility(DW_ACCESS_public)
    9929              
    9930              $C$DW$1054      .dwtag  DW_TAG_member
    9931                      .dwattr $C$DW$1054, DW_AT_type(*$C$DW$T$76)
    9932                      .dwattr $C$DW$1054, DW_AT_name("OTW")
    9933                      .dwattr $C$DW$1054, DW_AT_TI_symbol_name("_OTW")
    9934                      .dwattr $C$DW$1054, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9935                      .dwattr $C$DW$1054, DW_AT_accessibility(DW_ACCESS_public)
    9936              
    9937              $C$DW$1055      .dwtag  DW_TAG_member
    9938                      .dwattr $C$DW$1055, DW_AT_type(*$C$DW$T$76)
    9939                      .dwattr $C$DW$1055, DW_AT_name("FETHA_OC")
    9940                      .dwattr $C$DW$1055, DW_AT_TI_symbol_name("_FETHA_OC")
    9941                      .dwattr $C$DW$1055, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9942                      .dwattr $C$DW$1055, DW_AT_accessibility(DW_ACCESS_public)
    9943              
    9944              $C$DW$1056      .dwtag  DW_TAG_member
    9945                      .dwattr $C$DW$1056, DW_AT_type(*$C$DW$T$76)
    9946                      .dwattr $C$DW$1056, DW_AT_name("FETLA_OC")
    9947                      .dwattr $C$DW$1056, DW_AT_TI_symbol_name("_FETLA_OC")
    9948                      .dwattr $C$DW$1056, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9949                      .dwattr $C$DW$1056, DW_AT_accessibility(DW_ACCESS_public)
    9950              
    9951              $C$DW$1057      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Fri Apr 14 02:53:58 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{2613842F-80FE-4F6A-B731-29B9211AC451} PAGE  194

    9952                      .dwattr $C$DW$1057, DW_AT_type(*$C$DW$T$76)
    9953                      .dwattr $C$DW$1057, DW_AT_name("FETHB_OC")
    9954                      .dwattr $C$DW$1057, DW_AT_TI_symbol_name("_FETHB_OC")
    9955                      .dwattr $C$DW$1057, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    9956                      .dwattr $C$DW$1057, DW_AT_accessibility(DW_ACCESS_public)
    9957              
    9958              $C$DW$1058      .dwtag  DW_TAG_member
    9959                      .dwattr $C$DW$1058, DW_AT_type(*$C$DW$T$76)
    9960                      .dwattr $C$DW$1058, DW_AT_name("FETLB_OC")
    9961                      .dwattr $C$DW$1058, DW_AT_TI_symbol_name("_FETLB_OC")
    9962                      .dwattr $C$DW$1058, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9963                      .dwattr $C$DW$1058, DW_AT_accessibility(DW_ACCESS_public)
