TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:54:04 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{AFCBCAD4-90C2-4A1E-B05B-37E3FCD6034D} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                             PC v18.12.4.LTS *
       3              ;* Date/Time created: Fri Feb 17 15:54:03 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/GIANT/GAINT_TI_instaspin/motorware/motorware_1_01_00_18/sw/solutions
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v18.12.4.LTS Copyright (c) 1996-
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\GIANT\GAINT_TI_instaspin\motorware\motorware_1_01_00_18\sw\solut
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    8580              $C$DW$884       .dwtag  DW_TAG_enumerator
    8581                      .dwattr $C$DW$884, DW_AT_name("PIE_GroupNumber_7")
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:54:04 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{AFCBCAD4-90C2-4A1E-B05B-37E3FCD6034D} PAGE  169

    8582                      .dwattr $C$DW$884, DW_AT_const_value(0x06)
    8583              
    8584              $C$DW$885       .dwtag  DW_TAG_enumerator
    8585                      .dwattr $C$DW$885, DW_AT_name("PIE_GroupNumber_8")
    8586                      .dwattr $C$DW$885, DW_AT_const_value(0x07)
    8587              
    8588              $C$DW$886       .dwtag  DW_TAG_enumerator
    8589                      .dwattr $C$DW$886, DW_AT_name("PIE_GroupNumber_9")
    8590                      .dwattr $C$DW$886, DW_AT_const_value(0x08)
    8591              
    8592              $C$DW$887       .dwtag  DW_TAG_enumerator
    8593                      .dwattr $C$DW$887, DW_AT_name("PIE_GroupNumber_10")
    8594                      .dwattr $C$DW$887, DW_AT_const_value(0x09)
    8595              
    8596              $C$DW$888       .dwtag  DW_TAG_enumerator
    8597                      .dwattr $C$DW$888, DW_AT_name("PIE_GroupNumber_11")
    8598                      .dwattr $C$DW$888, DW_AT_const_value(0x0a)
    8599              
    8600              $C$DW$889       .dwtag  DW_TAG_enumerator
    8601                      .dwattr $C$DW$889, DW_AT_name("PIE_GroupNumber_12")
    8602                      .dwattr $C$DW$889, DW_AT_const_value(0x0b)
    8603              
    8604                      .dwendtag $C$DW$T$221
    8605              
    8606              $C$DW$T$222     .dwtag  DW_TAG_typedef
    8607                      .dwattr $C$DW$T$222, DW_AT_name("PIE_GroupNumber_e")
    8608                      .dwattr $C$DW$T$222, DW_AT_type(*$C$DW$T$221)
    8609                      .dwattr $C$DW$T$222, DW_AT_language(DW_LANG_C)
    8610              
    8611              
    8612              $C$DW$T$224     .dwtag  DW_TAG_enumeration_type
    8613                      .dwattr $C$DW$T$224, DW_AT_byte_size(0x01)
    8614              $C$DW$890       .dwtag  DW_TAG_enumerator
    8615                      .dwattr $C$DW$890, DW_AT_name("CTRL_Type_PID_spd")
    8616                      .dwattr $C$DW$890, DW_AT_const_value(0x00)
    8617              
    8618              $C$DW$891       .dwtag  DW_TAG_enumerator
    8619                      .dwattr $C$DW$891, DW_AT_name("CTRL_Type_PID_Id")
    8620                      .dwattr $C$DW$891, DW_AT_const_value(0x01)
    8621              
    8622              $C$DW$892       .dwtag  DW_TAG_enumerator
    8623                      .dwattr $C$DW$892, DW_AT_name("CTRL_Type_PID_Iq")
    8624                      .dwattr $C$DW$892, DW_AT_const_value(0x02)
    8625              
    8626                      .dwendtag $C$DW$T$224
    8627              
    8628              $C$DW$T$225     .dwtag  DW_TAG_typedef
    8629                      .dwattr $C$DW$T$225, DW_AT_name("CTRL_Type_e")
    8630                      .dwattr $C$DW$T$225, DW_AT_type(*$C$DW$T$224)
    8631                      .dwattr $C$DW$T$225, DW_AT_language(DW_LANG_C)
    8632              
    8633              
    8634              $C$DW$T$227     .dwtag  DW_TAG_enumeration_type
    8635                      .dwattr $C$DW$T$227, DW_AT_byte_size(0x01)
    8636              $C$DW$893       .dwtag  DW_TAG_enumerator
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:54:04 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{AFCBCAD4-90C2-4A1E-B05B-37E3FCD6034D} PAGE  170

    8637                      .dwattr $C$DW$893, DW_AT_name("HAL_SensorType_Current")
    8638                      .dwattr $C$DW$893, DW_AT_const_value(0x00)
    8639              
    8640              $C$DW$894       .dwtag  DW_TAG_enumerator
    8641                      .dwattr $C$DW$894, DW_AT_name("HAL_SensorType_Voltage")
    8642                      .dwattr $C$DW$894, DW_AT_const_value(0x01)
    8643              
    8644                      .dwendtag $C$DW$T$227
    8645              
    8646              $C$DW$T$228     .dwtag  DW_TAG_typedef
    8647                      .dwattr $C$DW$T$228, DW_AT_name("HAL_SensorType_e")
    8648                      .dwattr $C$DW$T$228, DW_AT_type(*$C$DW$T$227)
    8649                      .dwattr $C$DW$T$228, DW_AT_language(DW_LANG_C)
    8650              
    8651              
    8652              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    8653                      .dwattr $C$DW$T$19, DW_AT_name("IPD_HFI_Obj")
    8654                      .dwattr $C$DW$T$19, DW_AT_declaration
    8655                      .dwendtag $C$DW$T$19
    8656              
    8657              $C$DW$T$230     .dwtag  DW_TAG_pointer_type
    8658                      .dwattr $C$DW$T$230, DW_AT_type(*$C$DW$T$19)
    8659                      .dwattr $C$DW$T$230, DW_AT_address_class(0x20)
    8660              
    8661              $C$DW$T$231     .dwtag  DW_TAG_typedef
    8662                      .dwattr $C$DW$T$231, DW_AT_name("IPD_HFI_Handle")
    8663                      .dwattr $C$DW$T$231, DW_AT_type(*$C$DW$T$230)
    8664                      .dwattr $C$DW$T$231, DW_AT_language(DW_LANG_C)
    8665              
    8666              
    8667              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    8668                      .dwattr $C$DW$T$34, DW_AT_name("_ADC_Obj_")
    8669                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x6650)
    8670              $C$DW$895       .dwtag  DW_TAG_member
    8671                      .dwattr $C$DW$895, DW_AT_type(*$C$DW$T$28)
    8672                      .dwattr $C$DW$895, DW_AT_name("ADCRESULT")
    8673                      .dwattr $C$DW$895, DW_AT_TI_symbol_name("_ADCRESULT")
    8674                      .dwattr $C$DW$895, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8675                      .dwattr $C$DW$895, DW_AT_accessibility(DW_ACCESS_public)
    8676              
    8677              $C$DW$896       .dwtag  DW_TAG_member
    8678                      .dwattr $C$DW$896, DW_AT_type(*$C$DW$T$29)
    8679                      .dwattr $C$DW$896, DW_AT_name("resvd_1")
    8680                      .dwattr $C$DW$896, DW_AT_TI_symbol_name("_resvd_1")
    8681                      .dwattr $C$DW$896, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8682                      .dwattr $C$DW$896, DW_AT_accessibility(DW_ACCESS_public)
    8683              
    8684              $C$DW$897       .dwtag  DW_TAG_member
    8685                      .dwattr $C$DW$897, DW_AT_type(*$C$DW$T$27)
    8686                      .dwattr $C$DW$897, DW_AT_name("ADCCTL1")
    8687                      .dwattr $C$DW$897, DW_AT_TI_symbol_name("_ADCCTL1")
    8688                      .dwattr $C$DW$897, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    8689                      .dwattr $C$DW$897, DW_AT_accessibility(DW_ACCESS_public)
    8690              
    8691              $C$DW$898       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:54:04 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{AFCBCAD4-90C2-4A1E-B05B-37E3FCD6034D} PAGE  171

    8692                      .dwattr $C$DW$898, DW_AT_type(*$C$DW$T$27)
    8693                      .dwattr $C$DW$898, DW_AT_name("ADCCTL2")
    8694                      .dwattr $C$DW$898, DW_AT_TI_symbol_name("_ADCCTL2")
    8695                      .dwattr $C$DW$898, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    8696                      .dwattr $C$DW$898, DW_AT_accessibility(DW_ACCESS_public)
    8697              
    8698              $C$DW$899       .dwtag  DW_TAG_member
    8699                      .dwattr $C$DW$899, DW_AT_type(*$C$DW$T$30)
    8700                      .dwattr $C$DW$899, DW_AT_name("rsvd_2")
    8701                      .dwattr $C$DW$899, DW_AT_TI_symbol_name("_rsvd_2")
    8702                      .dwattr $C$DW$899, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    8703                      .dwattr $C$DW$899, DW_AT_accessibility(DW_ACCESS_public)
    8704              
    8705              $C$DW$900       .dwtag  DW_TAG_member
    8706                      .dwattr $C$DW$900, DW_AT_type(*$C$DW$T$27)
    8707                      .dwattr $C$DW$900, DW_AT_name("ADCINTFLG")
    8708                      .dwattr $C$DW$900, DW_AT_TI_symbol_name("_ADCINTFLG")
    8709                      .dwattr $C$DW$900, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    8710                      .dwattr $C$DW$900, DW_AT_accessibility(DW_ACCESS_public)
    8711              
    8712              $C$DW$901       .dwtag  DW_TAG_member
    8713                      .dwattr $C$DW$901, DW_AT_type(*$C$DW$T$27)
    8714                      .dwattr $C$DW$901, DW_AT_name("ADCINTFLGCLR")
    8715                      .dwattr $C$DW$901, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    8716                      .dwattr $C$DW$901, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    8717                      .dwattr $C$DW$901, DW_AT_accessibility(DW_ACCESS_public)
    8718              
    8719              $C$DW$902       .dwtag  DW_TAG_member
    8720                      .dwattr $C$DW$902, DW_AT_type(*$C$DW$T$27)
    8721                      .dwattr $C$DW$902, DW_AT_name("ADCINTOVF")
    8722                      .dwattr $C$DW$902, DW_AT_TI_symbol_name("_ADCINTOVF")
    8723                      .dwattr $C$DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    8724                      .dwattr $C$DW$902, DW_AT_accessibility(DW_ACCESS_public)
    8725              
    8726              $C$DW$903       .dwtag  DW_TAG_member
    8727                      .dwattr $C$DW$903, DW_AT_type(*$C$DW$T$27)
    8728                      .dwattr $C$DW$903, DW_AT_name("ADCINTOVFCLR")
    8729                      .dwattr $C$DW$903, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    8730                      .dwattr $C$DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    8731                      .dwattr $C$DW$903, DW_AT_accessibility(DW_ACCESS_public)
    8732              
    8733              $C$DW$904       .dwtag  DW_TAG_member
    8734                      .dwattr $C$DW$904, DW_AT_type(*$C$DW$T$31)
    8735                      .dwattr $C$DW$904, DW_AT_name("INTSELxNy")
    8736                      .dwattr $C$DW$904, DW_AT_TI_symbol_name("_INTSELxNy")
    8737                      .dwattr $C$DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    8738                      .dwattr $C$DW$904, DW_AT_accessibility(DW_ACCESS_public)
    8739              
    8740              $C$DW$905       .dwtag  DW_TAG_member
    8741                      .dwattr $C$DW$905, DW_AT_type(*$C$DW$T$32)
    8742                      .dwattr $C$DW$905, DW_AT_name("rsvd_3")
    8743                      .dwattr $C$DW$905, DW_AT_TI_symbol_name("_rsvd_3")
    8744                      .dwattr $C$DW$905, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    8745                      .dwattr $C$DW$905, DW_AT_accessibility(DW_ACCESS_public)
    8746              
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:54:04 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{AFCBCAD4-90C2-4A1E-B05B-37E3FCD6034D} PAGE  172

    8747              $C$DW$906       .dwtag  DW_TAG_member
    8748                      .dwattr $C$DW$906, DW_AT_type(*$C$DW$T$27)
    8749                      .dwattr $C$DW$906, DW_AT_name("SOCPRICTRL")
    8750                      .dwattr $C$DW$906, DW_AT_TI_symbol_name("_SOCPRICTRL")
    8751                      .dwattr $C$DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    8752                      .dwattr $C$DW$906, DW_AT_accessibility(DW_ACCESS_public)
    8753              
    8754              $C$DW$907       .dwtag  DW_TAG_member
    8755                      .dwattr $C$DW$907, DW_AT_type(*$C$DW$T$27)
    8756                      .dwattr $C$DW$907, DW_AT_name("rsvd_4")
    8757                      .dwattr $C$DW$907, DW_AT_TI_symbol_name("_rsvd_4")
    8758                      .dwattr $C$DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    8759                      .dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
    8760              
    8761              $C$DW$908       .dwtag  DW_TAG_member
    8762                      .dwattr $C$DW$908, DW_AT_type(*$C$DW$T$27)
    8763                      .dwattr $C$DW$908, DW_AT_name("ADCSAMPLEMODE")
    8764                      .dwattr $C$DW$908, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    8765                      .dwattr $C$DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    8766                      .dwattr $C$DW$908, DW_AT_accessibility(DW_ACCESS_public)
    8767              
    8768              $C$DW$909       .dwtag  DW_TAG_member
    8769                      .dwattr $C$DW$909, DW_AT_type(*$C$DW$T$27)
    8770                      .dwattr $C$DW$909, DW_AT_name("rsvd_5")
    8771                      .dwattr $C$DW$909, DW_AT_TI_symbol_name("_rsvd_5")
    8772                      .dwattr $C$DW$909, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    8773                      .dwattr $C$DW$909, DW_AT_accessibility(DW_ACCESS_public)
    8774              
    8775              $C$DW$910       .dwtag  DW_TAG_member
    8776                      .dwattr $C$DW$910, DW_AT_type(*$C$DW$T$27)
    8777                      .dwattr $C$DW$910, DW_AT_name("ADCINTSOCSEL1")
    8778                      .dwattr $C$DW$910, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    8779                      .dwattr $C$DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    8780                      .dwattr $C$DW$910, DW_AT_accessibility(DW_ACCESS_public)
    8781              
    8782              $C$DW$911       .dwtag  DW_TAG_member
    8783                      .dwattr $C$DW$911, DW_AT_type(*$C$DW$T$27)
    8784                      .dwattr $C$DW$911, DW_AT_name("ADCINTSOCSEL2")
    8785                      .dwattr $C$DW$911, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    8786                      .dwattr $C$DW$911, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    8787                      .dwattr $C$DW$911, DW_AT_accessibility(DW_ACCESS_public)
    8788              
    8789              $C$DW$912       .dwtag  DW_TAG_member
    8790                      .dwattr $C$DW$912, DW_AT_type(*$C$DW$T$30)
    8791                      .dwattr $C$DW$912, DW_AT_name("rsvd_6")
    8792                      .dwattr $C$DW$912, DW_AT_TI_symbol_name("_rsvd_6")
    8793                      .dwattr $C$DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    8794                      .dwattr $C$DW$912, DW_AT_accessibility(DW_ACCESS_public)
    8795              
    8796              $C$DW$913       .dwtag  DW_TAG_member
    8797                      .dwattr $C$DW$913, DW_AT_type(*$C$DW$T$27)
    8798                      .dwattr $C$DW$913, DW_AT_name("ADCSOCFLG1")
    8799                      .dwattr $C$DW$913, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    8800                      .dwattr $C$DW$913, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    8801                      .dwattr $C$DW$913, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:54:04 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{AFCBCAD4-90C2-4A1E-B05B-37E3FCD6034D} PAGE  173

    8802              
    8803              $C$DW$914       .dwtag  DW_TAG_member
    8804                      .dwattr $C$DW$914, DW_AT_type(*$C$DW$T$27)
    8805                      .dwattr $C$DW$914, DW_AT_name("rsvd_7")
    8806                      .dwattr $C$DW$914, DW_AT_TI_symbol_name("_rsvd_7")
    8807                      .dwattr $C$DW$914, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    8808                      .dwattr $C$DW$914, DW_AT_accessibility(DW_ACCESS_public)
    8809              
    8810              $C$DW$915       .dwtag  DW_TAG_member
    8811                      .dwattr $C$DW$915, DW_AT_type(*$C$DW$T$27)
    8812                      .dwattr $C$DW$915, DW_AT_name("ADCSOCFRC1")
    8813                      .dwattr $C$DW$915, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    8814                      .dwattr $C$DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    8815                      .dwattr $C$DW$915, DW_AT_accessibility(DW_ACCESS_public)
    8816              
    8817              $C$DW$916       .dwtag  DW_TAG_member
    8818                      .dwattr $C$DW$916, DW_AT_type(*$C$DW$T$27)
    8819                      .dwattr $C$DW$916, DW_AT_name("rsvd_8")
    8820                      .dwattr $C$DW$916, DW_AT_TI_symbol_name("_rsvd_8")
    8821                      .dwattr $C$DW$916, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    8822                      .dwattr $C$DW$916, DW_AT_accessibility(DW_ACCESS_public)
    8823              
    8824              $C$DW$917       .dwtag  DW_TAG_member
    8825                      .dwattr $C$DW$917, DW_AT_type(*$C$DW$T$27)
    8826                      .dwattr $C$DW$917, DW_AT_name("ADCSOCOVF1")
    8827                      .dwattr $C$DW$917, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    8828                      .dwattr $C$DW$917, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    8829                      .dwattr $C$DW$917, DW_AT_accessibility(DW_ACCESS_public)
    8830              
    8831              $C$DW$918       .dwtag  DW_TAG_member
    8832                      .dwattr $C$DW$918, DW_AT_type(*$C$DW$T$27)
    8833                      .dwattr $C$DW$918, DW_AT_name("rsvd_9")
    8834                      .dwattr $C$DW$918, DW_AT_TI_symbol_name("_rsvd_9")
    8835                      .dwattr $C$DW$918, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    8836                      .dwattr $C$DW$918, DW_AT_accessibility(DW_ACCESS_public)
    8837              
    8838              $C$DW$919       .dwtag  DW_TAG_member
    8839                      .dwattr $C$DW$919, DW_AT_type(*$C$DW$T$27)
    8840                      .dwattr $C$DW$919, DW_AT_name("ADCSOCOVFCLR1")
    8841                      .dwattr $C$DW$919, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    8842                      .dwattr $C$DW$919, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    8843                      .dwattr $C$DW$919, DW_AT_accessibility(DW_ACCESS_public)
    8844              
    8845              $C$DW$920       .dwtag  DW_TAG_member
    8846                      .dwattr $C$DW$920, DW_AT_type(*$C$DW$T$27)
    8847                      .dwattr $C$DW$920, DW_AT_name("rsvd_10")
    8848                      .dwattr $C$DW$920, DW_AT_TI_symbol_name("_rsvd_10")
    8849                      .dwattr $C$DW$920, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    8850                      .dwattr $C$DW$920, DW_AT_accessibility(DW_ACCESS_public)
    8851              
    8852              $C$DW$921       .dwtag  DW_TAG_member
    8853                      .dwattr $C$DW$921, DW_AT_type(*$C$DW$T$28)
    8854                      .dwattr $C$DW$921, DW_AT_name("ADCSOCxCTL")
    8855                      .dwattr $C$DW$921, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    8856                      .dwattr $C$DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:54:04 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{AFCBCAD4-90C2-4A1E-B05B-37E3FCD6034D} PAGE  174

    8857                      .dwattr $C$DW$921, DW_AT_accessibility(DW_ACCESS_public)
    8858              
    8859              $C$DW$922       .dwtag  DW_TAG_member
    8860                      .dwattr $C$DW$922, DW_AT_type(*$C$DW$T$28)
    8861                      .dwattr $C$DW$922, DW_AT_name("rsvd_11")
    8862                      .dwattr $C$DW$922, DW_AT_TI_symbol_name("_rsvd_11")
    8863                      .dwattr $C$DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    8864                      .dwattr $C$DW$922, DW_AT_accessibility(DW_ACCESS_public)
    8865              
    8866              $C$DW$923       .dwtag  DW_TAG_member
    8867                      .dwattr $C$DW$923, DW_AT_type(*$C$DW$T$27)
    8868                      .dwattr $C$DW$923, DW_AT_name("ADCREFTRIM")
    8869                      .dwattr $C$DW$923, DW_AT_TI_symbol_name("_ADCREFTRIM")
    8870                      .dwattr $C$DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    8871                      .dwattr $C$DW$923, DW_AT_accessibility(DW_ACCESS_public)
    8872              
    8873              $C$DW$924       .dwtag  DW_TAG_member
    8874                      .dwattr $C$DW$924, DW_AT_type(*$C$DW$T$27)
    8875                      .dwattr $C$DW$924, DW_AT_name("ADCOFFTRIM")
    8876                      .dwattr $C$DW$924, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    8877                      .dwattr $C$DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    8878                      .dwattr $C$DW$924, DW_AT_accessibility(DW_ACCESS_public)
    8879              
    8880              $C$DW$925       .dwtag  DW_TAG_member
    8881                      .dwattr $C$DW$925, DW_AT_type(*$C$DW$T$33)
    8882                      .dwattr $C$DW$925, DW_AT_name("resvd_12")
    8883                      .dwattr $C$DW$925, DW_AT_TI_symbol_name("_resvd_12")
    8884                      .dwattr $C$DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    8885                      .dwattr $C$DW$925, DW_AT_accessibility(DW_ACCESS_public)
    8886              
    8887              $C$DW$926       .dwtag  DW_TAG_member
    8888                      .dwattr $C$DW$926, DW_AT_type(*$C$DW$T$27)
    8889                      .dwattr $C$DW$926, DW_AT_name("ADCREV")
    8890                      .dwattr $C$DW$926, DW_AT_TI_symbol_name("_ADCREV")
    8891                      .dwattr $C$DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    8892                      .dwattr $C$DW$926, DW_AT_accessibility(DW_ACCESS_public)
    8893              
    8894                      .dwendtag $C$DW$T$34
    8895              
    8896              $C$DW$T$235     .dwtag  DW_TAG_typedef
    8897                      .dwattr $C$DW$T$235, DW_AT_name("ADC_Obj")
    8898                      .dwattr $C$DW$T$235, DW_AT_type(*$C$DW$T$34)
    8899                      .dwattr $C$DW$T$235, DW_AT_language(DW_LANG_C)
    8900              
    8901              $C$DW$T$124     .dwtag  DW_TAG_pointer_type
    8902                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$34)
    8903                      .dwattr $C$DW$T$124, DW_AT_address_class(0x20)
    8904              
    8905              $C$DW$T$125     .dwtag  DW_TAG_typedef
    8906                      .dwattr $C$DW$T$125, DW_AT_name("ADC_Handle")
    8907                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
    8908                      .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    8909              
    8910              
    8911              $C$DW$T$20      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:54:04 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{AFCBCAD4-90C2-4A1E-B05B-37E3FCD6034D} PAGE  175

    8912                      .dwattr $C$DW$T$20, DW_AT_name("_AFSEL_Obj_")
    8913                      .dwattr $C$DW$T$20, DW_AT_declaration
    8914                      .dwendtag $C$DW$T$20
    8915              
    8916              $C$DW$T$236     .dwtag  DW_TAG_pointer_type
    8917                      .dwattr $C$DW$T$236, DW_AT_type(*$C$DW$T$20)
    8918                      .dwattr $C$DW$T$236, DW_AT_address_class(0x20)
    8919              
    8920              $C$DW$T$237     .dwtag  DW_TAG_typedef
    8921                      .dwattr $C$DW$T$237, DW_AT_name("AFSEL_Handle")
    8922                      .dwattr $C$DW$T$237, DW_AT_type(*$C$DW$T$236)
    8923                      .dwattr $C$DW$T$237, DW_AT_language(DW_LANG_C)
    8924              
    8925              
    8926              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    8927                      .dwattr $C$DW$T$38, DW_AT_name("_CLARKE_Obj_")
    8928                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x06)
    8929              $C$DW$927       .dwtag  DW_TAG_member
    8930                      .dwattr $C$DW$927, DW_AT_type(*$C$DW$T$35)
    8931                      .dwattr $C$DW$927, DW_AT_name("alpha_sf")
    8932                      .dwattr $C$DW$927, DW_AT_TI_symbol_name("_alpha_sf")
    8933                      .dwattr $C$DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8934                      .dwattr $C$DW$927, DW_AT_accessibility(DW_ACCESS_public)
    8935              
    8936              $C$DW$928       .dwtag  DW_TAG_member
    8937                      .dwattr $C$DW$928, DW_AT_type(*$C$DW$T$35)
    8938                      .dwattr $C$DW$928, DW_AT_name("beta_sf")
    8939                      .dwattr $C$DW$928, DW_AT_TI_symbol_name("_beta_sf")
    8940                      .dwattr $C$DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8941                      .dwattr $C$DW$928, DW_AT_accessibility(DW_ACCESS_public)
    8942              
    8943              $C$DW$929       .dwtag  DW_TAG_member
    8944                      .dwattr $C$DW$929, DW_AT_type(*$C$DW$T$37)
    8945                      .dwattr $C$DW$929, DW_AT_name("numSensors")
    8946                      .dwattr $C$DW$929, DW_AT_TI_symbol_name("_numSensors")
    8947                      .dwattr $C$DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8948                      .dwattr $C$DW$929, DW_AT_accessibility(DW_ACCESS_public)
    8949              
    8950                      .dwendtag $C$DW$T$38
    8951              
    8952              $C$DW$T$49      .dwtag  DW_TAG_typedef
    8953                      .dwattr $C$DW$T$49, DW_AT_name("CLARKE_Obj")
    8954                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$38)
    8955                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    8956              
    8957              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    8958                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$38)
    8959                      .dwattr $C$DW$T$47, DW_AT_address_class(0x20)
    8960              
    8961              $C$DW$T$48      .dwtag  DW_TAG_typedef
    8962                      .dwattr $C$DW$T$48, DW_AT_name("CLARKE_Handle")
    8963                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    8964                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    8965              
    8966              $C$DW$930       .dwtag  DW_TAG_TI_far_type
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:54:04 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{AFCBCAD4-90C2-4A1E-B05B-37E3FCD6034D} PAGE  176

    8967                      .dwattr $C$DW$930, DW_AT_type(*$C$DW$T$48)
    8968              
    8969              $C$DW$T$241     .dwtag  DW_TAG_const_type
    8970                      .dwattr $C$DW$T$241, DW_AT_type(*$C$DW$930)
    8971              
    8972              
    8973              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    8974                      .dwattr $C$DW$T$40, DW_AT_name("_CLK_Obj_")
    8975                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x11)
    8976              $C$DW$931       .dwtag  DW_TAG_member
    8977                      .dwattr $C$DW$931, DW_AT_type(*$C$DW$T$27)
    8978                      .dwattr $C$DW$931, DW_AT_name("XCLK")
    8979                      .dwattr $C$DW$931, DW_AT_TI_symbol_name("_XCLK")
    8980                      .dwattr $C$DW$931, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8981                      .dwattr $C$DW$931, DW_AT_accessibility(DW_ACCESS_public)
    8982              
    8983              $C$DW$932       .dwtag  DW_TAG_member
    8984                      .dwattr $C$DW$932, DW_AT_type(*$C$DW$T$27)
    8985                      .dwattr $C$DW$932, DW_AT_name("rsvd_1")
    8986                      .dwattr $C$DW$932, DW_AT_TI_symbol_name("_rsvd_1")
    8987                      .dwattr $C$DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8988                      .dwattr $C$DW$932, DW_AT_accessibility(DW_ACCESS_public)
    8989              
    8990              $C$DW$933       .dwtag  DW_TAG_member
    8991                      .dwattr $C$DW$933, DW_AT_type(*$C$DW$T$27)
    8992                      .dwattr $C$DW$933, DW_AT_name("CLKCTL")
    8993                      .dwattr $C$DW$933, DW_AT_TI_symbol_name("_CLKCTL")
    8994                      .dwattr $C$DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8995                      .dwattr $C$DW$933, DW_AT_accessibility(DW_ACCESS_public)
    8996              
    8997              $C$DW$934       .dwtag  DW_TAG_member
    8998                      .dwattr $C$DW$934, DW_AT_type(*$C$DW$T$39)
    8999                      .dwattr $C$DW$934, DW_AT_name("rsvd_2")
    9000                      .dwattr $C$DW$934, DW_AT_TI_symbol_name("_rsvd_2")
    9001                      .dwattr $C$DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9002                      .dwattr $C$DW$934, DW_AT_accessibility(DW_ACCESS_public)
    9003              
    9004              $C$DW$935       .dwtag  DW_TAG_member
    9005                      .dwattr $C$DW$935, DW_AT_type(*$C$DW$T$27)
    9006                      .dwattr $C$DW$935, DW_AT_name("LOSPCP")
    9007                      .dwattr $C$DW$935, DW_AT_TI_symbol_name("_LOSPCP")
    9008                      .dwattr $C$DW$935, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    9009                      .dwattr $C$DW$935, DW_AT_accessibility(DW_ACCESS_public)
    9010              
    9011              $C$DW$936       .dwtag  DW_TAG_member
    9012                      .dwattr $C$DW$936, DW_AT_type(*$C$DW$T$27)
    9013                      .dwattr $C$DW$936, DW_AT_name("PCLKCR0")
    9014                      .dwattr $C$DW$936, DW_AT_TI_symbol_name("_PCLKCR0")
    9015                      .dwattr $C$DW$936, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9016                      .dwattr $C$DW$936, DW_AT_accessibility(DW_ACCESS_public)
    9017              
    9018              $C$DW$937       .dwtag  DW_TAG_member
    9019                      .dwattr $C$DW$937, DW_AT_type(*$C$DW$T$27)
    9020                      .dwattr $C$DW$937, DW_AT_name("PCLKCR1")
    9021                      .dwattr $C$DW$937, DW_AT_TI_symbol_name("_PCLKCR1")
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:54:04 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{AFCBCAD4-90C2-4A1E-B05B-37E3FCD6034D} PAGE  177

    9022                      .dwattr $C$DW$937, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    9023                      .dwattr $C$DW$937, DW_AT_accessibility(DW_ACCESS_public)
    9024              
    9025              $C$DW$938       .dwtag  DW_TAG_member
    9026                      .dwattr $C$DW$938, DW_AT_type(*$C$DW$T$30)
    9027                      .dwattr $C$DW$938, DW_AT_name("rsvd_3")
    9028                      .dwattr $C$DW$938, DW_AT_TI_symbol_name("_rsvd_3")
    9029                      .dwattr $C$DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9030                      .dwattr $C$DW$938, DW_AT_accessibility(DW_ACCESS_public)
    9031              
    9032              $C$DW$939       .dwtag  DW_TAG_member
    9033                      .dwattr $C$DW$939, DW_AT_type(*$C$DW$T$27)
    9034                      .dwattr $C$DW$939, DW_AT_name("PCLKCR3")
    9035                      .dwattr $C$DW$939, DW_AT_TI_symbol_name("_PCLKCR3")
    9036                      .dwattr $C$DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9037                      .dwattr $C$DW$939, DW_AT_accessibility(DW_ACCESS_public)
    9038              
    9039                      .dwendtag $C$DW$T$40
    9040              
    9041              $C$DW$T$126     .dwtag  DW_TAG_pointer_type
    9042                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$40)
    9043                      .dwattr $C$DW$T$126, DW_AT_address_class(0x20)
    9044              
    9045              $C$DW$T$127     .dwtag  DW_TAG_typedef
    9046                      .dwattr $C$DW$T$127, DW_AT_name("CLK_Handle")
    9047                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
    9048                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    9049              
    9050              
    9051              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    9052                      .dwattr $C$DW$T$41, DW_AT_name("_CPU_Obj_")
    9053                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    9054              $C$DW$940       .dwtag  DW_TAG_member
    9055                      .dwattr $C$DW$940, DW_AT_type(*$C$DW$T$37)
    9056                      .dwattr $C$DW$940, DW_AT_name("tmp")
    9057                      .dwattr $C$DW$940, DW_AT_TI_symbol_name("_tmp")
    9058                      .dwattr $C$DW$940, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9059                      .dwattr $C$DW$940, DW_AT_accessibility(DW_ACCESS_public)
    9060              
    9061                      .dwendtag $C$DW$T$41
    9062              
    9063              $C$DW$T$128     .dwtag  DW_TAG_pointer_type
    9064                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$41)
    9065                      .dwattr $C$DW$T$128, DW_AT_address_class(0x20)
    9066              
    9067              $C$DW$T$129     .dwtag  DW_TAG_typedef
    9068                      .dwattr $C$DW$T$129, DW_AT_name("CPU_Handle")
    9069                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$128)
    9070                      .dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
    9071              
    9072              
    9073              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    9074                      .dwattr $C$DW$T$77, DW_AT_name("_CTRL_Obj_")
    9075                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x10a)
    9076              $C$DW$941       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:54:04 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{AFCBCAD4-90C2-4A1E-B05B-37E3FCD6034D} PAGE  178

    9077                      .dwattr $C$DW$941, DW_AT_type(*$C$DW$T$42)
    9078                      .dwattr $C$DW$941, DW_AT_name("version")
    9079                      .dwattr $C$DW$941, DW_AT_TI_symbol_name("_version")
    9080                      .dwattr $C$DW$941, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9081                      .dwattr $C$DW$941, DW_AT_accessibility(DW_ACCESS_public)
    9082              
    9083              $C$DW$942       .dwtag  DW_TAG_member
    9084                      .dwattr $C$DW$942, DW_AT_type(*$C$DW$T$44)
    9085                      .dwattr $C$DW$942, DW_AT_name("state")
    9086                      .dwattr $C$DW$942, DW_AT_TI_symbol_name("_state")
    9087                      .dwattr $C$DW$942, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9088                      .dwattr $C$DW$942, DW_AT_accessibility(DW_ACCESS_public)
    9089              
    9090              $C$DW$943       .dwtag  DW_TAG_member
    9091                      .dwattr $C$DW$943, DW_AT_type(*$C$DW$T$44)
    9092                      .dwattr $C$DW$943, DW_AT_name("prevState")
    9093                      .dwattr $C$DW$943, DW_AT_TI_symbol_name("_prevState")
    9094                      .dwattr $C$DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9095                      .dwattr $C$DW$943, DW_AT_accessibility(DW_ACCESS_public)
    9096              
    9097              $C$DW$944       .dwtag  DW_TAG_member
    9098                      .dwattr $C$DW$944, DW_AT_type(*$C$DW$T$46)
    9099                      .dwattr $C$DW$944, DW_AT_name("errorCode")
    9100                      .dwattr $C$DW$944, DW_AT_TI_symbol_name("_errorCode")
    9101                      .dwattr $C$DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9102                      .dwattr $C$DW$944, DW_AT_accessibility(DW_ACCESS_public)
    9103              
    9104              $C$DW$945       .dwtag  DW_TAG_member
    9105                      .dwattr $C$DW$945, DW_AT_type(*$C$DW$T$48)
    9106                      .dwattr $C$DW$945, DW_AT_name("clarkeHandle_I")
    9107                      .dwattr $C$DW$945, DW_AT_TI_symbol_name("_clarkeHandle_I")
    9108                      .dwattr $C$DW$945, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9109                      .dwattr $C$DW$945, DW_AT_accessibility(DW_ACCESS_public)
    9110              
    9111              $C$DW$946       .dwtag  DW_TAG_member
    9112                      .dwattr $C$DW$946, DW_AT_type(*$C$DW$T$49)
    9113                      .dwattr $C$DW$946, DW_AT_name("clarke_I")
    9114                      .dwattr $C$DW$946, DW_AT_TI_symbol_name("_clarke_I")
    9115                      .dwattr $C$DW$946, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9116                      .dwattr $C$DW$946, DW_AT_accessibility(DW_ACCESS_public)
    9117              
    9118              $C$DW$947       .dwtag  DW_TAG_member
    9119                      .dwattr $C$DW$947, DW_AT_type(*$C$DW$T$48)
    9120                      .dwattr $C$DW$947, DW_AT_name("clarkeHandle_V")
    9121                      .dwattr $C$DW$947, DW_AT_TI_symbol_name("_clarkeHandle_V")
    9122                      .dwattr $C$DW$947, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9123                      .dwattr $C$DW$947, DW_AT_accessibility(DW_ACCESS_public)
    9124              
    9125              $C$DW$948       .dwtag  DW_TAG_member
    9126                      .dwattr $C$DW$948, DW_AT_type(*$C$DW$T$49)
    9127                      .dwattr $C$DW$948, DW_AT_name("clarke_V")
    9128                      .dwattr $C$DW$948, DW_AT_TI_symbol_name("_clarke_V")
    9129                      .dwattr $C$DW$948, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9130                      .dwattr $C$DW$948, DW_AT_accessibility(DW_ACCESS_public)
    9131              
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:54:04 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{AFCBCAD4-90C2-4A1E-B05B-37E3FCD6034D} PAGE  179

    9132              $C$DW$949       .dwtag  DW_TAG_member
    9133                      .dwattr $C$DW$949, DW_AT_type(*$C$DW$T$51)
    9134                      .dwattr $C$DW$949, DW_AT_name("estHandle")
    9135                      .dwattr $C$DW$949, DW_AT_TI_symbol_name("_estHandle")
    9136                      .dwattr $C$DW$949, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9137                      .dwattr $C$DW$949, DW_AT_accessibility(DW_ACCESS_public)
    9138              
    9139              $C$DW$950       .dwtag  DW_TAG_member
    9140                      .dwattr $C$DW$950, DW_AT_type(*$C$DW$T$53)
    9141                      .dwattr $C$DW$950, DW_AT_name("parkHandle")
    9142                      .dwattr $C$DW$950, DW_AT_TI_symbol_name("_parkHandle")
    9143                      .dwattr $C$DW$950, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9144                      .dwattr $C$DW$950, DW_AT_accessibility(DW_ACCESS_public)
    9145              
    9146              $C$DW$951       .dwtag  DW_TAG_member
    9147                      .dwattr $C$DW$951, DW_AT_type(*$C$DW$T$54)
    9148                      .dwattr $C$DW$951, DW_AT_name("park")
    9149                      .dwattr $C$DW$951, DW_AT_TI_symbol_name("_park")
    9150                      .dwattr $C$DW$951, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9151                      .dwattr $C$DW$951, DW_AT_accessibility(DW_ACCESS_public)
    9152              
    9153              $C$DW$952       .dwtag  DW_TAG_member
    9154                      .dwattr $C$DW$952, DW_AT_type(*$C$DW$T$56)
    9155                      .dwattr $C$DW$952, DW_AT_name("pidHandle_Id")
    9156                      .dwattr $C$DW$952, DW_AT_TI_symbol_name("_pidHandle_Id")
    9157                      .dwattr $C$DW$952, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    9158                      .dwattr $C$DW$952, DW_AT_accessibility(DW_ACCESS_public)
    9159              
    9160              $C$DW$953       .dwtag  DW_TAG_member
    9161                      .dwattr $C$DW$953, DW_AT_type(*$C$DW$T$57)
    9162                      .dwattr $C$DW$953, DW_AT_name("pid_Id")
    9163                      .dwattr $C$DW$953, DW_AT_TI_symbol_name("_pid_Id")
    9164                      .dwattr $C$DW$953, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    9165                      .dwattr $C$DW$953, DW_AT_accessibility(DW_ACCESS_public)
    9166              
    9167              $C$DW$954       .dwtag  DW_TAG_member
    9168                      .dwattr $C$DW$954, DW_AT_type(*$C$DW$T$56)
    9169                      .dwattr $C$DW$954, DW_AT_name("pidHandle_Iq")
    9170                      .dwattr $C$DW$954, DW_AT_TI_symbol_name("_pidHandle_Iq")
    9171                      .dwattr $C$DW$954, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    9172                      .dwattr $C$DW$954, DW_AT_accessibility(DW_ACCESS_public)
    9173              
    9174              $C$DW$955       .dwtag  DW_TAG_member
    9175                      .dwattr $C$DW$955, DW_AT_type(*$C$DW$T$57)
    9176                      .dwattr $C$DW$955, DW_AT_name("pid_Iq")
    9177                      .dwattr $C$DW$955, DW_AT_TI_symbol_name("_pid_Iq")
    9178                      .dwattr $C$DW$955, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    9179                      .dwattr $C$DW$955, DW_AT_accessibility(DW_ACCESS_public)
    9180              
    9181              $C$DW$956       .dwtag  DW_TAG_member
    9182                      .dwattr $C$DW$956, DW_AT_type(*$C$DW$T$56)
    9183                      .dwattr $C$DW$956, DW_AT_name("pidHandle_spd")
    9184                      .dwattr $C$DW$956, DW_AT_TI_symbol_name("_pidHandle_spd")
    9185                      .dwattr $C$DW$956, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    9186                      .dwattr $C$DW$956, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:54:04 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{AFCBCAD4-90C2-4A1E-B05B-37E3FCD6034D} PAGE  180

    9187              
    9188              $C$DW$957       .dwtag  DW_TAG_member
    9189                      .dwattr $C$DW$957, DW_AT_type(*$C$DW$T$57)
    9190                      .dwattr $C$DW$957, DW_AT_name("pid_spd")
    9191                      .dwattr $C$DW$957, DW_AT_TI_symbol_name("_pid_spd")
    9192                      .dwattr $C$DW$957, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    9193                      .dwattr $C$DW$957, DW_AT_accessibility(DW_ACCESS_public)
    9194              
    9195              $C$DW$958       .dwtag  DW_TAG_member
    9196                      .dwattr $C$DW$958, DW_AT_type(*$C$DW$T$59)
    9197                      .dwattr $C$DW$958, DW_AT_name("iparkHandle")
    9198                      .dwattr $C$DW$958, DW_AT_TI_symbol_name("_iparkHandle")
    9199                      .dwattr $C$DW$958, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    9200                      .dwattr $C$DW$958, DW_AT_accessibility(DW_ACCESS_public)
    9201              
    9202              $C$DW$959       .dwtag  DW_TAG_member
    9203                      .dwattr $C$DW$959, DW_AT_type(*$C$DW$T$60)
    9204                      .dwattr $C$DW$959, DW_AT_name("ipark")
    9205                      .dwattr $C$DW$959, DW_AT_TI_symbol_name("_ipark")
    9206                      .dwattr $C$DW$959, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    9207                      .dwattr $C$DW$959, DW_AT_accessibility(DW_ACCESS_public)
    9208              
    9209              $C$DW$960       .dwtag  DW_TAG_member
    9210                      .dwattr $C$DW$960, DW_AT_type(*$C$DW$T$62)
    9211                      .dwattr $C$DW$960, DW_AT_name("svgenHandle")
    9212                      .dwattr $C$DW$960, DW_AT_TI_symbol_name("_svgenHandle")
    9213                      .dwattr $C$DW$960, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    9214                      .dwattr $C$DW$960, DW_AT_accessibility(DW_ACCESS_public)
    9215              
    9216              $C$DW$961       .dwtag  DW_TAG_member
    9217                      .dwattr $C$DW$961, DW_AT_type(*$C$DW$T$63)
    9218                      .dwattr $C$DW$961, DW_AT_name("svgen")
    9219                      .dwattr $C$DW$961, DW_AT_TI_symbol_name("_svgen")
    9220                      .dwattr $C$DW$961, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    9221                      .dwattr $C$DW$961, DW_AT_accessibility(DW_ACCESS_public)
    9222              
    9223              $C$DW$962       .dwtag  DW_TAG_member
    9224                      .dwattr $C$DW$962, DW_AT_type(*$C$DW$T$65)
    9225                      .dwattr $C$DW$962, DW_AT_name("trajHandle_Id")
    9226                      .dwattr $C$DW$962, DW_AT_TI_symbol_name("_trajHandle_Id")
    9227                      .dwattr $C$DW$962, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    9228                      .dwattr $C$DW$962, DW_AT_accessibility(DW_ACCESS_public)
    9229              
    9230              $C$DW$963       .dwtag  DW_TAG_member
    9231                      .dwattr $C$DW$963, DW_AT_type(*$C$DW$T$66)
    9232                      .dwattr $C$DW$963, DW_AT_name("traj_Id")
    9233                      .dwattr $C$DW$963, DW_AT_TI_symbol_name("_traj_Id")
    9234                      .dwattr $C$DW$963, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    9235                      .dwattr $C$DW$963, DW_AT_accessibility(DW_ACCESS_public)
    9236              
    9237              $C$DW$964       .dwtag  DW_TAG_member
    9238                      .dwattr $C$DW$964, DW_AT_type(*$C$DW$T$65)
    9239                      .dwattr $C$DW$964, DW_AT_name("trajHandle_spd")
    9240                      .dwattr $C$DW$964, DW_AT_TI_symbol_name("_trajHandle_spd")
    9241                      .dwattr $C$DW$964, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:54:04 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{AFCBCAD4-90C2-4A1E-B05B-37E3FCD6034D} PAGE  181

    9242                      .dwattr $C$DW$964, DW_AT_accessibility(DW_ACCESS_public)
    9243              
    9244              $C$DW$965       .dwtag  DW_TAG_member
    9245                      .dwattr $C$DW$965, DW_AT_type(*$C$DW$T$66)
    9246                      .dwattr $C$DW$965, DW_AT_name("traj_spd")
    9247                      .dwattr $C$DW$965, DW_AT_TI_symbol_name("_traj_spd")
    9248                      .dwattr $C$DW$965, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    9249                      .dwattr $C$DW$965, DW_AT_accessibility(DW_ACCESS_public)
    9250              
    9251              $C$DW$966       .dwtag  DW_TAG_member
    9252                      .dwattr $C$DW$966, DW_AT_type(*$C$DW$T$65)
    9253                      .dwattr $C$DW$966, DW_AT_name("trajHandle_spdMax")
    9254                      .dwattr $C$DW$966, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    9255                      .dwattr $C$DW$966, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    9256                      .dwattr $C$DW$966, DW_AT_accessibility(DW_ACCESS_public)
    9257              
    9258              $C$DW$967       .dwtag  DW_TAG_member
    9259                      .dwattr $C$DW$967, DW_AT_type(*$C$DW$T$66)
    9260                      .dwattr $C$DW$967, DW_AT_name("traj_spdMax")
    9261                      .dwattr $C$DW$967, DW_AT_TI_symbol_name("_traj_spdMax")
    9262                      .dwattr $C$DW$967, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    9263                      .dwattr $C$DW$967, DW_AT_accessibility(DW_ACCESS_public)
    9264              
    9265              $C$DW$968       .dwtag  DW_TAG_member
    9266                      .dwattr $C$DW$968, DW_AT_type(*$C$DW$T$67)
    9267                      .dwattr $C$DW$968, DW_AT_name("motorParams")
    9268                      .dwattr $C$DW$968, DW_AT_TI_symbol_name("_motorParams")
    9269                      .dwattr $C$DW$968, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    9270                      .dwattr $C$DW$968, DW_AT_accessibility(DW_ACCESS_public)
    9271              
    9272              $C$DW$969       .dwtag  DW_TAG_member
    9273                      .dwattr $C$DW$969, DW_AT_type(*$C$DW$T$71)
    9274                      .dwattr $C$DW$969, DW_AT_name("waitTimes")
    9275                      .dwattr $C$DW$969, DW_AT_TI_symbol_name("_waitTimes")
    9276                      .dwattr $C$DW$969, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    9277                      .dwattr $C$DW$969, DW_AT_accessibility(DW_ACCESS_public)
    9278              
    9279              $C$DW$970       .dwtag  DW_TAG_member
    9280                      .dwattr $C$DW$970, DW_AT_type(*$C$DW$T$70)
    9281                      .dwattr $C$DW$970, DW_AT_name("counter_state")
    9282                      .dwattr $C$DW$970, DW_AT_TI_symbol_name("_counter_state")
    9283                      .dwattr $C$DW$970, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    9284                      .dwattr $C$DW$970, DW_AT_accessibility(DW_ACCESS_public)
    9285              
    9286              $C$DW$971       .dwtag  DW_TAG_member
    9287                      .dwattr $C$DW$971, DW_AT_type(*$C$DW$T$73)
    9288                      .dwattr $C$DW$971, DW_AT_name("numIsrTicksPerCtrlTick")
    9289                      .dwattr $C$DW$971, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    9290                      .dwattr $C$DW$971, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    9291                      .dwattr $C$DW$971, DW_AT_accessibility(DW_ACCESS_public)
    9292              
    9293              $C$DW$972       .dwtag  DW_TAG_member
    9294                      .dwattr $C$DW$972, DW_AT_type(*$C$DW$T$73)
    9295                      .dwattr $C$DW$972, DW_AT_name("numCtrlTicksPerCurrentTick")
    9296                      .dwattr $C$DW$972, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:54:04 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{AFCBCAD4-90C2-4A1E-B05B-37E3FCD6034D} PAGE  182

    9297                      .dwattr $C$DW$972, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    9298                      .dwattr $C$DW$972, DW_AT_accessibility(DW_ACCESS_public)
    9299              
    9300              $C$DW$973       .dwtag  DW_TAG_member
    9301                      .dwattr $C$DW$973, DW_AT_type(*$C$DW$T$73)
    9302                      .dwattr $C$DW$973, DW_AT_name("numCtrlTicksPerSpeedTick")
    9303                      .dwattr $C$DW$973, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    9304                      .dwattr $C$DW$973, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    9305                      .dwattr $C$DW$973, DW_AT_accessibility(DW_ACCESS_public)
    9306              
    9307              $C$DW$974       .dwtag  DW_TAG_member
    9308                      .dwattr $C$DW$974, DW_AT_type(*$C$DW$T$73)
    9309                      .dwattr $C$DW$974, DW_AT_name("numCtrlTicksPerTrajTick")
    9310                      .dwattr $C$DW$974, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    9311                      .dwattr $C$DW$974, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    9312                      .dwattr $C$DW$974, DW_AT_accessibility(DW_ACCESS_public)
    9313              
    9314              $C$DW$975       .dwtag  DW_TAG_member
    9315                      .dwattr $C$DW$975, DW_AT_type(*$C$DW$T$70)
    9316                      .dwattr $C$DW$975, DW_AT_name("ctrlFreq_Hz")
    9317                      .dwattr $C$DW$975, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    9318                      .dwattr $C$DW$975, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    9319                      .dwattr $C$DW$975, DW_AT_accessibility(DW_ACCESS_public)
    9320              
    9321              $C$DW$976       .dwtag  DW_TAG_member
    9322                      .dwattr $C$DW$976, DW_AT_type(*$C$DW$T$70)
    9323                      .dwattr $C$DW$976, DW_AT_name("trajFreq_Hz")
    9324                      .dwattr $C$DW$976, DW_AT_TI_symbol_name("_trajFreq_Hz")
    9325                      .dwattr $C$DW$976, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    9326                      .dwattr $C$DW$976, DW_AT_accessibility(DW_ACCESS_public)
    9327              
    9328              $C$DW$977       .dwtag  DW_TAG_member
    9329                      .dwattr $C$DW$977, DW_AT_type(*$C$DW$T$35)
    9330                      .dwattr $C$DW$977, DW_AT_name("trajPeriod_sec")
    9331                      .dwattr $C$DW$977, DW_AT_TI_symbol_name("_trajPeriod_sec")
    9332                      .dwattr $C$DW$977, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    9333                      .dwattr $C$DW$977, DW_AT_accessibility(DW_ACCESS_public)
    9334              
    9335              $C$DW$978       .dwtag  DW_TAG_member
    9336                      .dwattr $C$DW$978, DW_AT_type(*$C$DW$T$74)
    9337                      .dwattr $C$DW$978, DW_AT_name("ctrlPeriod_sec")
    9338                      .dwattr $C$DW$978, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    9339                      .dwattr $C$DW$978, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    9340                      .dwattr $C$DW$978, DW_AT_accessibility(DW_ACCESS_public)
    9341              
    9342              $C$DW$979       .dwtag  DW_TAG_member
    9343                      .dwattr $C$DW$979, DW_AT_type(*$C$DW$T$35)
    9344                      .dwattr $C$DW$979, DW_AT_name("maxVsMag_pu")
    9345                      .dwattr $C$DW$979, DW_AT_TI_symbol_name("_maxVsMag_pu")
    9346                      .dwattr $C$DW$979, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    9347                      .dwattr $C$DW$979, DW_AT_accessibility(DW_ACCESS_public)
    9348              
    9349              $C$DW$980       .dwtag  DW_TAG_member
    9350                      .dwattr $C$DW$980, DW_AT_type(*$C$DW$T$75)
    9351                      .dwattr $C$DW$980, DW_AT_name("Iab_in")
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:54:04 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{AFCBCAD4-90C2-4A1E-B05B-37E3FCD6034D} PAGE  183

    9352                      .dwattr $C$DW$980, DW_AT_TI_symbol_name("_Iab_in")
    9353                      .dwattr $C$DW$980, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    9354                      .dwattr $C$DW$980, DW_AT_accessibility(DW_ACCESS_public)
    9355              
    9356              $C$DW$981       .dwtag  DW_TAG_member
    9357                      .dwattr $C$DW$981, DW_AT_type(*$C$DW$T$75)
    9358                      .dwattr $C$DW$981, DW_AT_name("Iab_filt")
    9359                      .dwattr $C$DW$981, DW_AT_TI_symbol_name("_Iab_filt")
    9360                      .dwattr $C$DW$981, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    9361                      .dwattr $C$DW$981, DW_AT_accessibility(DW_ACCESS_public)
    9362              
    9363              $C$DW$982       .dwtag  DW_TAG_member
    9364                      .dwattr $C$DW$982, DW_AT_type(*$C$DW$T$75)
    9365                      .dwattr $C$DW$982, DW_AT_name("Idq_in")
    9366                      .dwattr $C$DW$982, DW_AT_TI_symbol_name("_Idq_in")
    9367                      .dwattr $C$DW$982, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    9368                      .dwattr $C$DW$982, DW_AT_accessibility(DW_ACCESS_public)
    9369              
    9370              $C$DW$983       .dwtag  DW_TAG_member
    9371                      .dwattr $C$DW$983, DW_AT_type(*$C$DW$T$75)
    9372                      .dwattr $C$DW$983, DW_AT_name("Vab_in")
    9373                      .dwattr $C$DW$983, DW_AT_TI_symbol_name("_Vab_in")
    9374                      .dwattr $C$DW$983, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    9375                      .dwattr $C$DW$983, DW_AT_accessibility(DW_ACCESS_public)
    9376              
    9377              $C$DW$984       .dwtag  DW_TAG_member
    9378                      .dwattr $C$DW$984, DW_AT_type(*$C$DW$T$35)
    9379                      .dwattr $C$DW$984, DW_AT_name("spd_out")
    9380                      .dwattr $C$DW$984, DW_AT_TI_symbol_name("_spd_out")
    9381                      .dwattr $C$DW$984, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    9382                      .dwattr $C$DW$984, DW_AT_accessibility(DW_ACCESS_public)
    9383              
    9384              $C$DW$985       .dwtag  DW_TAG_member
    9385                      .dwattr $C$DW$985, DW_AT_type(*$C$DW$T$75)
    9386                      .dwattr $C$DW$985, DW_AT_name("Vab_out")
    9387                      .dwattr $C$DW$985, DW_AT_TI_symbol_name("_Vab_out")
    9388                      .dwattr $C$DW$985, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    9389                      .dwattr $C$DW$985, DW_AT_accessibility(DW_ACCESS_public)
    9390              
    9391              $C$DW$986       .dwtag  DW_TAG_member
    9392                      .dwattr $C$DW$986, DW_AT_type(*$C$DW$T$75)
    9393                      .dwattr $C$DW$986, DW_AT_name("Vdq_out")
    9394                      .dwattr $C$DW$986, DW_AT_TI_symbol_name("_Vdq_out")
    9395                      .dwattr $C$DW$986, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    9396                      .dwattr $C$DW$986, DW_AT_accessibility(DW_ACCESS_public)
    9397              
    9398              $C$DW$987       .dwtag  DW_TAG_member
    9399                      .dwattr $C$DW$987, DW_AT_type(*$C$DW$T$74)
    9400                      .dwattr $C$DW$987, DW_AT_name("Rhf")
    9401                      .dwattr $C$DW$987, DW_AT_TI_symbol_name("_Rhf")
    9402                      .dwattr $C$DW$987, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    9403                      .dwattr $C$DW$987, DW_AT_accessibility(DW_ACCESS_public)
    9404              
    9405              $C$DW$988       .dwtag  DW_TAG_member
    9406                      .dwattr $C$DW$988, DW_AT_type(*$C$DW$T$74)
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:54:04 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{AFCBCAD4-90C2-4A1E-B05B-37E3FCD6034D} PAGE  184

    9407                      .dwattr $C$DW$988, DW_AT_name("Lhf")
    9408                      .dwattr $C$DW$988, DW_AT_TI_symbol_name("_Lhf")
    9409                      .dwattr $C$DW$988, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    9410                      .dwattr $C$DW$988, DW_AT_accessibility(DW_ACCESS_public)
    9411              
    9412              $C$DW$989       .dwtag  DW_TAG_member
    9413                      .dwattr $C$DW$989, DW_AT_type(*$C$DW$T$74)
    9414                      .dwattr $C$DW$989, DW_AT_name("RoverL")
    9415                      .dwattr $C$DW$989, DW_AT_TI_symbol_name("_RoverL")
    9416                      .dwattr $C$DW$989, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    9417                      .dwattr $C$DW$989, DW_AT_accessibility(DW_ACCESS_public)
    9418              
    9419              $C$DW$990       .dwtag  DW_TAG_member
    9420                      .dwattr $C$DW$990, DW_AT_type(*$C$DW$T$35)
    9421                      .dwattr $C$DW$990, DW_AT_name("Kp_Id")
    9422                      .dwattr $C$DW$990, DW_AT_TI_symbol_name("_Kp_Id")
    9423                      .dwattr $C$DW$990, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    9424                      .dwattr $C$DW$990, DW_AT_accessibility(DW_ACCESS_public)
    9425              
    9426              $C$DW$991       .dwtag  DW_TAG_member
    9427                      .dwattr $C$DW$991, DW_AT_type(*$C$DW$T$35)
    9428                      .dwattr $C$DW$991, DW_AT_name("Kp_Iq")
    9429                      .dwattr $C$DW$991, DW_AT_TI_symbol_name("_Kp_Iq")
    9430                      .dwattr $C$DW$991, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    9431                      .dwattr $C$DW$991, DW_AT_accessibility(DW_ACCESS_public)
    9432              
    9433              $C$DW$992       .dwtag  DW_TAG_member
    9434                      .dwattr $C$DW$992, DW_AT_type(*$C$DW$T$35)
    9435                      .dwattr $C$DW$992, DW_AT_name("Kp_spd")
    9436                      .dwattr $C$DW$992, DW_AT_TI_symbol_name("_Kp_spd")
    9437                      .dwattr $C$DW$992, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    9438                      .dwattr $C$DW$992, DW_AT_accessibility(DW_ACCESS_public)
    9439              
    9440              $C$DW$993       .dwtag  DW_TAG_member
    9441                      .dwattr $C$DW$993, DW_AT_type(*$C$DW$T$35)
    9442                      .dwattr $C$DW$993, DW_AT_name("Ki_Id")
    9443                      .dwattr $C$DW$993, DW_AT_TI_symbol_name("_Ki_Id")
    9444                      .dwattr $C$DW$993, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    9445                      .dwattr $C$DW$993, DW_AT_accessibility(DW_ACCESS_public)
    9446              
    9447              $C$DW$994       .dwtag  DW_TAG_member
    9448                      .dwattr $C$DW$994, DW_AT_type(*$C$DW$T$35)
    9449                      .dwattr $C$DW$994, DW_AT_name("Ki_Iq")
    9450                      .dwattr $C$DW$994, DW_AT_TI_symbol_name("_Ki_Iq")
    9451                      .dwattr $C$DW$994, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    9452                      .dwattr $C$DW$994, DW_AT_accessibility(DW_ACCESS_public)
    9453              
    9454              $C$DW$995       .dwtag  DW_TAG_member
    9455                      .dwattr $C$DW$995, DW_AT_type(*$C$DW$T$35)
    9456                      .dwattr $C$DW$995, DW_AT_name("Ki_spd")
    9457                      .dwattr $C$DW$995, DW_AT_TI_symbol_name("_Ki_spd")
    9458                      .dwattr $C$DW$995, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    9459                      .dwattr $C$DW$995, DW_AT_accessibility(DW_ACCESS_public)
    9460              
    9461              $C$DW$996       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:54:04 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{AFCBCAD4-90C2-4A1E-B05B-37E3FCD6034D} PAGE  185

    9462                      .dwattr $C$DW$996, DW_AT_type(*$C$DW$T$35)
    9463                      .dwattr $C$DW$996, DW_AT_name("Kd_Id")
    9464                      .dwattr $C$DW$996, DW_AT_TI_symbol_name("_Kd_Id")
    9465                      .dwattr $C$DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    9466                      .dwattr $C$DW$996, DW_AT_accessibility(DW_ACCESS_public)
    9467              
    9468              $C$DW$997       .dwtag  DW_TAG_member
    9469                      .dwattr $C$DW$997, DW_AT_type(*$C$DW$T$35)
    9470                      .dwattr $C$DW$997, DW_AT_name("Kd_Iq")
    9471                      .dwattr $C$DW$997, DW_AT_TI_symbol_name("_Kd_Iq")
    9472                      .dwattr $C$DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    9473                      .dwattr $C$DW$997, DW_AT_accessibility(DW_ACCESS_public)
    9474              
    9475              $C$DW$998       .dwtag  DW_TAG_member
    9476                      .dwattr $C$DW$998, DW_AT_type(*$C$DW$T$35)
    9477                      .dwattr $C$DW$998, DW_AT_name("Kd_spd")
    9478                      .dwattr $C$DW$998, DW_AT_TI_symbol_name("_Kd_spd")
    9479                      .dwattr $C$DW$998, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    9480                      .dwattr $C$DW$998, DW_AT_accessibility(DW_ACCESS_public)
    9481              
    9482              $C$DW$999       .dwtag  DW_TAG_member
    9483                      .dwattr $C$DW$999, DW_AT_type(*$C$DW$T$35)
    9484                      .dwattr $C$DW$999, DW_AT_name("Ui_Id")
    9485                      .dwattr $C$DW$999, DW_AT_TI_symbol_name("_Ui_Id")
    9486                      .dwattr $C$DW$999, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    9487                      .dwattr $C$DW$999, DW_AT_accessibility(DW_ACCESS_public)
    9488              
    9489              $C$DW$1000      .dwtag  DW_TAG_member
    9490                      .dwattr $C$DW$1000, DW_AT_type(*$C$DW$T$35)
    9491                      .dwattr $C$DW$1000, DW_AT_name("Ui_Iq")
    9492                      .dwattr $C$DW$1000, DW_AT_TI_symbol_name("_Ui_Iq")
    9493                      .dwattr $C$DW$1000, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    9494                      .dwattr $C$DW$1000, DW_AT_accessibility(DW_ACCESS_public)
    9495              
    9496              $C$DW$1001      .dwtag  DW_TAG_member
    9497                      .dwattr $C$DW$1001, DW_AT_type(*$C$DW$T$35)
    9498                      .dwattr $C$DW$1001, DW_AT_name("Ui_spd")
    9499                      .dwattr $C$DW$1001, DW_AT_TI_symbol_name("_Ui_spd")
    9500                      .dwattr $C$DW$1001, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    9501                      .dwattr $C$DW$1001, DW_AT_accessibility(DW_ACCESS_public)
    9502              
    9503              $C$DW$1002      .dwtag  DW_TAG_member
    9504                      .dwattr $C$DW$1002, DW_AT_type(*$C$DW$T$75)
    9505                      .dwattr $C$DW$1002, DW_AT_name("Idq_ref")
    9506                      .dwattr $C$DW$1002, DW_AT_TI_symbol_name("_Idq_ref")
    9507                      .dwattr $C$DW$1002, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    9508                      .dwattr $C$DW$1002, DW_AT_accessibility(DW_ACCESS_public)
    9509              
    9510              $C$DW$1003      .dwtag  DW_TAG_member
    9511                      .dwattr $C$DW$1003, DW_AT_type(*$C$DW$T$35)
    9512                      .dwattr $C$DW$1003, DW_AT_name("IdRated")
    9513                      .dwattr $C$DW$1003, DW_AT_TI_symbol_name("_IdRated")
    9514                      .dwattr $C$DW$1003, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    9515                      .dwattr $C$DW$1003, DW_AT_accessibility(DW_ACCESS_public)
    9516              
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:54:04 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{AFCBCAD4-90C2-4A1E-B05B-37E3FCD6034D} PAGE  186

    9517              $C$DW$1004      .dwtag  DW_TAG_member
    9518                      .dwattr $C$DW$1004, DW_AT_type(*$C$DW$T$35)
    9519                      .dwattr $C$DW$1004, DW_AT_name("spd_ref")
    9520                      .dwattr $C$DW$1004, DW_AT_TI_symbol_name("_spd_ref")
    9521                      .dwattr $C$DW$1004, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    9522                      .dwattr $C$DW$1004, DW_AT_accessibility(DW_ACCESS_public)
    9523              
    9524              $C$DW$1005      .dwtag  DW_TAG_member
    9525                      .dwattr $C$DW$1005, DW_AT_type(*$C$DW$T$35)
    9526                      .dwattr $C$DW$1005, DW_AT_name("spd_max")
    9527                      .dwattr $C$DW$1005, DW_AT_TI_symbol_name("_spd_max")
    9528                      .dwattr $C$DW$1005, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    9529                      .dwattr $C$DW$1005, DW_AT_accessibility(DW_ACCESS_public)
    9530              
    9531              $C$DW$1006      .dwtag  DW_TAG_member
    9532                      .dwattr $C$DW$1006, DW_AT_type(*$C$DW$T$73)
    9533                      .dwattr $C$DW$1006, DW_AT_name("counter_current")
    9534                      .dwattr $C$DW$1006, DW_AT_TI_symbol_name("_counter_current")
    9535                      .dwattr $C$DW$1006, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    9536                      .dwattr $C$DW$1006, DW_AT_accessibility(DW_ACCESS_public)
    9537              
    9538              $C$DW$1007      .dwtag  DW_TAG_member
    9539                      .dwattr $C$DW$1007, DW_AT_type(*$C$DW$T$73)
    9540                      .dwattr $C$DW$1007, DW_AT_name("counter_isr")
    9541                      .dwattr $C$DW$1007, DW_AT_TI_symbol_name("_counter_isr")
    9542                      .dwattr $C$DW$1007, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    9543                      .dwattr $C$DW$1007, DW_AT_accessibility(DW_ACCESS_public)
    9544              
    9545              $C$DW$1008      .dwtag  DW_TAG_member
    9546                      .dwattr $C$DW$1008, DW_AT_type(*$C$DW$T$73)
    9547                      .dwattr $C$DW$1008, DW_AT_name("counter_speed")
    9548                      .dwattr $C$DW$1008, DW_AT_TI_symbol_name("_counter_speed")
    9549                      .dwattr $C$DW$1008, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    9550                      .dwattr $C$DW$1008, DW_AT_accessibility(DW_ACCESS_public)
    9551              
    9552              $C$DW$1009      .dwtag  DW_TAG_member
    9553                      .dwattr $C$DW$1009, DW_AT_type(*$C$DW$T$73)
    9554                      .dwattr $C$DW$1009, DW_AT_name("counter_traj")
    9555                      .dwattr $C$DW$1009, DW_AT_TI_symbol_name("_counter_traj")
    9556                      .dwattr $C$DW$1009, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    9557                      .dwattr $C$DW$1009, DW_AT_accessibility(DW_ACCESS_public)
    9558              
    9559              $C$DW$1010      .dwtag  DW_TAG_member
    9560                      .dwattr $C$DW$1010, DW_AT_type(*$C$DW$T$76)
    9561                      .dwattr $C$DW$1010, DW_AT_name("flag_enableCtrl")
    9562                      .dwattr $C$DW$1010, DW_AT_TI_symbol_name("_flag_enableCtrl")
    9563                      .dwattr $C$DW$1010, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    9564                      .dwattr $C$DW$1010, DW_AT_accessibility(DW_ACCESS_public)
    9565              
    9566              $C$DW$1011      .dwtag  DW_TAG_member
    9567                      .dwattr $C$DW$1011, DW_AT_type(*$C$DW$T$76)
    9568                      .dwattr $C$DW$1011, DW_AT_name("flag_enableDcBusComp")
    9569                      .dwattr $C$DW$1011, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    9570                      .dwattr $C$DW$1011, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    9571                      .dwattr $C$DW$1011, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:54:04 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{AFCBCAD4-90C2-4A1E-B05B-37E3FCD6034D} PAGE  187

    9572              
    9573              $C$DW$1012      .dwtag  DW_TAG_member
    9574                      .dwattr $C$DW$1012, DW_AT_type(*$C$DW$T$76)
    9575                      .dwattr $C$DW$1012, DW_AT_name("flag_enablePowerWarp")
    9576                      .dwattr $C$DW$1012, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    9577                      .dwattr $C$DW$1012, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    9578                      .dwattr $C$DW$1012, DW_AT_accessibility(DW_ACCESS_public)
    9579              
    9580              $C$DW$1013      .dwtag  DW_TAG_member
    9581                      .dwattr $C$DW$1013, DW_AT_type(*$C$DW$T$76)
    9582                      .dwattr $C$DW$1013, DW_AT_name("flag_enableOffset")
    9583                      .dwattr $C$DW$1013, DW_AT_TI_symbol_name("_flag_enableOffset")
    9584                      .dwattr $C$DW$1013, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    9585                      .dwattr $C$DW$1013, DW_AT_accessibility(DW_ACCESS_public)
    9586              
    9587              $C$DW$1014      .dwtag  DW_TAG_member
    9588                      .dwattr $C$DW$1014, DW_AT_type(*$C$DW$T$76)
    9589                      .dwattr $C$DW$1014, DW_AT_name("flag_enableSpeedCtrl")
    9590                      .dwattr $C$DW$1014, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    9591                      .dwattr $C$DW$1014, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    9592                      .dwattr $C$DW$1014, DW_AT_accessibility(DW_ACCESS_public)
    9593              
    9594              $C$DW$1015      .dwtag  DW_TAG_member
    9595                      .dwattr $C$DW$1015, DW_AT_type(*$C$DW$T$76)
    9596                      .dwattr $C$DW$1015, DW_AT_name("flag_enableUserMotorParams")
    9597                      .dwattr $C$DW$1015, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    9598                      .dwattr $C$DW$1015, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    9599                      .dwattr $C$DW$1015, DW_AT_accessibility(DW_ACCESS_public)
    9600              
    9601              $C$DW$1016      .dwtag  DW_TAG_member
    9602                      .dwattr $C$DW$1016, DW_AT_type(*$C$DW$T$75)
    9603                      .dwattr $C$DW$1016, DW_AT_name("Idq_offset_pu")
    9604                      .dwattr $C$DW$1016, DW_AT_TI_symbol_name("_Idq_offset_pu")
    9605                      .dwattr $C$DW$1016, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    9606                      .dwattr $C$DW$1016, DW_AT_accessibility(DW_ACCESS_public)
    9607              
    9608              $C$DW$1017      .dwtag  DW_TAG_member
    9609                      .dwattr $C$DW$1017, DW_AT_type(*$C$DW$T$75)
    9610                      .dwattr $C$DW$1017, DW_AT_name("Vdq_offset_pu")
    9611                      .dwattr $C$DW$1017, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    9612                      .dwattr $C$DW$1017, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    9613                      .dwattr $C$DW$1017, DW_AT_accessibility(DW_ACCESS_public)
    9614              
    9615              $C$DW$1018      .dwtag  DW_TAG_member
    9616                      .dwattr $C$DW$1018, DW_AT_type(*$C$DW$T$35)
    9617                      .dwattr $C$DW$1018, DW_AT_name("angle_pu")
    9618                      .dwattr $C$DW$1018, DW_AT_TI_symbol_name("_angle_pu")
    9619                      .dwattr $C$DW$1018, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    9620                      .dwattr $C$DW$1018, DW_AT_accessibility(DW_ACCESS_public)
    9621              
    9622              $C$DW$1019      .dwtag  DW_TAG_member
    9623                      .dwattr $C$DW$1019, DW_AT_type(*$C$DW$T$35)
    9624                      .dwattr $C$DW$1019, DW_AT_name("speed_ref_pu")
    9625                      .dwattr $C$DW$1019, DW_AT_TI_symbol_name("_speed_ref_pu")
    9626                      .dwattr $C$DW$1019, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:54:04 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{AFCBCAD4-90C2-4A1E-B05B-37E3FCD6034D} PAGE  188

    9627                      .dwattr $C$DW$1019, DW_AT_accessibility(DW_ACCESS_public)
    9628              
    9629              $C$DW$1020      .dwtag  DW_TAG_member
    9630                      .dwattr $C$DW$1020, DW_AT_type(*$C$DW$T$35)
    9631                      .dwattr $C$DW$1020, DW_AT_name("speed_fb_pu")
    9632                      .dwattr $C$DW$1020, DW_AT_TI_symbol_name("_speed_fb_pu")
    9633                      .dwattr $C$DW$1020, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    9634                      .dwattr $C$DW$1020, DW_AT_accessibility(DW_ACCESS_public)
    9635              
    9636              $C$DW$1021      .dwtag  DW_TAG_member
    9637                      .dwattr $C$DW$1021, DW_AT_type(*$C$DW$T$35)
    9638                      .dwattr $C$DW$1021, DW_AT_name("speed_outMax_pu")
    9639                      .dwattr $C$DW$1021, DW_AT_TI_symbol_name("_speed_outMax_pu")
    9640                      .dwattr $C$DW$1021, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    9641                      .dwattr $C$DW$1021, DW_AT_accessibility(DW_ACCESS_public)
    9642              
    9643              $C$DW$1022      .dwtag  DW_TAG_member
    9644                      .dwattr $C$DW$1022, DW_AT_type(*$C$DW$T$76)
    9645                      .dwattr $C$DW$1022, DW_AT_name("flag_enableCurrentCtrl")
    9646                      .dwattr $C$DW$1022, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    9647                      .dwattr $C$DW$1022, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    9648                      .dwattr $C$DW$1022, DW_AT_accessibility(DW_ACCESS_public)
    9649              
    9650              $C$DW$1023      .dwtag  DW_TAG_member
    9651                      .dwattr $C$DW$1023, DW_AT_type(*$C$DW$T$35)
    9652                      .dwattr $C$DW$1023, DW_AT_name("torque_head_comm")
    9653                      .dwattr $C$DW$1023, DW_AT_TI_symbol_name("_torque_head_comm")
    9654                      .dwattr $C$DW$1023, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    9655                      .dwattr $C$DW$1023, DW_AT_accessibility(DW_ACCESS_public)
    9656              
    9657                      .dwendtag $C$DW$T$77
    9658              
    9659              $C$DW$T$248     .dwtag  DW_TAG_typedef
    9660                      .dwattr $C$DW$T$248, DW_AT_name("CTRL_Obj")
    9661                      .dwattr $C$DW$T$248, DW_AT_type(*$C$DW$T$77)
    9662                      .dwattr $C$DW$T$248, DW_AT_language(DW_LANG_C)
    9663              
    9664              $C$DW$T$249     .dwtag  DW_TAG_pointer_type
    9665                      .dwattr $C$DW$T$249, DW_AT_type(*$C$DW$T$248)
    9666                      .dwattr $C$DW$T$249, DW_AT_address_class(0x20)
    9667              
    9668              $C$DW$T$203     .dwtag  DW_TAG_pointer_type
    9669                      .dwattr $C$DW$T$203, DW_AT_type(*$C$DW$T$77)
    9670                      .dwattr $C$DW$T$203, DW_AT_address_class(0x20)
    9671              
    9672              $C$DW$T$204     .dwtag  DW_TAG_typedef
    9673                      .dwattr $C$DW$T$204, DW_AT_name("CTRL_Handle")
    9674                      .dwattr $C$DW$T$204, DW_AT_type(*$C$DW$T$203)
    9675                      .dwattr $C$DW$T$204, DW_AT_language(DW_LANG_C)
    9676              
    9677              $C$DW$1024      .dwtag  DW_TAG_TI_far_type
    9678                      .dwattr $C$DW$1024, DW_AT_type(*$C$DW$T$204)
    9679              
    9680              $C$DW$T$250     .dwtag  DW_TAG_const_type
    9681                      .dwattr $C$DW$T$250, DW_AT_type(*$C$DW$1024)
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:54:04 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{AFCBCAD4-90C2-4A1E-B05B-37E3FCD6034D} PAGE  189

    9682              
    9683              
    9684              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    9685                      .dwattr $C$DW$T$80, DW_AT_name("_CTRL_Version_")
    9686                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x04)
    9687              $C$DW$1025      .dwtag  DW_TAG_member
    9688                      .dwattr $C$DW$1025, DW_AT_type(*$C$DW$T$26)
    9689                      .dwattr $C$DW$1025, DW_AT_name("rsvd")
    9690                      .dwattr $C$DW$1025, DW_AT_TI_symbol_name("_rsvd")
    9691                      .dwattr $C$DW$1025, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9692                      .dwattr $C$DW$1025, DW_AT_accessibility(DW_ACCESS_public)
    9693              
    9694              $C$DW$1026      .dwtag  DW_TAG_member
    9695                      .dwattr $C$DW$1026, DW_AT_type(*$C$DW$T$79)
    9696                      .dwattr $C$DW$1026, DW_AT_name("targetProc")
    9697                      .dwattr $C$DW$1026, DW_AT_TI_symbol_name("_targetProc")
    9698                      .dwattr $C$DW$1026, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9699                      .dwattr $C$DW$1026, DW_AT_accessibility(DW_ACCESS_public)
    9700              
    9701              $C$DW$1027      .dwtag  DW_TAG_member
    9702                      .dwattr $C$DW$1027, DW_AT_type(*$C$DW$T$26)
    9703                      .dwattr $C$DW$1027, DW_AT_name("major")
    9704                      .dwattr $C$DW$1027, DW_AT_TI_symbol_name("_major")
    9705                      .dwattr $C$DW$1027, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9706                      .dwattr $C$DW$1027, DW_AT_accessibility(DW_ACCESS_public)
    9707              
    9708              $C$DW$1028      .dwtag  DW_TAG_member
    9709                      .dwattr $C$DW$1028, DW_AT_type(*$C$DW$T$26)
    9710                      .dwattr $C$DW$1028, DW_AT_name("minor")
    9711                      .dwattr $C$DW$1028, DW_AT_TI_symbol_name("_minor")
    9712                      .dwattr $C$DW$1028, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9713                      .dwattr $C$DW$1028, DW_AT_accessibility(DW_ACCESS_public)
    9714              
    9715                      .dwendtag $C$DW$T$80
    9716              
    9717              $C$DW$T$42      .dwtag  DW_TAG_typedef
    9718                      .dwattr $C$DW$T$42, DW_AT_name("CTRL_Version")
    9719                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$80)
    9720                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    9721              
    9722              $C$DW$T$256     .dwtag  DW_TAG_pointer_type
    9723                      .dwattr $C$DW$T$256, DW_AT_type(*$C$DW$T$42)
    9724                      .dwattr $C$DW$T$256, DW_AT_address_class(0x20)
    9725              
    9726              
    9727              $C$DW$T$87      .dwtag  DW_TAG_structure_type
    9728                      .dwattr $C$DW$T$87, DW_AT_name("_DRV8301_Obj_")
    9729                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x08)
    9730              $C$DW$1029      .dwtag  DW_TAG_member
    9731                      .dwattr $C$DW$1029, DW_AT_type(*$C$DW$T$82)
    9732                      .dwattr $C$DW$1029, DW_AT_name("spiHandle")
    9733                      .dwattr $C$DW$1029, DW_AT_TI_symbol_name("_spiHandle")
    9734                      .dwattr $C$DW$1029, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9735                      .dwattr $C$DW$1029, DW_AT_accessibility(DW_ACCESS_public)
    9736              
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:54:04 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{AFCBCAD4-90C2-4A1E-B05B-37E3FCD6034D} PAGE  190

    9737              $C$DW$1030      .dwtag  DW_TAG_member
    9738                      .dwattr $C$DW$1030, DW_AT_type(*$C$DW$T$84)
    9739                      .dwattr $C$DW$1030, DW_AT_name("gpioHandle")
    9740                      .dwattr $C$DW$1030, DW_AT_TI_symbol_name("_gpioHandle")
    9741                      .dwattr $C$DW$1030, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9742                      .dwattr $C$DW$1030, DW_AT_accessibility(DW_ACCESS_public)
    9743              
    9744              $C$DW$1031      .dwtag  DW_TAG_member
    9745                      .dwattr $C$DW$1031, DW_AT_type(*$C$DW$T$86)
    9746                      .dwattr $C$DW$1031, DW_AT_name("gpioNumber")
    9747                      .dwattr $C$DW$1031, DW_AT_TI_symbol_name("_gpioNumber")
    9748                      .dwattr $C$DW$1031, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9749                      .dwattr $C$DW$1031, DW_AT_accessibility(DW_ACCESS_public)
    9750              
    9751              $C$DW$1032      .dwtag  DW_TAG_member
    9752                      .dwattr $C$DW$1032, DW_AT_type(*$C$DW$T$76)
    9753                      .dwattr $C$DW$1032, DW_AT_name("RxTimeOut")
    9754                      .dwattr $C$DW$1032, DW_AT_TI_symbol_name("_RxTimeOut")
    9755                      .dwattr $C$DW$1032, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9756                      .dwattr $C$DW$1032, DW_AT_accessibility(DW_ACCESS_public)
    9757              
    9758              $C$DW$1033      .dwtag  DW_TAG_member
    9759                      .dwattr $C$DW$1033, DW_AT_type(*$C$DW$T$76)
    9760                      .dwattr $C$DW$1033, DW_AT_name("enableTimeOut")
    9761                      .dwattr $C$DW$1033, DW_AT_TI_symbol_name("_enableTimeOut")
    9762                      .dwattr $C$DW$1033, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9763                      .dwattr $C$DW$1033, DW_AT_accessibility(DW_ACCESS_public)
    9764              
    9765                      .dwendtag $C$DW$T$87
    9766              
    9767              $C$DW$T$156     .dwtag  DW_TAG_typedef
    9768                      .dwattr $C$DW$T$156, DW_AT_name("DRV8301_Obj")
    9769                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$87)
    9770                      .dwattr $C$DW$T$156, DW_AT_language(DW_LANG_C)
    9771              
    9772              $C$DW$T$154     .dwtag  DW_TAG_pointer_type
    9773                      .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$87)
    9774                      .dwattr $C$DW$T$154, DW_AT_address_class(0x20)
    9775              
    9776              $C$DW$T$155     .dwtag  DW_TAG_typedef
    9777                      .dwattr $C$DW$T$155, DW_AT_name("DRV8301_Handle")
    9778                      .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$154)
    9779                      .dwattr $C$DW$T$155, DW_AT_language(DW_LANG_C)
    9780              
    9781              
    9782              $C$DW$T$98      .dwtag  DW_TAG_structure_type
    9783                      .dwattr $C$DW$T$98, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    9784                      .dwattr $C$DW$T$98, DW_AT_byte_size(0x05)
    9785              $C$DW$1034      .dwtag  DW_TAG_member
    9786                      .dwattr $C$DW$1034, DW_AT_type(*$C$DW$T$89)
    9787                      .dwattr $C$DW$1034, DW_AT_name("DRV8301_CURRENT")
    9788                      .dwattr $C$DW$1034, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    9789                      .dwattr $C$DW$1034, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9790                      .dwattr $C$DW$1034, DW_AT_accessibility(DW_ACCESS_public)
    9791              
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:54:04 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{AFCBCAD4-90C2-4A1E-B05B-37E3FCD6034D} PAGE  191

    9792              $C$DW$1035      .dwtag  DW_TAG_member
    9793                      .dwattr $C$DW$1035, DW_AT_type(*$C$DW$T$91)
    9794                      .dwattr $C$DW$1035, DW_AT_name("DRV8301_RESET")
    9795                      .dwattr $C$DW$1035, DW_AT_TI_symbol_name("_DRV8301_RESET")
    9796                      .dwattr $C$DW$1035, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9797                      .dwattr $C$DW$1035, DW_AT_accessibility(DW_ACCESS_public)
    9798              
    9799              $C$DW$1036      .dwtag  DW_TAG_member
    9800                      .dwattr $C$DW$1036, DW_AT_type(*$C$DW$T$93)
    9801                      .dwattr $C$DW$1036, DW_AT_name("PWM_MODE")
    9802                      .dwattr $C$DW$1036, DW_AT_TI_symbol_name("_PWM_MODE")
    9803                      .dwattr $C$DW$1036, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9804                      .dwattr $C$DW$1036, DW_AT_accessibility(DW_ACCESS_public)
    9805              
    9806              $C$DW$1037      .dwtag  DW_TAG_member
    9807                      .dwattr $C$DW$1037, DW_AT_type(*$C$DW$T$95)
    9808                      .dwattr $C$DW$1037, DW_AT_name("OC_MODE")
    9809                      .dwattr $C$DW$1037, DW_AT_TI_symbol_name("_OC_MODE")
    9810                      .dwattr $C$DW$1037, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9811                      .dwattr $C$DW$1037, DW_AT_accessibility(DW_ACCESS_public)
    9812              
    9813              $C$DW$1038      .dwtag  DW_TAG_member
    9814                      .dwattr $C$DW$1038, DW_AT_type(*$C$DW$T$97)
    9815                      .dwattr $C$DW$1038, DW_AT_name("OC_ADJ_SET")
    9816                      .dwattr $C$DW$1038, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    9817                      .dwattr $C$DW$1038, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9818                      .dwattr $C$DW$1038, DW_AT_accessibility(DW_ACCESS_public)
    9819              
    9820                      .dwendtag $C$DW$T$98
    9821              
    9822              $C$DW$T$112     .dwtag  DW_TAG_typedef
    9823                      .dwattr $C$DW$T$112, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    9824                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$98)
    9825                      .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    9826              
    9827              
    9828              $C$DW$T$107     .dwtag  DW_TAG_structure_type
    9829                      .dwattr $C$DW$T$107, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    9830                      .dwattr $C$DW$T$107, DW_AT_byte_size(0x04)
    9831              $C$DW$1039      .dwtag  DW_TAG_member
    9832                      .dwattr $C$DW$1039, DW_AT_type(*$C$DW$T$100)
    9833                      .dwattr $C$DW$1039, DW_AT_name("OCTW_SET")
    9834                      .dwattr $C$DW$1039, DW_AT_TI_symbol_name("_OCTW_SET")
    9835                      .dwattr $C$DW$1039, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9836                      .dwattr $C$DW$1039, DW_AT_accessibility(DW_ACCESS_public)
    9837              
    9838              $C$DW$1040      .dwtag  DW_TAG_member
    9839                      .dwattr $C$DW$1040, DW_AT_type(*$C$DW$T$102)
    9840                      .dwattr $C$DW$1040, DW_AT_name("GAIN")
    9841                      .dwattr $C$DW$1040, DW_AT_TI_symbol_name("_GAIN")
    9842                      .dwattr $C$DW$1040, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9843                      .dwattr $C$DW$1040, DW_AT_accessibility(DW_ACCESS_public)
    9844              
    9845              $C$DW$1041      .dwtag  DW_TAG_member
    9846                      .dwattr $C$DW$1041, DW_AT_type(*$C$DW$T$104)
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:54:04 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{AFCBCAD4-90C2-4A1E-B05B-37E3FCD6034D} PAGE  192

    9847                      .dwattr $C$DW$1041, DW_AT_name("DC_CAL_CH1p2")
    9848                      .dwattr $C$DW$1041, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    9849                      .dwattr $C$DW$1041, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9850                      .dwattr $C$DW$1041, DW_AT_accessibility(DW_ACCESS_public)
    9851              
    9852              $C$DW$1042      .dwtag  DW_TAG_member
    9853                      .dwattr $C$DW$1042, DW_AT_type(*$C$DW$T$106)
    9854                      .dwattr $C$DW$1042, DW_AT_name("OC_TOFF")
    9855                      .dwattr $C$DW$1042, DW_AT_TI_symbol_name("_OC_TOFF")
    9856                      .dwattr $C$DW$1042, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9857                      .dwattr $C$DW$1042, DW_AT_accessibility(DW_ACCESS_public)
    9858              
    9859                      .dwendtag $C$DW$T$107
    9860              
    9861              $C$DW$T$113     .dwtag  DW_TAG_typedef
    9862                      .dwattr $C$DW$T$113, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    9863                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$107)
    9864                      .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    9865              
    9866              
    9867              $C$DW$T$108     .dwtag  DW_TAG_structure_type
    9868                      .dwattr $C$DW$T$108, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    9869                      .dwattr $C$DW$T$108, DW_AT_byte_size(0x0b)
    9870              $C$DW$1043      .dwtag  DW_TAG_member
    9871                      .dwattr $C$DW$1043, DW_AT_type(*$C$DW$T$76)
    9872                      .dwattr $C$DW$1043, DW_AT_name("FAULT")
    9873                      .dwattr $C$DW$1043, DW_AT_TI_symbol_name("_FAULT")
    9874                      .dwattr $C$DW$1043, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9875                      .dwattr $C$DW$1043, DW_AT_accessibility(DW_ACCESS_public)
    9876              
    9877              $C$DW$1044      .dwtag  DW_TAG_member
    9878                      .dwattr $C$DW$1044, DW_AT_type(*$C$DW$T$76)
    9879                      .dwattr $C$DW$1044, DW_AT_name("GVDD_UV")
    9880                      .dwattr $C$DW$1044, DW_AT_TI_symbol_name("_GVDD_UV")
    9881                      .dwattr $C$DW$1044, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9882                      .dwattr $C$DW$1044, DW_AT_accessibility(DW_ACCESS_public)
    9883              
    9884              $C$DW$1045      .dwtag  DW_TAG_member
    9885                      .dwattr $C$DW$1045, DW_AT_type(*$C$DW$T$76)
    9886                      .dwattr $C$DW$1045, DW_AT_name("PVDD_UV")
    9887                      .dwattr $C$DW$1045, DW_AT_TI_symbol_name("_PVDD_UV")
    9888                      .dwattr $C$DW$1045, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9889                      .dwattr $C$DW$1045, DW_AT_accessibility(DW_ACCESS_public)
    9890              
    9891              $C$DW$1046      .dwtag  DW_TAG_member
    9892                      .dwattr $C$DW$1046, DW_AT_type(*$C$DW$T$76)
    9893                      .dwattr $C$DW$1046, DW_AT_name("OTSD")
    9894                      .dwattr $C$DW$1046, DW_AT_TI_symbol_name("_OTSD")
    9895                      .dwattr $C$DW$1046, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9896                      .dwattr $C$DW$1046, DW_AT_accessibility(DW_ACCESS_public)
    9897              
    9898              $C$DW$1047      .dwtag  DW_TAG_member
    9899                      .dwattr $C$DW$1047, DW_AT_type(*$C$DW$T$76)
    9900                      .dwattr $C$DW$1047, DW_AT_name("OTW")
    9901                      .dwattr $C$DW$1047, DW_AT_TI_symbol_name("_OTW")
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:54:04 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{AFCBCAD4-90C2-4A1E-B05B-37E3FCD6034D} PAGE  193

    9902                      .dwattr $C$DW$1047, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9903                      .dwattr $C$DW$1047, DW_AT_accessibility(DW_ACCESS_public)
    9904              
    9905              $C$DW$1048      .dwtag  DW_TAG_member
    9906                      .dwattr $C$DW$1048, DW_AT_type(*$C$DW$T$76)
    9907                      .dwattr $C$DW$1048, DW_AT_name("FETHA_OC")
    9908                      .dwattr $C$DW$1048, DW_AT_TI_symbol_name("_FETHA_OC")
    9909                      .dwattr $C$DW$1048, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9910                      .dwattr $C$DW$1048, DW_AT_accessibility(DW_ACCESS_public)
    9911              
    9912              $C$DW$1049      .dwtag  DW_TAG_member
    9913                      .dwattr $C$DW$1049, DW_AT_type(*$C$DW$T$76)
    9914                      .dwattr $C$DW$1049, DW_AT_name("FETLA_OC")
    9915                      .dwattr $C$DW$1049, DW_AT_TI_symbol_name("_FETLA_OC")
    9916                      .dwattr $C$DW$1049, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9917                      .dwattr $C$DW$1049, DW_AT_accessibility(DW_ACCESS_public)
    9918              
    9919              $C$DW$1050      .dwtag  DW_TAG_member
    9920                      .dwattr $C$DW$1050, DW_AT_type(*$C$DW$T$76)
    9921                      .dwattr $C$DW$1050, DW_AT_name("FETHB_OC")
    9922                      .dwattr $C$DW$1050, DW_AT_TI_symbol_name("_FETHB_OC")
    9923                      .dwattr $C$DW$1050, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    9924                      .dwattr $C$DW$1050, DW_AT_accessibility(DW_ACCESS_public)
    9925              
    9926              $C$DW$1051      .dwtag  DW_TAG_member
    9927                      .dwattr $C$DW$1051, DW_AT_type(*$C$DW$T$76)
    9928                      .dwattr $C$DW$1051, DW_AT_name("FETLB_OC")
    9929                      .dwattr $C$DW$1051, DW_AT_TI_symbol_name("_FETLB_OC")
    9930                      .dwattr $C$DW$1051, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9931                      .dwattr $C$DW$1051, DW_AT_accessibility(DW_ACCESS_public)
    9932              
