TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:44 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{FF9B9E7E-063A-41EE-8C61-EA327628573A} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                             PC v18.12.4.LTS *
       3              ;* Date/Time created: Tue Feb 21 14:51:43 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/GIANT/GAINT_TI_instaspin/motorware/motorware_1_01_00_18/sw/solutions
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v18.12.4.LTS Copyright (c) 1996-
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\GIANT\GAINT_TI_instaspin\motorware\motorware_1_01_00_18\sw\solut
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    8338              $C$DW$870       .dwtag  DW_TAG_enumerator
    8339                      .dwattr $C$DW$870, DW_AT_name("PIE_GroupNumber_7")
    8340                      .dwattr $C$DW$870, DW_AT_const_value(0x06)
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:44 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{FF9B9E7E-063A-41EE-8C61-EA327628573A} PAGE  164

    8341              
    8342              $C$DW$871       .dwtag  DW_TAG_enumerator
    8343                      .dwattr $C$DW$871, DW_AT_name("PIE_GroupNumber_8")
    8344                      .dwattr $C$DW$871, DW_AT_const_value(0x07)
    8345              
    8346              $C$DW$872       .dwtag  DW_TAG_enumerator
    8347                      .dwattr $C$DW$872, DW_AT_name("PIE_GroupNumber_9")
    8348                      .dwattr $C$DW$872, DW_AT_const_value(0x08)
    8349              
    8350              $C$DW$873       .dwtag  DW_TAG_enumerator
    8351                      .dwattr $C$DW$873, DW_AT_name("PIE_GroupNumber_10")
    8352                      .dwattr $C$DW$873, DW_AT_const_value(0x09)
    8353              
    8354              $C$DW$874       .dwtag  DW_TAG_enumerator
    8355                      .dwattr $C$DW$874, DW_AT_name("PIE_GroupNumber_11")
    8356                      .dwattr $C$DW$874, DW_AT_const_value(0x0a)
    8357              
    8358              $C$DW$875       .dwtag  DW_TAG_enumerator
    8359                      .dwattr $C$DW$875, DW_AT_name("PIE_GroupNumber_12")
    8360                      .dwattr $C$DW$875, DW_AT_const_value(0x0b)
    8361              
    8362                      .dwendtag $C$DW$T$221
    8363              
    8364              $C$DW$T$222     .dwtag  DW_TAG_typedef
    8365                      .dwattr $C$DW$T$222, DW_AT_name("PIE_GroupNumber_e")
    8366                      .dwattr $C$DW$T$222, DW_AT_type(*$C$DW$T$221)
    8367                      .dwattr $C$DW$T$222, DW_AT_language(DW_LANG_C)
    8368              
    8369              
    8370              $C$DW$T$224     .dwtag  DW_TAG_enumeration_type
    8371                      .dwattr $C$DW$T$224, DW_AT_byte_size(0x01)
    8372              $C$DW$876       .dwtag  DW_TAG_enumerator
    8373                      .dwattr $C$DW$876, DW_AT_name("CTRL_Type_PID_spd")
    8374                      .dwattr $C$DW$876, DW_AT_const_value(0x00)
    8375              
    8376              $C$DW$877       .dwtag  DW_TAG_enumerator
    8377                      .dwattr $C$DW$877, DW_AT_name("CTRL_Type_PID_Id")
    8378                      .dwattr $C$DW$877, DW_AT_const_value(0x01)
    8379              
    8380              $C$DW$878       .dwtag  DW_TAG_enumerator
    8381                      .dwattr $C$DW$878, DW_AT_name("CTRL_Type_PID_Iq")
    8382                      .dwattr $C$DW$878, DW_AT_const_value(0x02)
    8383              
    8384                      .dwendtag $C$DW$T$224
    8385              
    8386              $C$DW$T$225     .dwtag  DW_TAG_typedef
    8387                      .dwattr $C$DW$T$225, DW_AT_name("CTRL_Type_e")
    8388                      .dwattr $C$DW$T$225, DW_AT_type(*$C$DW$T$224)
    8389                      .dwattr $C$DW$T$225, DW_AT_language(DW_LANG_C)
    8390              
    8391              
    8392              $C$DW$T$227     .dwtag  DW_TAG_enumeration_type
    8393                      .dwattr $C$DW$T$227, DW_AT_byte_size(0x01)
    8394              $C$DW$879       .dwtag  DW_TAG_enumerator
    8395                      .dwattr $C$DW$879, DW_AT_name("HAL_SensorType_Current")
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:44 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{FF9B9E7E-063A-41EE-8C61-EA327628573A} PAGE  165

    8396                      .dwattr $C$DW$879, DW_AT_const_value(0x00)
    8397              
    8398              $C$DW$880       .dwtag  DW_TAG_enumerator
    8399                      .dwattr $C$DW$880, DW_AT_name("HAL_SensorType_Voltage")
    8400                      .dwattr $C$DW$880, DW_AT_const_value(0x01)
    8401              
    8402                      .dwendtag $C$DW$T$227
    8403              
    8404              $C$DW$T$228     .dwtag  DW_TAG_typedef
    8405                      .dwattr $C$DW$T$228, DW_AT_name("HAL_SensorType_e")
    8406                      .dwattr $C$DW$T$228, DW_AT_type(*$C$DW$T$227)
    8407                      .dwattr $C$DW$T$228, DW_AT_language(DW_LANG_C)
    8408              
    8409              
    8410              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    8411                      .dwattr $C$DW$T$19, DW_AT_name("IPD_HFI_Obj")
    8412                      .dwattr $C$DW$T$19, DW_AT_declaration
    8413                      .dwendtag $C$DW$T$19
    8414              
    8415              $C$DW$T$230     .dwtag  DW_TAG_pointer_type
    8416                      .dwattr $C$DW$T$230, DW_AT_type(*$C$DW$T$19)
    8417                      .dwattr $C$DW$T$230, DW_AT_address_class(0x20)
    8418              
    8419              $C$DW$T$231     .dwtag  DW_TAG_typedef
    8420                      .dwattr $C$DW$T$231, DW_AT_name("IPD_HFI_Handle")
    8421                      .dwattr $C$DW$T$231, DW_AT_type(*$C$DW$T$230)
    8422                      .dwattr $C$DW$T$231, DW_AT_language(DW_LANG_C)
    8423              
    8424              
    8425              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    8426                      .dwattr $C$DW$T$34, DW_AT_name("_ADC_Obj_")
    8427                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x6650)
    8428              $C$DW$881       .dwtag  DW_TAG_member
    8429                      .dwattr $C$DW$881, DW_AT_type(*$C$DW$T$28)
    8430                      .dwattr $C$DW$881, DW_AT_name("ADCRESULT")
    8431                      .dwattr $C$DW$881, DW_AT_TI_symbol_name("_ADCRESULT")
    8432                      .dwattr $C$DW$881, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8433                      .dwattr $C$DW$881, DW_AT_accessibility(DW_ACCESS_public)
    8434              
    8435              $C$DW$882       .dwtag  DW_TAG_member
    8436                      .dwattr $C$DW$882, DW_AT_type(*$C$DW$T$29)
    8437                      .dwattr $C$DW$882, DW_AT_name("resvd_1")
    8438                      .dwattr $C$DW$882, DW_AT_TI_symbol_name("_resvd_1")
    8439                      .dwattr $C$DW$882, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8440                      .dwattr $C$DW$882, DW_AT_accessibility(DW_ACCESS_public)
    8441              
    8442              $C$DW$883       .dwtag  DW_TAG_member
    8443                      .dwattr $C$DW$883, DW_AT_type(*$C$DW$T$27)
    8444                      .dwattr $C$DW$883, DW_AT_name("ADCCTL1")
    8445                      .dwattr $C$DW$883, DW_AT_TI_symbol_name("_ADCCTL1")
    8446                      .dwattr $C$DW$883, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    8447                      .dwattr $C$DW$883, DW_AT_accessibility(DW_ACCESS_public)
    8448              
    8449              $C$DW$884       .dwtag  DW_TAG_member
    8450                      .dwattr $C$DW$884, DW_AT_type(*$C$DW$T$27)
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:44 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{FF9B9E7E-063A-41EE-8C61-EA327628573A} PAGE  166

    8451                      .dwattr $C$DW$884, DW_AT_name("ADCCTL2")
    8452                      .dwattr $C$DW$884, DW_AT_TI_symbol_name("_ADCCTL2")
    8453                      .dwattr $C$DW$884, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    8454                      .dwattr $C$DW$884, DW_AT_accessibility(DW_ACCESS_public)
    8455              
    8456              $C$DW$885       .dwtag  DW_TAG_member
    8457                      .dwattr $C$DW$885, DW_AT_type(*$C$DW$T$30)
    8458                      .dwattr $C$DW$885, DW_AT_name("rsvd_2")
    8459                      .dwattr $C$DW$885, DW_AT_TI_symbol_name("_rsvd_2")
    8460                      .dwattr $C$DW$885, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    8461                      .dwattr $C$DW$885, DW_AT_accessibility(DW_ACCESS_public)
    8462              
    8463              $C$DW$886       .dwtag  DW_TAG_member
    8464                      .dwattr $C$DW$886, DW_AT_type(*$C$DW$T$27)
    8465                      .dwattr $C$DW$886, DW_AT_name("ADCINTFLG")
    8466                      .dwattr $C$DW$886, DW_AT_TI_symbol_name("_ADCINTFLG")
    8467                      .dwattr $C$DW$886, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    8468                      .dwattr $C$DW$886, DW_AT_accessibility(DW_ACCESS_public)
    8469              
    8470              $C$DW$887       .dwtag  DW_TAG_member
    8471                      .dwattr $C$DW$887, DW_AT_type(*$C$DW$T$27)
    8472                      .dwattr $C$DW$887, DW_AT_name("ADCINTFLGCLR")
    8473                      .dwattr $C$DW$887, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    8474                      .dwattr $C$DW$887, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    8475                      .dwattr $C$DW$887, DW_AT_accessibility(DW_ACCESS_public)
    8476              
    8477              $C$DW$888       .dwtag  DW_TAG_member
    8478                      .dwattr $C$DW$888, DW_AT_type(*$C$DW$T$27)
    8479                      .dwattr $C$DW$888, DW_AT_name("ADCINTOVF")
    8480                      .dwattr $C$DW$888, DW_AT_TI_symbol_name("_ADCINTOVF")
    8481                      .dwattr $C$DW$888, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    8482                      .dwattr $C$DW$888, DW_AT_accessibility(DW_ACCESS_public)
    8483              
    8484              $C$DW$889       .dwtag  DW_TAG_member
    8485                      .dwattr $C$DW$889, DW_AT_type(*$C$DW$T$27)
    8486                      .dwattr $C$DW$889, DW_AT_name("ADCINTOVFCLR")
    8487                      .dwattr $C$DW$889, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    8488                      .dwattr $C$DW$889, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    8489                      .dwattr $C$DW$889, DW_AT_accessibility(DW_ACCESS_public)
    8490              
    8491              $C$DW$890       .dwtag  DW_TAG_member
    8492                      .dwattr $C$DW$890, DW_AT_type(*$C$DW$T$31)
    8493                      .dwattr $C$DW$890, DW_AT_name("INTSELxNy")
    8494                      .dwattr $C$DW$890, DW_AT_TI_symbol_name("_INTSELxNy")
    8495                      .dwattr $C$DW$890, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    8496                      .dwattr $C$DW$890, DW_AT_accessibility(DW_ACCESS_public)
    8497              
    8498              $C$DW$891       .dwtag  DW_TAG_member
    8499                      .dwattr $C$DW$891, DW_AT_type(*$C$DW$T$32)
    8500                      .dwattr $C$DW$891, DW_AT_name("rsvd_3")
    8501                      .dwattr $C$DW$891, DW_AT_TI_symbol_name("_rsvd_3")
    8502                      .dwattr $C$DW$891, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    8503                      .dwattr $C$DW$891, DW_AT_accessibility(DW_ACCESS_public)
    8504              
    8505              $C$DW$892       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:44 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{FF9B9E7E-063A-41EE-8C61-EA327628573A} PAGE  167

    8506                      .dwattr $C$DW$892, DW_AT_type(*$C$DW$T$27)
    8507                      .dwattr $C$DW$892, DW_AT_name("SOCPRICTRL")
    8508                      .dwattr $C$DW$892, DW_AT_TI_symbol_name("_SOCPRICTRL")
    8509                      .dwattr $C$DW$892, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    8510                      .dwattr $C$DW$892, DW_AT_accessibility(DW_ACCESS_public)
    8511              
    8512              $C$DW$893       .dwtag  DW_TAG_member
    8513                      .dwattr $C$DW$893, DW_AT_type(*$C$DW$T$27)
    8514                      .dwattr $C$DW$893, DW_AT_name("rsvd_4")
    8515                      .dwattr $C$DW$893, DW_AT_TI_symbol_name("_rsvd_4")
    8516                      .dwattr $C$DW$893, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    8517                      .dwattr $C$DW$893, DW_AT_accessibility(DW_ACCESS_public)
    8518              
    8519              $C$DW$894       .dwtag  DW_TAG_member
    8520                      .dwattr $C$DW$894, DW_AT_type(*$C$DW$T$27)
    8521                      .dwattr $C$DW$894, DW_AT_name("ADCSAMPLEMODE")
    8522                      .dwattr $C$DW$894, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    8523                      .dwattr $C$DW$894, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    8524                      .dwattr $C$DW$894, DW_AT_accessibility(DW_ACCESS_public)
    8525              
    8526              $C$DW$895       .dwtag  DW_TAG_member
    8527                      .dwattr $C$DW$895, DW_AT_type(*$C$DW$T$27)
    8528                      .dwattr $C$DW$895, DW_AT_name("rsvd_5")
    8529                      .dwattr $C$DW$895, DW_AT_TI_symbol_name("_rsvd_5")
    8530                      .dwattr $C$DW$895, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    8531                      .dwattr $C$DW$895, DW_AT_accessibility(DW_ACCESS_public)
    8532              
    8533              $C$DW$896       .dwtag  DW_TAG_member
    8534                      .dwattr $C$DW$896, DW_AT_type(*$C$DW$T$27)
    8535                      .dwattr $C$DW$896, DW_AT_name("ADCINTSOCSEL1")
    8536                      .dwattr $C$DW$896, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    8537                      .dwattr $C$DW$896, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    8538                      .dwattr $C$DW$896, DW_AT_accessibility(DW_ACCESS_public)
    8539              
    8540              $C$DW$897       .dwtag  DW_TAG_member
    8541                      .dwattr $C$DW$897, DW_AT_type(*$C$DW$T$27)
    8542                      .dwattr $C$DW$897, DW_AT_name("ADCINTSOCSEL2")
    8543                      .dwattr $C$DW$897, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    8544                      .dwattr $C$DW$897, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    8545                      .dwattr $C$DW$897, DW_AT_accessibility(DW_ACCESS_public)
    8546              
    8547              $C$DW$898       .dwtag  DW_TAG_member
    8548                      .dwattr $C$DW$898, DW_AT_type(*$C$DW$T$30)
    8549                      .dwattr $C$DW$898, DW_AT_name("rsvd_6")
    8550                      .dwattr $C$DW$898, DW_AT_TI_symbol_name("_rsvd_6")
    8551                      .dwattr $C$DW$898, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    8552                      .dwattr $C$DW$898, DW_AT_accessibility(DW_ACCESS_public)
    8553              
    8554              $C$DW$899       .dwtag  DW_TAG_member
    8555                      .dwattr $C$DW$899, DW_AT_type(*$C$DW$T$27)
    8556                      .dwattr $C$DW$899, DW_AT_name("ADCSOCFLG1")
    8557                      .dwattr $C$DW$899, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    8558                      .dwattr $C$DW$899, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    8559                      .dwattr $C$DW$899, DW_AT_accessibility(DW_ACCESS_public)
    8560              
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:44 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{FF9B9E7E-063A-41EE-8C61-EA327628573A} PAGE  168

    8561              $C$DW$900       .dwtag  DW_TAG_member
    8562                      .dwattr $C$DW$900, DW_AT_type(*$C$DW$T$27)
    8563                      .dwattr $C$DW$900, DW_AT_name("rsvd_7")
    8564                      .dwattr $C$DW$900, DW_AT_TI_symbol_name("_rsvd_7")
    8565                      .dwattr $C$DW$900, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    8566                      .dwattr $C$DW$900, DW_AT_accessibility(DW_ACCESS_public)
    8567              
    8568              $C$DW$901       .dwtag  DW_TAG_member
    8569                      .dwattr $C$DW$901, DW_AT_type(*$C$DW$T$27)
    8570                      .dwattr $C$DW$901, DW_AT_name("ADCSOCFRC1")
    8571                      .dwattr $C$DW$901, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    8572                      .dwattr $C$DW$901, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    8573                      .dwattr $C$DW$901, DW_AT_accessibility(DW_ACCESS_public)
    8574              
    8575              $C$DW$902       .dwtag  DW_TAG_member
    8576                      .dwattr $C$DW$902, DW_AT_type(*$C$DW$T$27)
    8577                      .dwattr $C$DW$902, DW_AT_name("rsvd_8")
    8578                      .dwattr $C$DW$902, DW_AT_TI_symbol_name("_rsvd_8")
    8579                      .dwattr $C$DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    8580                      .dwattr $C$DW$902, DW_AT_accessibility(DW_ACCESS_public)
    8581              
    8582              $C$DW$903       .dwtag  DW_TAG_member
    8583                      .dwattr $C$DW$903, DW_AT_type(*$C$DW$T$27)
    8584                      .dwattr $C$DW$903, DW_AT_name("ADCSOCOVF1")
    8585                      .dwattr $C$DW$903, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    8586                      .dwattr $C$DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    8587                      .dwattr $C$DW$903, DW_AT_accessibility(DW_ACCESS_public)
    8588              
    8589              $C$DW$904       .dwtag  DW_TAG_member
    8590                      .dwattr $C$DW$904, DW_AT_type(*$C$DW$T$27)
    8591                      .dwattr $C$DW$904, DW_AT_name("rsvd_9")
    8592                      .dwattr $C$DW$904, DW_AT_TI_symbol_name("_rsvd_9")
    8593                      .dwattr $C$DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    8594                      .dwattr $C$DW$904, DW_AT_accessibility(DW_ACCESS_public)
    8595              
    8596              $C$DW$905       .dwtag  DW_TAG_member
    8597                      .dwattr $C$DW$905, DW_AT_type(*$C$DW$T$27)
    8598                      .dwattr $C$DW$905, DW_AT_name("ADCSOCOVFCLR1")
    8599                      .dwattr $C$DW$905, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    8600                      .dwattr $C$DW$905, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    8601                      .dwattr $C$DW$905, DW_AT_accessibility(DW_ACCESS_public)
    8602              
    8603              $C$DW$906       .dwtag  DW_TAG_member
    8604                      .dwattr $C$DW$906, DW_AT_type(*$C$DW$T$27)
    8605                      .dwattr $C$DW$906, DW_AT_name("rsvd_10")
    8606                      .dwattr $C$DW$906, DW_AT_TI_symbol_name("_rsvd_10")
    8607                      .dwattr $C$DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    8608                      .dwattr $C$DW$906, DW_AT_accessibility(DW_ACCESS_public)
    8609              
    8610              $C$DW$907       .dwtag  DW_TAG_member
    8611                      .dwattr $C$DW$907, DW_AT_type(*$C$DW$T$28)
    8612                      .dwattr $C$DW$907, DW_AT_name("ADCSOCxCTL")
    8613                      .dwattr $C$DW$907, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    8614                      .dwattr $C$DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    8615                      .dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:44 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{FF9B9E7E-063A-41EE-8C61-EA327628573A} PAGE  169

    8616              
    8617              $C$DW$908       .dwtag  DW_TAG_member
    8618                      .dwattr $C$DW$908, DW_AT_type(*$C$DW$T$28)
    8619                      .dwattr $C$DW$908, DW_AT_name("rsvd_11")
    8620                      .dwattr $C$DW$908, DW_AT_TI_symbol_name("_rsvd_11")
    8621                      .dwattr $C$DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    8622                      .dwattr $C$DW$908, DW_AT_accessibility(DW_ACCESS_public)
    8623              
    8624              $C$DW$909       .dwtag  DW_TAG_member
    8625                      .dwattr $C$DW$909, DW_AT_type(*$C$DW$T$27)
    8626                      .dwattr $C$DW$909, DW_AT_name("ADCREFTRIM")
    8627                      .dwattr $C$DW$909, DW_AT_TI_symbol_name("_ADCREFTRIM")
    8628                      .dwattr $C$DW$909, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    8629                      .dwattr $C$DW$909, DW_AT_accessibility(DW_ACCESS_public)
    8630              
    8631              $C$DW$910       .dwtag  DW_TAG_member
    8632                      .dwattr $C$DW$910, DW_AT_type(*$C$DW$T$27)
    8633                      .dwattr $C$DW$910, DW_AT_name("ADCOFFTRIM")
    8634                      .dwattr $C$DW$910, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    8635                      .dwattr $C$DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    8636                      .dwattr $C$DW$910, DW_AT_accessibility(DW_ACCESS_public)
    8637              
    8638              $C$DW$911       .dwtag  DW_TAG_member
    8639                      .dwattr $C$DW$911, DW_AT_type(*$C$DW$T$33)
    8640                      .dwattr $C$DW$911, DW_AT_name("resvd_12")
    8641                      .dwattr $C$DW$911, DW_AT_TI_symbol_name("_resvd_12")
    8642                      .dwattr $C$DW$911, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    8643                      .dwattr $C$DW$911, DW_AT_accessibility(DW_ACCESS_public)
    8644              
    8645              $C$DW$912       .dwtag  DW_TAG_member
    8646                      .dwattr $C$DW$912, DW_AT_type(*$C$DW$T$27)
    8647                      .dwattr $C$DW$912, DW_AT_name("ADCREV")
    8648                      .dwattr $C$DW$912, DW_AT_TI_symbol_name("_ADCREV")
    8649                      .dwattr $C$DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    8650                      .dwattr $C$DW$912, DW_AT_accessibility(DW_ACCESS_public)
    8651              
    8652                      .dwendtag $C$DW$T$34
    8653              
    8654              $C$DW$T$235     .dwtag  DW_TAG_typedef
    8655                      .dwattr $C$DW$T$235, DW_AT_name("ADC_Obj")
    8656                      .dwattr $C$DW$T$235, DW_AT_type(*$C$DW$T$34)
    8657                      .dwattr $C$DW$T$235, DW_AT_language(DW_LANG_C)
    8658              
    8659              $C$DW$T$124     .dwtag  DW_TAG_pointer_type
    8660                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$34)
    8661                      .dwattr $C$DW$T$124, DW_AT_address_class(0x20)
    8662              
    8663              $C$DW$T$125     .dwtag  DW_TAG_typedef
    8664                      .dwattr $C$DW$T$125, DW_AT_name("ADC_Handle")
    8665                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
    8666                      .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    8667              
    8668              
    8669              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    8670                      .dwattr $C$DW$T$20, DW_AT_name("_AFSEL_Obj_")
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:44 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{FF9B9E7E-063A-41EE-8C61-EA327628573A} PAGE  170

    8671                      .dwattr $C$DW$T$20, DW_AT_declaration
    8672                      .dwendtag $C$DW$T$20
    8673              
    8674              $C$DW$T$236     .dwtag  DW_TAG_pointer_type
    8675                      .dwattr $C$DW$T$236, DW_AT_type(*$C$DW$T$20)
    8676                      .dwattr $C$DW$T$236, DW_AT_address_class(0x20)
    8677              
    8678              $C$DW$T$237     .dwtag  DW_TAG_typedef
    8679                      .dwattr $C$DW$T$237, DW_AT_name("AFSEL_Handle")
    8680                      .dwattr $C$DW$T$237, DW_AT_type(*$C$DW$T$236)
    8681                      .dwattr $C$DW$T$237, DW_AT_language(DW_LANG_C)
    8682              
    8683              
    8684              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    8685                      .dwattr $C$DW$T$38, DW_AT_name("_CLARKE_Obj_")
    8686                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x06)
    8687              $C$DW$913       .dwtag  DW_TAG_member
    8688                      .dwattr $C$DW$913, DW_AT_type(*$C$DW$T$35)
    8689                      .dwattr $C$DW$913, DW_AT_name("alpha_sf")
    8690                      .dwattr $C$DW$913, DW_AT_TI_symbol_name("_alpha_sf")
    8691                      .dwattr $C$DW$913, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8692                      .dwattr $C$DW$913, DW_AT_accessibility(DW_ACCESS_public)
    8693              
    8694              $C$DW$914       .dwtag  DW_TAG_member
    8695                      .dwattr $C$DW$914, DW_AT_type(*$C$DW$T$35)
    8696                      .dwattr $C$DW$914, DW_AT_name("beta_sf")
    8697                      .dwattr $C$DW$914, DW_AT_TI_symbol_name("_beta_sf")
    8698                      .dwattr $C$DW$914, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8699                      .dwattr $C$DW$914, DW_AT_accessibility(DW_ACCESS_public)
    8700              
    8701              $C$DW$915       .dwtag  DW_TAG_member
    8702                      .dwattr $C$DW$915, DW_AT_type(*$C$DW$T$37)
    8703                      .dwattr $C$DW$915, DW_AT_name("numSensors")
    8704                      .dwattr $C$DW$915, DW_AT_TI_symbol_name("_numSensors")
    8705                      .dwattr $C$DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8706                      .dwattr $C$DW$915, DW_AT_accessibility(DW_ACCESS_public)
    8707              
    8708                      .dwendtag $C$DW$T$38
    8709              
    8710              $C$DW$T$49      .dwtag  DW_TAG_typedef
    8711                      .dwattr $C$DW$T$49, DW_AT_name("CLARKE_Obj")
    8712                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$38)
    8713                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    8714              
    8715              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    8716                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$38)
    8717                      .dwattr $C$DW$T$47, DW_AT_address_class(0x20)
    8718              
    8719              $C$DW$T$48      .dwtag  DW_TAG_typedef
    8720                      .dwattr $C$DW$T$48, DW_AT_name("CLARKE_Handle")
    8721                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    8722                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    8723              
    8724              $C$DW$916       .dwtag  DW_TAG_TI_far_type
    8725                      .dwattr $C$DW$916, DW_AT_type(*$C$DW$T$48)
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:44 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{FF9B9E7E-063A-41EE-8C61-EA327628573A} PAGE  171

    8726              
    8727              $C$DW$T$241     .dwtag  DW_TAG_const_type
    8728                      .dwattr $C$DW$T$241, DW_AT_type(*$C$DW$916)
    8729              
    8730              
    8731              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    8732                      .dwattr $C$DW$T$40, DW_AT_name("_CLK_Obj_")
    8733                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x11)
    8734              $C$DW$917       .dwtag  DW_TAG_member
    8735                      .dwattr $C$DW$917, DW_AT_type(*$C$DW$T$27)
    8736                      .dwattr $C$DW$917, DW_AT_name("XCLK")
    8737                      .dwattr $C$DW$917, DW_AT_TI_symbol_name("_XCLK")
    8738                      .dwattr $C$DW$917, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8739                      .dwattr $C$DW$917, DW_AT_accessibility(DW_ACCESS_public)
    8740              
    8741              $C$DW$918       .dwtag  DW_TAG_member
    8742                      .dwattr $C$DW$918, DW_AT_type(*$C$DW$T$27)
    8743                      .dwattr $C$DW$918, DW_AT_name("rsvd_1")
    8744                      .dwattr $C$DW$918, DW_AT_TI_symbol_name("_rsvd_1")
    8745                      .dwattr $C$DW$918, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8746                      .dwattr $C$DW$918, DW_AT_accessibility(DW_ACCESS_public)
    8747              
    8748              $C$DW$919       .dwtag  DW_TAG_member
    8749                      .dwattr $C$DW$919, DW_AT_type(*$C$DW$T$27)
    8750                      .dwattr $C$DW$919, DW_AT_name("CLKCTL")
    8751                      .dwattr $C$DW$919, DW_AT_TI_symbol_name("_CLKCTL")
    8752                      .dwattr $C$DW$919, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8753                      .dwattr $C$DW$919, DW_AT_accessibility(DW_ACCESS_public)
    8754              
    8755              $C$DW$920       .dwtag  DW_TAG_member
    8756                      .dwattr $C$DW$920, DW_AT_type(*$C$DW$T$39)
    8757                      .dwattr $C$DW$920, DW_AT_name("rsvd_2")
    8758                      .dwattr $C$DW$920, DW_AT_TI_symbol_name("_rsvd_2")
    8759                      .dwattr $C$DW$920, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8760                      .dwattr $C$DW$920, DW_AT_accessibility(DW_ACCESS_public)
    8761              
    8762              $C$DW$921       .dwtag  DW_TAG_member
    8763                      .dwattr $C$DW$921, DW_AT_type(*$C$DW$T$27)
    8764                      .dwattr $C$DW$921, DW_AT_name("LOSPCP")
    8765                      .dwattr $C$DW$921, DW_AT_TI_symbol_name("_LOSPCP")
    8766                      .dwattr $C$DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    8767                      .dwattr $C$DW$921, DW_AT_accessibility(DW_ACCESS_public)
    8768              
    8769              $C$DW$922       .dwtag  DW_TAG_member
    8770                      .dwattr $C$DW$922, DW_AT_type(*$C$DW$T$27)
    8771                      .dwattr $C$DW$922, DW_AT_name("PCLKCR0")
    8772                      .dwattr $C$DW$922, DW_AT_TI_symbol_name("_PCLKCR0")
    8773                      .dwattr $C$DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8774                      .dwattr $C$DW$922, DW_AT_accessibility(DW_ACCESS_public)
    8775              
    8776              $C$DW$923       .dwtag  DW_TAG_member
    8777                      .dwattr $C$DW$923, DW_AT_type(*$C$DW$T$27)
    8778                      .dwattr $C$DW$923, DW_AT_name("PCLKCR1")
    8779                      .dwattr $C$DW$923, DW_AT_TI_symbol_name("_PCLKCR1")
    8780                      .dwattr $C$DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:44 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{FF9B9E7E-063A-41EE-8C61-EA327628573A} PAGE  172

    8781                      .dwattr $C$DW$923, DW_AT_accessibility(DW_ACCESS_public)
    8782              
    8783              $C$DW$924       .dwtag  DW_TAG_member
    8784                      .dwattr $C$DW$924, DW_AT_type(*$C$DW$T$30)
    8785                      .dwattr $C$DW$924, DW_AT_name("rsvd_3")
    8786                      .dwattr $C$DW$924, DW_AT_TI_symbol_name("_rsvd_3")
    8787                      .dwattr $C$DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8788                      .dwattr $C$DW$924, DW_AT_accessibility(DW_ACCESS_public)
    8789              
    8790              $C$DW$925       .dwtag  DW_TAG_member
    8791                      .dwattr $C$DW$925, DW_AT_type(*$C$DW$T$27)
    8792                      .dwattr $C$DW$925, DW_AT_name("PCLKCR3")
    8793                      .dwattr $C$DW$925, DW_AT_TI_symbol_name("_PCLKCR3")
    8794                      .dwattr $C$DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8795                      .dwattr $C$DW$925, DW_AT_accessibility(DW_ACCESS_public)
    8796              
    8797                      .dwendtag $C$DW$T$40
    8798              
    8799              $C$DW$T$126     .dwtag  DW_TAG_pointer_type
    8800                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$40)
    8801                      .dwattr $C$DW$T$126, DW_AT_address_class(0x20)
    8802              
    8803              $C$DW$T$127     .dwtag  DW_TAG_typedef
    8804                      .dwattr $C$DW$T$127, DW_AT_name("CLK_Handle")
    8805                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
    8806                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    8807              
    8808              
    8809              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    8810                      .dwattr $C$DW$T$41, DW_AT_name("_CPU_Obj_")
    8811                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    8812              $C$DW$926       .dwtag  DW_TAG_member
    8813                      .dwattr $C$DW$926, DW_AT_type(*$C$DW$T$37)
    8814                      .dwattr $C$DW$926, DW_AT_name("tmp")
    8815                      .dwattr $C$DW$926, DW_AT_TI_symbol_name("_tmp")
    8816                      .dwattr $C$DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8817                      .dwattr $C$DW$926, DW_AT_accessibility(DW_ACCESS_public)
    8818              
    8819                      .dwendtag $C$DW$T$41
    8820              
    8821              $C$DW$T$128     .dwtag  DW_TAG_pointer_type
    8822                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$41)
    8823                      .dwattr $C$DW$T$128, DW_AT_address_class(0x20)
    8824              
    8825              $C$DW$T$129     .dwtag  DW_TAG_typedef
    8826                      .dwattr $C$DW$T$129, DW_AT_name("CPU_Handle")
    8827                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$128)
    8828                      .dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
    8829              
    8830              
    8831              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    8832                      .dwattr $C$DW$T$77, DW_AT_name("_CTRL_Obj_")
    8833                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x10a)
    8834              $C$DW$927       .dwtag  DW_TAG_member
    8835                      .dwattr $C$DW$927, DW_AT_type(*$C$DW$T$42)
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:44 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{FF9B9E7E-063A-41EE-8C61-EA327628573A} PAGE  173

    8836                      .dwattr $C$DW$927, DW_AT_name("version")
    8837                      .dwattr $C$DW$927, DW_AT_TI_symbol_name("_version")
    8838                      .dwattr $C$DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8839                      .dwattr $C$DW$927, DW_AT_accessibility(DW_ACCESS_public)
    8840              
    8841              $C$DW$928       .dwtag  DW_TAG_member
    8842                      .dwattr $C$DW$928, DW_AT_type(*$C$DW$T$44)
    8843                      .dwattr $C$DW$928, DW_AT_name("state")
    8844                      .dwattr $C$DW$928, DW_AT_TI_symbol_name("_state")
    8845                      .dwattr $C$DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8846                      .dwattr $C$DW$928, DW_AT_accessibility(DW_ACCESS_public)
    8847              
    8848              $C$DW$929       .dwtag  DW_TAG_member
    8849                      .dwattr $C$DW$929, DW_AT_type(*$C$DW$T$44)
    8850                      .dwattr $C$DW$929, DW_AT_name("prevState")
    8851                      .dwattr $C$DW$929, DW_AT_TI_symbol_name("_prevState")
    8852                      .dwattr $C$DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8853                      .dwattr $C$DW$929, DW_AT_accessibility(DW_ACCESS_public)
    8854              
    8855              $C$DW$930       .dwtag  DW_TAG_member
    8856                      .dwattr $C$DW$930, DW_AT_type(*$C$DW$T$46)
    8857                      .dwattr $C$DW$930, DW_AT_name("errorCode")
    8858                      .dwattr $C$DW$930, DW_AT_TI_symbol_name("_errorCode")
    8859                      .dwattr $C$DW$930, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8860                      .dwattr $C$DW$930, DW_AT_accessibility(DW_ACCESS_public)
    8861              
    8862              $C$DW$931       .dwtag  DW_TAG_member
    8863                      .dwattr $C$DW$931, DW_AT_type(*$C$DW$T$48)
    8864                      .dwattr $C$DW$931, DW_AT_name("clarkeHandle_I")
    8865                      .dwattr $C$DW$931, DW_AT_TI_symbol_name("_clarkeHandle_I")
    8866                      .dwattr $C$DW$931, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8867                      .dwattr $C$DW$931, DW_AT_accessibility(DW_ACCESS_public)
    8868              
    8869              $C$DW$932       .dwtag  DW_TAG_member
    8870                      .dwattr $C$DW$932, DW_AT_type(*$C$DW$T$49)
    8871                      .dwattr $C$DW$932, DW_AT_name("clarke_I")
    8872                      .dwattr $C$DW$932, DW_AT_TI_symbol_name("_clarke_I")
    8873                      .dwattr $C$DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8874                      .dwattr $C$DW$932, DW_AT_accessibility(DW_ACCESS_public)
    8875              
    8876              $C$DW$933       .dwtag  DW_TAG_member
    8877                      .dwattr $C$DW$933, DW_AT_type(*$C$DW$T$48)
    8878                      .dwattr $C$DW$933, DW_AT_name("clarkeHandle_V")
    8879                      .dwattr $C$DW$933, DW_AT_TI_symbol_name("_clarkeHandle_V")
    8880                      .dwattr $C$DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8881                      .dwattr $C$DW$933, DW_AT_accessibility(DW_ACCESS_public)
    8882              
    8883              $C$DW$934       .dwtag  DW_TAG_member
    8884                      .dwattr $C$DW$934, DW_AT_type(*$C$DW$T$49)
    8885                      .dwattr $C$DW$934, DW_AT_name("clarke_V")
    8886                      .dwattr $C$DW$934, DW_AT_TI_symbol_name("_clarke_V")
    8887                      .dwattr $C$DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8888                      .dwattr $C$DW$934, DW_AT_accessibility(DW_ACCESS_public)
    8889              
    8890              $C$DW$935       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:44 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{FF9B9E7E-063A-41EE-8C61-EA327628573A} PAGE  174

    8891                      .dwattr $C$DW$935, DW_AT_type(*$C$DW$T$51)
    8892                      .dwattr $C$DW$935, DW_AT_name("estHandle")
    8893                      .dwattr $C$DW$935, DW_AT_TI_symbol_name("_estHandle")
    8894                      .dwattr $C$DW$935, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8895                      .dwattr $C$DW$935, DW_AT_accessibility(DW_ACCESS_public)
    8896              
    8897              $C$DW$936       .dwtag  DW_TAG_member
    8898                      .dwattr $C$DW$936, DW_AT_type(*$C$DW$T$53)
    8899                      .dwattr $C$DW$936, DW_AT_name("parkHandle")
    8900                      .dwattr $C$DW$936, DW_AT_TI_symbol_name("_parkHandle")
    8901                      .dwattr $C$DW$936, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    8902                      .dwattr $C$DW$936, DW_AT_accessibility(DW_ACCESS_public)
    8903              
    8904              $C$DW$937       .dwtag  DW_TAG_member
    8905                      .dwattr $C$DW$937, DW_AT_type(*$C$DW$T$54)
    8906                      .dwattr $C$DW$937, DW_AT_name("park")
    8907                      .dwattr $C$DW$937, DW_AT_TI_symbol_name("_park")
    8908                      .dwattr $C$DW$937, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8909                      .dwattr $C$DW$937, DW_AT_accessibility(DW_ACCESS_public)
    8910              
    8911              $C$DW$938       .dwtag  DW_TAG_member
    8912                      .dwattr $C$DW$938, DW_AT_type(*$C$DW$T$56)
    8913                      .dwattr $C$DW$938, DW_AT_name("pidHandle_Id")
    8914                      .dwattr $C$DW$938, DW_AT_TI_symbol_name("_pidHandle_Id")
    8915                      .dwattr $C$DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8916                      .dwattr $C$DW$938, DW_AT_accessibility(DW_ACCESS_public)
    8917              
    8918              $C$DW$939       .dwtag  DW_TAG_member
    8919                      .dwattr $C$DW$939, DW_AT_type(*$C$DW$T$57)
    8920                      .dwattr $C$DW$939, DW_AT_name("pid_Id")
    8921                      .dwattr $C$DW$939, DW_AT_TI_symbol_name("_pid_Id")
    8922                      .dwattr $C$DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    8923                      .dwattr $C$DW$939, DW_AT_accessibility(DW_ACCESS_public)
    8924              
    8925              $C$DW$940       .dwtag  DW_TAG_member
    8926                      .dwattr $C$DW$940, DW_AT_type(*$C$DW$T$56)
    8927                      .dwattr $C$DW$940, DW_AT_name("pidHandle_Iq")
    8928                      .dwattr $C$DW$940, DW_AT_TI_symbol_name("_pidHandle_Iq")
    8929                      .dwattr $C$DW$940, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    8930                      .dwattr $C$DW$940, DW_AT_accessibility(DW_ACCESS_public)
    8931              
    8932              $C$DW$941       .dwtag  DW_TAG_member
    8933                      .dwattr $C$DW$941, DW_AT_type(*$C$DW$T$57)
    8934                      .dwattr $C$DW$941, DW_AT_name("pid_Iq")
    8935                      .dwattr $C$DW$941, DW_AT_TI_symbol_name("_pid_Iq")
    8936                      .dwattr $C$DW$941, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    8937                      .dwattr $C$DW$941, DW_AT_accessibility(DW_ACCESS_public)
    8938              
    8939              $C$DW$942       .dwtag  DW_TAG_member
    8940                      .dwattr $C$DW$942, DW_AT_type(*$C$DW$T$56)
    8941                      .dwattr $C$DW$942, DW_AT_name("pidHandle_spd")
    8942                      .dwattr $C$DW$942, DW_AT_TI_symbol_name("_pidHandle_spd")
    8943                      .dwattr $C$DW$942, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    8944                      .dwattr $C$DW$942, DW_AT_accessibility(DW_ACCESS_public)
    8945              
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:44 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{FF9B9E7E-063A-41EE-8C61-EA327628573A} PAGE  175

    8946              $C$DW$943       .dwtag  DW_TAG_member
    8947                      .dwattr $C$DW$943, DW_AT_type(*$C$DW$T$57)
    8948                      .dwattr $C$DW$943, DW_AT_name("pid_spd")
    8949                      .dwattr $C$DW$943, DW_AT_TI_symbol_name("_pid_spd")
    8950                      .dwattr $C$DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    8951                      .dwattr $C$DW$943, DW_AT_accessibility(DW_ACCESS_public)
    8952              
    8953              $C$DW$944       .dwtag  DW_TAG_member
    8954                      .dwattr $C$DW$944, DW_AT_type(*$C$DW$T$59)
    8955                      .dwattr $C$DW$944, DW_AT_name("iparkHandle")
    8956                      .dwattr $C$DW$944, DW_AT_TI_symbol_name("_iparkHandle")
    8957                      .dwattr $C$DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    8958                      .dwattr $C$DW$944, DW_AT_accessibility(DW_ACCESS_public)
    8959              
    8960              $C$DW$945       .dwtag  DW_TAG_member
    8961                      .dwattr $C$DW$945, DW_AT_type(*$C$DW$T$60)
    8962                      .dwattr $C$DW$945, DW_AT_name("ipark")
    8963                      .dwattr $C$DW$945, DW_AT_TI_symbol_name("_ipark")
    8964                      .dwattr $C$DW$945, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    8965                      .dwattr $C$DW$945, DW_AT_accessibility(DW_ACCESS_public)
    8966              
    8967              $C$DW$946       .dwtag  DW_TAG_member
    8968                      .dwattr $C$DW$946, DW_AT_type(*$C$DW$T$62)
    8969                      .dwattr $C$DW$946, DW_AT_name("svgenHandle")
    8970                      .dwattr $C$DW$946, DW_AT_TI_symbol_name("_svgenHandle")
    8971                      .dwattr $C$DW$946, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    8972                      .dwattr $C$DW$946, DW_AT_accessibility(DW_ACCESS_public)
    8973              
    8974              $C$DW$947       .dwtag  DW_TAG_member
    8975                      .dwattr $C$DW$947, DW_AT_type(*$C$DW$T$63)
    8976                      .dwattr $C$DW$947, DW_AT_name("svgen")
    8977                      .dwattr $C$DW$947, DW_AT_TI_symbol_name("_svgen")
    8978                      .dwattr $C$DW$947, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    8979                      .dwattr $C$DW$947, DW_AT_accessibility(DW_ACCESS_public)
    8980              
    8981              $C$DW$948       .dwtag  DW_TAG_member
    8982                      .dwattr $C$DW$948, DW_AT_type(*$C$DW$T$65)
    8983                      .dwattr $C$DW$948, DW_AT_name("trajHandle_Id")
    8984                      .dwattr $C$DW$948, DW_AT_TI_symbol_name("_trajHandle_Id")
    8985                      .dwattr $C$DW$948, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    8986                      .dwattr $C$DW$948, DW_AT_accessibility(DW_ACCESS_public)
    8987              
    8988              $C$DW$949       .dwtag  DW_TAG_member
    8989                      .dwattr $C$DW$949, DW_AT_type(*$C$DW$T$66)
    8990                      .dwattr $C$DW$949, DW_AT_name("traj_Id")
    8991                      .dwattr $C$DW$949, DW_AT_TI_symbol_name("_traj_Id")
    8992                      .dwattr $C$DW$949, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    8993                      .dwattr $C$DW$949, DW_AT_accessibility(DW_ACCESS_public)
    8994              
    8995              $C$DW$950       .dwtag  DW_TAG_member
    8996                      .dwattr $C$DW$950, DW_AT_type(*$C$DW$T$65)
    8997                      .dwattr $C$DW$950, DW_AT_name("trajHandle_spd")
    8998                      .dwattr $C$DW$950, DW_AT_TI_symbol_name("_trajHandle_spd")
    8999                      .dwattr $C$DW$950, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    9000                      .dwattr $C$DW$950, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:44 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{FF9B9E7E-063A-41EE-8C61-EA327628573A} PAGE  176

    9001              
    9002              $C$DW$951       .dwtag  DW_TAG_member
    9003                      .dwattr $C$DW$951, DW_AT_type(*$C$DW$T$66)
    9004                      .dwattr $C$DW$951, DW_AT_name("traj_spd")
    9005                      .dwattr $C$DW$951, DW_AT_TI_symbol_name("_traj_spd")
    9006                      .dwattr $C$DW$951, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    9007                      .dwattr $C$DW$951, DW_AT_accessibility(DW_ACCESS_public)
    9008              
    9009              $C$DW$952       .dwtag  DW_TAG_member
    9010                      .dwattr $C$DW$952, DW_AT_type(*$C$DW$T$65)
    9011                      .dwattr $C$DW$952, DW_AT_name("trajHandle_spdMax")
    9012                      .dwattr $C$DW$952, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    9013                      .dwattr $C$DW$952, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    9014                      .dwattr $C$DW$952, DW_AT_accessibility(DW_ACCESS_public)
    9015              
    9016              $C$DW$953       .dwtag  DW_TAG_member
    9017                      .dwattr $C$DW$953, DW_AT_type(*$C$DW$T$66)
    9018                      .dwattr $C$DW$953, DW_AT_name("traj_spdMax")
    9019                      .dwattr $C$DW$953, DW_AT_TI_symbol_name("_traj_spdMax")
    9020                      .dwattr $C$DW$953, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    9021                      .dwattr $C$DW$953, DW_AT_accessibility(DW_ACCESS_public)
    9022              
    9023              $C$DW$954       .dwtag  DW_TAG_member
    9024                      .dwattr $C$DW$954, DW_AT_type(*$C$DW$T$67)
    9025                      .dwattr $C$DW$954, DW_AT_name("motorParams")
    9026                      .dwattr $C$DW$954, DW_AT_TI_symbol_name("_motorParams")
    9027                      .dwattr $C$DW$954, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    9028                      .dwattr $C$DW$954, DW_AT_accessibility(DW_ACCESS_public)
    9029              
    9030              $C$DW$955       .dwtag  DW_TAG_member
    9031                      .dwattr $C$DW$955, DW_AT_type(*$C$DW$T$71)
    9032                      .dwattr $C$DW$955, DW_AT_name("waitTimes")
    9033                      .dwattr $C$DW$955, DW_AT_TI_symbol_name("_waitTimes")
    9034                      .dwattr $C$DW$955, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    9035                      .dwattr $C$DW$955, DW_AT_accessibility(DW_ACCESS_public)
    9036              
    9037              $C$DW$956       .dwtag  DW_TAG_member
    9038                      .dwattr $C$DW$956, DW_AT_type(*$C$DW$T$70)
    9039                      .dwattr $C$DW$956, DW_AT_name("counter_state")
    9040                      .dwattr $C$DW$956, DW_AT_TI_symbol_name("_counter_state")
    9041                      .dwattr $C$DW$956, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    9042                      .dwattr $C$DW$956, DW_AT_accessibility(DW_ACCESS_public)
    9043              
    9044              $C$DW$957       .dwtag  DW_TAG_member
    9045                      .dwattr $C$DW$957, DW_AT_type(*$C$DW$T$73)
    9046                      .dwattr $C$DW$957, DW_AT_name("numIsrTicksPerCtrlTick")
    9047                      .dwattr $C$DW$957, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    9048                      .dwattr $C$DW$957, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    9049                      .dwattr $C$DW$957, DW_AT_accessibility(DW_ACCESS_public)
    9050              
    9051              $C$DW$958       .dwtag  DW_TAG_member
    9052                      .dwattr $C$DW$958, DW_AT_type(*$C$DW$T$73)
    9053                      .dwattr $C$DW$958, DW_AT_name("numCtrlTicksPerCurrentTick")
    9054                      .dwattr $C$DW$958, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    9055                      .dwattr $C$DW$958, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:44 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{FF9B9E7E-063A-41EE-8C61-EA327628573A} PAGE  177

    9056                      .dwattr $C$DW$958, DW_AT_accessibility(DW_ACCESS_public)
    9057              
    9058              $C$DW$959       .dwtag  DW_TAG_member
    9059                      .dwattr $C$DW$959, DW_AT_type(*$C$DW$T$73)
    9060                      .dwattr $C$DW$959, DW_AT_name("numCtrlTicksPerSpeedTick")
    9061                      .dwattr $C$DW$959, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    9062                      .dwattr $C$DW$959, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    9063                      .dwattr $C$DW$959, DW_AT_accessibility(DW_ACCESS_public)
    9064              
    9065              $C$DW$960       .dwtag  DW_TAG_member
    9066                      .dwattr $C$DW$960, DW_AT_type(*$C$DW$T$73)
    9067                      .dwattr $C$DW$960, DW_AT_name("numCtrlTicksPerTrajTick")
    9068                      .dwattr $C$DW$960, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    9069                      .dwattr $C$DW$960, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    9070                      .dwattr $C$DW$960, DW_AT_accessibility(DW_ACCESS_public)
    9071              
    9072              $C$DW$961       .dwtag  DW_TAG_member
    9073                      .dwattr $C$DW$961, DW_AT_type(*$C$DW$T$70)
    9074                      .dwattr $C$DW$961, DW_AT_name("ctrlFreq_Hz")
    9075                      .dwattr $C$DW$961, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    9076                      .dwattr $C$DW$961, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    9077                      .dwattr $C$DW$961, DW_AT_accessibility(DW_ACCESS_public)
    9078              
    9079              $C$DW$962       .dwtag  DW_TAG_member
    9080                      .dwattr $C$DW$962, DW_AT_type(*$C$DW$T$70)
    9081                      .dwattr $C$DW$962, DW_AT_name("trajFreq_Hz")
    9082                      .dwattr $C$DW$962, DW_AT_TI_symbol_name("_trajFreq_Hz")
    9083                      .dwattr $C$DW$962, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    9084                      .dwattr $C$DW$962, DW_AT_accessibility(DW_ACCESS_public)
    9085              
    9086              $C$DW$963       .dwtag  DW_TAG_member
    9087                      .dwattr $C$DW$963, DW_AT_type(*$C$DW$T$35)
    9088                      .dwattr $C$DW$963, DW_AT_name("trajPeriod_sec")
    9089                      .dwattr $C$DW$963, DW_AT_TI_symbol_name("_trajPeriod_sec")
    9090                      .dwattr $C$DW$963, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    9091                      .dwattr $C$DW$963, DW_AT_accessibility(DW_ACCESS_public)
    9092              
    9093              $C$DW$964       .dwtag  DW_TAG_member
    9094                      .dwattr $C$DW$964, DW_AT_type(*$C$DW$T$74)
    9095                      .dwattr $C$DW$964, DW_AT_name("ctrlPeriod_sec")
    9096                      .dwattr $C$DW$964, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    9097                      .dwattr $C$DW$964, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    9098                      .dwattr $C$DW$964, DW_AT_accessibility(DW_ACCESS_public)
    9099              
    9100              $C$DW$965       .dwtag  DW_TAG_member
    9101                      .dwattr $C$DW$965, DW_AT_type(*$C$DW$T$35)
    9102                      .dwattr $C$DW$965, DW_AT_name("maxVsMag_pu")
    9103                      .dwattr $C$DW$965, DW_AT_TI_symbol_name("_maxVsMag_pu")
    9104                      .dwattr $C$DW$965, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    9105                      .dwattr $C$DW$965, DW_AT_accessibility(DW_ACCESS_public)
    9106              
    9107              $C$DW$966       .dwtag  DW_TAG_member
    9108                      .dwattr $C$DW$966, DW_AT_type(*$C$DW$T$75)
    9109                      .dwattr $C$DW$966, DW_AT_name("Iab_in")
    9110                      .dwattr $C$DW$966, DW_AT_TI_symbol_name("_Iab_in")
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:44 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{FF9B9E7E-063A-41EE-8C61-EA327628573A} PAGE  178

    9111                      .dwattr $C$DW$966, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    9112                      .dwattr $C$DW$966, DW_AT_accessibility(DW_ACCESS_public)
    9113              
    9114              $C$DW$967       .dwtag  DW_TAG_member
    9115                      .dwattr $C$DW$967, DW_AT_type(*$C$DW$T$75)
    9116                      .dwattr $C$DW$967, DW_AT_name("Iab_filt")
    9117                      .dwattr $C$DW$967, DW_AT_TI_symbol_name("_Iab_filt")
    9118                      .dwattr $C$DW$967, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    9119                      .dwattr $C$DW$967, DW_AT_accessibility(DW_ACCESS_public)
    9120              
    9121              $C$DW$968       .dwtag  DW_TAG_member
    9122                      .dwattr $C$DW$968, DW_AT_type(*$C$DW$T$75)
    9123                      .dwattr $C$DW$968, DW_AT_name("Idq_in")
    9124                      .dwattr $C$DW$968, DW_AT_TI_symbol_name("_Idq_in")
    9125                      .dwattr $C$DW$968, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    9126                      .dwattr $C$DW$968, DW_AT_accessibility(DW_ACCESS_public)
    9127              
    9128              $C$DW$969       .dwtag  DW_TAG_member
    9129                      .dwattr $C$DW$969, DW_AT_type(*$C$DW$T$75)
    9130                      .dwattr $C$DW$969, DW_AT_name("Vab_in")
    9131                      .dwattr $C$DW$969, DW_AT_TI_symbol_name("_Vab_in")
    9132                      .dwattr $C$DW$969, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    9133                      .dwattr $C$DW$969, DW_AT_accessibility(DW_ACCESS_public)
    9134              
    9135              $C$DW$970       .dwtag  DW_TAG_member
    9136                      .dwattr $C$DW$970, DW_AT_type(*$C$DW$T$35)
    9137                      .dwattr $C$DW$970, DW_AT_name("spd_out")
    9138                      .dwattr $C$DW$970, DW_AT_TI_symbol_name("_spd_out")
    9139                      .dwattr $C$DW$970, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    9140                      .dwattr $C$DW$970, DW_AT_accessibility(DW_ACCESS_public)
    9141              
    9142              $C$DW$971       .dwtag  DW_TAG_member
    9143                      .dwattr $C$DW$971, DW_AT_type(*$C$DW$T$75)
    9144                      .dwattr $C$DW$971, DW_AT_name("Vab_out")
    9145                      .dwattr $C$DW$971, DW_AT_TI_symbol_name("_Vab_out")
    9146                      .dwattr $C$DW$971, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    9147                      .dwattr $C$DW$971, DW_AT_accessibility(DW_ACCESS_public)
    9148              
    9149              $C$DW$972       .dwtag  DW_TAG_member
    9150                      .dwattr $C$DW$972, DW_AT_type(*$C$DW$T$75)
    9151                      .dwattr $C$DW$972, DW_AT_name("Vdq_out")
    9152                      .dwattr $C$DW$972, DW_AT_TI_symbol_name("_Vdq_out")
    9153                      .dwattr $C$DW$972, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    9154                      .dwattr $C$DW$972, DW_AT_accessibility(DW_ACCESS_public)
    9155              
    9156              $C$DW$973       .dwtag  DW_TAG_member
    9157                      .dwattr $C$DW$973, DW_AT_type(*$C$DW$T$74)
    9158                      .dwattr $C$DW$973, DW_AT_name("Rhf")
    9159                      .dwattr $C$DW$973, DW_AT_TI_symbol_name("_Rhf")
    9160                      .dwattr $C$DW$973, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    9161                      .dwattr $C$DW$973, DW_AT_accessibility(DW_ACCESS_public)
    9162              
    9163              $C$DW$974       .dwtag  DW_TAG_member
    9164                      .dwattr $C$DW$974, DW_AT_type(*$C$DW$T$74)
    9165                      .dwattr $C$DW$974, DW_AT_name("Lhf")
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:44 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{FF9B9E7E-063A-41EE-8C61-EA327628573A} PAGE  179

    9166                      .dwattr $C$DW$974, DW_AT_TI_symbol_name("_Lhf")
    9167                      .dwattr $C$DW$974, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    9168                      .dwattr $C$DW$974, DW_AT_accessibility(DW_ACCESS_public)
    9169              
    9170              $C$DW$975       .dwtag  DW_TAG_member
    9171                      .dwattr $C$DW$975, DW_AT_type(*$C$DW$T$74)
    9172                      .dwattr $C$DW$975, DW_AT_name("RoverL")
    9173                      .dwattr $C$DW$975, DW_AT_TI_symbol_name("_RoverL")
    9174                      .dwattr $C$DW$975, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    9175                      .dwattr $C$DW$975, DW_AT_accessibility(DW_ACCESS_public)
    9176              
    9177              $C$DW$976       .dwtag  DW_TAG_member
    9178                      .dwattr $C$DW$976, DW_AT_type(*$C$DW$T$35)
    9179                      .dwattr $C$DW$976, DW_AT_name("Kp_Id")
    9180                      .dwattr $C$DW$976, DW_AT_TI_symbol_name("_Kp_Id")
    9181                      .dwattr $C$DW$976, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    9182                      .dwattr $C$DW$976, DW_AT_accessibility(DW_ACCESS_public)
    9183              
    9184              $C$DW$977       .dwtag  DW_TAG_member
    9185                      .dwattr $C$DW$977, DW_AT_type(*$C$DW$T$35)
    9186                      .dwattr $C$DW$977, DW_AT_name("Kp_Iq")
    9187                      .dwattr $C$DW$977, DW_AT_TI_symbol_name("_Kp_Iq")
    9188                      .dwattr $C$DW$977, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    9189                      .dwattr $C$DW$977, DW_AT_accessibility(DW_ACCESS_public)
    9190              
    9191              $C$DW$978       .dwtag  DW_TAG_member
    9192                      .dwattr $C$DW$978, DW_AT_type(*$C$DW$T$35)
    9193                      .dwattr $C$DW$978, DW_AT_name("Kp_spd")
    9194                      .dwattr $C$DW$978, DW_AT_TI_symbol_name("_Kp_spd")
    9195                      .dwattr $C$DW$978, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    9196                      .dwattr $C$DW$978, DW_AT_accessibility(DW_ACCESS_public)
    9197              
    9198              $C$DW$979       .dwtag  DW_TAG_member
    9199                      .dwattr $C$DW$979, DW_AT_type(*$C$DW$T$35)
    9200                      .dwattr $C$DW$979, DW_AT_name("Ki_Id")
    9201                      .dwattr $C$DW$979, DW_AT_TI_symbol_name("_Ki_Id")
    9202                      .dwattr $C$DW$979, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    9203                      .dwattr $C$DW$979, DW_AT_accessibility(DW_ACCESS_public)
    9204              
    9205              $C$DW$980       .dwtag  DW_TAG_member
    9206                      .dwattr $C$DW$980, DW_AT_type(*$C$DW$T$35)
    9207                      .dwattr $C$DW$980, DW_AT_name("Ki_Iq")
    9208                      .dwattr $C$DW$980, DW_AT_TI_symbol_name("_Ki_Iq")
    9209                      .dwattr $C$DW$980, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    9210                      .dwattr $C$DW$980, DW_AT_accessibility(DW_ACCESS_public)
    9211              
    9212              $C$DW$981       .dwtag  DW_TAG_member
    9213                      .dwattr $C$DW$981, DW_AT_type(*$C$DW$T$35)
    9214                      .dwattr $C$DW$981, DW_AT_name("Ki_spd")
    9215                      .dwattr $C$DW$981, DW_AT_TI_symbol_name("_Ki_spd")
    9216                      .dwattr $C$DW$981, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    9217                      .dwattr $C$DW$981, DW_AT_accessibility(DW_ACCESS_public)
    9218              
    9219              $C$DW$982       .dwtag  DW_TAG_member
    9220                      .dwattr $C$DW$982, DW_AT_type(*$C$DW$T$35)
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:44 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{FF9B9E7E-063A-41EE-8C61-EA327628573A} PAGE  180

    9221                      .dwattr $C$DW$982, DW_AT_name("Kd_Id")
    9222                      .dwattr $C$DW$982, DW_AT_TI_symbol_name("_Kd_Id")
    9223                      .dwattr $C$DW$982, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    9224                      .dwattr $C$DW$982, DW_AT_accessibility(DW_ACCESS_public)
    9225              
    9226              $C$DW$983       .dwtag  DW_TAG_member
    9227                      .dwattr $C$DW$983, DW_AT_type(*$C$DW$T$35)
    9228                      .dwattr $C$DW$983, DW_AT_name("Kd_Iq")
    9229                      .dwattr $C$DW$983, DW_AT_TI_symbol_name("_Kd_Iq")
    9230                      .dwattr $C$DW$983, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    9231                      .dwattr $C$DW$983, DW_AT_accessibility(DW_ACCESS_public)
    9232              
    9233              $C$DW$984       .dwtag  DW_TAG_member
    9234                      .dwattr $C$DW$984, DW_AT_type(*$C$DW$T$35)
    9235                      .dwattr $C$DW$984, DW_AT_name("Kd_spd")
    9236                      .dwattr $C$DW$984, DW_AT_TI_symbol_name("_Kd_spd")
    9237                      .dwattr $C$DW$984, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    9238                      .dwattr $C$DW$984, DW_AT_accessibility(DW_ACCESS_public)
    9239              
    9240              $C$DW$985       .dwtag  DW_TAG_member
    9241                      .dwattr $C$DW$985, DW_AT_type(*$C$DW$T$35)
    9242                      .dwattr $C$DW$985, DW_AT_name("Ui_Id")
    9243                      .dwattr $C$DW$985, DW_AT_TI_symbol_name("_Ui_Id")
    9244                      .dwattr $C$DW$985, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    9245                      .dwattr $C$DW$985, DW_AT_accessibility(DW_ACCESS_public)
    9246              
    9247              $C$DW$986       .dwtag  DW_TAG_member
    9248                      .dwattr $C$DW$986, DW_AT_type(*$C$DW$T$35)
    9249                      .dwattr $C$DW$986, DW_AT_name("Ui_Iq")
    9250                      .dwattr $C$DW$986, DW_AT_TI_symbol_name("_Ui_Iq")
    9251                      .dwattr $C$DW$986, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    9252                      .dwattr $C$DW$986, DW_AT_accessibility(DW_ACCESS_public)
    9253              
    9254              $C$DW$987       .dwtag  DW_TAG_member
    9255                      .dwattr $C$DW$987, DW_AT_type(*$C$DW$T$35)
    9256                      .dwattr $C$DW$987, DW_AT_name("Ui_spd")
    9257                      .dwattr $C$DW$987, DW_AT_TI_symbol_name("_Ui_spd")
    9258                      .dwattr $C$DW$987, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    9259                      .dwattr $C$DW$987, DW_AT_accessibility(DW_ACCESS_public)
    9260              
    9261              $C$DW$988       .dwtag  DW_TAG_member
    9262                      .dwattr $C$DW$988, DW_AT_type(*$C$DW$T$75)
    9263                      .dwattr $C$DW$988, DW_AT_name("Idq_ref")
    9264                      .dwattr $C$DW$988, DW_AT_TI_symbol_name("_Idq_ref")
    9265                      .dwattr $C$DW$988, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    9266                      .dwattr $C$DW$988, DW_AT_accessibility(DW_ACCESS_public)
    9267              
    9268              $C$DW$989       .dwtag  DW_TAG_member
    9269                      .dwattr $C$DW$989, DW_AT_type(*$C$DW$T$35)
    9270                      .dwattr $C$DW$989, DW_AT_name("IdRated")
    9271                      .dwattr $C$DW$989, DW_AT_TI_symbol_name("_IdRated")
    9272                      .dwattr $C$DW$989, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    9273                      .dwattr $C$DW$989, DW_AT_accessibility(DW_ACCESS_public)
    9274              
    9275              $C$DW$990       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:44 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{FF9B9E7E-063A-41EE-8C61-EA327628573A} PAGE  181

    9276                      .dwattr $C$DW$990, DW_AT_type(*$C$DW$T$35)
    9277                      .dwattr $C$DW$990, DW_AT_name("spd_ref")
    9278                      .dwattr $C$DW$990, DW_AT_TI_symbol_name("_spd_ref")
    9279                      .dwattr $C$DW$990, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    9280                      .dwattr $C$DW$990, DW_AT_accessibility(DW_ACCESS_public)
    9281              
    9282              $C$DW$991       .dwtag  DW_TAG_member
    9283                      .dwattr $C$DW$991, DW_AT_type(*$C$DW$T$35)
    9284                      .dwattr $C$DW$991, DW_AT_name("spd_max")
    9285                      .dwattr $C$DW$991, DW_AT_TI_symbol_name("_spd_max")
    9286                      .dwattr $C$DW$991, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    9287                      .dwattr $C$DW$991, DW_AT_accessibility(DW_ACCESS_public)
    9288              
    9289              $C$DW$992       .dwtag  DW_TAG_member
    9290                      .dwattr $C$DW$992, DW_AT_type(*$C$DW$T$73)
    9291                      .dwattr $C$DW$992, DW_AT_name("counter_current")
    9292                      .dwattr $C$DW$992, DW_AT_TI_symbol_name("_counter_current")
    9293                      .dwattr $C$DW$992, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    9294                      .dwattr $C$DW$992, DW_AT_accessibility(DW_ACCESS_public)
    9295              
    9296              $C$DW$993       .dwtag  DW_TAG_member
    9297                      .dwattr $C$DW$993, DW_AT_type(*$C$DW$T$73)
    9298                      .dwattr $C$DW$993, DW_AT_name("counter_isr")
    9299                      .dwattr $C$DW$993, DW_AT_TI_symbol_name("_counter_isr")
    9300                      .dwattr $C$DW$993, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    9301                      .dwattr $C$DW$993, DW_AT_accessibility(DW_ACCESS_public)
    9302              
    9303              $C$DW$994       .dwtag  DW_TAG_member
    9304                      .dwattr $C$DW$994, DW_AT_type(*$C$DW$T$73)
    9305                      .dwattr $C$DW$994, DW_AT_name("counter_speed")
    9306                      .dwattr $C$DW$994, DW_AT_TI_symbol_name("_counter_speed")
    9307                      .dwattr $C$DW$994, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    9308                      .dwattr $C$DW$994, DW_AT_accessibility(DW_ACCESS_public)
    9309              
    9310              $C$DW$995       .dwtag  DW_TAG_member
    9311                      .dwattr $C$DW$995, DW_AT_type(*$C$DW$T$73)
    9312                      .dwattr $C$DW$995, DW_AT_name("counter_traj")
    9313                      .dwattr $C$DW$995, DW_AT_TI_symbol_name("_counter_traj")
    9314                      .dwattr $C$DW$995, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    9315                      .dwattr $C$DW$995, DW_AT_accessibility(DW_ACCESS_public)
    9316              
    9317              $C$DW$996       .dwtag  DW_TAG_member
    9318                      .dwattr $C$DW$996, DW_AT_type(*$C$DW$T$76)
    9319                      .dwattr $C$DW$996, DW_AT_name("flag_enableCtrl")
    9320                      .dwattr $C$DW$996, DW_AT_TI_symbol_name("_flag_enableCtrl")
    9321                      .dwattr $C$DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    9322                      .dwattr $C$DW$996, DW_AT_accessibility(DW_ACCESS_public)
    9323              
    9324              $C$DW$997       .dwtag  DW_TAG_member
    9325                      .dwattr $C$DW$997, DW_AT_type(*$C$DW$T$76)
    9326                      .dwattr $C$DW$997, DW_AT_name("flag_enableDcBusComp")
    9327                      .dwattr $C$DW$997, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    9328                      .dwattr $C$DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    9329                      .dwattr $C$DW$997, DW_AT_accessibility(DW_ACCESS_public)
    9330              
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:44 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{FF9B9E7E-063A-41EE-8C61-EA327628573A} PAGE  182

    9331              $C$DW$998       .dwtag  DW_TAG_member
    9332                      .dwattr $C$DW$998, DW_AT_type(*$C$DW$T$76)
    9333                      .dwattr $C$DW$998, DW_AT_name("flag_enablePowerWarp")
    9334                      .dwattr $C$DW$998, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    9335                      .dwattr $C$DW$998, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    9336                      .dwattr $C$DW$998, DW_AT_accessibility(DW_ACCESS_public)
    9337              
    9338              $C$DW$999       .dwtag  DW_TAG_member
    9339                      .dwattr $C$DW$999, DW_AT_type(*$C$DW$T$76)
    9340                      .dwattr $C$DW$999, DW_AT_name("flag_enableOffset")
    9341                      .dwattr $C$DW$999, DW_AT_TI_symbol_name("_flag_enableOffset")
    9342                      .dwattr $C$DW$999, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    9343                      .dwattr $C$DW$999, DW_AT_accessibility(DW_ACCESS_public)
    9344              
    9345              $C$DW$1000      .dwtag  DW_TAG_member
    9346                      .dwattr $C$DW$1000, DW_AT_type(*$C$DW$T$76)
    9347                      .dwattr $C$DW$1000, DW_AT_name("flag_enableSpeedCtrl")
    9348                      .dwattr $C$DW$1000, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    9349                      .dwattr $C$DW$1000, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    9350                      .dwattr $C$DW$1000, DW_AT_accessibility(DW_ACCESS_public)
    9351              
    9352              $C$DW$1001      .dwtag  DW_TAG_member
    9353                      .dwattr $C$DW$1001, DW_AT_type(*$C$DW$T$76)
    9354                      .dwattr $C$DW$1001, DW_AT_name("flag_enableUserMotorParams")
    9355                      .dwattr $C$DW$1001, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    9356                      .dwattr $C$DW$1001, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    9357                      .dwattr $C$DW$1001, DW_AT_accessibility(DW_ACCESS_public)
    9358              
    9359              $C$DW$1002      .dwtag  DW_TAG_member
    9360                      .dwattr $C$DW$1002, DW_AT_type(*$C$DW$T$75)
    9361                      .dwattr $C$DW$1002, DW_AT_name("Idq_offset_pu")
    9362                      .dwattr $C$DW$1002, DW_AT_TI_symbol_name("_Idq_offset_pu")
    9363                      .dwattr $C$DW$1002, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    9364                      .dwattr $C$DW$1002, DW_AT_accessibility(DW_ACCESS_public)
    9365              
    9366              $C$DW$1003      .dwtag  DW_TAG_member
    9367                      .dwattr $C$DW$1003, DW_AT_type(*$C$DW$T$75)
    9368                      .dwattr $C$DW$1003, DW_AT_name("Vdq_offset_pu")
    9369                      .dwattr $C$DW$1003, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    9370                      .dwattr $C$DW$1003, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    9371                      .dwattr $C$DW$1003, DW_AT_accessibility(DW_ACCESS_public)
    9372              
    9373              $C$DW$1004      .dwtag  DW_TAG_member
    9374                      .dwattr $C$DW$1004, DW_AT_type(*$C$DW$T$35)
    9375                      .dwattr $C$DW$1004, DW_AT_name("angle_pu")
    9376                      .dwattr $C$DW$1004, DW_AT_TI_symbol_name("_angle_pu")
    9377                      .dwattr $C$DW$1004, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    9378                      .dwattr $C$DW$1004, DW_AT_accessibility(DW_ACCESS_public)
    9379              
    9380              $C$DW$1005      .dwtag  DW_TAG_member
    9381                      .dwattr $C$DW$1005, DW_AT_type(*$C$DW$T$35)
    9382                      .dwattr $C$DW$1005, DW_AT_name("speed_ref_pu")
    9383                      .dwattr $C$DW$1005, DW_AT_TI_symbol_name("_speed_ref_pu")
    9384                      .dwattr $C$DW$1005, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    9385                      .dwattr $C$DW$1005, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:44 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{FF9B9E7E-063A-41EE-8C61-EA327628573A} PAGE  183

    9386              
    9387              $C$DW$1006      .dwtag  DW_TAG_member
    9388                      .dwattr $C$DW$1006, DW_AT_type(*$C$DW$T$35)
    9389                      .dwattr $C$DW$1006, DW_AT_name("speed_fb_pu")
    9390                      .dwattr $C$DW$1006, DW_AT_TI_symbol_name("_speed_fb_pu")
    9391                      .dwattr $C$DW$1006, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    9392                      .dwattr $C$DW$1006, DW_AT_accessibility(DW_ACCESS_public)
    9393              
    9394              $C$DW$1007      .dwtag  DW_TAG_member
    9395                      .dwattr $C$DW$1007, DW_AT_type(*$C$DW$T$35)
    9396                      .dwattr $C$DW$1007, DW_AT_name("speed_outMax_pu")
    9397                      .dwattr $C$DW$1007, DW_AT_TI_symbol_name("_speed_outMax_pu")
    9398                      .dwattr $C$DW$1007, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    9399                      .dwattr $C$DW$1007, DW_AT_accessibility(DW_ACCESS_public)
    9400              
    9401              $C$DW$1008      .dwtag  DW_TAG_member
    9402                      .dwattr $C$DW$1008, DW_AT_type(*$C$DW$T$76)
    9403                      .dwattr $C$DW$1008, DW_AT_name("flag_enableCurrentCtrl")
    9404                      .dwattr $C$DW$1008, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    9405                      .dwattr $C$DW$1008, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    9406                      .dwattr $C$DW$1008, DW_AT_accessibility(DW_ACCESS_public)
    9407              
    9408              $C$DW$1009      .dwtag  DW_TAG_member
    9409                      .dwattr $C$DW$1009, DW_AT_type(*$C$DW$T$35)
    9410                      .dwattr $C$DW$1009, DW_AT_name("torque_head_comm")
    9411                      .dwattr $C$DW$1009, DW_AT_TI_symbol_name("_torque_head_comm")
    9412                      .dwattr $C$DW$1009, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    9413                      .dwattr $C$DW$1009, DW_AT_accessibility(DW_ACCESS_public)
    9414              
    9415                      .dwendtag $C$DW$T$77
    9416              
    9417              $C$DW$T$248     .dwtag  DW_TAG_typedef
    9418                      .dwattr $C$DW$T$248, DW_AT_name("CTRL_Obj")
    9419                      .dwattr $C$DW$T$248, DW_AT_type(*$C$DW$T$77)
    9420                      .dwattr $C$DW$T$248, DW_AT_language(DW_LANG_C)
    9421              
    9422              $C$DW$T$249     .dwtag  DW_TAG_pointer_type
    9423                      .dwattr $C$DW$T$249, DW_AT_type(*$C$DW$T$248)
    9424                      .dwattr $C$DW$T$249, DW_AT_address_class(0x20)
    9425              
    9426              $C$DW$T$203     .dwtag  DW_TAG_pointer_type
    9427                      .dwattr $C$DW$T$203, DW_AT_type(*$C$DW$T$77)
    9428                      .dwattr $C$DW$T$203, DW_AT_address_class(0x20)
    9429              
    9430              $C$DW$T$204     .dwtag  DW_TAG_typedef
    9431                      .dwattr $C$DW$T$204, DW_AT_name("CTRL_Handle")
    9432                      .dwattr $C$DW$T$204, DW_AT_type(*$C$DW$T$203)
    9433                      .dwattr $C$DW$T$204, DW_AT_language(DW_LANG_C)
    9434              
    9435              $C$DW$1010      .dwtag  DW_TAG_TI_far_type
    9436                      .dwattr $C$DW$1010, DW_AT_type(*$C$DW$T$204)
    9437              
    9438              $C$DW$T$250     .dwtag  DW_TAG_const_type
    9439                      .dwattr $C$DW$T$250, DW_AT_type(*$C$DW$1010)
    9440              
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:44 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{FF9B9E7E-063A-41EE-8C61-EA327628573A} PAGE  184

    9441              
    9442              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    9443                      .dwattr $C$DW$T$80, DW_AT_name("_CTRL_Version_")
    9444                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x04)
    9445              $C$DW$1011      .dwtag  DW_TAG_member
    9446                      .dwattr $C$DW$1011, DW_AT_type(*$C$DW$T$26)
    9447                      .dwattr $C$DW$1011, DW_AT_name("rsvd")
    9448                      .dwattr $C$DW$1011, DW_AT_TI_symbol_name("_rsvd")
    9449                      .dwattr $C$DW$1011, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9450                      .dwattr $C$DW$1011, DW_AT_accessibility(DW_ACCESS_public)
    9451              
    9452              $C$DW$1012      .dwtag  DW_TAG_member
    9453                      .dwattr $C$DW$1012, DW_AT_type(*$C$DW$T$79)
    9454                      .dwattr $C$DW$1012, DW_AT_name("targetProc")
    9455                      .dwattr $C$DW$1012, DW_AT_TI_symbol_name("_targetProc")
    9456                      .dwattr $C$DW$1012, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9457                      .dwattr $C$DW$1012, DW_AT_accessibility(DW_ACCESS_public)
    9458              
    9459              $C$DW$1013      .dwtag  DW_TAG_member
    9460                      .dwattr $C$DW$1013, DW_AT_type(*$C$DW$T$26)
    9461                      .dwattr $C$DW$1013, DW_AT_name("major")
    9462                      .dwattr $C$DW$1013, DW_AT_TI_symbol_name("_major")
    9463                      .dwattr $C$DW$1013, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9464                      .dwattr $C$DW$1013, DW_AT_accessibility(DW_ACCESS_public)
    9465              
    9466              $C$DW$1014      .dwtag  DW_TAG_member
    9467                      .dwattr $C$DW$1014, DW_AT_type(*$C$DW$T$26)
    9468                      .dwattr $C$DW$1014, DW_AT_name("minor")
    9469                      .dwattr $C$DW$1014, DW_AT_TI_symbol_name("_minor")
    9470                      .dwattr $C$DW$1014, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9471                      .dwattr $C$DW$1014, DW_AT_accessibility(DW_ACCESS_public)
    9472              
    9473                      .dwendtag $C$DW$T$80
    9474              
    9475              $C$DW$T$42      .dwtag  DW_TAG_typedef
    9476                      .dwattr $C$DW$T$42, DW_AT_name("CTRL_Version")
    9477                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$80)
    9478                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    9479              
    9480              $C$DW$T$256     .dwtag  DW_TAG_pointer_type
    9481                      .dwattr $C$DW$T$256, DW_AT_type(*$C$DW$T$42)
    9482                      .dwattr $C$DW$T$256, DW_AT_address_class(0x20)
    9483              
    9484              
    9485              $C$DW$T$87      .dwtag  DW_TAG_structure_type
    9486                      .dwattr $C$DW$T$87, DW_AT_name("_DRV8301_Obj_")
    9487                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x08)
    9488              $C$DW$1015      .dwtag  DW_TAG_member
    9489                      .dwattr $C$DW$1015, DW_AT_type(*$C$DW$T$82)
    9490                      .dwattr $C$DW$1015, DW_AT_name("spiHandle")
    9491                      .dwattr $C$DW$1015, DW_AT_TI_symbol_name("_spiHandle")
    9492                      .dwattr $C$DW$1015, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9493                      .dwattr $C$DW$1015, DW_AT_accessibility(DW_ACCESS_public)
    9494              
    9495              $C$DW$1016      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:44 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{FF9B9E7E-063A-41EE-8C61-EA327628573A} PAGE  185

    9496                      .dwattr $C$DW$1016, DW_AT_type(*$C$DW$T$84)
    9497                      .dwattr $C$DW$1016, DW_AT_name("gpioHandle")
    9498                      .dwattr $C$DW$1016, DW_AT_TI_symbol_name("_gpioHandle")
    9499                      .dwattr $C$DW$1016, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9500                      .dwattr $C$DW$1016, DW_AT_accessibility(DW_ACCESS_public)
    9501              
    9502              $C$DW$1017      .dwtag  DW_TAG_member
    9503                      .dwattr $C$DW$1017, DW_AT_type(*$C$DW$T$86)
    9504                      .dwattr $C$DW$1017, DW_AT_name("gpioNumber")
    9505                      .dwattr $C$DW$1017, DW_AT_TI_symbol_name("_gpioNumber")
    9506                      .dwattr $C$DW$1017, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9507                      .dwattr $C$DW$1017, DW_AT_accessibility(DW_ACCESS_public)
    9508              
    9509              $C$DW$1018      .dwtag  DW_TAG_member
    9510                      .dwattr $C$DW$1018, DW_AT_type(*$C$DW$T$76)
    9511                      .dwattr $C$DW$1018, DW_AT_name("RxTimeOut")
    9512                      .dwattr $C$DW$1018, DW_AT_TI_symbol_name("_RxTimeOut")
    9513                      .dwattr $C$DW$1018, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9514                      .dwattr $C$DW$1018, DW_AT_accessibility(DW_ACCESS_public)
    9515              
    9516              $C$DW$1019      .dwtag  DW_TAG_member
    9517                      .dwattr $C$DW$1019, DW_AT_type(*$C$DW$T$76)
    9518                      .dwattr $C$DW$1019, DW_AT_name("enableTimeOut")
    9519                      .dwattr $C$DW$1019, DW_AT_TI_symbol_name("_enableTimeOut")
    9520                      .dwattr $C$DW$1019, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9521                      .dwattr $C$DW$1019, DW_AT_accessibility(DW_ACCESS_public)
    9522              
    9523                      .dwendtag $C$DW$T$87
    9524              
    9525              $C$DW$T$156     .dwtag  DW_TAG_typedef
    9526                      .dwattr $C$DW$T$156, DW_AT_name("DRV8301_Obj")
    9527                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$87)
    9528                      .dwattr $C$DW$T$156, DW_AT_language(DW_LANG_C)
    9529              
    9530              $C$DW$T$154     .dwtag  DW_TAG_pointer_type
    9531                      .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$87)
    9532                      .dwattr $C$DW$T$154, DW_AT_address_class(0x20)
    9533              
    9534              $C$DW$T$155     .dwtag  DW_TAG_typedef
    9535                      .dwattr $C$DW$T$155, DW_AT_name("DRV8301_Handle")
    9536                      .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$154)
    9537                      .dwattr $C$DW$T$155, DW_AT_language(DW_LANG_C)
    9538              
    9539              
    9540              $C$DW$T$98      .dwtag  DW_TAG_structure_type
    9541                      .dwattr $C$DW$T$98, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    9542                      .dwattr $C$DW$T$98, DW_AT_byte_size(0x05)
    9543              $C$DW$1020      .dwtag  DW_TAG_member
    9544                      .dwattr $C$DW$1020, DW_AT_type(*$C$DW$T$89)
    9545                      .dwattr $C$DW$1020, DW_AT_name("DRV8301_CURRENT")
    9546                      .dwattr $C$DW$1020, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    9547                      .dwattr $C$DW$1020, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9548                      .dwattr $C$DW$1020, DW_AT_accessibility(DW_ACCESS_public)
    9549              
    9550              $C$DW$1021      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:44 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{FF9B9E7E-063A-41EE-8C61-EA327628573A} PAGE  186

    9551                      .dwattr $C$DW$1021, DW_AT_type(*$C$DW$T$91)
    9552                      .dwattr $C$DW$1021, DW_AT_name("DRV8301_RESET")
    9553                      .dwattr $C$DW$1021, DW_AT_TI_symbol_name("_DRV8301_RESET")
    9554                      .dwattr $C$DW$1021, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9555                      .dwattr $C$DW$1021, DW_AT_accessibility(DW_ACCESS_public)
    9556              
    9557              $C$DW$1022      .dwtag  DW_TAG_member
    9558                      .dwattr $C$DW$1022, DW_AT_type(*$C$DW$T$93)
    9559                      .dwattr $C$DW$1022, DW_AT_name("PWM_MODE")
    9560                      .dwattr $C$DW$1022, DW_AT_TI_symbol_name("_PWM_MODE")
    9561                      .dwattr $C$DW$1022, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9562                      .dwattr $C$DW$1022, DW_AT_accessibility(DW_ACCESS_public)
    9563              
    9564              $C$DW$1023      .dwtag  DW_TAG_member
    9565                      .dwattr $C$DW$1023, DW_AT_type(*$C$DW$T$95)
    9566                      .dwattr $C$DW$1023, DW_AT_name("OC_MODE")
    9567                      .dwattr $C$DW$1023, DW_AT_TI_symbol_name("_OC_MODE")
    9568                      .dwattr $C$DW$1023, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9569                      .dwattr $C$DW$1023, DW_AT_accessibility(DW_ACCESS_public)
    9570              
    9571              $C$DW$1024      .dwtag  DW_TAG_member
    9572                      .dwattr $C$DW$1024, DW_AT_type(*$C$DW$T$97)
    9573                      .dwattr $C$DW$1024, DW_AT_name("OC_ADJ_SET")
    9574                      .dwattr $C$DW$1024, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    9575                      .dwattr $C$DW$1024, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9576                      .dwattr $C$DW$1024, DW_AT_accessibility(DW_ACCESS_public)
    9577              
    9578                      .dwendtag $C$DW$T$98
    9579              
    9580              $C$DW$T$112     .dwtag  DW_TAG_typedef
    9581                      .dwattr $C$DW$T$112, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    9582                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$98)
    9583                      .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    9584              
    9585              
    9586              $C$DW$T$107     .dwtag  DW_TAG_structure_type
    9587                      .dwattr $C$DW$T$107, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    9588                      .dwattr $C$DW$T$107, DW_AT_byte_size(0x04)
    9589              $C$DW$1025      .dwtag  DW_TAG_member
    9590                      .dwattr $C$DW$1025, DW_AT_type(*$C$DW$T$100)
    9591                      .dwattr $C$DW$1025, DW_AT_name("OCTW_SET")
    9592                      .dwattr $C$DW$1025, DW_AT_TI_symbol_name("_OCTW_SET")
    9593                      .dwattr $C$DW$1025, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9594                      .dwattr $C$DW$1025, DW_AT_accessibility(DW_ACCESS_public)
    9595              
    9596              $C$DW$1026      .dwtag  DW_TAG_member
    9597                      .dwattr $C$DW$1026, DW_AT_type(*$C$DW$T$102)
    9598                      .dwattr $C$DW$1026, DW_AT_name("GAIN")
    9599                      .dwattr $C$DW$1026, DW_AT_TI_symbol_name("_GAIN")
    9600                      .dwattr $C$DW$1026, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9601                      .dwattr $C$DW$1026, DW_AT_accessibility(DW_ACCESS_public)
    9602              
    9603              $C$DW$1027      .dwtag  DW_TAG_member
    9604                      .dwattr $C$DW$1027, DW_AT_type(*$C$DW$T$104)
    9605                      .dwattr $C$DW$1027, DW_AT_name("DC_CAL_CH1p2")
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:44 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{FF9B9E7E-063A-41EE-8C61-EA327628573A} PAGE  187

    9606                      .dwattr $C$DW$1027, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    9607                      .dwattr $C$DW$1027, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9608                      .dwattr $C$DW$1027, DW_AT_accessibility(DW_ACCESS_public)
    9609              
    9610              $C$DW$1028      .dwtag  DW_TAG_member
    9611                      .dwattr $C$DW$1028, DW_AT_type(*$C$DW$T$106)
    9612                      .dwattr $C$DW$1028, DW_AT_name("OC_TOFF")
    9613                      .dwattr $C$DW$1028, DW_AT_TI_symbol_name("_OC_TOFF")
    9614                      .dwattr $C$DW$1028, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9615                      .dwattr $C$DW$1028, DW_AT_accessibility(DW_ACCESS_public)
    9616              
    9617                      .dwendtag $C$DW$T$107
    9618              
    9619              $C$DW$T$113     .dwtag  DW_TAG_typedef
    9620                      .dwattr $C$DW$T$113, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    9621                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$107)
    9622                      .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    9623              
    9624              
    9625              $C$DW$T$108     .dwtag  DW_TAG_structure_type
    9626                      .dwattr $C$DW$T$108, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    9627                      .dwattr $C$DW$T$108, DW_AT_byte_size(0x0b)
    9628              $C$DW$1029      .dwtag  DW_TAG_member
    9629                      .dwattr $C$DW$1029, DW_AT_type(*$C$DW$T$76)
    9630                      .dwattr $C$DW$1029, DW_AT_name("FAULT")
    9631                      .dwattr $C$DW$1029, DW_AT_TI_symbol_name("_FAULT")
    9632                      .dwattr $C$DW$1029, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9633                      .dwattr $C$DW$1029, DW_AT_accessibility(DW_ACCESS_public)
    9634              
    9635              $C$DW$1030      .dwtag  DW_TAG_member
    9636                      .dwattr $C$DW$1030, DW_AT_type(*$C$DW$T$76)
    9637                      .dwattr $C$DW$1030, DW_AT_name("GVDD_UV")
    9638                      .dwattr $C$DW$1030, DW_AT_TI_symbol_name("_GVDD_UV")
    9639                      .dwattr $C$DW$1030, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9640                      .dwattr $C$DW$1030, DW_AT_accessibility(DW_ACCESS_public)
    9641              
    9642              $C$DW$1031      .dwtag  DW_TAG_member
    9643                      .dwattr $C$DW$1031, DW_AT_type(*$C$DW$T$76)
    9644                      .dwattr $C$DW$1031, DW_AT_name("PVDD_UV")
    9645                      .dwattr $C$DW$1031, DW_AT_TI_symbol_name("_PVDD_UV")
    9646                      .dwattr $C$DW$1031, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9647                      .dwattr $C$DW$1031, DW_AT_accessibility(DW_ACCESS_public)
    9648              
    9649              $C$DW$1032      .dwtag  DW_TAG_member
    9650                      .dwattr $C$DW$1032, DW_AT_type(*$C$DW$T$76)
    9651                      .dwattr $C$DW$1032, DW_AT_name("OTSD")
    9652                      .dwattr $C$DW$1032, DW_AT_TI_symbol_name("_OTSD")
    9653                      .dwattr $C$DW$1032, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9654                      .dwattr $C$DW$1032, DW_AT_accessibility(DW_ACCESS_public)
    9655              
    9656              $C$DW$1033      .dwtag  DW_TAG_member
    9657                      .dwattr $C$DW$1033, DW_AT_type(*$C$DW$T$76)
    9658                      .dwattr $C$DW$1033, DW_AT_name("OTW")
    9659                      .dwattr $C$DW$1033, DW_AT_TI_symbol_name("_OTW")
    9660                      .dwattr $C$DW$1033, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:44 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{FF9B9E7E-063A-41EE-8C61-EA327628573A} PAGE  188

    9661                      .dwattr $C$DW$1033, DW_AT_accessibility(DW_ACCESS_public)
    9662              
    9663              $C$DW$1034      .dwtag  DW_TAG_member
    9664                      .dwattr $C$DW$1034, DW_AT_type(*$C$DW$T$76)
    9665                      .dwattr $C$DW$1034, DW_AT_name("FETHA_OC")
    9666                      .dwattr $C$DW$1034, DW_AT_TI_symbol_name("_FETHA_OC")
    9667                      .dwattr $C$DW$1034, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9668                      .dwattr $C$DW$1034, DW_AT_accessibility(DW_ACCESS_public)
    9669              
    9670              $C$DW$1035      .dwtag  DW_TAG_member
    9671                      .dwattr $C$DW$1035, DW_AT_type(*$C$DW$T$76)
    9672                      .dwattr $C$DW$1035, DW_AT_name("FETLA_OC")
    9673                      .dwattr $C$DW$1035, DW_AT_TI_symbol_name("_FETLA_OC")
    9674                      .dwattr $C$DW$1035, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9675                      .dwattr $C$DW$1035, DW_AT_accessibility(DW_ACCESS_public)
    9676              
    9677              $C$DW$1036      .dwtag  DW_TAG_member
    9678                      .dwattr $C$DW$1036, DW_AT_type(*$C$DW$T$76)
    9679                      .dwattr $C$DW$1036, DW_AT_name("FETHB_OC")
    9680                      .dwattr $C$DW$1036, DW_AT_TI_symbol_name("_FETHB_OC")
    9681                      .dwattr $C$DW$1036, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    9682                      .dwattr $C$DW$1036, DW_AT_accessibility(DW_ACCESS_public)
    9683              
    9684              $C$DW$1037      .dwtag  DW_TAG_member
    9685                      .dwattr $C$DW$1037, DW_AT_type(*$C$DW$T$76)
    9686                      .dwattr $C$DW$1037, DW_AT_name("FETLB_OC")
    9687                      .dwattr $C$DW$1037, DW_AT_TI_symbol_name("_FETLB_OC")
    9688                      .dwattr $C$DW$1037, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9689                      .dwattr $C$DW$1037, DW_AT_accessibility(DW_ACCESS_public)
    9690              
    9691              $C$DW$1038      .dwtag  DW_TAG_member
