TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:39 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6B48A69E-CD12-47CE-9AB2-8A4B9A5994C6} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                             PC v18.12.4.LTS *
       3              ;* Date/Time created: Fri Feb 17 15:09:38 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/GIANT/GAINT_TI_instaspin/motorware/motorware_1_01_00_18/sw/solutions
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v18.12.4.LTS Copyright (c) 1996-
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\GIANT\GAINT_TI_instaspin\motorware\motorware_1_01_00_18\sw\solut
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    8802              $C$DW$903       .dwtag  DW_TAG_enumerator
    8803                      .dwattr $C$DW$903, DW_AT_name("PIE_GroupNumber_7")
    8804                      .dwattr $C$DW$903, DW_AT_const_value(0x06)
    8805              
    8806              $C$DW$904       .dwtag  DW_TAG_enumerator
    8807                      .dwattr $C$DW$904, DW_AT_name("PIE_GroupNumber_8")
    8808                      .dwattr $C$DW$904, DW_AT_const_value(0x07)
    8809              
    8810              $C$DW$905       .dwtag  DW_TAG_enumerator
    8811                      .dwattr $C$DW$905, DW_AT_name("PIE_GroupNumber_9")
    8812                      .dwattr $C$DW$905, DW_AT_const_value(0x08)
    8813              
    8814              $C$DW$906       .dwtag  DW_TAG_enumerator
    8815                      .dwattr $C$DW$906, DW_AT_name("PIE_GroupNumber_10")
    8816                      .dwattr $C$DW$906, DW_AT_const_value(0x09)
    8817              
    8818              $C$DW$907       .dwtag  DW_TAG_enumerator
    8819                      .dwattr $C$DW$907, DW_AT_name("PIE_GroupNumber_11")
    8820                      .dwattr $C$DW$907, DW_AT_const_value(0x0a)
    8821              
    8822              $C$DW$908       .dwtag  DW_TAG_enumerator
    8823                      .dwattr $C$DW$908, DW_AT_name("PIE_GroupNumber_12")
    8824                      .dwattr $C$DW$908, DW_AT_const_value(0x0b)
    8825              
    8826                      .dwendtag $C$DW$T$224
    8827              
    8828              $C$DW$T$225     .dwtag  DW_TAG_typedef
    8829                      .dwattr $C$DW$T$225, DW_AT_name("PIE_GroupNumber_e")
    8830                      .dwattr $C$DW$T$225, DW_AT_type(*$C$DW$T$224)
    8831                      .dwattr $C$DW$T$225, DW_AT_language(DW_LANG_C)
    8832              
    8833              
    8834              $C$DW$T$227     .dwtag  DW_TAG_enumeration_type
    8835                      .dwattr $C$DW$T$227, DW_AT_byte_size(0x01)
    8836              $C$DW$909       .dwtag  DW_TAG_enumerator
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:39 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6B48A69E-CD12-47CE-9AB2-8A4B9A5994C6} PAGE  174

    8837                      .dwattr $C$DW$909, DW_AT_name("CTRL_Type_PID_spd")
    8838                      .dwattr $C$DW$909, DW_AT_const_value(0x00)
    8839              
    8840              $C$DW$910       .dwtag  DW_TAG_enumerator
    8841                      .dwattr $C$DW$910, DW_AT_name("CTRL_Type_PID_Id")
    8842                      .dwattr $C$DW$910, DW_AT_const_value(0x01)
    8843              
    8844              $C$DW$911       .dwtag  DW_TAG_enumerator
    8845                      .dwattr $C$DW$911, DW_AT_name("CTRL_Type_PID_Iq")
    8846                      .dwattr $C$DW$911, DW_AT_const_value(0x02)
    8847              
    8848                      .dwendtag $C$DW$T$227
    8849              
    8850              $C$DW$T$228     .dwtag  DW_TAG_typedef
    8851                      .dwattr $C$DW$T$228, DW_AT_name("CTRL_Type_e")
    8852                      .dwattr $C$DW$T$228, DW_AT_type(*$C$DW$T$227)
    8853                      .dwattr $C$DW$T$228, DW_AT_language(DW_LANG_C)
    8854              
    8855              
    8856              $C$DW$T$230     .dwtag  DW_TAG_enumeration_type
    8857                      .dwattr $C$DW$T$230, DW_AT_byte_size(0x01)
    8858              $C$DW$912       .dwtag  DW_TAG_enumerator
    8859                      .dwattr $C$DW$912, DW_AT_name("HAL_SensorType_Current")
    8860                      .dwattr $C$DW$912, DW_AT_const_value(0x00)
    8861              
    8862              $C$DW$913       .dwtag  DW_TAG_enumerator
    8863                      .dwattr $C$DW$913, DW_AT_name("HAL_SensorType_Voltage")
    8864                      .dwattr $C$DW$913, DW_AT_const_value(0x01)
    8865              
    8866                      .dwendtag $C$DW$T$230
    8867              
    8868              $C$DW$T$231     .dwtag  DW_TAG_typedef
    8869                      .dwattr $C$DW$T$231, DW_AT_name("HAL_SensorType_e")
    8870                      .dwattr $C$DW$T$231, DW_AT_type(*$C$DW$T$230)
    8871                      .dwattr $C$DW$T$231, DW_AT_language(DW_LANG_C)
    8872              
    8873              
    8874              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    8875                      .dwattr $C$DW$T$19, DW_AT_name("IPD_HFI_Obj")
    8876                      .dwattr $C$DW$T$19, DW_AT_declaration
    8877                      .dwendtag $C$DW$T$19
    8878              
    8879              $C$DW$T$233     .dwtag  DW_TAG_pointer_type
    8880                      .dwattr $C$DW$T$233, DW_AT_type(*$C$DW$T$19)
    8881                      .dwattr $C$DW$T$233, DW_AT_address_class(0x20)
    8882              
    8883              $C$DW$T$234     .dwtag  DW_TAG_typedef
    8884                      .dwattr $C$DW$T$234, DW_AT_name("IPD_HFI_Handle")
    8885                      .dwattr $C$DW$T$234, DW_AT_type(*$C$DW$T$233)
    8886                      .dwattr $C$DW$T$234, DW_AT_language(DW_LANG_C)
    8887              
    8888              
    8889              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    8890                      .dwattr $C$DW$T$34, DW_AT_name("_ADC_Obj_")
    8891                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x6650)
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:39 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6B48A69E-CD12-47CE-9AB2-8A4B9A5994C6} PAGE  175

    8892              $C$DW$914       .dwtag  DW_TAG_member
    8893                      .dwattr $C$DW$914, DW_AT_type(*$C$DW$T$28)
    8894                      .dwattr $C$DW$914, DW_AT_name("ADCRESULT")
    8895                      .dwattr $C$DW$914, DW_AT_TI_symbol_name("_ADCRESULT")
    8896                      .dwattr $C$DW$914, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8897                      .dwattr $C$DW$914, DW_AT_accessibility(DW_ACCESS_public)
    8898              
    8899              $C$DW$915       .dwtag  DW_TAG_member
    8900                      .dwattr $C$DW$915, DW_AT_type(*$C$DW$T$29)
    8901                      .dwattr $C$DW$915, DW_AT_name("resvd_1")
    8902                      .dwattr $C$DW$915, DW_AT_TI_symbol_name("_resvd_1")
    8903                      .dwattr $C$DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8904                      .dwattr $C$DW$915, DW_AT_accessibility(DW_ACCESS_public)
    8905              
    8906              $C$DW$916       .dwtag  DW_TAG_member
    8907                      .dwattr $C$DW$916, DW_AT_type(*$C$DW$T$27)
    8908                      .dwattr $C$DW$916, DW_AT_name("ADCCTL1")
    8909                      .dwattr $C$DW$916, DW_AT_TI_symbol_name("_ADCCTL1")
    8910                      .dwattr $C$DW$916, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    8911                      .dwattr $C$DW$916, DW_AT_accessibility(DW_ACCESS_public)
    8912              
    8913              $C$DW$917       .dwtag  DW_TAG_member
    8914                      .dwattr $C$DW$917, DW_AT_type(*$C$DW$T$27)
    8915                      .dwattr $C$DW$917, DW_AT_name("ADCCTL2")
    8916                      .dwattr $C$DW$917, DW_AT_TI_symbol_name("_ADCCTL2")
    8917                      .dwattr $C$DW$917, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    8918                      .dwattr $C$DW$917, DW_AT_accessibility(DW_ACCESS_public)
    8919              
    8920              $C$DW$918       .dwtag  DW_TAG_member
    8921                      .dwattr $C$DW$918, DW_AT_type(*$C$DW$T$30)
    8922                      .dwattr $C$DW$918, DW_AT_name("rsvd_2")
    8923                      .dwattr $C$DW$918, DW_AT_TI_symbol_name("_rsvd_2")
    8924                      .dwattr $C$DW$918, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    8925                      .dwattr $C$DW$918, DW_AT_accessibility(DW_ACCESS_public)
    8926              
    8927              $C$DW$919       .dwtag  DW_TAG_member
    8928                      .dwattr $C$DW$919, DW_AT_type(*$C$DW$T$27)
    8929                      .dwattr $C$DW$919, DW_AT_name("ADCINTFLG")
    8930                      .dwattr $C$DW$919, DW_AT_TI_symbol_name("_ADCINTFLG")
    8931                      .dwattr $C$DW$919, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    8932                      .dwattr $C$DW$919, DW_AT_accessibility(DW_ACCESS_public)
    8933              
    8934              $C$DW$920       .dwtag  DW_TAG_member
    8935                      .dwattr $C$DW$920, DW_AT_type(*$C$DW$T$27)
    8936                      .dwattr $C$DW$920, DW_AT_name("ADCINTFLGCLR")
    8937                      .dwattr $C$DW$920, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    8938                      .dwattr $C$DW$920, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    8939                      .dwattr $C$DW$920, DW_AT_accessibility(DW_ACCESS_public)
    8940              
    8941              $C$DW$921       .dwtag  DW_TAG_member
    8942                      .dwattr $C$DW$921, DW_AT_type(*$C$DW$T$27)
    8943                      .dwattr $C$DW$921, DW_AT_name("ADCINTOVF")
    8944                      .dwattr $C$DW$921, DW_AT_TI_symbol_name("_ADCINTOVF")
    8945                      .dwattr $C$DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    8946                      .dwattr $C$DW$921, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:39 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6B48A69E-CD12-47CE-9AB2-8A4B9A5994C6} PAGE  176

    8947              
    8948              $C$DW$922       .dwtag  DW_TAG_member
    8949                      .dwattr $C$DW$922, DW_AT_type(*$C$DW$T$27)
    8950                      .dwattr $C$DW$922, DW_AT_name("ADCINTOVFCLR")
    8951                      .dwattr $C$DW$922, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    8952                      .dwattr $C$DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    8953                      .dwattr $C$DW$922, DW_AT_accessibility(DW_ACCESS_public)
    8954              
    8955              $C$DW$923       .dwtag  DW_TAG_member
    8956                      .dwattr $C$DW$923, DW_AT_type(*$C$DW$T$31)
    8957                      .dwattr $C$DW$923, DW_AT_name("INTSELxNy")
    8958                      .dwattr $C$DW$923, DW_AT_TI_symbol_name("_INTSELxNy")
    8959                      .dwattr $C$DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    8960                      .dwattr $C$DW$923, DW_AT_accessibility(DW_ACCESS_public)
    8961              
    8962              $C$DW$924       .dwtag  DW_TAG_member
    8963                      .dwattr $C$DW$924, DW_AT_type(*$C$DW$T$32)
    8964                      .dwattr $C$DW$924, DW_AT_name("rsvd_3")
    8965                      .dwattr $C$DW$924, DW_AT_TI_symbol_name("_rsvd_3")
    8966                      .dwattr $C$DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    8967                      .dwattr $C$DW$924, DW_AT_accessibility(DW_ACCESS_public)
    8968              
    8969              $C$DW$925       .dwtag  DW_TAG_member
    8970                      .dwattr $C$DW$925, DW_AT_type(*$C$DW$T$27)
    8971                      .dwattr $C$DW$925, DW_AT_name("SOCPRICTRL")
    8972                      .dwattr $C$DW$925, DW_AT_TI_symbol_name("_SOCPRICTRL")
    8973                      .dwattr $C$DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    8974                      .dwattr $C$DW$925, DW_AT_accessibility(DW_ACCESS_public)
    8975              
    8976              $C$DW$926       .dwtag  DW_TAG_member
    8977                      .dwattr $C$DW$926, DW_AT_type(*$C$DW$T$27)
    8978                      .dwattr $C$DW$926, DW_AT_name("rsvd_4")
    8979                      .dwattr $C$DW$926, DW_AT_TI_symbol_name("_rsvd_4")
    8980                      .dwattr $C$DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    8981                      .dwattr $C$DW$926, DW_AT_accessibility(DW_ACCESS_public)
    8982              
    8983              $C$DW$927       .dwtag  DW_TAG_member
    8984                      .dwattr $C$DW$927, DW_AT_type(*$C$DW$T$27)
    8985                      .dwattr $C$DW$927, DW_AT_name("ADCSAMPLEMODE")
    8986                      .dwattr $C$DW$927, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    8987                      .dwattr $C$DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    8988                      .dwattr $C$DW$927, DW_AT_accessibility(DW_ACCESS_public)
    8989              
    8990              $C$DW$928       .dwtag  DW_TAG_member
    8991                      .dwattr $C$DW$928, DW_AT_type(*$C$DW$T$27)
    8992                      .dwattr $C$DW$928, DW_AT_name("rsvd_5")
    8993                      .dwattr $C$DW$928, DW_AT_TI_symbol_name("_rsvd_5")
    8994                      .dwattr $C$DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    8995                      .dwattr $C$DW$928, DW_AT_accessibility(DW_ACCESS_public)
    8996              
    8997              $C$DW$929       .dwtag  DW_TAG_member
    8998                      .dwattr $C$DW$929, DW_AT_type(*$C$DW$T$27)
    8999                      .dwattr $C$DW$929, DW_AT_name("ADCINTSOCSEL1")
    9000                      .dwattr $C$DW$929, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    9001                      .dwattr $C$DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:39 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6B48A69E-CD12-47CE-9AB2-8A4B9A5994C6} PAGE  177

    9002                      .dwattr $C$DW$929, DW_AT_accessibility(DW_ACCESS_public)
    9003              
    9004              $C$DW$930       .dwtag  DW_TAG_member
    9005                      .dwattr $C$DW$930, DW_AT_type(*$C$DW$T$27)
    9006                      .dwattr $C$DW$930, DW_AT_name("ADCINTSOCSEL2")
    9007                      .dwattr $C$DW$930, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    9008                      .dwattr $C$DW$930, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    9009                      .dwattr $C$DW$930, DW_AT_accessibility(DW_ACCESS_public)
    9010              
    9011              $C$DW$931       .dwtag  DW_TAG_member
    9012                      .dwattr $C$DW$931, DW_AT_type(*$C$DW$T$30)
    9013                      .dwattr $C$DW$931, DW_AT_name("rsvd_6")
    9014                      .dwattr $C$DW$931, DW_AT_TI_symbol_name("_rsvd_6")
    9015                      .dwattr $C$DW$931, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    9016                      .dwattr $C$DW$931, DW_AT_accessibility(DW_ACCESS_public)
    9017              
    9018              $C$DW$932       .dwtag  DW_TAG_member
    9019                      .dwattr $C$DW$932, DW_AT_type(*$C$DW$T$27)
    9020                      .dwattr $C$DW$932, DW_AT_name("ADCSOCFLG1")
    9021                      .dwattr $C$DW$932, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    9022                      .dwattr $C$DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    9023                      .dwattr $C$DW$932, DW_AT_accessibility(DW_ACCESS_public)
    9024              
    9025              $C$DW$933       .dwtag  DW_TAG_member
    9026                      .dwattr $C$DW$933, DW_AT_type(*$C$DW$T$27)
    9027                      .dwattr $C$DW$933, DW_AT_name("rsvd_7")
    9028                      .dwattr $C$DW$933, DW_AT_TI_symbol_name("_rsvd_7")
    9029                      .dwattr $C$DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    9030                      .dwattr $C$DW$933, DW_AT_accessibility(DW_ACCESS_public)
    9031              
    9032              $C$DW$934       .dwtag  DW_TAG_member
    9033                      .dwattr $C$DW$934, DW_AT_type(*$C$DW$T$27)
    9034                      .dwattr $C$DW$934, DW_AT_name("ADCSOCFRC1")
    9035                      .dwattr $C$DW$934, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    9036                      .dwattr $C$DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    9037                      .dwattr $C$DW$934, DW_AT_accessibility(DW_ACCESS_public)
    9038              
    9039              $C$DW$935       .dwtag  DW_TAG_member
    9040                      .dwattr $C$DW$935, DW_AT_type(*$C$DW$T$27)
    9041                      .dwattr $C$DW$935, DW_AT_name("rsvd_8")
    9042                      .dwattr $C$DW$935, DW_AT_TI_symbol_name("_rsvd_8")
    9043                      .dwattr $C$DW$935, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    9044                      .dwattr $C$DW$935, DW_AT_accessibility(DW_ACCESS_public)
    9045              
    9046              $C$DW$936       .dwtag  DW_TAG_member
    9047                      .dwattr $C$DW$936, DW_AT_type(*$C$DW$T$27)
    9048                      .dwattr $C$DW$936, DW_AT_name("ADCSOCOVF1")
    9049                      .dwattr $C$DW$936, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    9050                      .dwattr $C$DW$936, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    9051                      .dwattr $C$DW$936, DW_AT_accessibility(DW_ACCESS_public)
    9052              
    9053              $C$DW$937       .dwtag  DW_TAG_member
    9054                      .dwattr $C$DW$937, DW_AT_type(*$C$DW$T$27)
    9055                      .dwattr $C$DW$937, DW_AT_name("rsvd_9")
    9056                      .dwattr $C$DW$937, DW_AT_TI_symbol_name("_rsvd_9")
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:39 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6B48A69E-CD12-47CE-9AB2-8A4B9A5994C6} PAGE  178

    9057                      .dwattr $C$DW$937, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    9058                      .dwattr $C$DW$937, DW_AT_accessibility(DW_ACCESS_public)
    9059              
    9060              $C$DW$938       .dwtag  DW_TAG_member
    9061                      .dwattr $C$DW$938, DW_AT_type(*$C$DW$T$27)
    9062                      .dwattr $C$DW$938, DW_AT_name("ADCSOCOVFCLR1")
    9063                      .dwattr $C$DW$938, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    9064                      .dwattr $C$DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    9065                      .dwattr $C$DW$938, DW_AT_accessibility(DW_ACCESS_public)
    9066              
    9067              $C$DW$939       .dwtag  DW_TAG_member
    9068                      .dwattr $C$DW$939, DW_AT_type(*$C$DW$T$27)
    9069                      .dwattr $C$DW$939, DW_AT_name("rsvd_10")
    9070                      .dwattr $C$DW$939, DW_AT_TI_symbol_name("_rsvd_10")
    9071                      .dwattr $C$DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    9072                      .dwattr $C$DW$939, DW_AT_accessibility(DW_ACCESS_public)
    9073              
    9074              $C$DW$940       .dwtag  DW_TAG_member
    9075                      .dwattr $C$DW$940, DW_AT_type(*$C$DW$T$28)
    9076                      .dwattr $C$DW$940, DW_AT_name("ADCSOCxCTL")
    9077                      .dwattr $C$DW$940, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    9078                      .dwattr $C$DW$940, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    9079                      .dwattr $C$DW$940, DW_AT_accessibility(DW_ACCESS_public)
    9080              
    9081              $C$DW$941       .dwtag  DW_TAG_member
    9082                      .dwattr $C$DW$941, DW_AT_type(*$C$DW$T$28)
    9083                      .dwattr $C$DW$941, DW_AT_name("rsvd_11")
    9084                      .dwattr $C$DW$941, DW_AT_TI_symbol_name("_rsvd_11")
    9085                      .dwattr $C$DW$941, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    9086                      .dwattr $C$DW$941, DW_AT_accessibility(DW_ACCESS_public)
    9087              
    9088              $C$DW$942       .dwtag  DW_TAG_member
    9089                      .dwattr $C$DW$942, DW_AT_type(*$C$DW$T$27)
    9090                      .dwattr $C$DW$942, DW_AT_name("ADCREFTRIM")
    9091                      .dwattr $C$DW$942, DW_AT_TI_symbol_name("_ADCREFTRIM")
    9092                      .dwattr $C$DW$942, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    9093                      .dwattr $C$DW$942, DW_AT_accessibility(DW_ACCESS_public)
    9094              
    9095              $C$DW$943       .dwtag  DW_TAG_member
    9096                      .dwattr $C$DW$943, DW_AT_type(*$C$DW$T$27)
    9097                      .dwattr $C$DW$943, DW_AT_name("ADCOFFTRIM")
    9098                      .dwattr $C$DW$943, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    9099                      .dwattr $C$DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    9100                      .dwattr $C$DW$943, DW_AT_accessibility(DW_ACCESS_public)
    9101              
    9102              $C$DW$944       .dwtag  DW_TAG_member
    9103                      .dwattr $C$DW$944, DW_AT_type(*$C$DW$T$33)
    9104                      .dwattr $C$DW$944, DW_AT_name("resvd_12")
    9105                      .dwattr $C$DW$944, DW_AT_TI_symbol_name("_resvd_12")
    9106                      .dwattr $C$DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    9107                      .dwattr $C$DW$944, DW_AT_accessibility(DW_ACCESS_public)
    9108              
    9109              $C$DW$945       .dwtag  DW_TAG_member
    9110                      .dwattr $C$DW$945, DW_AT_type(*$C$DW$T$27)
    9111                      .dwattr $C$DW$945, DW_AT_name("ADCREV")
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:39 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6B48A69E-CD12-47CE-9AB2-8A4B9A5994C6} PAGE  179

    9112                      .dwattr $C$DW$945, DW_AT_TI_symbol_name("_ADCREV")
    9113                      .dwattr $C$DW$945, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    9114                      .dwattr $C$DW$945, DW_AT_accessibility(DW_ACCESS_public)
    9115              
    9116                      .dwendtag $C$DW$T$34
    9117              
    9118              $C$DW$T$238     .dwtag  DW_TAG_typedef
    9119                      .dwattr $C$DW$T$238, DW_AT_name("ADC_Obj")
    9120                      .dwattr $C$DW$T$238, DW_AT_type(*$C$DW$T$34)
    9121                      .dwattr $C$DW$T$238, DW_AT_language(DW_LANG_C)
    9122              
    9123              $C$DW$T$124     .dwtag  DW_TAG_pointer_type
    9124                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$34)
    9125                      .dwattr $C$DW$T$124, DW_AT_address_class(0x20)
    9126              
    9127              $C$DW$T$125     .dwtag  DW_TAG_typedef
    9128                      .dwattr $C$DW$T$125, DW_AT_name("ADC_Handle")
    9129                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
    9130                      .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    9131              
    9132              
    9133              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    9134                      .dwattr $C$DW$T$20, DW_AT_name("_AFSEL_Obj_")
    9135                      .dwattr $C$DW$T$20, DW_AT_declaration
    9136                      .dwendtag $C$DW$T$20
    9137              
    9138              $C$DW$T$239     .dwtag  DW_TAG_pointer_type
    9139                      .dwattr $C$DW$T$239, DW_AT_type(*$C$DW$T$20)
    9140                      .dwattr $C$DW$T$239, DW_AT_address_class(0x20)
    9141              
    9142              $C$DW$T$240     .dwtag  DW_TAG_typedef
    9143                      .dwattr $C$DW$T$240, DW_AT_name("AFSEL_Handle")
    9144                      .dwattr $C$DW$T$240, DW_AT_type(*$C$DW$T$239)
    9145                      .dwattr $C$DW$T$240, DW_AT_language(DW_LANG_C)
    9146              
    9147              
    9148              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    9149                      .dwattr $C$DW$T$38, DW_AT_name("_CLARKE_Obj_")
    9150                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x06)
    9151              $C$DW$946       .dwtag  DW_TAG_member
    9152                      .dwattr $C$DW$946, DW_AT_type(*$C$DW$T$35)
    9153                      .dwattr $C$DW$946, DW_AT_name("alpha_sf")
    9154                      .dwattr $C$DW$946, DW_AT_TI_symbol_name("_alpha_sf")
    9155                      .dwattr $C$DW$946, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9156                      .dwattr $C$DW$946, DW_AT_accessibility(DW_ACCESS_public)
    9157              
    9158              $C$DW$947       .dwtag  DW_TAG_member
    9159                      .dwattr $C$DW$947, DW_AT_type(*$C$DW$T$35)
    9160                      .dwattr $C$DW$947, DW_AT_name("beta_sf")
    9161                      .dwattr $C$DW$947, DW_AT_TI_symbol_name("_beta_sf")
    9162                      .dwattr $C$DW$947, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9163                      .dwattr $C$DW$947, DW_AT_accessibility(DW_ACCESS_public)
    9164              
    9165              $C$DW$948       .dwtag  DW_TAG_member
    9166                      .dwattr $C$DW$948, DW_AT_type(*$C$DW$T$37)
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:39 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6B48A69E-CD12-47CE-9AB2-8A4B9A5994C6} PAGE  180

    9167                      .dwattr $C$DW$948, DW_AT_name("numSensors")
    9168                      .dwattr $C$DW$948, DW_AT_TI_symbol_name("_numSensors")
    9169                      .dwattr $C$DW$948, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9170                      .dwattr $C$DW$948, DW_AT_accessibility(DW_ACCESS_public)
    9171              
    9172                      .dwendtag $C$DW$T$38
    9173              
    9174              $C$DW$T$49      .dwtag  DW_TAG_typedef
    9175                      .dwattr $C$DW$T$49, DW_AT_name("CLARKE_Obj")
    9176                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$38)
    9177                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    9178              
    9179              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    9180                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$38)
    9181                      .dwattr $C$DW$T$47, DW_AT_address_class(0x20)
    9182              
    9183              $C$DW$T$48      .dwtag  DW_TAG_typedef
    9184                      .dwattr $C$DW$T$48, DW_AT_name("CLARKE_Handle")
    9185                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    9186                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    9187              
    9188              $C$DW$949       .dwtag  DW_TAG_TI_far_type
    9189                      .dwattr $C$DW$949, DW_AT_type(*$C$DW$T$48)
    9190              
    9191              $C$DW$T$244     .dwtag  DW_TAG_const_type
    9192                      .dwattr $C$DW$T$244, DW_AT_type(*$C$DW$949)
    9193              
    9194              
    9195              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    9196                      .dwattr $C$DW$T$40, DW_AT_name("_CLK_Obj_")
    9197                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x11)
    9198              $C$DW$950       .dwtag  DW_TAG_member
    9199                      .dwattr $C$DW$950, DW_AT_type(*$C$DW$T$27)
    9200                      .dwattr $C$DW$950, DW_AT_name("XCLK")
    9201                      .dwattr $C$DW$950, DW_AT_TI_symbol_name("_XCLK")
    9202                      .dwattr $C$DW$950, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9203                      .dwattr $C$DW$950, DW_AT_accessibility(DW_ACCESS_public)
    9204              
    9205              $C$DW$951       .dwtag  DW_TAG_member
    9206                      .dwattr $C$DW$951, DW_AT_type(*$C$DW$T$27)
    9207                      .dwattr $C$DW$951, DW_AT_name("rsvd_1")
    9208                      .dwattr $C$DW$951, DW_AT_TI_symbol_name("_rsvd_1")
    9209                      .dwattr $C$DW$951, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9210                      .dwattr $C$DW$951, DW_AT_accessibility(DW_ACCESS_public)
    9211              
    9212              $C$DW$952       .dwtag  DW_TAG_member
    9213                      .dwattr $C$DW$952, DW_AT_type(*$C$DW$T$27)
    9214                      .dwattr $C$DW$952, DW_AT_name("CLKCTL")
    9215                      .dwattr $C$DW$952, DW_AT_TI_symbol_name("_CLKCTL")
    9216                      .dwattr $C$DW$952, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9217                      .dwattr $C$DW$952, DW_AT_accessibility(DW_ACCESS_public)
    9218              
    9219              $C$DW$953       .dwtag  DW_TAG_member
    9220                      .dwattr $C$DW$953, DW_AT_type(*$C$DW$T$39)
    9221                      .dwattr $C$DW$953, DW_AT_name("rsvd_2")
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:39 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6B48A69E-CD12-47CE-9AB2-8A4B9A5994C6} PAGE  181

    9222                      .dwattr $C$DW$953, DW_AT_TI_symbol_name("_rsvd_2")
    9223                      .dwattr $C$DW$953, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9224                      .dwattr $C$DW$953, DW_AT_accessibility(DW_ACCESS_public)
    9225              
    9226              $C$DW$954       .dwtag  DW_TAG_member
    9227                      .dwattr $C$DW$954, DW_AT_type(*$C$DW$T$27)
    9228                      .dwattr $C$DW$954, DW_AT_name("LOSPCP")
    9229                      .dwattr $C$DW$954, DW_AT_TI_symbol_name("_LOSPCP")
    9230                      .dwattr $C$DW$954, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    9231                      .dwattr $C$DW$954, DW_AT_accessibility(DW_ACCESS_public)
    9232              
    9233              $C$DW$955       .dwtag  DW_TAG_member
    9234                      .dwattr $C$DW$955, DW_AT_type(*$C$DW$T$27)
    9235                      .dwattr $C$DW$955, DW_AT_name("PCLKCR0")
    9236                      .dwattr $C$DW$955, DW_AT_TI_symbol_name("_PCLKCR0")
    9237                      .dwattr $C$DW$955, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9238                      .dwattr $C$DW$955, DW_AT_accessibility(DW_ACCESS_public)
    9239              
    9240              $C$DW$956       .dwtag  DW_TAG_member
    9241                      .dwattr $C$DW$956, DW_AT_type(*$C$DW$T$27)
    9242                      .dwattr $C$DW$956, DW_AT_name("PCLKCR1")
    9243                      .dwattr $C$DW$956, DW_AT_TI_symbol_name("_PCLKCR1")
    9244                      .dwattr $C$DW$956, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    9245                      .dwattr $C$DW$956, DW_AT_accessibility(DW_ACCESS_public)
    9246              
    9247              $C$DW$957       .dwtag  DW_TAG_member
    9248                      .dwattr $C$DW$957, DW_AT_type(*$C$DW$T$30)
    9249                      .dwattr $C$DW$957, DW_AT_name("rsvd_3")
    9250                      .dwattr $C$DW$957, DW_AT_TI_symbol_name("_rsvd_3")
    9251                      .dwattr $C$DW$957, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9252                      .dwattr $C$DW$957, DW_AT_accessibility(DW_ACCESS_public)
    9253              
    9254              $C$DW$958       .dwtag  DW_TAG_member
    9255                      .dwattr $C$DW$958, DW_AT_type(*$C$DW$T$27)
    9256                      .dwattr $C$DW$958, DW_AT_name("PCLKCR3")
    9257                      .dwattr $C$DW$958, DW_AT_TI_symbol_name("_PCLKCR3")
    9258                      .dwattr $C$DW$958, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9259                      .dwattr $C$DW$958, DW_AT_accessibility(DW_ACCESS_public)
    9260              
    9261                      .dwendtag $C$DW$T$40
    9262              
    9263              $C$DW$T$126     .dwtag  DW_TAG_pointer_type
    9264                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$40)
    9265                      .dwattr $C$DW$T$126, DW_AT_address_class(0x20)
    9266              
    9267              $C$DW$T$127     .dwtag  DW_TAG_typedef
    9268                      .dwattr $C$DW$T$127, DW_AT_name("CLK_Handle")
    9269                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
    9270                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    9271              
    9272              
    9273              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    9274                      .dwattr $C$DW$T$41, DW_AT_name("_CPU_Obj_")
    9275                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    9276              $C$DW$959       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:39 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6B48A69E-CD12-47CE-9AB2-8A4B9A5994C6} PAGE  182

    9277                      .dwattr $C$DW$959, DW_AT_type(*$C$DW$T$37)
    9278                      .dwattr $C$DW$959, DW_AT_name("tmp")
    9279                      .dwattr $C$DW$959, DW_AT_TI_symbol_name("_tmp")
    9280                      .dwattr $C$DW$959, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9281                      .dwattr $C$DW$959, DW_AT_accessibility(DW_ACCESS_public)
    9282              
    9283                      .dwendtag $C$DW$T$41
    9284              
    9285              $C$DW$T$128     .dwtag  DW_TAG_pointer_type
    9286                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$41)
    9287                      .dwattr $C$DW$T$128, DW_AT_address_class(0x20)
    9288              
    9289              $C$DW$T$129     .dwtag  DW_TAG_typedef
    9290                      .dwattr $C$DW$T$129, DW_AT_name("CPU_Handle")
    9291                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$128)
    9292                      .dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
    9293              
    9294              
    9295              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    9296                      .dwattr $C$DW$T$77, DW_AT_name("_CTRL_Obj_")
    9297                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x10a)
    9298              $C$DW$960       .dwtag  DW_TAG_member
    9299                      .dwattr $C$DW$960, DW_AT_type(*$C$DW$T$42)
    9300                      .dwattr $C$DW$960, DW_AT_name("version")
    9301                      .dwattr $C$DW$960, DW_AT_TI_symbol_name("_version")
    9302                      .dwattr $C$DW$960, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9303                      .dwattr $C$DW$960, DW_AT_accessibility(DW_ACCESS_public)
    9304              
    9305              $C$DW$961       .dwtag  DW_TAG_member
    9306                      .dwattr $C$DW$961, DW_AT_type(*$C$DW$T$44)
    9307                      .dwattr $C$DW$961, DW_AT_name("state")
    9308                      .dwattr $C$DW$961, DW_AT_TI_symbol_name("_state")
    9309                      .dwattr $C$DW$961, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9310                      .dwattr $C$DW$961, DW_AT_accessibility(DW_ACCESS_public)
    9311              
    9312              $C$DW$962       .dwtag  DW_TAG_member
    9313                      .dwattr $C$DW$962, DW_AT_type(*$C$DW$T$44)
    9314                      .dwattr $C$DW$962, DW_AT_name("prevState")
    9315                      .dwattr $C$DW$962, DW_AT_TI_symbol_name("_prevState")
    9316                      .dwattr $C$DW$962, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9317                      .dwattr $C$DW$962, DW_AT_accessibility(DW_ACCESS_public)
    9318              
    9319              $C$DW$963       .dwtag  DW_TAG_member
    9320                      .dwattr $C$DW$963, DW_AT_type(*$C$DW$T$46)
    9321                      .dwattr $C$DW$963, DW_AT_name("errorCode")
    9322                      .dwattr $C$DW$963, DW_AT_TI_symbol_name("_errorCode")
    9323                      .dwattr $C$DW$963, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9324                      .dwattr $C$DW$963, DW_AT_accessibility(DW_ACCESS_public)
    9325              
    9326              $C$DW$964       .dwtag  DW_TAG_member
    9327                      .dwattr $C$DW$964, DW_AT_type(*$C$DW$T$48)
    9328                      .dwattr $C$DW$964, DW_AT_name("clarkeHandle_I")
    9329                      .dwattr $C$DW$964, DW_AT_TI_symbol_name("_clarkeHandle_I")
    9330                      .dwattr $C$DW$964, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9331                      .dwattr $C$DW$964, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:39 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6B48A69E-CD12-47CE-9AB2-8A4B9A5994C6} PAGE  183

    9332              
    9333              $C$DW$965       .dwtag  DW_TAG_member
    9334                      .dwattr $C$DW$965, DW_AT_type(*$C$DW$T$49)
    9335                      .dwattr $C$DW$965, DW_AT_name("clarke_I")
    9336                      .dwattr $C$DW$965, DW_AT_TI_symbol_name("_clarke_I")
    9337                      .dwattr $C$DW$965, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9338                      .dwattr $C$DW$965, DW_AT_accessibility(DW_ACCESS_public)
    9339              
    9340              $C$DW$966       .dwtag  DW_TAG_member
    9341                      .dwattr $C$DW$966, DW_AT_type(*$C$DW$T$48)
    9342                      .dwattr $C$DW$966, DW_AT_name("clarkeHandle_V")
    9343                      .dwattr $C$DW$966, DW_AT_TI_symbol_name("_clarkeHandle_V")
    9344                      .dwattr $C$DW$966, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9345                      .dwattr $C$DW$966, DW_AT_accessibility(DW_ACCESS_public)
    9346              
    9347              $C$DW$967       .dwtag  DW_TAG_member
    9348                      .dwattr $C$DW$967, DW_AT_type(*$C$DW$T$49)
    9349                      .dwattr $C$DW$967, DW_AT_name("clarke_V")
    9350                      .dwattr $C$DW$967, DW_AT_TI_symbol_name("_clarke_V")
    9351                      .dwattr $C$DW$967, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9352                      .dwattr $C$DW$967, DW_AT_accessibility(DW_ACCESS_public)
    9353              
    9354              $C$DW$968       .dwtag  DW_TAG_member
    9355                      .dwattr $C$DW$968, DW_AT_type(*$C$DW$T$51)
    9356                      .dwattr $C$DW$968, DW_AT_name("estHandle")
    9357                      .dwattr $C$DW$968, DW_AT_TI_symbol_name("_estHandle")
    9358                      .dwattr $C$DW$968, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9359                      .dwattr $C$DW$968, DW_AT_accessibility(DW_ACCESS_public)
    9360              
    9361              $C$DW$969       .dwtag  DW_TAG_member
    9362                      .dwattr $C$DW$969, DW_AT_type(*$C$DW$T$53)
    9363                      .dwattr $C$DW$969, DW_AT_name("parkHandle")
    9364                      .dwattr $C$DW$969, DW_AT_TI_symbol_name("_parkHandle")
    9365                      .dwattr $C$DW$969, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9366                      .dwattr $C$DW$969, DW_AT_accessibility(DW_ACCESS_public)
    9367              
    9368              $C$DW$970       .dwtag  DW_TAG_member
    9369                      .dwattr $C$DW$970, DW_AT_type(*$C$DW$T$54)
    9370                      .dwattr $C$DW$970, DW_AT_name("park")
    9371                      .dwattr $C$DW$970, DW_AT_TI_symbol_name("_park")
    9372                      .dwattr $C$DW$970, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9373                      .dwattr $C$DW$970, DW_AT_accessibility(DW_ACCESS_public)
    9374              
    9375              $C$DW$971       .dwtag  DW_TAG_member
    9376                      .dwattr $C$DW$971, DW_AT_type(*$C$DW$T$56)
    9377                      .dwattr $C$DW$971, DW_AT_name("pidHandle_Id")
    9378                      .dwattr $C$DW$971, DW_AT_TI_symbol_name("_pidHandle_Id")
    9379                      .dwattr $C$DW$971, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    9380                      .dwattr $C$DW$971, DW_AT_accessibility(DW_ACCESS_public)
    9381              
    9382              $C$DW$972       .dwtag  DW_TAG_member
    9383                      .dwattr $C$DW$972, DW_AT_type(*$C$DW$T$57)
    9384                      .dwattr $C$DW$972, DW_AT_name("pid_Id")
    9385                      .dwattr $C$DW$972, DW_AT_TI_symbol_name("_pid_Id")
    9386                      .dwattr $C$DW$972, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:39 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6B48A69E-CD12-47CE-9AB2-8A4B9A5994C6} PAGE  184

    9387                      .dwattr $C$DW$972, DW_AT_accessibility(DW_ACCESS_public)
    9388              
    9389              $C$DW$973       .dwtag  DW_TAG_member
    9390                      .dwattr $C$DW$973, DW_AT_type(*$C$DW$T$56)
    9391                      .dwattr $C$DW$973, DW_AT_name("pidHandle_Iq")
    9392                      .dwattr $C$DW$973, DW_AT_TI_symbol_name("_pidHandle_Iq")
    9393                      .dwattr $C$DW$973, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    9394                      .dwattr $C$DW$973, DW_AT_accessibility(DW_ACCESS_public)
    9395              
    9396              $C$DW$974       .dwtag  DW_TAG_member
    9397                      .dwattr $C$DW$974, DW_AT_type(*$C$DW$T$57)
    9398                      .dwattr $C$DW$974, DW_AT_name("pid_Iq")
    9399                      .dwattr $C$DW$974, DW_AT_TI_symbol_name("_pid_Iq")
    9400                      .dwattr $C$DW$974, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    9401                      .dwattr $C$DW$974, DW_AT_accessibility(DW_ACCESS_public)
    9402              
    9403              $C$DW$975       .dwtag  DW_TAG_member
    9404                      .dwattr $C$DW$975, DW_AT_type(*$C$DW$T$56)
    9405                      .dwattr $C$DW$975, DW_AT_name("pidHandle_spd")
    9406                      .dwattr $C$DW$975, DW_AT_TI_symbol_name("_pidHandle_spd")
    9407                      .dwattr $C$DW$975, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    9408                      .dwattr $C$DW$975, DW_AT_accessibility(DW_ACCESS_public)
    9409              
    9410              $C$DW$976       .dwtag  DW_TAG_member
    9411                      .dwattr $C$DW$976, DW_AT_type(*$C$DW$T$57)
    9412                      .dwattr $C$DW$976, DW_AT_name("pid_spd")
    9413                      .dwattr $C$DW$976, DW_AT_TI_symbol_name("_pid_spd")
    9414                      .dwattr $C$DW$976, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    9415                      .dwattr $C$DW$976, DW_AT_accessibility(DW_ACCESS_public)
    9416              
    9417              $C$DW$977       .dwtag  DW_TAG_member
    9418                      .dwattr $C$DW$977, DW_AT_type(*$C$DW$T$59)
    9419                      .dwattr $C$DW$977, DW_AT_name("iparkHandle")
    9420                      .dwattr $C$DW$977, DW_AT_TI_symbol_name("_iparkHandle")
    9421                      .dwattr $C$DW$977, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    9422                      .dwattr $C$DW$977, DW_AT_accessibility(DW_ACCESS_public)
    9423              
    9424              $C$DW$978       .dwtag  DW_TAG_member
    9425                      .dwattr $C$DW$978, DW_AT_type(*$C$DW$T$60)
    9426                      .dwattr $C$DW$978, DW_AT_name("ipark")
    9427                      .dwattr $C$DW$978, DW_AT_TI_symbol_name("_ipark")
    9428                      .dwattr $C$DW$978, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    9429                      .dwattr $C$DW$978, DW_AT_accessibility(DW_ACCESS_public)
    9430              
    9431              $C$DW$979       .dwtag  DW_TAG_member
    9432                      .dwattr $C$DW$979, DW_AT_type(*$C$DW$T$62)
    9433                      .dwattr $C$DW$979, DW_AT_name("svgenHandle")
    9434                      .dwattr $C$DW$979, DW_AT_TI_symbol_name("_svgenHandle")
    9435                      .dwattr $C$DW$979, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    9436                      .dwattr $C$DW$979, DW_AT_accessibility(DW_ACCESS_public)
    9437              
    9438              $C$DW$980       .dwtag  DW_TAG_member
    9439                      .dwattr $C$DW$980, DW_AT_type(*$C$DW$T$63)
    9440                      .dwattr $C$DW$980, DW_AT_name("svgen")
    9441                      .dwattr $C$DW$980, DW_AT_TI_symbol_name("_svgen")
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:39 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6B48A69E-CD12-47CE-9AB2-8A4B9A5994C6} PAGE  185

    9442                      .dwattr $C$DW$980, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    9443                      .dwattr $C$DW$980, DW_AT_accessibility(DW_ACCESS_public)
    9444              
    9445              $C$DW$981       .dwtag  DW_TAG_member
    9446                      .dwattr $C$DW$981, DW_AT_type(*$C$DW$T$65)
    9447                      .dwattr $C$DW$981, DW_AT_name("trajHandle_Id")
    9448                      .dwattr $C$DW$981, DW_AT_TI_symbol_name("_trajHandle_Id")
    9449                      .dwattr $C$DW$981, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    9450                      .dwattr $C$DW$981, DW_AT_accessibility(DW_ACCESS_public)
    9451              
    9452              $C$DW$982       .dwtag  DW_TAG_member
    9453                      .dwattr $C$DW$982, DW_AT_type(*$C$DW$T$66)
    9454                      .dwattr $C$DW$982, DW_AT_name("traj_Id")
    9455                      .dwattr $C$DW$982, DW_AT_TI_symbol_name("_traj_Id")
    9456                      .dwattr $C$DW$982, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    9457                      .dwattr $C$DW$982, DW_AT_accessibility(DW_ACCESS_public)
    9458              
    9459              $C$DW$983       .dwtag  DW_TAG_member
    9460                      .dwattr $C$DW$983, DW_AT_type(*$C$DW$T$65)
    9461                      .dwattr $C$DW$983, DW_AT_name("trajHandle_spd")
    9462                      .dwattr $C$DW$983, DW_AT_TI_symbol_name("_trajHandle_spd")
    9463                      .dwattr $C$DW$983, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    9464                      .dwattr $C$DW$983, DW_AT_accessibility(DW_ACCESS_public)
    9465              
    9466              $C$DW$984       .dwtag  DW_TAG_member
    9467                      .dwattr $C$DW$984, DW_AT_type(*$C$DW$T$66)
    9468                      .dwattr $C$DW$984, DW_AT_name("traj_spd")
    9469                      .dwattr $C$DW$984, DW_AT_TI_symbol_name("_traj_spd")
    9470                      .dwattr $C$DW$984, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    9471                      .dwattr $C$DW$984, DW_AT_accessibility(DW_ACCESS_public)
    9472              
    9473              $C$DW$985       .dwtag  DW_TAG_member
    9474                      .dwattr $C$DW$985, DW_AT_type(*$C$DW$T$65)
    9475                      .dwattr $C$DW$985, DW_AT_name("trajHandle_spdMax")
    9476                      .dwattr $C$DW$985, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    9477                      .dwattr $C$DW$985, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    9478                      .dwattr $C$DW$985, DW_AT_accessibility(DW_ACCESS_public)
    9479              
    9480              $C$DW$986       .dwtag  DW_TAG_member
    9481                      .dwattr $C$DW$986, DW_AT_type(*$C$DW$T$66)
    9482                      .dwattr $C$DW$986, DW_AT_name("traj_spdMax")
    9483                      .dwattr $C$DW$986, DW_AT_TI_symbol_name("_traj_spdMax")
    9484                      .dwattr $C$DW$986, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    9485                      .dwattr $C$DW$986, DW_AT_accessibility(DW_ACCESS_public)
    9486              
    9487              $C$DW$987       .dwtag  DW_TAG_member
    9488                      .dwattr $C$DW$987, DW_AT_type(*$C$DW$T$67)
    9489                      .dwattr $C$DW$987, DW_AT_name("motorParams")
    9490                      .dwattr $C$DW$987, DW_AT_TI_symbol_name("_motorParams")
    9491                      .dwattr $C$DW$987, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    9492                      .dwattr $C$DW$987, DW_AT_accessibility(DW_ACCESS_public)
    9493              
    9494              $C$DW$988       .dwtag  DW_TAG_member
    9495                      .dwattr $C$DW$988, DW_AT_type(*$C$DW$T$71)
    9496                      .dwattr $C$DW$988, DW_AT_name("waitTimes")
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:39 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6B48A69E-CD12-47CE-9AB2-8A4B9A5994C6} PAGE  186

    9497                      .dwattr $C$DW$988, DW_AT_TI_symbol_name("_waitTimes")
    9498                      .dwattr $C$DW$988, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    9499                      .dwattr $C$DW$988, DW_AT_accessibility(DW_ACCESS_public)
    9500              
    9501              $C$DW$989       .dwtag  DW_TAG_member
    9502                      .dwattr $C$DW$989, DW_AT_type(*$C$DW$T$70)
    9503                      .dwattr $C$DW$989, DW_AT_name("counter_state")
    9504                      .dwattr $C$DW$989, DW_AT_TI_symbol_name("_counter_state")
    9505                      .dwattr $C$DW$989, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    9506                      .dwattr $C$DW$989, DW_AT_accessibility(DW_ACCESS_public)
    9507              
    9508              $C$DW$990       .dwtag  DW_TAG_member
    9509                      .dwattr $C$DW$990, DW_AT_type(*$C$DW$T$73)
    9510                      .dwattr $C$DW$990, DW_AT_name("numIsrTicksPerCtrlTick")
    9511                      .dwattr $C$DW$990, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    9512                      .dwattr $C$DW$990, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    9513                      .dwattr $C$DW$990, DW_AT_accessibility(DW_ACCESS_public)
    9514              
    9515              $C$DW$991       .dwtag  DW_TAG_member
    9516                      .dwattr $C$DW$991, DW_AT_type(*$C$DW$T$73)
    9517                      .dwattr $C$DW$991, DW_AT_name("numCtrlTicksPerCurrentTick")
    9518                      .dwattr $C$DW$991, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    9519                      .dwattr $C$DW$991, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    9520                      .dwattr $C$DW$991, DW_AT_accessibility(DW_ACCESS_public)
    9521              
    9522              $C$DW$992       .dwtag  DW_TAG_member
    9523                      .dwattr $C$DW$992, DW_AT_type(*$C$DW$T$73)
    9524                      .dwattr $C$DW$992, DW_AT_name("numCtrlTicksPerSpeedTick")
    9525                      .dwattr $C$DW$992, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    9526                      .dwattr $C$DW$992, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    9527                      .dwattr $C$DW$992, DW_AT_accessibility(DW_ACCESS_public)
    9528              
    9529              $C$DW$993       .dwtag  DW_TAG_member
    9530                      .dwattr $C$DW$993, DW_AT_type(*$C$DW$T$73)
    9531                      .dwattr $C$DW$993, DW_AT_name("numCtrlTicksPerTrajTick")
    9532                      .dwattr $C$DW$993, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    9533                      .dwattr $C$DW$993, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    9534                      .dwattr $C$DW$993, DW_AT_accessibility(DW_ACCESS_public)
    9535              
    9536              $C$DW$994       .dwtag  DW_TAG_member
    9537                      .dwattr $C$DW$994, DW_AT_type(*$C$DW$T$70)
    9538                      .dwattr $C$DW$994, DW_AT_name("ctrlFreq_Hz")
    9539                      .dwattr $C$DW$994, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    9540                      .dwattr $C$DW$994, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    9541                      .dwattr $C$DW$994, DW_AT_accessibility(DW_ACCESS_public)
    9542              
    9543              $C$DW$995       .dwtag  DW_TAG_member
    9544                      .dwattr $C$DW$995, DW_AT_type(*$C$DW$T$70)
    9545                      .dwattr $C$DW$995, DW_AT_name("trajFreq_Hz")
    9546                      .dwattr $C$DW$995, DW_AT_TI_symbol_name("_trajFreq_Hz")
    9547                      .dwattr $C$DW$995, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    9548                      .dwattr $C$DW$995, DW_AT_accessibility(DW_ACCESS_public)
    9549              
    9550              $C$DW$996       .dwtag  DW_TAG_member
    9551                      .dwattr $C$DW$996, DW_AT_type(*$C$DW$T$35)
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:39 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6B48A69E-CD12-47CE-9AB2-8A4B9A5994C6} PAGE  187

    9552                      .dwattr $C$DW$996, DW_AT_name("trajPeriod_sec")
    9553                      .dwattr $C$DW$996, DW_AT_TI_symbol_name("_trajPeriod_sec")
    9554                      .dwattr $C$DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    9555                      .dwattr $C$DW$996, DW_AT_accessibility(DW_ACCESS_public)
    9556              
    9557              $C$DW$997       .dwtag  DW_TAG_member
    9558                      .dwattr $C$DW$997, DW_AT_type(*$C$DW$T$74)
    9559                      .dwattr $C$DW$997, DW_AT_name("ctrlPeriod_sec")
    9560                      .dwattr $C$DW$997, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    9561                      .dwattr $C$DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    9562                      .dwattr $C$DW$997, DW_AT_accessibility(DW_ACCESS_public)
    9563              
    9564              $C$DW$998       .dwtag  DW_TAG_member
    9565                      .dwattr $C$DW$998, DW_AT_type(*$C$DW$T$35)
    9566                      .dwattr $C$DW$998, DW_AT_name("maxVsMag_pu")
    9567                      .dwattr $C$DW$998, DW_AT_TI_symbol_name("_maxVsMag_pu")
    9568                      .dwattr $C$DW$998, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    9569                      .dwattr $C$DW$998, DW_AT_accessibility(DW_ACCESS_public)
    9570              
    9571              $C$DW$999       .dwtag  DW_TAG_member
    9572                      .dwattr $C$DW$999, DW_AT_type(*$C$DW$T$75)
    9573                      .dwattr $C$DW$999, DW_AT_name("Iab_in")
    9574                      .dwattr $C$DW$999, DW_AT_TI_symbol_name("_Iab_in")
    9575                      .dwattr $C$DW$999, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    9576                      .dwattr $C$DW$999, DW_AT_accessibility(DW_ACCESS_public)
    9577              
    9578              $C$DW$1000      .dwtag  DW_TAG_member
    9579                      .dwattr $C$DW$1000, DW_AT_type(*$C$DW$T$75)
    9580                      .dwattr $C$DW$1000, DW_AT_name("Iab_filt")
    9581                      .dwattr $C$DW$1000, DW_AT_TI_symbol_name("_Iab_filt")
    9582                      .dwattr $C$DW$1000, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    9583                      .dwattr $C$DW$1000, DW_AT_accessibility(DW_ACCESS_public)
    9584              
    9585              $C$DW$1001      .dwtag  DW_TAG_member
    9586                      .dwattr $C$DW$1001, DW_AT_type(*$C$DW$T$75)
    9587                      .dwattr $C$DW$1001, DW_AT_name("Idq_in")
    9588                      .dwattr $C$DW$1001, DW_AT_TI_symbol_name("_Idq_in")
    9589                      .dwattr $C$DW$1001, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    9590                      .dwattr $C$DW$1001, DW_AT_accessibility(DW_ACCESS_public)
    9591              
    9592              $C$DW$1002      .dwtag  DW_TAG_member
    9593                      .dwattr $C$DW$1002, DW_AT_type(*$C$DW$T$75)
    9594                      .dwattr $C$DW$1002, DW_AT_name("Vab_in")
    9595                      .dwattr $C$DW$1002, DW_AT_TI_symbol_name("_Vab_in")
    9596                      .dwattr $C$DW$1002, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    9597                      .dwattr $C$DW$1002, DW_AT_accessibility(DW_ACCESS_public)
    9598              
    9599              $C$DW$1003      .dwtag  DW_TAG_member
    9600                      .dwattr $C$DW$1003, DW_AT_type(*$C$DW$T$35)
    9601                      .dwattr $C$DW$1003, DW_AT_name("spd_out")
    9602                      .dwattr $C$DW$1003, DW_AT_TI_symbol_name("_spd_out")
    9603                      .dwattr $C$DW$1003, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    9604                      .dwattr $C$DW$1003, DW_AT_accessibility(DW_ACCESS_public)
    9605              
    9606              $C$DW$1004      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:39 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6B48A69E-CD12-47CE-9AB2-8A4B9A5994C6} PAGE  188

    9607                      .dwattr $C$DW$1004, DW_AT_type(*$C$DW$T$75)
    9608                      .dwattr $C$DW$1004, DW_AT_name("Vab_out")
    9609                      .dwattr $C$DW$1004, DW_AT_TI_symbol_name("_Vab_out")
    9610                      .dwattr $C$DW$1004, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    9611                      .dwattr $C$DW$1004, DW_AT_accessibility(DW_ACCESS_public)
    9612              
    9613              $C$DW$1005      .dwtag  DW_TAG_member
    9614                      .dwattr $C$DW$1005, DW_AT_type(*$C$DW$T$75)
    9615                      .dwattr $C$DW$1005, DW_AT_name("Vdq_out")
    9616                      .dwattr $C$DW$1005, DW_AT_TI_symbol_name("_Vdq_out")
    9617                      .dwattr $C$DW$1005, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    9618                      .dwattr $C$DW$1005, DW_AT_accessibility(DW_ACCESS_public)
    9619              
    9620              $C$DW$1006      .dwtag  DW_TAG_member
    9621                      .dwattr $C$DW$1006, DW_AT_type(*$C$DW$T$74)
    9622                      .dwattr $C$DW$1006, DW_AT_name("Rhf")
    9623                      .dwattr $C$DW$1006, DW_AT_TI_symbol_name("_Rhf")
    9624                      .dwattr $C$DW$1006, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    9625                      .dwattr $C$DW$1006, DW_AT_accessibility(DW_ACCESS_public)
    9626              
    9627              $C$DW$1007      .dwtag  DW_TAG_member
    9628                      .dwattr $C$DW$1007, DW_AT_type(*$C$DW$T$74)
    9629                      .dwattr $C$DW$1007, DW_AT_name("Lhf")
    9630                      .dwattr $C$DW$1007, DW_AT_TI_symbol_name("_Lhf")
    9631                      .dwattr $C$DW$1007, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    9632                      .dwattr $C$DW$1007, DW_AT_accessibility(DW_ACCESS_public)
    9633              
    9634              $C$DW$1008      .dwtag  DW_TAG_member
    9635                      .dwattr $C$DW$1008, DW_AT_type(*$C$DW$T$74)
    9636                      .dwattr $C$DW$1008, DW_AT_name("RoverL")
    9637                      .dwattr $C$DW$1008, DW_AT_TI_symbol_name("_RoverL")
    9638                      .dwattr $C$DW$1008, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    9639                      .dwattr $C$DW$1008, DW_AT_accessibility(DW_ACCESS_public)
    9640              
    9641              $C$DW$1009      .dwtag  DW_TAG_member
    9642                      .dwattr $C$DW$1009, DW_AT_type(*$C$DW$T$35)
    9643                      .dwattr $C$DW$1009, DW_AT_name("Kp_Id")
    9644                      .dwattr $C$DW$1009, DW_AT_TI_symbol_name("_Kp_Id")
    9645                      .dwattr $C$DW$1009, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    9646                      .dwattr $C$DW$1009, DW_AT_accessibility(DW_ACCESS_public)
    9647              
    9648              $C$DW$1010      .dwtag  DW_TAG_member
    9649                      .dwattr $C$DW$1010, DW_AT_type(*$C$DW$T$35)
    9650                      .dwattr $C$DW$1010, DW_AT_name("Kp_Iq")
    9651                      .dwattr $C$DW$1010, DW_AT_TI_symbol_name("_Kp_Iq")
    9652                      .dwattr $C$DW$1010, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    9653                      .dwattr $C$DW$1010, DW_AT_accessibility(DW_ACCESS_public)
    9654              
    9655              $C$DW$1011      .dwtag  DW_TAG_member
    9656                      .dwattr $C$DW$1011, DW_AT_type(*$C$DW$T$35)
    9657                      .dwattr $C$DW$1011, DW_AT_name("Kp_spd")
    9658                      .dwattr $C$DW$1011, DW_AT_TI_symbol_name("_Kp_spd")
    9659                      .dwattr $C$DW$1011, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    9660                      .dwattr $C$DW$1011, DW_AT_accessibility(DW_ACCESS_public)
    9661              
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:39 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6B48A69E-CD12-47CE-9AB2-8A4B9A5994C6} PAGE  189

    9662              $C$DW$1012      .dwtag  DW_TAG_member
    9663                      .dwattr $C$DW$1012, DW_AT_type(*$C$DW$T$35)
    9664                      .dwattr $C$DW$1012, DW_AT_name("Ki_Id")
    9665                      .dwattr $C$DW$1012, DW_AT_TI_symbol_name("_Ki_Id")
    9666                      .dwattr $C$DW$1012, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    9667                      .dwattr $C$DW$1012, DW_AT_accessibility(DW_ACCESS_public)
    9668              
    9669              $C$DW$1013      .dwtag  DW_TAG_member
    9670                      .dwattr $C$DW$1013, DW_AT_type(*$C$DW$T$35)
    9671                      .dwattr $C$DW$1013, DW_AT_name("Ki_Iq")
    9672                      .dwattr $C$DW$1013, DW_AT_TI_symbol_name("_Ki_Iq")
    9673                      .dwattr $C$DW$1013, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    9674                      .dwattr $C$DW$1013, DW_AT_accessibility(DW_ACCESS_public)
    9675              
    9676              $C$DW$1014      .dwtag  DW_TAG_member
    9677                      .dwattr $C$DW$1014, DW_AT_type(*$C$DW$T$35)
    9678                      .dwattr $C$DW$1014, DW_AT_name("Ki_spd")
    9679                      .dwattr $C$DW$1014, DW_AT_TI_symbol_name("_Ki_spd")
    9680                      .dwattr $C$DW$1014, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    9681                      .dwattr $C$DW$1014, DW_AT_accessibility(DW_ACCESS_public)
    9682              
    9683              $C$DW$1015      .dwtag  DW_TAG_member
    9684                      .dwattr $C$DW$1015, DW_AT_type(*$C$DW$T$35)
    9685                      .dwattr $C$DW$1015, DW_AT_name("Kd_Id")
    9686                      .dwattr $C$DW$1015, DW_AT_TI_symbol_name("_Kd_Id")
    9687                      .dwattr $C$DW$1015, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    9688                      .dwattr $C$DW$1015, DW_AT_accessibility(DW_ACCESS_public)
    9689              
    9690              $C$DW$1016      .dwtag  DW_TAG_member
    9691                      .dwattr $C$DW$1016, DW_AT_type(*$C$DW$T$35)
    9692                      .dwattr $C$DW$1016, DW_AT_name("Kd_Iq")
    9693                      .dwattr $C$DW$1016, DW_AT_TI_symbol_name("_Kd_Iq")
    9694                      .dwattr $C$DW$1016, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    9695                      .dwattr $C$DW$1016, DW_AT_accessibility(DW_ACCESS_public)
    9696              
    9697              $C$DW$1017      .dwtag  DW_TAG_member
    9698                      .dwattr $C$DW$1017, DW_AT_type(*$C$DW$T$35)
    9699                      .dwattr $C$DW$1017, DW_AT_name("Kd_spd")
    9700                      .dwattr $C$DW$1017, DW_AT_TI_symbol_name("_Kd_spd")
    9701                      .dwattr $C$DW$1017, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    9702                      .dwattr $C$DW$1017, DW_AT_accessibility(DW_ACCESS_public)
    9703              
    9704              $C$DW$1018      .dwtag  DW_TAG_member
    9705                      .dwattr $C$DW$1018, DW_AT_type(*$C$DW$T$35)
    9706                      .dwattr $C$DW$1018, DW_AT_name("Ui_Id")
    9707                      .dwattr $C$DW$1018, DW_AT_TI_symbol_name("_Ui_Id")
    9708                      .dwattr $C$DW$1018, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    9709                      .dwattr $C$DW$1018, DW_AT_accessibility(DW_ACCESS_public)
    9710              
    9711              $C$DW$1019      .dwtag  DW_TAG_member
    9712                      .dwattr $C$DW$1019, DW_AT_type(*$C$DW$T$35)
    9713                      .dwattr $C$DW$1019, DW_AT_name("Ui_Iq")
    9714                      .dwattr $C$DW$1019, DW_AT_TI_symbol_name("_Ui_Iq")
    9715                      .dwattr $C$DW$1019, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    9716                      .dwattr $C$DW$1019, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:39 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6B48A69E-CD12-47CE-9AB2-8A4B9A5994C6} PAGE  190

    9717              
    9718              $C$DW$1020      .dwtag  DW_TAG_member
    9719                      .dwattr $C$DW$1020, DW_AT_type(*$C$DW$T$35)
    9720                      .dwattr $C$DW$1020, DW_AT_name("Ui_spd")
    9721                      .dwattr $C$DW$1020, DW_AT_TI_symbol_name("_Ui_spd")
    9722                      .dwattr $C$DW$1020, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    9723                      .dwattr $C$DW$1020, DW_AT_accessibility(DW_ACCESS_public)
    9724              
    9725              $C$DW$1021      .dwtag  DW_TAG_member
    9726                      .dwattr $C$DW$1021, DW_AT_type(*$C$DW$T$75)
    9727                      .dwattr $C$DW$1021, DW_AT_name("Idq_ref")
    9728                      .dwattr $C$DW$1021, DW_AT_TI_symbol_name("_Idq_ref")
    9729                      .dwattr $C$DW$1021, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    9730                      .dwattr $C$DW$1021, DW_AT_accessibility(DW_ACCESS_public)
    9731              
    9732              $C$DW$1022      .dwtag  DW_TAG_member
    9733                      .dwattr $C$DW$1022, DW_AT_type(*$C$DW$T$35)
    9734                      .dwattr $C$DW$1022, DW_AT_name("IdRated")
    9735                      .dwattr $C$DW$1022, DW_AT_TI_symbol_name("_IdRated")
    9736                      .dwattr $C$DW$1022, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    9737                      .dwattr $C$DW$1022, DW_AT_accessibility(DW_ACCESS_public)
    9738              
    9739              $C$DW$1023      .dwtag  DW_TAG_member
    9740                      .dwattr $C$DW$1023, DW_AT_type(*$C$DW$T$35)
    9741                      .dwattr $C$DW$1023, DW_AT_name("spd_ref")
    9742                      .dwattr $C$DW$1023, DW_AT_TI_symbol_name("_spd_ref")
    9743                      .dwattr $C$DW$1023, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    9744                      .dwattr $C$DW$1023, DW_AT_accessibility(DW_ACCESS_public)
    9745              
    9746              $C$DW$1024      .dwtag  DW_TAG_member
    9747                      .dwattr $C$DW$1024, DW_AT_type(*$C$DW$T$35)
    9748                      .dwattr $C$DW$1024, DW_AT_name("spd_max")
    9749                      .dwattr $C$DW$1024, DW_AT_TI_symbol_name("_spd_max")
    9750                      .dwattr $C$DW$1024, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    9751                      .dwattr $C$DW$1024, DW_AT_accessibility(DW_ACCESS_public)
    9752              
    9753              $C$DW$1025      .dwtag  DW_TAG_member
    9754                      .dwattr $C$DW$1025, DW_AT_type(*$C$DW$T$73)
    9755                      .dwattr $C$DW$1025, DW_AT_name("counter_current")
    9756                      .dwattr $C$DW$1025, DW_AT_TI_symbol_name("_counter_current")
    9757                      .dwattr $C$DW$1025, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    9758                      .dwattr $C$DW$1025, DW_AT_accessibility(DW_ACCESS_public)
    9759              
    9760              $C$DW$1026      .dwtag  DW_TAG_member
    9761                      .dwattr $C$DW$1026, DW_AT_type(*$C$DW$T$73)
    9762                      .dwattr $C$DW$1026, DW_AT_name("counter_isr")
    9763                      .dwattr $C$DW$1026, DW_AT_TI_symbol_name("_counter_isr")
    9764                      .dwattr $C$DW$1026, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    9765                      .dwattr $C$DW$1026, DW_AT_accessibility(DW_ACCESS_public)
    9766              
    9767              $C$DW$1027      .dwtag  DW_TAG_member
    9768                      .dwattr $C$DW$1027, DW_AT_type(*$C$DW$T$73)
    9769                      .dwattr $C$DW$1027, DW_AT_name("counter_speed")
    9770                      .dwattr $C$DW$1027, DW_AT_TI_symbol_name("_counter_speed")
    9771                      .dwattr $C$DW$1027, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:39 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6B48A69E-CD12-47CE-9AB2-8A4B9A5994C6} PAGE  191

    9772                      .dwattr $C$DW$1027, DW_AT_accessibility(DW_ACCESS_public)
    9773              
    9774              $C$DW$1028      .dwtag  DW_TAG_member
    9775                      .dwattr $C$DW$1028, DW_AT_type(*$C$DW$T$73)
    9776                      .dwattr $C$DW$1028, DW_AT_name("counter_traj")
    9777                      .dwattr $C$DW$1028, DW_AT_TI_symbol_name("_counter_traj")
    9778                      .dwattr $C$DW$1028, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    9779                      .dwattr $C$DW$1028, DW_AT_accessibility(DW_ACCESS_public)
    9780              
    9781              $C$DW$1029      .dwtag  DW_TAG_member
    9782                      .dwattr $C$DW$1029, DW_AT_type(*$C$DW$T$76)
    9783                      .dwattr $C$DW$1029, DW_AT_name("flag_enableCtrl")
    9784                      .dwattr $C$DW$1029, DW_AT_TI_symbol_name("_flag_enableCtrl")
    9785                      .dwattr $C$DW$1029, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    9786                      .dwattr $C$DW$1029, DW_AT_accessibility(DW_ACCESS_public)
    9787              
    9788              $C$DW$1030      .dwtag  DW_TAG_member
    9789                      .dwattr $C$DW$1030, DW_AT_type(*$C$DW$T$76)
    9790                      .dwattr $C$DW$1030, DW_AT_name("flag_enableDcBusComp")
    9791                      .dwattr $C$DW$1030, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    9792                      .dwattr $C$DW$1030, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    9793                      .dwattr $C$DW$1030, DW_AT_accessibility(DW_ACCESS_public)
    9794              
    9795              $C$DW$1031      .dwtag  DW_TAG_member
    9796                      .dwattr $C$DW$1031, DW_AT_type(*$C$DW$T$76)
    9797                      .dwattr $C$DW$1031, DW_AT_name("flag_enablePowerWarp")
    9798                      .dwattr $C$DW$1031, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    9799                      .dwattr $C$DW$1031, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    9800                      .dwattr $C$DW$1031, DW_AT_accessibility(DW_ACCESS_public)
    9801              
    9802              $C$DW$1032      .dwtag  DW_TAG_member
    9803                      .dwattr $C$DW$1032, DW_AT_type(*$C$DW$T$76)
    9804                      .dwattr $C$DW$1032, DW_AT_name("flag_enableOffset")
    9805                      .dwattr $C$DW$1032, DW_AT_TI_symbol_name("_flag_enableOffset")
    9806                      .dwattr $C$DW$1032, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    9807                      .dwattr $C$DW$1032, DW_AT_accessibility(DW_ACCESS_public)
    9808              
    9809              $C$DW$1033      .dwtag  DW_TAG_member
    9810                      .dwattr $C$DW$1033, DW_AT_type(*$C$DW$T$76)
    9811                      .dwattr $C$DW$1033, DW_AT_name("flag_enableSpeedCtrl")
    9812                      .dwattr $C$DW$1033, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    9813                      .dwattr $C$DW$1033, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    9814                      .dwattr $C$DW$1033, DW_AT_accessibility(DW_ACCESS_public)
    9815              
    9816              $C$DW$1034      .dwtag  DW_TAG_member
    9817                      .dwattr $C$DW$1034, DW_AT_type(*$C$DW$T$76)
    9818                      .dwattr $C$DW$1034, DW_AT_name("flag_enableUserMotorParams")
    9819                      .dwattr $C$DW$1034, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    9820                      .dwattr $C$DW$1034, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    9821                      .dwattr $C$DW$1034, DW_AT_accessibility(DW_ACCESS_public)
    9822              
    9823              $C$DW$1035      .dwtag  DW_TAG_member
    9824                      .dwattr $C$DW$1035, DW_AT_type(*$C$DW$T$75)
    9825                      .dwattr $C$DW$1035, DW_AT_name("Idq_offset_pu")
    9826                      .dwattr $C$DW$1035, DW_AT_TI_symbol_name("_Idq_offset_pu")
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:39 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6B48A69E-CD12-47CE-9AB2-8A4B9A5994C6} PAGE  192

    9827                      .dwattr $C$DW$1035, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    9828                      .dwattr $C$DW$1035, DW_AT_accessibility(DW_ACCESS_public)
    9829              
    9830              $C$DW$1036      .dwtag  DW_TAG_member
    9831                      .dwattr $C$DW$1036, DW_AT_type(*$C$DW$T$75)
    9832                      .dwattr $C$DW$1036, DW_AT_name("Vdq_offset_pu")
    9833                      .dwattr $C$DW$1036, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    9834                      .dwattr $C$DW$1036, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    9835                      .dwattr $C$DW$1036, DW_AT_accessibility(DW_ACCESS_public)
    9836              
    9837              $C$DW$1037      .dwtag  DW_TAG_member
    9838                      .dwattr $C$DW$1037, DW_AT_type(*$C$DW$T$35)
    9839                      .dwattr $C$DW$1037, DW_AT_name("angle_pu")
    9840                      .dwattr $C$DW$1037, DW_AT_TI_symbol_name("_angle_pu")
    9841                      .dwattr $C$DW$1037, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    9842                      .dwattr $C$DW$1037, DW_AT_accessibility(DW_ACCESS_public)
    9843              
    9844              $C$DW$1038      .dwtag  DW_TAG_member
    9845                      .dwattr $C$DW$1038, DW_AT_type(*$C$DW$T$35)
    9846                      .dwattr $C$DW$1038, DW_AT_name("speed_ref_pu")
    9847                      .dwattr $C$DW$1038, DW_AT_TI_symbol_name("_speed_ref_pu")
    9848                      .dwattr $C$DW$1038, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    9849                      .dwattr $C$DW$1038, DW_AT_accessibility(DW_ACCESS_public)
    9850              
    9851              $C$DW$1039      .dwtag  DW_TAG_member
    9852                      .dwattr $C$DW$1039, DW_AT_type(*$C$DW$T$35)
    9853                      .dwattr $C$DW$1039, DW_AT_name("speed_fb_pu")
    9854                      .dwattr $C$DW$1039, DW_AT_TI_symbol_name("_speed_fb_pu")
    9855                      .dwattr $C$DW$1039, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    9856                      .dwattr $C$DW$1039, DW_AT_accessibility(DW_ACCESS_public)
    9857              
    9858              $C$DW$1040      .dwtag  DW_TAG_member
    9859                      .dwattr $C$DW$1040, DW_AT_type(*$C$DW$T$35)
    9860                      .dwattr $C$DW$1040, DW_AT_name("speed_outMax_pu")
    9861                      .dwattr $C$DW$1040, DW_AT_TI_symbol_name("_speed_outMax_pu")
    9862                      .dwattr $C$DW$1040, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    9863                      .dwattr $C$DW$1040, DW_AT_accessibility(DW_ACCESS_public)
    9864              
    9865              $C$DW$1041      .dwtag  DW_TAG_member
    9866                      .dwattr $C$DW$1041, DW_AT_type(*$C$DW$T$76)
    9867                      .dwattr $C$DW$1041, DW_AT_name("flag_enableCurrentCtrl")
    9868                      .dwattr $C$DW$1041, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    9869                      .dwattr $C$DW$1041, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    9870                      .dwattr $C$DW$1041, DW_AT_accessibility(DW_ACCESS_public)
    9871              
    9872              $C$DW$1042      .dwtag  DW_TAG_member
    9873                      .dwattr $C$DW$1042, DW_AT_type(*$C$DW$T$35)
    9874                      .dwattr $C$DW$1042, DW_AT_name("torque_head_comm")
    9875                      .dwattr $C$DW$1042, DW_AT_TI_symbol_name("_torque_head_comm")
    9876                      .dwattr $C$DW$1042, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    9877                      .dwattr $C$DW$1042, DW_AT_accessibility(DW_ACCESS_public)
    9878              
    9879                      .dwendtag $C$DW$T$77
    9880              
    9881              $C$DW$T$251     .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:39 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6B48A69E-CD12-47CE-9AB2-8A4B9A5994C6} PAGE  193

    9882                      .dwattr $C$DW$T$251, DW_AT_name("CTRL_Obj")
    9883                      .dwattr $C$DW$T$251, DW_AT_type(*$C$DW$T$77)
    9884                      .dwattr $C$DW$T$251, DW_AT_language(DW_LANG_C)
    9885              
    9886              $C$DW$T$252     .dwtag  DW_TAG_pointer_type
    9887                      .dwattr $C$DW$T$252, DW_AT_type(*$C$DW$T$251)
    9888                      .dwattr $C$DW$T$252, DW_AT_address_class(0x20)
    9889              
    9890              $C$DW$T$206     .dwtag  DW_TAG_pointer_type
    9891                      .dwattr $C$DW$T$206, DW_AT_type(*$C$DW$T$77)
    9892                      .dwattr $C$DW$T$206, DW_AT_address_class(0x20)
    9893              
    9894              $C$DW$T$207     .dwtag  DW_TAG_typedef
    9895                      .dwattr $C$DW$T$207, DW_AT_name("CTRL_Handle")
    9896                      .dwattr $C$DW$T$207, DW_AT_type(*$C$DW$T$206)
    9897                      .dwattr $C$DW$T$207, DW_AT_language(DW_LANG_C)
    9898              
    9899              $C$DW$1043      .dwtag  DW_TAG_TI_far_type
    9900                      .dwattr $C$DW$1043, DW_AT_type(*$C$DW$T$207)
    9901              
    9902              $C$DW$T$253     .dwtag  DW_TAG_const_type
    9903                      .dwattr $C$DW$T$253, DW_AT_type(*$C$DW$1043)
    9904              
    9905              
    9906              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    9907                      .dwattr $C$DW$T$80, DW_AT_name("_CTRL_Version_")
    9908                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x04)
    9909              $C$DW$1044      .dwtag  DW_TAG_member
    9910                      .dwattr $C$DW$1044, DW_AT_type(*$C$DW$T$26)
    9911                      .dwattr $C$DW$1044, DW_AT_name("rsvd")
    9912                      .dwattr $C$DW$1044, DW_AT_TI_symbol_name("_rsvd")
    9913                      .dwattr $C$DW$1044, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9914                      .dwattr $C$DW$1044, DW_AT_accessibility(DW_ACCESS_public)
    9915              
    9916              $C$DW$1045      .dwtag  DW_TAG_member
    9917                      .dwattr $C$DW$1045, DW_AT_type(*$C$DW$T$79)
    9918                      .dwattr $C$DW$1045, DW_AT_name("targetProc")
    9919                      .dwattr $C$DW$1045, DW_AT_TI_symbol_name("_targetProc")
    9920                      .dwattr $C$DW$1045, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9921                      .dwattr $C$DW$1045, DW_AT_accessibility(DW_ACCESS_public)
    9922              
    9923              $C$DW$1046      .dwtag  DW_TAG_member
    9924                      .dwattr $C$DW$1046, DW_AT_type(*$C$DW$T$26)
    9925                      .dwattr $C$DW$1046, DW_AT_name("major")
    9926                      .dwattr $C$DW$1046, DW_AT_TI_symbol_name("_major")
    9927                      .dwattr $C$DW$1046, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9928                      .dwattr $C$DW$1046, DW_AT_accessibility(DW_ACCESS_public)
    9929              
    9930              $C$DW$1047      .dwtag  DW_TAG_member
    9931                      .dwattr $C$DW$1047, DW_AT_type(*$C$DW$T$26)
    9932                      .dwattr $C$DW$1047, DW_AT_name("minor")
    9933                      .dwattr $C$DW$1047, DW_AT_TI_symbol_name("_minor")
    9934                      .dwattr $C$DW$1047, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9935                      .dwattr $C$DW$1047, DW_AT_accessibility(DW_ACCESS_public)
    9936              
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:39 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6B48A69E-CD12-47CE-9AB2-8A4B9A5994C6} PAGE  194

    9937                      .dwendtag $C$DW$T$80
    9938              
    9939              $C$DW$T$42      .dwtag  DW_TAG_typedef
    9940                      .dwattr $C$DW$T$42, DW_AT_name("CTRL_Version")
    9941                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$80)
    9942                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    9943              
    9944              $C$DW$T$259     .dwtag  DW_TAG_pointer_type
    9945                      .dwattr $C$DW$T$259, DW_AT_type(*$C$DW$T$42)
    9946                      .dwattr $C$DW$T$259, DW_AT_address_class(0x20)
    9947              
    9948              
    9949              $C$DW$T$87      .dwtag  DW_TAG_structure_type
    9950                      .dwattr $C$DW$T$87, DW_AT_name("_DRV8301_Obj_")
    9951                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x08)
    9952              $C$DW$1048      .dwtag  DW_TAG_member
    9953                      .dwattr $C$DW$1048, DW_AT_type(*$C$DW$T$82)
    9954                      .dwattr $C$DW$1048, DW_AT_name("spiHandle")
    9955                      .dwattr $C$DW$1048, DW_AT_TI_symbol_name("_spiHandle")
    9956                      .dwattr $C$DW$1048, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9957                      .dwattr $C$DW$1048, DW_AT_accessibility(DW_ACCESS_public)
    9958              
    9959              $C$DW$1049      .dwtag  DW_TAG_member
    9960                      .dwattr $C$DW$1049, DW_AT_type(*$C$DW$T$84)
    9961                      .dwattr $C$DW$1049, DW_AT_name("gpioHandle")
    9962                      .dwattr $C$DW$1049, DW_AT_TI_symbol_name("_gpioHandle")
    9963                      .dwattr $C$DW$1049, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9964                      .dwattr $C$DW$1049, DW_AT_accessibility(DW_ACCESS_public)
    9965              
    9966              $C$DW$1050      .dwtag  DW_TAG_member
    9967                      .dwattr $C$DW$1050, DW_AT_type(*$C$DW$T$86)
    9968                      .dwattr $C$DW$1050, DW_AT_name("gpioNumber")
    9969                      .dwattr $C$DW$1050, DW_AT_TI_symbol_name("_gpioNumber")
    9970                      .dwattr $C$DW$1050, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9971                      .dwattr $C$DW$1050, DW_AT_accessibility(DW_ACCESS_public)
    9972              
    9973              $C$DW$1051      .dwtag  DW_TAG_member
    9974                      .dwattr $C$DW$1051, DW_AT_type(*$C$DW$T$76)
    9975                      .dwattr $C$DW$1051, DW_AT_name("RxTimeOut")
    9976                      .dwattr $C$DW$1051, DW_AT_TI_symbol_name("_RxTimeOut")
    9977                      .dwattr $C$DW$1051, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9978                      .dwattr $C$DW$1051, DW_AT_accessibility(DW_ACCESS_public)
    9979              
    9980              $C$DW$1052      .dwtag  DW_TAG_member
    9981                      .dwattr $C$DW$1052, DW_AT_type(*$C$DW$T$76)
    9982                      .dwattr $C$DW$1052, DW_AT_name("enableTimeOut")
    9983                      .dwattr $C$DW$1052, DW_AT_TI_symbol_name("_enableTimeOut")
    9984                      .dwattr $C$DW$1052, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9985                      .dwattr $C$DW$1052, DW_AT_accessibility(DW_ACCESS_public)
    9986              
    9987                      .dwendtag $C$DW$T$87
    9988              
    9989              $C$DW$T$156     .dwtag  DW_TAG_typedef
    9990                      .dwattr $C$DW$T$156, DW_AT_name("DRV8301_Obj")
    9991                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$87)
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:39 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6B48A69E-CD12-47CE-9AB2-8A4B9A5994C6} PAGE  195

    9992                      .dwattr $C$DW$T$156, DW_AT_language(DW_LANG_C)
    9993              
    9994              $C$DW$T$154     .dwtag  DW_TAG_pointer_type
    9995                      .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$87)
    9996                      .dwattr $C$DW$T$154, DW_AT_address_class(0x20)
    9997              
    9998              $C$DW$T$155     .dwtag  DW_TAG_typedef
    9999                      .dwattr $C$DW$T$155, DW_AT_name("DRV8301_Handle")
   10000                      .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$154)
   10001                      .dwattr $C$DW$T$155, DW_AT_language(DW_LANG_C)
   10002              
   10003              
   10004              $C$DW$T$98      .dwtag  DW_TAG_structure_type
   10005                      .dwattr $C$DW$T$98, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
   10006                      .dwattr $C$DW$T$98, DW_AT_byte_size(0x05)
   10007              $C$DW$1053      .dwtag  DW_TAG_member
   10008                      .dwattr $C$DW$1053, DW_AT_type(*$C$DW$T$89)
   10009                      .dwattr $C$DW$1053, DW_AT_name("DRV8301_CURRENT")
   10010                      .dwattr $C$DW$1053, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
   10011                      .dwattr $C$DW$1053, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10012                      .dwattr $C$DW$1053, DW_AT_accessibility(DW_ACCESS_public)
   10013              
   10014              $C$DW$1054      .dwtag  DW_TAG_member
   10015                      .dwattr $C$DW$1054, DW_AT_type(*$C$DW$T$91)
   10016                      .dwattr $C$DW$1054, DW_AT_name("DRV8301_RESET")
   10017                      .dwattr $C$DW$1054, DW_AT_TI_symbol_name("_DRV8301_RESET")
   10018                      .dwattr $C$DW$1054, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10019                      .dwattr $C$DW$1054, DW_AT_accessibility(DW_ACCESS_public)
   10020              
   10021              $C$DW$1055      .dwtag  DW_TAG_member
   10022                      .dwattr $C$DW$1055, DW_AT_type(*$C$DW$T$93)
   10023                      .dwattr $C$DW$1055, DW_AT_name("PWM_MODE")
   10024                      .dwattr $C$DW$1055, DW_AT_TI_symbol_name("_PWM_MODE")
   10025                      .dwattr $C$DW$1055, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10026                      .dwattr $C$DW$1055, DW_AT_accessibility(DW_ACCESS_public)
   10027              
   10028              $C$DW$1056      .dwtag  DW_TAG_member
   10029                      .dwattr $C$DW$1056, DW_AT_type(*$C$DW$T$95)
   10030                      .dwattr $C$DW$1056, DW_AT_name("OC_MODE")
   10031                      .dwattr $C$DW$1056, DW_AT_TI_symbol_name("_OC_MODE")
   10032                      .dwattr $C$DW$1056, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10033                      .dwattr $C$DW$1056, DW_AT_accessibility(DW_ACCESS_public)
   10034              
   10035              $C$DW$1057      .dwtag  DW_TAG_member
   10036                      .dwattr $C$DW$1057, DW_AT_type(*$C$DW$T$97)
   10037                      .dwattr $C$DW$1057, DW_AT_name("OC_ADJ_SET")
   10038                      .dwattr $C$DW$1057, DW_AT_TI_symbol_name("_OC_ADJ_SET")
   10039                      .dwattr $C$DW$1057, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10040                      .dwattr $C$DW$1057, DW_AT_accessibility(DW_ACCESS_public)
   10041              
   10042                      .dwendtag $C$DW$T$98
   10043              
   10044              $C$DW$T$112     .dwtag  DW_TAG_typedef
   10045                      .dwattr $C$DW$T$112, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
   10046                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$98)
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:39 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6B48A69E-CD12-47CE-9AB2-8A4B9A5994C6} PAGE  196

   10047                      .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
   10048              
   10049              
   10050              $C$DW$T$107     .dwtag  DW_TAG_structure_type
   10051                      .dwattr $C$DW$T$107, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
   10052                      .dwattr $C$DW$T$107, DW_AT_byte_size(0x04)
   10053              $C$DW$1058      .dwtag  DW_TAG_member
   10054                      .dwattr $C$DW$1058, DW_AT_type(*$C$DW$T$100)
   10055                      .dwattr $C$DW$1058, DW_AT_name("OCTW_SET")
   10056                      .dwattr $C$DW$1058, DW_AT_TI_symbol_name("_OCTW_SET")
   10057                      .dwattr $C$DW$1058, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10058                      .dwattr $C$DW$1058, DW_AT_accessibility(DW_ACCESS_public)
   10059              
   10060              $C$DW$1059      .dwtag  DW_TAG_member
   10061                      .dwattr $C$DW$1059, DW_AT_type(*$C$DW$T$102)
   10062                      .dwattr $C$DW$1059, DW_AT_name("GAIN")
   10063                      .dwattr $C$DW$1059, DW_AT_TI_symbol_name("_GAIN")
   10064                      .dwattr $C$DW$1059, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10065                      .dwattr $C$DW$1059, DW_AT_accessibility(DW_ACCESS_public)
   10066              
   10067              $C$DW$1060      .dwtag  DW_TAG_member
   10068                      .dwattr $C$DW$1060, DW_AT_type(*$C$DW$T$104)
   10069                      .dwattr $C$DW$1060, DW_AT_name("DC_CAL_CH1p2")
   10070                      .dwattr $C$DW$1060, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
   10071                      .dwattr $C$DW$1060, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10072                      .dwattr $C$DW$1060, DW_AT_accessibility(DW_ACCESS_public)
   10073              
   10074              $C$DW$1061      .dwtag  DW_TAG_member
   10075                      .dwattr $C$DW$1061, DW_AT_type(*$C$DW$T$106)
   10076                      .dwattr $C$DW$1061, DW_AT_name("OC_TOFF")
   10077                      .dwattr $C$DW$1061, DW_AT_TI_symbol_name("_OC_TOFF")
   10078                      .dwattr $C$DW$1061, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10079                      .dwattr $C$DW$1061, DW_AT_accessibility(DW_ACCESS_public)
   10080              
   10081                      .dwendtag $C$DW$T$107
   10082              
   10083              $C$DW$T$113     .dwtag  DW_TAG_typedef
   10084                      .dwattr $C$DW$T$113, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
   10085                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$107)
   10086                      .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
   10087              
   10088              
   10089              $C$DW$T$108     .dwtag  DW_TAG_structure_type
   10090                      .dwattr $C$DW$T$108, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
   10091                      .dwattr $C$DW$T$108, DW_AT_byte_size(0x0b)
   10092              $C$DW$1062      .dwtag  DW_TAG_member
   10093                      .dwattr $C$DW$1062, DW_AT_type(*$C$DW$T$76)
   10094                      .dwattr $C$DW$1062, DW_AT_name("FAULT")
   10095                      .dwattr $C$DW$1062, DW_AT_TI_symbol_name("_FAULT")
   10096                      .dwattr $C$DW$1062, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10097                      .dwattr $C$DW$1062, DW_AT_accessibility(DW_ACCESS_public)
   10098              
   10099              $C$DW$1063      .dwtag  DW_TAG_member
   10100                      .dwattr $C$DW$1063, DW_AT_type(*$C$DW$T$76)
   10101                      .dwattr $C$DW$1063, DW_AT_name("GVDD_UV")
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:09:39 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{6B48A69E-CD12-47CE-9AB2-8A4B9A5994C6} PAGE  197

   10102                      .dwattr $C$DW$1063, DW_AT_TI_symbol_name("_GVDD_UV")
   10103                      .dwattr $C$DW$1063, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10104                      .dwattr $C$DW$1063, DW_AT_accessibility(DW_ACCESS_public)
   10105              
   10106              $C$DW$1064      .dwtag  DW_TAG_member
   10107                      .dwattr $C$DW$1064, DW_AT_type(*$C$DW$T$76)
   10108                      .dwattr $C$DW$1064, DW_AT_name("PVDD_UV")
   10109                      .dwattr $C$DW$1064, DW_AT_TI_symbol_name("_PVDD_UV")
   10110                      .dwattr $C$DW$1064, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10111                      .dwattr $C$DW$1064, DW_AT_accessibility(DW_ACCESS_public)
   10112              
   10113              $C$DW$1065      .dwtag  DW_TAG_member
   10114                      .dwattr $C$DW$1065, DW_AT_type(*$C$DW$T$76)
   10115                      .dwattr $C$DW$1065, DW_AT_name("OTSD")
   10116                      .dwattr $C$DW$1065, DW_AT_TI_symbol_name("_OTSD")
   10117                      .dwattr $C$DW$1065, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10118                      .dwattr $C$DW$1065, DW_AT_accessibility(DW_ACCESS_public)
   10119              
   10120              $C$DW$1066      .dwtag  DW_TAG_member
   10121                      .dwattr $C$DW$1066, DW_AT_type(*$C$DW$T$76)
   10122                      .dwattr $C$DW$1066, DW_AT_name("OTW")
   10123                      .dwattr $C$DW$1066, DW_AT_TI_symbol_name("_OTW")
   10124                      .dwattr $C$DW$1066, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10125                      .dwattr $C$DW$1066, DW_AT_accessibility(DW_ACCESS_public)
   10126              
   10127              $C$DW$1067      .dwtag  DW_TAG_member
   10128                      .dwattr $C$DW$1067, DW_AT_type(*$C$DW$T$76)
   10129                      .dwattr $C$DW$1067, DW_AT_name("FETHA_OC")
   10130                      .dwattr $C$DW$1067, DW_AT_TI_symbol_name("_FETHA_OC")
   10131                      .dwattr $C$DW$1067, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10132                      .dwattr $C$DW$1067, DW_AT_accessibility(DW_ACCESS_public)
   10133              
   10134              $C$DW$1068      .dwtag  DW_TAG_member
   10135                      .dwattr $C$DW$1068, DW_AT_type(*$C$DW$T$76)
   10136                      .dwattr $C$DW$1068, DW_AT_name("FETLA_OC")
   10137                      .dwattr $C$DW$1068, DW_AT_TI_symbol_name("_FETLA_OC")
   10138                      .dwattr $C$DW$1068, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10139                      .dwattr $C$DW$1068, DW_AT_accessibility(DW_ACCESS_public)
   10140              
   10141              $C$DW$1069      .dwtag  DW_TAG_member
   10142                      .dwattr $C$DW$1069, DW_AT_type(*$C$DW$T$76)
   10143                      .dwattr $C$DW$1069, DW_AT_name("FETHB_OC")
   10144                      .dwattr $C$DW$1069, DW_AT_TI_symbol_name("_FETHB_OC")
   10145                      .dwattr $C$DW$1069, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   10146                      .dwattr $C$DW$1069, DW_AT_accessibility(DW_ACCESS_public)
   10147              
   10148              $C$DW$1070      .dwtag  DW_TAG_member
   10149                      .dwattr $C$DW$1070, DW_AT_type(*$C$DW$T$76)
   10150                      .dwattr $C$DW$1070, DW_AT_name("FETLB_OC")
   10151                      .dwattr $C$DW$1070, DW_AT_TI_symbol_name("_FETLB_OC")
   10152                      .dwattr $C$DW$1070, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10153                      .dwattr $C$DW$1070, DW_AT_accessibility(DW_ACCESS_public)
   10154              
   10155              $C$DW$1071      .dwtag  DW_TAG_member
