TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:14:25 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F103A99A-D750-42FB-8923-AD93E2502D41} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                             PC v18.12.4.LTS *
       3              ;* Date/Time created: Fri Feb 17 15:14:24 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/GIANT/GAINT_TI_instaspin/motorware/motorware_1_01_00_18/sw/solutions
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v18.12.4.LTS Copyright (c) 1996-
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\GIANT\GAINT_TI_instaspin\motorware\motorware_1_01_00_18\sw\solut
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    8592              $C$DW$884       .dwtag  DW_TAG_enumerator
    8593                      .dwattr $C$DW$884, DW_AT_name("PIE_GroupNumber_6")
    8594                      .dwattr $C$DW$884, DW_AT_const_value(0x05)
    8595              
    8596              $C$DW$885       .dwtag  DW_TAG_enumerator
    8597                      .dwattr $C$DW$885, DW_AT_name("PIE_GroupNumber_7")
    8598                      .dwattr $C$DW$885, DW_AT_const_value(0x06)
    8599              
    8600              $C$DW$886       .dwtag  DW_TAG_enumerator
    8601                      .dwattr $C$DW$886, DW_AT_name("PIE_GroupNumber_8")
    8602                      .dwattr $C$DW$886, DW_AT_const_value(0x07)
    8603              
    8604              $C$DW$887       .dwtag  DW_TAG_enumerator
    8605                      .dwattr $C$DW$887, DW_AT_name("PIE_GroupNumber_9")
    8606                      .dwattr $C$DW$887, DW_AT_const_value(0x08)
    8607              
    8608              $C$DW$888       .dwtag  DW_TAG_enumerator
    8609                      .dwattr $C$DW$888, DW_AT_name("PIE_GroupNumber_10")
    8610                      .dwattr $C$DW$888, DW_AT_const_value(0x09)
    8611              
    8612              $C$DW$889       .dwtag  DW_TAG_enumerator
    8613                      .dwattr $C$DW$889, DW_AT_name("PIE_GroupNumber_11")
    8614                      .dwattr $C$DW$889, DW_AT_const_value(0x0a)
    8615              
    8616              $C$DW$890       .dwtag  DW_TAG_enumerator
    8617                      .dwattr $C$DW$890, DW_AT_name("PIE_GroupNumber_12")
    8618                      .dwattr $C$DW$890, DW_AT_const_value(0x0b)
    8619              
    8620                      .dwendtag $C$DW$T$221
    8621              
    8622              $C$DW$T$222     .dwtag  DW_TAG_typedef
    8623                      .dwattr $C$DW$T$222, DW_AT_name("PIE_GroupNumber_e")
    8624                      .dwattr $C$DW$T$222, DW_AT_type(*$C$DW$T$221)
    8625                      .dwattr $C$DW$T$222, DW_AT_language(DW_LANG_C)
    8626              
    8627              
    8628              $C$DW$T$224     .dwtag  DW_TAG_enumeration_type
    8629                      .dwattr $C$DW$T$224, DW_AT_byte_size(0x01)
    8630              $C$DW$891       .dwtag  DW_TAG_enumerator
    8631                      .dwattr $C$DW$891, DW_AT_name("CTRL_Type_PID_spd")
    8632                      .dwattr $C$DW$891, DW_AT_const_value(0x00)
    8633              
    8634              $C$DW$892       .dwtag  DW_TAG_enumerator
    8635                      .dwattr $C$DW$892, DW_AT_name("CTRL_Type_PID_Id")
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:14:25 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F103A99A-D750-42FB-8923-AD93E2502D41} PAGE  170

    8636                      .dwattr $C$DW$892, DW_AT_const_value(0x01)
    8637              
    8638              $C$DW$893       .dwtag  DW_TAG_enumerator
    8639                      .dwattr $C$DW$893, DW_AT_name("CTRL_Type_PID_Iq")
    8640                      .dwattr $C$DW$893, DW_AT_const_value(0x02)
    8641              
    8642                      .dwendtag $C$DW$T$224
    8643              
    8644              $C$DW$T$225     .dwtag  DW_TAG_typedef
    8645                      .dwattr $C$DW$T$225, DW_AT_name("CTRL_Type_e")
    8646                      .dwattr $C$DW$T$225, DW_AT_type(*$C$DW$T$224)
    8647                      .dwattr $C$DW$T$225, DW_AT_language(DW_LANG_C)
    8648              
    8649              
    8650              $C$DW$T$227     .dwtag  DW_TAG_enumeration_type
    8651                      .dwattr $C$DW$T$227, DW_AT_byte_size(0x01)
    8652              $C$DW$894       .dwtag  DW_TAG_enumerator
    8653                      .dwattr $C$DW$894, DW_AT_name("HAL_SensorType_Current")
    8654                      .dwattr $C$DW$894, DW_AT_const_value(0x00)
    8655              
    8656              $C$DW$895       .dwtag  DW_TAG_enumerator
    8657                      .dwattr $C$DW$895, DW_AT_name("HAL_SensorType_Voltage")
    8658                      .dwattr $C$DW$895, DW_AT_const_value(0x01)
    8659              
    8660                      .dwendtag $C$DW$T$227
    8661              
    8662              $C$DW$T$228     .dwtag  DW_TAG_typedef
    8663                      .dwattr $C$DW$T$228, DW_AT_name("HAL_SensorType_e")
    8664                      .dwattr $C$DW$T$228, DW_AT_type(*$C$DW$T$227)
    8665                      .dwattr $C$DW$T$228, DW_AT_language(DW_LANG_C)
    8666              
    8667              
    8668              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    8669                      .dwattr $C$DW$T$19, DW_AT_name("IPD_HFI_Obj")
    8670                      .dwattr $C$DW$T$19, DW_AT_declaration
    8671                      .dwendtag $C$DW$T$19
    8672              
    8673              $C$DW$T$230     .dwtag  DW_TAG_pointer_type
    8674                      .dwattr $C$DW$T$230, DW_AT_type(*$C$DW$T$19)
    8675                      .dwattr $C$DW$T$230, DW_AT_address_class(0x20)
    8676              
    8677              $C$DW$T$231     .dwtag  DW_TAG_typedef
    8678                      .dwattr $C$DW$T$231, DW_AT_name("IPD_HFI_Handle")
    8679                      .dwattr $C$DW$T$231, DW_AT_type(*$C$DW$T$230)
    8680                      .dwattr $C$DW$T$231, DW_AT_language(DW_LANG_C)
    8681              
    8682              
    8683              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    8684                      .dwattr $C$DW$T$34, DW_AT_name("_ADC_Obj_")
    8685                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x6650)
    8686              $C$DW$896       .dwtag  DW_TAG_member
    8687                      .dwattr $C$DW$896, DW_AT_type(*$C$DW$T$28)
    8688                      .dwattr $C$DW$896, DW_AT_name("ADCRESULT")
    8689                      .dwattr $C$DW$896, DW_AT_TI_symbol_name("_ADCRESULT")
    8690                      .dwattr $C$DW$896, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:14:25 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F103A99A-D750-42FB-8923-AD93E2502D41} PAGE  171

    8691                      .dwattr $C$DW$896, DW_AT_accessibility(DW_ACCESS_public)
    8692              
    8693              $C$DW$897       .dwtag  DW_TAG_member
    8694                      .dwattr $C$DW$897, DW_AT_type(*$C$DW$T$29)
    8695                      .dwattr $C$DW$897, DW_AT_name("resvd_1")
    8696                      .dwattr $C$DW$897, DW_AT_TI_symbol_name("_resvd_1")
    8697                      .dwattr $C$DW$897, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8698                      .dwattr $C$DW$897, DW_AT_accessibility(DW_ACCESS_public)
    8699              
    8700              $C$DW$898       .dwtag  DW_TAG_member
    8701                      .dwattr $C$DW$898, DW_AT_type(*$C$DW$T$27)
    8702                      .dwattr $C$DW$898, DW_AT_name("ADCCTL1")
    8703                      .dwattr $C$DW$898, DW_AT_TI_symbol_name("_ADCCTL1")
    8704                      .dwattr $C$DW$898, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    8705                      .dwattr $C$DW$898, DW_AT_accessibility(DW_ACCESS_public)
    8706              
    8707              $C$DW$899       .dwtag  DW_TAG_member
    8708                      .dwattr $C$DW$899, DW_AT_type(*$C$DW$T$27)
    8709                      .dwattr $C$DW$899, DW_AT_name("ADCCTL2")
    8710                      .dwattr $C$DW$899, DW_AT_TI_symbol_name("_ADCCTL2")
    8711                      .dwattr $C$DW$899, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    8712                      .dwattr $C$DW$899, DW_AT_accessibility(DW_ACCESS_public)
    8713              
    8714              $C$DW$900       .dwtag  DW_TAG_member
    8715                      .dwattr $C$DW$900, DW_AT_type(*$C$DW$T$30)
    8716                      .dwattr $C$DW$900, DW_AT_name("rsvd_2")
    8717                      .dwattr $C$DW$900, DW_AT_TI_symbol_name("_rsvd_2")
    8718                      .dwattr $C$DW$900, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    8719                      .dwattr $C$DW$900, DW_AT_accessibility(DW_ACCESS_public)
    8720              
    8721              $C$DW$901       .dwtag  DW_TAG_member
    8722                      .dwattr $C$DW$901, DW_AT_type(*$C$DW$T$27)
    8723                      .dwattr $C$DW$901, DW_AT_name("ADCINTFLG")
    8724                      .dwattr $C$DW$901, DW_AT_TI_symbol_name("_ADCINTFLG")
    8725                      .dwattr $C$DW$901, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    8726                      .dwattr $C$DW$901, DW_AT_accessibility(DW_ACCESS_public)
    8727              
    8728              $C$DW$902       .dwtag  DW_TAG_member
    8729                      .dwattr $C$DW$902, DW_AT_type(*$C$DW$T$27)
    8730                      .dwattr $C$DW$902, DW_AT_name("ADCINTFLGCLR")
    8731                      .dwattr $C$DW$902, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    8732                      .dwattr $C$DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    8733                      .dwattr $C$DW$902, DW_AT_accessibility(DW_ACCESS_public)
    8734              
    8735              $C$DW$903       .dwtag  DW_TAG_member
    8736                      .dwattr $C$DW$903, DW_AT_type(*$C$DW$T$27)
    8737                      .dwattr $C$DW$903, DW_AT_name("ADCINTOVF")
    8738                      .dwattr $C$DW$903, DW_AT_TI_symbol_name("_ADCINTOVF")
    8739                      .dwattr $C$DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    8740                      .dwattr $C$DW$903, DW_AT_accessibility(DW_ACCESS_public)
    8741              
    8742              $C$DW$904       .dwtag  DW_TAG_member
    8743                      .dwattr $C$DW$904, DW_AT_type(*$C$DW$T$27)
    8744                      .dwattr $C$DW$904, DW_AT_name("ADCINTOVFCLR")
    8745                      .dwattr $C$DW$904, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:14:25 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F103A99A-D750-42FB-8923-AD93E2502D41} PAGE  172

    8746                      .dwattr $C$DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    8747                      .dwattr $C$DW$904, DW_AT_accessibility(DW_ACCESS_public)
    8748              
    8749              $C$DW$905       .dwtag  DW_TAG_member
    8750                      .dwattr $C$DW$905, DW_AT_type(*$C$DW$T$31)
    8751                      .dwattr $C$DW$905, DW_AT_name("INTSELxNy")
    8752                      .dwattr $C$DW$905, DW_AT_TI_symbol_name("_INTSELxNy")
    8753                      .dwattr $C$DW$905, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    8754                      .dwattr $C$DW$905, DW_AT_accessibility(DW_ACCESS_public)
    8755              
    8756              $C$DW$906       .dwtag  DW_TAG_member
    8757                      .dwattr $C$DW$906, DW_AT_type(*$C$DW$T$32)
    8758                      .dwattr $C$DW$906, DW_AT_name("rsvd_3")
    8759                      .dwattr $C$DW$906, DW_AT_TI_symbol_name("_rsvd_3")
    8760                      .dwattr $C$DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    8761                      .dwattr $C$DW$906, DW_AT_accessibility(DW_ACCESS_public)
    8762              
    8763              $C$DW$907       .dwtag  DW_TAG_member
    8764                      .dwattr $C$DW$907, DW_AT_type(*$C$DW$T$27)
    8765                      .dwattr $C$DW$907, DW_AT_name("SOCPRICTRL")
    8766                      .dwattr $C$DW$907, DW_AT_TI_symbol_name("_SOCPRICTRL")
    8767                      .dwattr $C$DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    8768                      .dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
    8769              
    8770              $C$DW$908       .dwtag  DW_TAG_member
    8771                      .dwattr $C$DW$908, DW_AT_type(*$C$DW$T$27)
    8772                      .dwattr $C$DW$908, DW_AT_name("rsvd_4")
    8773                      .dwattr $C$DW$908, DW_AT_TI_symbol_name("_rsvd_4")
    8774                      .dwattr $C$DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    8775                      .dwattr $C$DW$908, DW_AT_accessibility(DW_ACCESS_public)
    8776              
    8777              $C$DW$909       .dwtag  DW_TAG_member
    8778                      .dwattr $C$DW$909, DW_AT_type(*$C$DW$T$27)
    8779                      .dwattr $C$DW$909, DW_AT_name("ADCSAMPLEMODE")
    8780                      .dwattr $C$DW$909, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    8781                      .dwattr $C$DW$909, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    8782                      .dwattr $C$DW$909, DW_AT_accessibility(DW_ACCESS_public)
    8783              
    8784              $C$DW$910       .dwtag  DW_TAG_member
    8785                      .dwattr $C$DW$910, DW_AT_type(*$C$DW$T$27)
    8786                      .dwattr $C$DW$910, DW_AT_name("rsvd_5")
    8787                      .dwattr $C$DW$910, DW_AT_TI_symbol_name("_rsvd_5")
    8788                      .dwattr $C$DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    8789                      .dwattr $C$DW$910, DW_AT_accessibility(DW_ACCESS_public)
    8790              
    8791              $C$DW$911       .dwtag  DW_TAG_member
    8792                      .dwattr $C$DW$911, DW_AT_type(*$C$DW$T$27)
    8793                      .dwattr $C$DW$911, DW_AT_name("ADCINTSOCSEL1")
    8794                      .dwattr $C$DW$911, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    8795                      .dwattr $C$DW$911, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    8796                      .dwattr $C$DW$911, DW_AT_accessibility(DW_ACCESS_public)
    8797              
    8798              $C$DW$912       .dwtag  DW_TAG_member
    8799                      .dwattr $C$DW$912, DW_AT_type(*$C$DW$T$27)
    8800                      .dwattr $C$DW$912, DW_AT_name("ADCINTSOCSEL2")
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:14:25 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F103A99A-D750-42FB-8923-AD93E2502D41} PAGE  173

    8801                      .dwattr $C$DW$912, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    8802                      .dwattr $C$DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    8803                      .dwattr $C$DW$912, DW_AT_accessibility(DW_ACCESS_public)
    8804              
    8805              $C$DW$913       .dwtag  DW_TAG_member
    8806                      .dwattr $C$DW$913, DW_AT_type(*$C$DW$T$30)
    8807                      .dwattr $C$DW$913, DW_AT_name("rsvd_6")
    8808                      .dwattr $C$DW$913, DW_AT_TI_symbol_name("_rsvd_6")
    8809                      .dwattr $C$DW$913, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    8810                      .dwattr $C$DW$913, DW_AT_accessibility(DW_ACCESS_public)
    8811              
    8812              $C$DW$914       .dwtag  DW_TAG_member
    8813                      .dwattr $C$DW$914, DW_AT_type(*$C$DW$T$27)
    8814                      .dwattr $C$DW$914, DW_AT_name("ADCSOCFLG1")
    8815                      .dwattr $C$DW$914, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    8816                      .dwattr $C$DW$914, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    8817                      .dwattr $C$DW$914, DW_AT_accessibility(DW_ACCESS_public)
    8818              
    8819              $C$DW$915       .dwtag  DW_TAG_member
    8820                      .dwattr $C$DW$915, DW_AT_type(*$C$DW$T$27)
    8821                      .dwattr $C$DW$915, DW_AT_name("rsvd_7")
    8822                      .dwattr $C$DW$915, DW_AT_TI_symbol_name("_rsvd_7")
    8823                      .dwattr $C$DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    8824                      .dwattr $C$DW$915, DW_AT_accessibility(DW_ACCESS_public)
    8825              
    8826              $C$DW$916       .dwtag  DW_TAG_member
    8827                      .dwattr $C$DW$916, DW_AT_type(*$C$DW$T$27)
    8828                      .dwattr $C$DW$916, DW_AT_name("ADCSOCFRC1")
    8829                      .dwattr $C$DW$916, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    8830                      .dwattr $C$DW$916, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    8831                      .dwattr $C$DW$916, DW_AT_accessibility(DW_ACCESS_public)
    8832              
    8833              $C$DW$917       .dwtag  DW_TAG_member
    8834                      .dwattr $C$DW$917, DW_AT_type(*$C$DW$T$27)
    8835                      .dwattr $C$DW$917, DW_AT_name("rsvd_8")
    8836                      .dwattr $C$DW$917, DW_AT_TI_symbol_name("_rsvd_8")
    8837                      .dwattr $C$DW$917, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    8838                      .dwattr $C$DW$917, DW_AT_accessibility(DW_ACCESS_public)
    8839              
    8840              $C$DW$918       .dwtag  DW_TAG_member
    8841                      .dwattr $C$DW$918, DW_AT_type(*$C$DW$T$27)
    8842                      .dwattr $C$DW$918, DW_AT_name("ADCSOCOVF1")
    8843                      .dwattr $C$DW$918, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    8844                      .dwattr $C$DW$918, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    8845                      .dwattr $C$DW$918, DW_AT_accessibility(DW_ACCESS_public)
    8846              
    8847              $C$DW$919       .dwtag  DW_TAG_member
    8848                      .dwattr $C$DW$919, DW_AT_type(*$C$DW$T$27)
    8849                      .dwattr $C$DW$919, DW_AT_name("rsvd_9")
    8850                      .dwattr $C$DW$919, DW_AT_TI_symbol_name("_rsvd_9")
    8851                      .dwattr $C$DW$919, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    8852                      .dwattr $C$DW$919, DW_AT_accessibility(DW_ACCESS_public)
    8853              
    8854              $C$DW$920       .dwtag  DW_TAG_member
    8855                      .dwattr $C$DW$920, DW_AT_type(*$C$DW$T$27)
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:14:25 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F103A99A-D750-42FB-8923-AD93E2502D41} PAGE  174

    8856                      .dwattr $C$DW$920, DW_AT_name("ADCSOCOVFCLR1")
    8857                      .dwattr $C$DW$920, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    8858                      .dwattr $C$DW$920, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    8859                      .dwattr $C$DW$920, DW_AT_accessibility(DW_ACCESS_public)
    8860              
    8861              $C$DW$921       .dwtag  DW_TAG_member
    8862                      .dwattr $C$DW$921, DW_AT_type(*$C$DW$T$27)
    8863                      .dwattr $C$DW$921, DW_AT_name("rsvd_10")
    8864                      .dwattr $C$DW$921, DW_AT_TI_symbol_name("_rsvd_10")
    8865                      .dwattr $C$DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    8866                      .dwattr $C$DW$921, DW_AT_accessibility(DW_ACCESS_public)
    8867              
    8868              $C$DW$922       .dwtag  DW_TAG_member
    8869                      .dwattr $C$DW$922, DW_AT_type(*$C$DW$T$28)
    8870                      .dwattr $C$DW$922, DW_AT_name("ADCSOCxCTL")
    8871                      .dwattr $C$DW$922, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    8872                      .dwattr $C$DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    8873                      .dwattr $C$DW$922, DW_AT_accessibility(DW_ACCESS_public)
    8874              
    8875              $C$DW$923       .dwtag  DW_TAG_member
    8876                      .dwattr $C$DW$923, DW_AT_type(*$C$DW$T$28)
    8877                      .dwattr $C$DW$923, DW_AT_name("rsvd_11")
    8878                      .dwattr $C$DW$923, DW_AT_TI_symbol_name("_rsvd_11")
    8879                      .dwattr $C$DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    8880                      .dwattr $C$DW$923, DW_AT_accessibility(DW_ACCESS_public)
    8881              
    8882              $C$DW$924       .dwtag  DW_TAG_member
    8883                      .dwattr $C$DW$924, DW_AT_type(*$C$DW$T$27)
    8884                      .dwattr $C$DW$924, DW_AT_name("ADCREFTRIM")
    8885                      .dwattr $C$DW$924, DW_AT_TI_symbol_name("_ADCREFTRIM")
    8886                      .dwattr $C$DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    8887                      .dwattr $C$DW$924, DW_AT_accessibility(DW_ACCESS_public)
    8888              
    8889              $C$DW$925       .dwtag  DW_TAG_member
    8890                      .dwattr $C$DW$925, DW_AT_type(*$C$DW$T$27)
    8891                      .dwattr $C$DW$925, DW_AT_name("ADCOFFTRIM")
    8892                      .dwattr $C$DW$925, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    8893                      .dwattr $C$DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    8894                      .dwattr $C$DW$925, DW_AT_accessibility(DW_ACCESS_public)
    8895              
    8896              $C$DW$926       .dwtag  DW_TAG_member
    8897                      .dwattr $C$DW$926, DW_AT_type(*$C$DW$T$33)
    8898                      .dwattr $C$DW$926, DW_AT_name("resvd_12")
    8899                      .dwattr $C$DW$926, DW_AT_TI_symbol_name("_resvd_12")
    8900                      .dwattr $C$DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    8901                      .dwattr $C$DW$926, DW_AT_accessibility(DW_ACCESS_public)
    8902              
    8903              $C$DW$927       .dwtag  DW_TAG_member
    8904                      .dwattr $C$DW$927, DW_AT_type(*$C$DW$T$27)
    8905                      .dwattr $C$DW$927, DW_AT_name("ADCREV")
    8906                      .dwattr $C$DW$927, DW_AT_TI_symbol_name("_ADCREV")
    8907                      .dwattr $C$DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    8908                      .dwattr $C$DW$927, DW_AT_accessibility(DW_ACCESS_public)
    8909              
    8910                      .dwendtag $C$DW$T$34
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:14:25 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F103A99A-D750-42FB-8923-AD93E2502D41} PAGE  175

    8911              
    8912              $C$DW$T$235     .dwtag  DW_TAG_typedef
    8913                      .dwattr $C$DW$T$235, DW_AT_name("ADC_Obj")
    8914                      .dwattr $C$DW$T$235, DW_AT_type(*$C$DW$T$34)
    8915                      .dwattr $C$DW$T$235, DW_AT_language(DW_LANG_C)
    8916              
    8917              $C$DW$T$124     .dwtag  DW_TAG_pointer_type
    8918                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$34)
    8919                      .dwattr $C$DW$T$124, DW_AT_address_class(0x20)
    8920              
    8921              $C$DW$T$125     .dwtag  DW_TAG_typedef
    8922                      .dwattr $C$DW$T$125, DW_AT_name("ADC_Handle")
    8923                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
    8924                      .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    8925              
    8926              
    8927              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    8928                      .dwattr $C$DW$T$20, DW_AT_name("_AFSEL_Obj_")
    8929                      .dwattr $C$DW$T$20, DW_AT_declaration
    8930                      .dwendtag $C$DW$T$20
    8931              
    8932              $C$DW$T$236     .dwtag  DW_TAG_pointer_type
    8933                      .dwattr $C$DW$T$236, DW_AT_type(*$C$DW$T$20)
    8934                      .dwattr $C$DW$T$236, DW_AT_address_class(0x20)
    8935              
    8936              $C$DW$T$237     .dwtag  DW_TAG_typedef
    8937                      .dwattr $C$DW$T$237, DW_AT_name("AFSEL_Handle")
    8938                      .dwattr $C$DW$T$237, DW_AT_type(*$C$DW$T$236)
    8939                      .dwattr $C$DW$T$237, DW_AT_language(DW_LANG_C)
    8940              
    8941              
    8942              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    8943                      .dwattr $C$DW$T$38, DW_AT_name("_CLARKE_Obj_")
    8944                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x06)
    8945              $C$DW$928       .dwtag  DW_TAG_member
    8946                      .dwattr $C$DW$928, DW_AT_type(*$C$DW$T$35)
    8947                      .dwattr $C$DW$928, DW_AT_name("alpha_sf")
    8948                      .dwattr $C$DW$928, DW_AT_TI_symbol_name("_alpha_sf")
    8949                      .dwattr $C$DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8950                      .dwattr $C$DW$928, DW_AT_accessibility(DW_ACCESS_public)
    8951              
    8952              $C$DW$929       .dwtag  DW_TAG_member
    8953                      .dwattr $C$DW$929, DW_AT_type(*$C$DW$T$35)
    8954                      .dwattr $C$DW$929, DW_AT_name("beta_sf")
    8955                      .dwattr $C$DW$929, DW_AT_TI_symbol_name("_beta_sf")
    8956                      .dwattr $C$DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8957                      .dwattr $C$DW$929, DW_AT_accessibility(DW_ACCESS_public)
    8958              
    8959              $C$DW$930       .dwtag  DW_TAG_member
    8960                      .dwattr $C$DW$930, DW_AT_type(*$C$DW$T$37)
    8961                      .dwattr $C$DW$930, DW_AT_name("numSensors")
    8962                      .dwattr $C$DW$930, DW_AT_TI_symbol_name("_numSensors")
    8963                      .dwattr $C$DW$930, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8964                      .dwattr $C$DW$930, DW_AT_accessibility(DW_ACCESS_public)
    8965              
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:14:25 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F103A99A-D750-42FB-8923-AD93E2502D41} PAGE  176

    8966                      .dwendtag $C$DW$T$38
    8967              
    8968              $C$DW$T$49      .dwtag  DW_TAG_typedef
    8969                      .dwattr $C$DW$T$49, DW_AT_name("CLARKE_Obj")
    8970                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$38)
    8971                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    8972              
    8973              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    8974                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$38)
    8975                      .dwattr $C$DW$T$47, DW_AT_address_class(0x20)
    8976              
    8977              $C$DW$T$48      .dwtag  DW_TAG_typedef
    8978                      .dwattr $C$DW$T$48, DW_AT_name("CLARKE_Handle")
    8979                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    8980                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    8981              
    8982              $C$DW$931       .dwtag  DW_TAG_TI_far_type
    8983                      .dwattr $C$DW$931, DW_AT_type(*$C$DW$T$48)
    8984              
    8985              $C$DW$T$241     .dwtag  DW_TAG_const_type
    8986                      .dwattr $C$DW$T$241, DW_AT_type(*$C$DW$931)
    8987              
    8988              
    8989              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    8990                      .dwattr $C$DW$T$40, DW_AT_name("_CLK_Obj_")
    8991                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x11)
    8992              $C$DW$932       .dwtag  DW_TAG_member
    8993                      .dwattr $C$DW$932, DW_AT_type(*$C$DW$T$27)
    8994                      .dwattr $C$DW$932, DW_AT_name("XCLK")
    8995                      .dwattr $C$DW$932, DW_AT_TI_symbol_name("_XCLK")
    8996                      .dwattr $C$DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8997                      .dwattr $C$DW$932, DW_AT_accessibility(DW_ACCESS_public)
    8998              
    8999              $C$DW$933       .dwtag  DW_TAG_member
    9000                      .dwattr $C$DW$933, DW_AT_type(*$C$DW$T$27)
    9001                      .dwattr $C$DW$933, DW_AT_name("rsvd_1")
    9002                      .dwattr $C$DW$933, DW_AT_TI_symbol_name("_rsvd_1")
    9003                      .dwattr $C$DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9004                      .dwattr $C$DW$933, DW_AT_accessibility(DW_ACCESS_public)
    9005              
    9006              $C$DW$934       .dwtag  DW_TAG_member
    9007                      .dwattr $C$DW$934, DW_AT_type(*$C$DW$T$27)
    9008                      .dwattr $C$DW$934, DW_AT_name("CLKCTL")
    9009                      .dwattr $C$DW$934, DW_AT_TI_symbol_name("_CLKCTL")
    9010                      .dwattr $C$DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9011                      .dwattr $C$DW$934, DW_AT_accessibility(DW_ACCESS_public)
    9012              
    9013              $C$DW$935       .dwtag  DW_TAG_member
    9014                      .dwattr $C$DW$935, DW_AT_type(*$C$DW$T$39)
    9015                      .dwattr $C$DW$935, DW_AT_name("rsvd_2")
    9016                      .dwattr $C$DW$935, DW_AT_TI_symbol_name("_rsvd_2")
    9017                      .dwattr $C$DW$935, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9018                      .dwattr $C$DW$935, DW_AT_accessibility(DW_ACCESS_public)
    9019              
    9020              $C$DW$936       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:14:25 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F103A99A-D750-42FB-8923-AD93E2502D41} PAGE  177

    9021                      .dwattr $C$DW$936, DW_AT_type(*$C$DW$T$27)
    9022                      .dwattr $C$DW$936, DW_AT_name("LOSPCP")
    9023                      .dwattr $C$DW$936, DW_AT_TI_symbol_name("_LOSPCP")
    9024                      .dwattr $C$DW$936, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    9025                      .dwattr $C$DW$936, DW_AT_accessibility(DW_ACCESS_public)
    9026              
    9027              $C$DW$937       .dwtag  DW_TAG_member
    9028                      .dwattr $C$DW$937, DW_AT_type(*$C$DW$T$27)
    9029                      .dwattr $C$DW$937, DW_AT_name("PCLKCR0")
    9030                      .dwattr $C$DW$937, DW_AT_TI_symbol_name("_PCLKCR0")
    9031                      .dwattr $C$DW$937, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9032                      .dwattr $C$DW$937, DW_AT_accessibility(DW_ACCESS_public)
    9033              
    9034              $C$DW$938       .dwtag  DW_TAG_member
    9035                      .dwattr $C$DW$938, DW_AT_type(*$C$DW$T$27)
    9036                      .dwattr $C$DW$938, DW_AT_name("PCLKCR1")
    9037                      .dwattr $C$DW$938, DW_AT_TI_symbol_name("_PCLKCR1")
    9038                      .dwattr $C$DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    9039                      .dwattr $C$DW$938, DW_AT_accessibility(DW_ACCESS_public)
    9040              
    9041              $C$DW$939       .dwtag  DW_TAG_member
    9042                      .dwattr $C$DW$939, DW_AT_type(*$C$DW$T$30)
    9043                      .dwattr $C$DW$939, DW_AT_name("rsvd_3")
    9044                      .dwattr $C$DW$939, DW_AT_TI_symbol_name("_rsvd_3")
    9045                      .dwattr $C$DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9046                      .dwattr $C$DW$939, DW_AT_accessibility(DW_ACCESS_public)
    9047              
    9048              $C$DW$940       .dwtag  DW_TAG_member
    9049                      .dwattr $C$DW$940, DW_AT_type(*$C$DW$T$27)
    9050                      .dwattr $C$DW$940, DW_AT_name("PCLKCR3")
    9051                      .dwattr $C$DW$940, DW_AT_TI_symbol_name("_PCLKCR3")
    9052                      .dwattr $C$DW$940, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9053                      .dwattr $C$DW$940, DW_AT_accessibility(DW_ACCESS_public)
    9054              
    9055                      .dwendtag $C$DW$T$40
    9056              
    9057              $C$DW$T$126     .dwtag  DW_TAG_pointer_type
    9058                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$40)
    9059                      .dwattr $C$DW$T$126, DW_AT_address_class(0x20)
    9060              
    9061              $C$DW$T$127     .dwtag  DW_TAG_typedef
    9062                      .dwattr $C$DW$T$127, DW_AT_name("CLK_Handle")
    9063                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
    9064                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    9065              
    9066              
    9067              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    9068                      .dwattr $C$DW$T$41, DW_AT_name("_CPU_Obj_")
    9069                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    9070              $C$DW$941       .dwtag  DW_TAG_member
    9071                      .dwattr $C$DW$941, DW_AT_type(*$C$DW$T$37)
    9072                      .dwattr $C$DW$941, DW_AT_name("tmp")
    9073                      .dwattr $C$DW$941, DW_AT_TI_symbol_name("_tmp")
    9074                      .dwattr $C$DW$941, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9075                      .dwattr $C$DW$941, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:14:25 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F103A99A-D750-42FB-8923-AD93E2502D41} PAGE  178

    9076              
    9077                      .dwendtag $C$DW$T$41
    9078              
    9079              $C$DW$T$128     .dwtag  DW_TAG_pointer_type
    9080                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$41)
    9081                      .dwattr $C$DW$T$128, DW_AT_address_class(0x20)
    9082              
    9083              $C$DW$T$129     .dwtag  DW_TAG_typedef
    9084                      .dwattr $C$DW$T$129, DW_AT_name("CPU_Handle")
    9085                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$128)
    9086                      .dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
    9087              
    9088              
    9089              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    9090                      .dwattr $C$DW$T$77, DW_AT_name("_CTRL_Obj_")
    9091                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x10a)
    9092              $C$DW$942       .dwtag  DW_TAG_member
    9093                      .dwattr $C$DW$942, DW_AT_type(*$C$DW$T$42)
    9094                      .dwattr $C$DW$942, DW_AT_name("version")
    9095                      .dwattr $C$DW$942, DW_AT_TI_symbol_name("_version")
    9096                      .dwattr $C$DW$942, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9097                      .dwattr $C$DW$942, DW_AT_accessibility(DW_ACCESS_public)
    9098              
    9099              $C$DW$943       .dwtag  DW_TAG_member
    9100                      .dwattr $C$DW$943, DW_AT_type(*$C$DW$T$44)
    9101                      .dwattr $C$DW$943, DW_AT_name("state")
    9102                      .dwattr $C$DW$943, DW_AT_TI_symbol_name("_state")
    9103                      .dwattr $C$DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9104                      .dwattr $C$DW$943, DW_AT_accessibility(DW_ACCESS_public)
    9105              
    9106              $C$DW$944       .dwtag  DW_TAG_member
    9107                      .dwattr $C$DW$944, DW_AT_type(*$C$DW$T$44)
    9108                      .dwattr $C$DW$944, DW_AT_name("prevState")
    9109                      .dwattr $C$DW$944, DW_AT_TI_symbol_name("_prevState")
    9110                      .dwattr $C$DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9111                      .dwattr $C$DW$944, DW_AT_accessibility(DW_ACCESS_public)
    9112              
    9113              $C$DW$945       .dwtag  DW_TAG_member
    9114                      .dwattr $C$DW$945, DW_AT_type(*$C$DW$T$46)
    9115                      .dwattr $C$DW$945, DW_AT_name("errorCode")
    9116                      .dwattr $C$DW$945, DW_AT_TI_symbol_name("_errorCode")
    9117                      .dwattr $C$DW$945, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9118                      .dwattr $C$DW$945, DW_AT_accessibility(DW_ACCESS_public)
    9119              
    9120              $C$DW$946       .dwtag  DW_TAG_member
    9121                      .dwattr $C$DW$946, DW_AT_type(*$C$DW$T$48)
    9122                      .dwattr $C$DW$946, DW_AT_name("clarkeHandle_I")
    9123                      .dwattr $C$DW$946, DW_AT_TI_symbol_name("_clarkeHandle_I")
    9124                      .dwattr $C$DW$946, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9125                      .dwattr $C$DW$946, DW_AT_accessibility(DW_ACCESS_public)
    9126              
    9127              $C$DW$947       .dwtag  DW_TAG_member
    9128                      .dwattr $C$DW$947, DW_AT_type(*$C$DW$T$49)
    9129                      .dwattr $C$DW$947, DW_AT_name("clarke_I")
    9130                      .dwattr $C$DW$947, DW_AT_TI_symbol_name("_clarke_I")
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:14:25 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F103A99A-D750-42FB-8923-AD93E2502D41} PAGE  179

    9131                      .dwattr $C$DW$947, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9132                      .dwattr $C$DW$947, DW_AT_accessibility(DW_ACCESS_public)
    9133              
    9134              $C$DW$948       .dwtag  DW_TAG_member
    9135                      .dwattr $C$DW$948, DW_AT_type(*$C$DW$T$48)
    9136                      .dwattr $C$DW$948, DW_AT_name("clarkeHandle_V")
    9137                      .dwattr $C$DW$948, DW_AT_TI_symbol_name("_clarkeHandle_V")
    9138                      .dwattr $C$DW$948, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9139                      .dwattr $C$DW$948, DW_AT_accessibility(DW_ACCESS_public)
    9140              
    9141              $C$DW$949       .dwtag  DW_TAG_member
    9142                      .dwattr $C$DW$949, DW_AT_type(*$C$DW$T$49)
    9143                      .dwattr $C$DW$949, DW_AT_name("clarke_V")
    9144                      .dwattr $C$DW$949, DW_AT_TI_symbol_name("_clarke_V")
    9145                      .dwattr $C$DW$949, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9146                      .dwattr $C$DW$949, DW_AT_accessibility(DW_ACCESS_public)
    9147              
    9148              $C$DW$950       .dwtag  DW_TAG_member
    9149                      .dwattr $C$DW$950, DW_AT_type(*$C$DW$T$51)
    9150                      .dwattr $C$DW$950, DW_AT_name("estHandle")
    9151                      .dwattr $C$DW$950, DW_AT_TI_symbol_name("_estHandle")
    9152                      .dwattr $C$DW$950, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9153                      .dwattr $C$DW$950, DW_AT_accessibility(DW_ACCESS_public)
    9154              
    9155              $C$DW$951       .dwtag  DW_TAG_member
    9156                      .dwattr $C$DW$951, DW_AT_type(*$C$DW$T$53)
    9157                      .dwattr $C$DW$951, DW_AT_name("parkHandle")
    9158                      .dwattr $C$DW$951, DW_AT_TI_symbol_name("_parkHandle")
    9159                      .dwattr $C$DW$951, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9160                      .dwattr $C$DW$951, DW_AT_accessibility(DW_ACCESS_public)
    9161              
    9162              $C$DW$952       .dwtag  DW_TAG_member
    9163                      .dwattr $C$DW$952, DW_AT_type(*$C$DW$T$54)
    9164                      .dwattr $C$DW$952, DW_AT_name("park")
    9165                      .dwattr $C$DW$952, DW_AT_TI_symbol_name("_park")
    9166                      .dwattr $C$DW$952, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9167                      .dwattr $C$DW$952, DW_AT_accessibility(DW_ACCESS_public)
    9168              
    9169              $C$DW$953       .dwtag  DW_TAG_member
    9170                      .dwattr $C$DW$953, DW_AT_type(*$C$DW$T$56)
    9171                      .dwattr $C$DW$953, DW_AT_name("pidHandle_Id")
    9172                      .dwattr $C$DW$953, DW_AT_TI_symbol_name("_pidHandle_Id")
    9173                      .dwattr $C$DW$953, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    9174                      .dwattr $C$DW$953, DW_AT_accessibility(DW_ACCESS_public)
    9175              
    9176              $C$DW$954       .dwtag  DW_TAG_member
    9177                      .dwattr $C$DW$954, DW_AT_type(*$C$DW$T$57)
    9178                      .dwattr $C$DW$954, DW_AT_name("pid_Id")
    9179                      .dwattr $C$DW$954, DW_AT_TI_symbol_name("_pid_Id")
    9180                      .dwattr $C$DW$954, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    9181                      .dwattr $C$DW$954, DW_AT_accessibility(DW_ACCESS_public)
    9182              
    9183              $C$DW$955       .dwtag  DW_TAG_member
    9184                      .dwattr $C$DW$955, DW_AT_type(*$C$DW$T$56)
    9185                      .dwattr $C$DW$955, DW_AT_name("pidHandle_Iq")
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:14:25 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F103A99A-D750-42FB-8923-AD93E2502D41} PAGE  180

    9186                      .dwattr $C$DW$955, DW_AT_TI_symbol_name("_pidHandle_Iq")
    9187                      .dwattr $C$DW$955, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    9188                      .dwattr $C$DW$955, DW_AT_accessibility(DW_ACCESS_public)
    9189              
    9190              $C$DW$956       .dwtag  DW_TAG_member
    9191                      .dwattr $C$DW$956, DW_AT_type(*$C$DW$T$57)
    9192                      .dwattr $C$DW$956, DW_AT_name("pid_Iq")
    9193                      .dwattr $C$DW$956, DW_AT_TI_symbol_name("_pid_Iq")
    9194                      .dwattr $C$DW$956, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    9195                      .dwattr $C$DW$956, DW_AT_accessibility(DW_ACCESS_public)
    9196              
    9197              $C$DW$957       .dwtag  DW_TAG_member
    9198                      .dwattr $C$DW$957, DW_AT_type(*$C$DW$T$56)
    9199                      .dwattr $C$DW$957, DW_AT_name("pidHandle_spd")
    9200                      .dwattr $C$DW$957, DW_AT_TI_symbol_name("_pidHandle_spd")
    9201                      .dwattr $C$DW$957, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    9202                      .dwattr $C$DW$957, DW_AT_accessibility(DW_ACCESS_public)
    9203              
    9204              $C$DW$958       .dwtag  DW_TAG_member
    9205                      .dwattr $C$DW$958, DW_AT_type(*$C$DW$T$57)
    9206                      .dwattr $C$DW$958, DW_AT_name("pid_spd")
    9207                      .dwattr $C$DW$958, DW_AT_TI_symbol_name("_pid_spd")
    9208                      .dwattr $C$DW$958, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    9209                      .dwattr $C$DW$958, DW_AT_accessibility(DW_ACCESS_public)
    9210              
    9211              $C$DW$959       .dwtag  DW_TAG_member
    9212                      .dwattr $C$DW$959, DW_AT_type(*$C$DW$T$59)
    9213                      .dwattr $C$DW$959, DW_AT_name("iparkHandle")
    9214                      .dwattr $C$DW$959, DW_AT_TI_symbol_name("_iparkHandle")
    9215                      .dwattr $C$DW$959, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    9216                      .dwattr $C$DW$959, DW_AT_accessibility(DW_ACCESS_public)
    9217              
    9218              $C$DW$960       .dwtag  DW_TAG_member
    9219                      .dwattr $C$DW$960, DW_AT_type(*$C$DW$T$60)
    9220                      .dwattr $C$DW$960, DW_AT_name("ipark")
    9221                      .dwattr $C$DW$960, DW_AT_TI_symbol_name("_ipark")
    9222                      .dwattr $C$DW$960, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    9223                      .dwattr $C$DW$960, DW_AT_accessibility(DW_ACCESS_public)
    9224              
    9225              $C$DW$961       .dwtag  DW_TAG_member
    9226                      .dwattr $C$DW$961, DW_AT_type(*$C$DW$T$62)
    9227                      .dwattr $C$DW$961, DW_AT_name("svgenHandle")
    9228                      .dwattr $C$DW$961, DW_AT_TI_symbol_name("_svgenHandle")
    9229                      .dwattr $C$DW$961, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    9230                      .dwattr $C$DW$961, DW_AT_accessibility(DW_ACCESS_public)
    9231              
    9232              $C$DW$962       .dwtag  DW_TAG_member
    9233                      .dwattr $C$DW$962, DW_AT_type(*$C$DW$T$63)
    9234                      .dwattr $C$DW$962, DW_AT_name("svgen")
    9235                      .dwattr $C$DW$962, DW_AT_TI_symbol_name("_svgen")
    9236                      .dwattr $C$DW$962, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    9237                      .dwattr $C$DW$962, DW_AT_accessibility(DW_ACCESS_public)
    9238              
    9239              $C$DW$963       .dwtag  DW_TAG_member
    9240                      .dwattr $C$DW$963, DW_AT_type(*$C$DW$T$65)
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:14:25 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F103A99A-D750-42FB-8923-AD93E2502D41} PAGE  181

    9241                      .dwattr $C$DW$963, DW_AT_name("trajHandle_Id")
    9242                      .dwattr $C$DW$963, DW_AT_TI_symbol_name("_trajHandle_Id")
    9243                      .dwattr $C$DW$963, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    9244                      .dwattr $C$DW$963, DW_AT_accessibility(DW_ACCESS_public)
    9245              
    9246              $C$DW$964       .dwtag  DW_TAG_member
    9247                      .dwattr $C$DW$964, DW_AT_type(*$C$DW$T$66)
    9248                      .dwattr $C$DW$964, DW_AT_name("traj_Id")
    9249                      .dwattr $C$DW$964, DW_AT_TI_symbol_name("_traj_Id")
    9250                      .dwattr $C$DW$964, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    9251                      .dwattr $C$DW$964, DW_AT_accessibility(DW_ACCESS_public)
    9252              
    9253              $C$DW$965       .dwtag  DW_TAG_member
    9254                      .dwattr $C$DW$965, DW_AT_type(*$C$DW$T$65)
    9255                      .dwattr $C$DW$965, DW_AT_name("trajHandle_spd")
    9256                      .dwattr $C$DW$965, DW_AT_TI_symbol_name("_trajHandle_spd")
    9257                      .dwattr $C$DW$965, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    9258                      .dwattr $C$DW$965, DW_AT_accessibility(DW_ACCESS_public)
    9259              
    9260              $C$DW$966       .dwtag  DW_TAG_member
    9261                      .dwattr $C$DW$966, DW_AT_type(*$C$DW$T$66)
    9262                      .dwattr $C$DW$966, DW_AT_name("traj_spd")
    9263                      .dwattr $C$DW$966, DW_AT_TI_symbol_name("_traj_spd")
    9264                      .dwattr $C$DW$966, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    9265                      .dwattr $C$DW$966, DW_AT_accessibility(DW_ACCESS_public)
    9266              
    9267              $C$DW$967       .dwtag  DW_TAG_member
    9268                      .dwattr $C$DW$967, DW_AT_type(*$C$DW$T$65)
    9269                      .dwattr $C$DW$967, DW_AT_name("trajHandle_spdMax")
    9270                      .dwattr $C$DW$967, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    9271                      .dwattr $C$DW$967, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    9272                      .dwattr $C$DW$967, DW_AT_accessibility(DW_ACCESS_public)
    9273              
    9274              $C$DW$968       .dwtag  DW_TAG_member
    9275                      .dwattr $C$DW$968, DW_AT_type(*$C$DW$T$66)
    9276                      .dwattr $C$DW$968, DW_AT_name("traj_spdMax")
    9277                      .dwattr $C$DW$968, DW_AT_TI_symbol_name("_traj_spdMax")
    9278                      .dwattr $C$DW$968, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    9279                      .dwattr $C$DW$968, DW_AT_accessibility(DW_ACCESS_public)
    9280              
    9281              $C$DW$969       .dwtag  DW_TAG_member
    9282                      .dwattr $C$DW$969, DW_AT_type(*$C$DW$T$67)
    9283                      .dwattr $C$DW$969, DW_AT_name("motorParams")
    9284                      .dwattr $C$DW$969, DW_AT_TI_symbol_name("_motorParams")
    9285                      .dwattr $C$DW$969, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    9286                      .dwattr $C$DW$969, DW_AT_accessibility(DW_ACCESS_public)
    9287              
    9288              $C$DW$970       .dwtag  DW_TAG_member
    9289                      .dwattr $C$DW$970, DW_AT_type(*$C$DW$T$71)
    9290                      .dwattr $C$DW$970, DW_AT_name("waitTimes")
    9291                      .dwattr $C$DW$970, DW_AT_TI_symbol_name("_waitTimes")
    9292                      .dwattr $C$DW$970, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    9293                      .dwattr $C$DW$970, DW_AT_accessibility(DW_ACCESS_public)
    9294              
    9295              $C$DW$971       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:14:25 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F103A99A-D750-42FB-8923-AD93E2502D41} PAGE  182

    9296                      .dwattr $C$DW$971, DW_AT_type(*$C$DW$T$70)
    9297                      .dwattr $C$DW$971, DW_AT_name("counter_state")
    9298                      .dwattr $C$DW$971, DW_AT_TI_symbol_name("_counter_state")
    9299                      .dwattr $C$DW$971, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    9300                      .dwattr $C$DW$971, DW_AT_accessibility(DW_ACCESS_public)
    9301              
    9302              $C$DW$972       .dwtag  DW_TAG_member
    9303                      .dwattr $C$DW$972, DW_AT_type(*$C$DW$T$73)
    9304                      .dwattr $C$DW$972, DW_AT_name("numIsrTicksPerCtrlTick")
    9305                      .dwattr $C$DW$972, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    9306                      .dwattr $C$DW$972, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    9307                      .dwattr $C$DW$972, DW_AT_accessibility(DW_ACCESS_public)
    9308              
    9309              $C$DW$973       .dwtag  DW_TAG_member
    9310                      .dwattr $C$DW$973, DW_AT_type(*$C$DW$T$73)
    9311                      .dwattr $C$DW$973, DW_AT_name("numCtrlTicksPerCurrentTick")
    9312                      .dwattr $C$DW$973, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    9313                      .dwattr $C$DW$973, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    9314                      .dwattr $C$DW$973, DW_AT_accessibility(DW_ACCESS_public)
    9315              
    9316              $C$DW$974       .dwtag  DW_TAG_member
    9317                      .dwattr $C$DW$974, DW_AT_type(*$C$DW$T$73)
    9318                      .dwattr $C$DW$974, DW_AT_name("numCtrlTicksPerSpeedTick")
    9319                      .dwattr $C$DW$974, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    9320                      .dwattr $C$DW$974, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    9321                      .dwattr $C$DW$974, DW_AT_accessibility(DW_ACCESS_public)
    9322              
    9323              $C$DW$975       .dwtag  DW_TAG_member
    9324                      .dwattr $C$DW$975, DW_AT_type(*$C$DW$T$73)
    9325                      .dwattr $C$DW$975, DW_AT_name("numCtrlTicksPerTrajTick")
    9326                      .dwattr $C$DW$975, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    9327                      .dwattr $C$DW$975, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    9328                      .dwattr $C$DW$975, DW_AT_accessibility(DW_ACCESS_public)
    9329              
    9330              $C$DW$976       .dwtag  DW_TAG_member
    9331                      .dwattr $C$DW$976, DW_AT_type(*$C$DW$T$70)
    9332                      .dwattr $C$DW$976, DW_AT_name("ctrlFreq_Hz")
    9333                      .dwattr $C$DW$976, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    9334                      .dwattr $C$DW$976, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    9335                      .dwattr $C$DW$976, DW_AT_accessibility(DW_ACCESS_public)
    9336              
    9337              $C$DW$977       .dwtag  DW_TAG_member
    9338                      .dwattr $C$DW$977, DW_AT_type(*$C$DW$T$70)
    9339                      .dwattr $C$DW$977, DW_AT_name("trajFreq_Hz")
    9340                      .dwattr $C$DW$977, DW_AT_TI_symbol_name("_trajFreq_Hz")
    9341                      .dwattr $C$DW$977, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    9342                      .dwattr $C$DW$977, DW_AT_accessibility(DW_ACCESS_public)
    9343              
    9344              $C$DW$978       .dwtag  DW_TAG_member
    9345                      .dwattr $C$DW$978, DW_AT_type(*$C$DW$T$35)
    9346                      .dwattr $C$DW$978, DW_AT_name("trajPeriod_sec")
    9347                      .dwattr $C$DW$978, DW_AT_TI_symbol_name("_trajPeriod_sec")
    9348                      .dwattr $C$DW$978, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    9349                      .dwattr $C$DW$978, DW_AT_accessibility(DW_ACCESS_public)
    9350              
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:14:25 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F103A99A-D750-42FB-8923-AD93E2502D41} PAGE  183

    9351              $C$DW$979       .dwtag  DW_TAG_member
    9352                      .dwattr $C$DW$979, DW_AT_type(*$C$DW$T$74)
    9353                      .dwattr $C$DW$979, DW_AT_name("ctrlPeriod_sec")
    9354                      .dwattr $C$DW$979, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    9355                      .dwattr $C$DW$979, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    9356                      .dwattr $C$DW$979, DW_AT_accessibility(DW_ACCESS_public)
    9357              
    9358              $C$DW$980       .dwtag  DW_TAG_member
    9359                      .dwattr $C$DW$980, DW_AT_type(*$C$DW$T$35)
    9360                      .dwattr $C$DW$980, DW_AT_name("maxVsMag_pu")
    9361                      .dwattr $C$DW$980, DW_AT_TI_symbol_name("_maxVsMag_pu")
    9362                      .dwattr $C$DW$980, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    9363                      .dwattr $C$DW$980, DW_AT_accessibility(DW_ACCESS_public)
    9364              
    9365              $C$DW$981       .dwtag  DW_TAG_member
    9366                      .dwattr $C$DW$981, DW_AT_type(*$C$DW$T$75)
    9367                      .dwattr $C$DW$981, DW_AT_name("Iab_in")
    9368                      .dwattr $C$DW$981, DW_AT_TI_symbol_name("_Iab_in")
    9369                      .dwattr $C$DW$981, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    9370                      .dwattr $C$DW$981, DW_AT_accessibility(DW_ACCESS_public)
    9371              
    9372              $C$DW$982       .dwtag  DW_TAG_member
    9373                      .dwattr $C$DW$982, DW_AT_type(*$C$DW$T$75)
    9374                      .dwattr $C$DW$982, DW_AT_name("Iab_filt")
    9375                      .dwattr $C$DW$982, DW_AT_TI_symbol_name("_Iab_filt")
    9376                      .dwattr $C$DW$982, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    9377                      .dwattr $C$DW$982, DW_AT_accessibility(DW_ACCESS_public)
    9378              
    9379              $C$DW$983       .dwtag  DW_TAG_member
    9380                      .dwattr $C$DW$983, DW_AT_type(*$C$DW$T$75)
    9381                      .dwattr $C$DW$983, DW_AT_name("Idq_in")
    9382                      .dwattr $C$DW$983, DW_AT_TI_symbol_name("_Idq_in")
    9383                      .dwattr $C$DW$983, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    9384                      .dwattr $C$DW$983, DW_AT_accessibility(DW_ACCESS_public)
    9385              
    9386              $C$DW$984       .dwtag  DW_TAG_member
    9387                      .dwattr $C$DW$984, DW_AT_type(*$C$DW$T$75)
    9388                      .dwattr $C$DW$984, DW_AT_name("Vab_in")
    9389                      .dwattr $C$DW$984, DW_AT_TI_symbol_name("_Vab_in")
    9390                      .dwattr $C$DW$984, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    9391                      .dwattr $C$DW$984, DW_AT_accessibility(DW_ACCESS_public)
    9392              
    9393              $C$DW$985       .dwtag  DW_TAG_member
    9394                      .dwattr $C$DW$985, DW_AT_type(*$C$DW$T$35)
    9395                      .dwattr $C$DW$985, DW_AT_name("spd_out")
    9396                      .dwattr $C$DW$985, DW_AT_TI_symbol_name("_spd_out")
    9397                      .dwattr $C$DW$985, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    9398                      .dwattr $C$DW$985, DW_AT_accessibility(DW_ACCESS_public)
    9399              
    9400              $C$DW$986       .dwtag  DW_TAG_member
    9401                      .dwattr $C$DW$986, DW_AT_type(*$C$DW$T$75)
    9402                      .dwattr $C$DW$986, DW_AT_name("Vab_out")
    9403                      .dwattr $C$DW$986, DW_AT_TI_symbol_name("_Vab_out")
    9404                      .dwattr $C$DW$986, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    9405                      .dwattr $C$DW$986, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:14:25 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F103A99A-D750-42FB-8923-AD93E2502D41} PAGE  184

    9406              
    9407              $C$DW$987       .dwtag  DW_TAG_member
    9408                      .dwattr $C$DW$987, DW_AT_type(*$C$DW$T$75)
    9409                      .dwattr $C$DW$987, DW_AT_name("Vdq_out")
    9410                      .dwattr $C$DW$987, DW_AT_TI_symbol_name("_Vdq_out")
    9411                      .dwattr $C$DW$987, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    9412                      .dwattr $C$DW$987, DW_AT_accessibility(DW_ACCESS_public)
    9413              
    9414              $C$DW$988       .dwtag  DW_TAG_member
    9415                      .dwattr $C$DW$988, DW_AT_type(*$C$DW$T$74)
    9416                      .dwattr $C$DW$988, DW_AT_name("Rhf")
    9417                      .dwattr $C$DW$988, DW_AT_TI_symbol_name("_Rhf")
    9418                      .dwattr $C$DW$988, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    9419                      .dwattr $C$DW$988, DW_AT_accessibility(DW_ACCESS_public)
    9420              
    9421              $C$DW$989       .dwtag  DW_TAG_member
    9422                      .dwattr $C$DW$989, DW_AT_type(*$C$DW$T$74)
    9423                      .dwattr $C$DW$989, DW_AT_name("Lhf")
    9424                      .dwattr $C$DW$989, DW_AT_TI_symbol_name("_Lhf")
    9425                      .dwattr $C$DW$989, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    9426                      .dwattr $C$DW$989, DW_AT_accessibility(DW_ACCESS_public)
    9427              
    9428              $C$DW$990       .dwtag  DW_TAG_member
    9429                      .dwattr $C$DW$990, DW_AT_type(*$C$DW$T$74)
    9430                      .dwattr $C$DW$990, DW_AT_name("RoverL")
    9431                      .dwattr $C$DW$990, DW_AT_TI_symbol_name("_RoverL")
    9432                      .dwattr $C$DW$990, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    9433                      .dwattr $C$DW$990, DW_AT_accessibility(DW_ACCESS_public)
    9434              
    9435              $C$DW$991       .dwtag  DW_TAG_member
    9436                      .dwattr $C$DW$991, DW_AT_type(*$C$DW$T$35)
    9437                      .dwattr $C$DW$991, DW_AT_name("Kp_Id")
    9438                      .dwattr $C$DW$991, DW_AT_TI_symbol_name("_Kp_Id")
    9439                      .dwattr $C$DW$991, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    9440                      .dwattr $C$DW$991, DW_AT_accessibility(DW_ACCESS_public)
    9441              
    9442              $C$DW$992       .dwtag  DW_TAG_member
    9443                      .dwattr $C$DW$992, DW_AT_type(*$C$DW$T$35)
    9444                      .dwattr $C$DW$992, DW_AT_name("Kp_Iq")
    9445                      .dwattr $C$DW$992, DW_AT_TI_symbol_name("_Kp_Iq")
    9446                      .dwattr $C$DW$992, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    9447                      .dwattr $C$DW$992, DW_AT_accessibility(DW_ACCESS_public)
    9448              
    9449              $C$DW$993       .dwtag  DW_TAG_member
    9450                      .dwattr $C$DW$993, DW_AT_type(*$C$DW$T$35)
    9451                      .dwattr $C$DW$993, DW_AT_name("Kp_spd")
    9452                      .dwattr $C$DW$993, DW_AT_TI_symbol_name("_Kp_spd")
    9453                      .dwattr $C$DW$993, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    9454                      .dwattr $C$DW$993, DW_AT_accessibility(DW_ACCESS_public)
    9455              
    9456              $C$DW$994       .dwtag  DW_TAG_member
    9457                      .dwattr $C$DW$994, DW_AT_type(*$C$DW$T$35)
    9458                      .dwattr $C$DW$994, DW_AT_name("Ki_Id")
    9459                      .dwattr $C$DW$994, DW_AT_TI_symbol_name("_Ki_Id")
    9460                      .dwattr $C$DW$994, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:14:25 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F103A99A-D750-42FB-8923-AD93E2502D41} PAGE  185

    9461                      .dwattr $C$DW$994, DW_AT_accessibility(DW_ACCESS_public)
    9462              
    9463              $C$DW$995       .dwtag  DW_TAG_member
    9464                      .dwattr $C$DW$995, DW_AT_type(*$C$DW$T$35)
    9465                      .dwattr $C$DW$995, DW_AT_name("Ki_Iq")
    9466                      .dwattr $C$DW$995, DW_AT_TI_symbol_name("_Ki_Iq")
    9467                      .dwattr $C$DW$995, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    9468                      .dwattr $C$DW$995, DW_AT_accessibility(DW_ACCESS_public)
    9469              
    9470              $C$DW$996       .dwtag  DW_TAG_member
    9471                      .dwattr $C$DW$996, DW_AT_type(*$C$DW$T$35)
    9472                      .dwattr $C$DW$996, DW_AT_name("Ki_spd")
    9473                      .dwattr $C$DW$996, DW_AT_TI_symbol_name("_Ki_spd")
    9474                      .dwattr $C$DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    9475                      .dwattr $C$DW$996, DW_AT_accessibility(DW_ACCESS_public)
    9476              
    9477              $C$DW$997       .dwtag  DW_TAG_member
    9478                      .dwattr $C$DW$997, DW_AT_type(*$C$DW$T$35)
    9479                      .dwattr $C$DW$997, DW_AT_name("Kd_Id")
    9480                      .dwattr $C$DW$997, DW_AT_TI_symbol_name("_Kd_Id")
    9481                      .dwattr $C$DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    9482                      .dwattr $C$DW$997, DW_AT_accessibility(DW_ACCESS_public)
    9483              
    9484              $C$DW$998       .dwtag  DW_TAG_member
    9485                      .dwattr $C$DW$998, DW_AT_type(*$C$DW$T$35)
    9486                      .dwattr $C$DW$998, DW_AT_name("Kd_Iq")
    9487                      .dwattr $C$DW$998, DW_AT_TI_symbol_name("_Kd_Iq")
    9488                      .dwattr $C$DW$998, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    9489                      .dwattr $C$DW$998, DW_AT_accessibility(DW_ACCESS_public)
    9490              
    9491              $C$DW$999       .dwtag  DW_TAG_member
    9492                      .dwattr $C$DW$999, DW_AT_type(*$C$DW$T$35)
    9493                      .dwattr $C$DW$999, DW_AT_name("Kd_spd")
    9494                      .dwattr $C$DW$999, DW_AT_TI_symbol_name("_Kd_spd")
    9495                      .dwattr $C$DW$999, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    9496                      .dwattr $C$DW$999, DW_AT_accessibility(DW_ACCESS_public)
    9497              
    9498              $C$DW$1000      .dwtag  DW_TAG_member
    9499                      .dwattr $C$DW$1000, DW_AT_type(*$C$DW$T$35)
    9500                      .dwattr $C$DW$1000, DW_AT_name("Ui_Id")
    9501                      .dwattr $C$DW$1000, DW_AT_TI_symbol_name("_Ui_Id")
    9502                      .dwattr $C$DW$1000, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    9503                      .dwattr $C$DW$1000, DW_AT_accessibility(DW_ACCESS_public)
    9504              
    9505              $C$DW$1001      .dwtag  DW_TAG_member
    9506                      .dwattr $C$DW$1001, DW_AT_type(*$C$DW$T$35)
    9507                      .dwattr $C$DW$1001, DW_AT_name("Ui_Iq")
    9508                      .dwattr $C$DW$1001, DW_AT_TI_symbol_name("_Ui_Iq")
    9509                      .dwattr $C$DW$1001, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    9510                      .dwattr $C$DW$1001, DW_AT_accessibility(DW_ACCESS_public)
    9511              
    9512              $C$DW$1002      .dwtag  DW_TAG_member
    9513                      .dwattr $C$DW$1002, DW_AT_type(*$C$DW$T$35)
    9514                      .dwattr $C$DW$1002, DW_AT_name("Ui_spd")
    9515                      .dwattr $C$DW$1002, DW_AT_TI_symbol_name("_Ui_spd")
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:14:25 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F103A99A-D750-42FB-8923-AD93E2502D41} PAGE  186

    9516                      .dwattr $C$DW$1002, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    9517                      .dwattr $C$DW$1002, DW_AT_accessibility(DW_ACCESS_public)
    9518              
    9519              $C$DW$1003      .dwtag  DW_TAG_member
    9520                      .dwattr $C$DW$1003, DW_AT_type(*$C$DW$T$75)
    9521                      .dwattr $C$DW$1003, DW_AT_name("Idq_ref")
    9522                      .dwattr $C$DW$1003, DW_AT_TI_symbol_name("_Idq_ref")
    9523                      .dwattr $C$DW$1003, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    9524                      .dwattr $C$DW$1003, DW_AT_accessibility(DW_ACCESS_public)
    9525              
    9526              $C$DW$1004      .dwtag  DW_TAG_member
    9527                      .dwattr $C$DW$1004, DW_AT_type(*$C$DW$T$35)
    9528                      .dwattr $C$DW$1004, DW_AT_name("IdRated")
    9529                      .dwattr $C$DW$1004, DW_AT_TI_symbol_name("_IdRated")
    9530                      .dwattr $C$DW$1004, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    9531                      .dwattr $C$DW$1004, DW_AT_accessibility(DW_ACCESS_public)
    9532              
    9533              $C$DW$1005      .dwtag  DW_TAG_member
    9534                      .dwattr $C$DW$1005, DW_AT_type(*$C$DW$T$35)
    9535                      .dwattr $C$DW$1005, DW_AT_name("spd_ref")
    9536                      .dwattr $C$DW$1005, DW_AT_TI_symbol_name("_spd_ref")
    9537                      .dwattr $C$DW$1005, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    9538                      .dwattr $C$DW$1005, DW_AT_accessibility(DW_ACCESS_public)
    9539              
    9540              $C$DW$1006      .dwtag  DW_TAG_member
    9541                      .dwattr $C$DW$1006, DW_AT_type(*$C$DW$T$35)
    9542                      .dwattr $C$DW$1006, DW_AT_name("spd_max")
    9543                      .dwattr $C$DW$1006, DW_AT_TI_symbol_name("_spd_max")
    9544                      .dwattr $C$DW$1006, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    9545                      .dwattr $C$DW$1006, DW_AT_accessibility(DW_ACCESS_public)
    9546              
    9547              $C$DW$1007      .dwtag  DW_TAG_member
    9548                      .dwattr $C$DW$1007, DW_AT_type(*$C$DW$T$73)
    9549                      .dwattr $C$DW$1007, DW_AT_name("counter_current")
    9550                      .dwattr $C$DW$1007, DW_AT_TI_symbol_name("_counter_current")
    9551                      .dwattr $C$DW$1007, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    9552                      .dwattr $C$DW$1007, DW_AT_accessibility(DW_ACCESS_public)
    9553              
    9554              $C$DW$1008      .dwtag  DW_TAG_member
    9555                      .dwattr $C$DW$1008, DW_AT_type(*$C$DW$T$73)
    9556                      .dwattr $C$DW$1008, DW_AT_name("counter_isr")
    9557                      .dwattr $C$DW$1008, DW_AT_TI_symbol_name("_counter_isr")
    9558                      .dwattr $C$DW$1008, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    9559                      .dwattr $C$DW$1008, DW_AT_accessibility(DW_ACCESS_public)
    9560              
    9561              $C$DW$1009      .dwtag  DW_TAG_member
    9562                      .dwattr $C$DW$1009, DW_AT_type(*$C$DW$T$73)
    9563                      .dwattr $C$DW$1009, DW_AT_name("counter_speed")
    9564                      .dwattr $C$DW$1009, DW_AT_TI_symbol_name("_counter_speed")
    9565                      .dwattr $C$DW$1009, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    9566                      .dwattr $C$DW$1009, DW_AT_accessibility(DW_ACCESS_public)
    9567              
    9568              $C$DW$1010      .dwtag  DW_TAG_member
    9569                      .dwattr $C$DW$1010, DW_AT_type(*$C$DW$T$73)
    9570                      .dwattr $C$DW$1010, DW_AT_name("counter_traj")
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:14:25 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F103A99A-D750-42FB-8923-AD93E2502D41} PAGE  187

    9571                      .dwattr $C$DW$1010, DW_AT_TI_symbol_name("_counter_traj")
    9572                      .dwattr $C$DW$1010, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    9573                      .dwattr $C$DW$1010, DW_AT_accessibility(DW_ACCESS_public)
    9574              
    9575              $C$DW$1011      .dwtag  DW_TAG_member
    9576                      .dwattr $C$DW$1011, DW_AT_type(*$C$DW$T$76)
    9577                      .dwattr $C$DW$1011, DW_AT_name("flag_enableCtrl")
    9578                      .dwattr $C$DW$1011, DW_AT_TI_symbol_name("_flag_enableCtrl")
    9579                      .dwattr $C$DW$1011, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    9580                      .dwattr $C$DW$1011, DW_AT_accessibility(DW_ACCESS_public)
    9581              
    9582              $C$DW$1012      .dwtag  DW_TAG_member
    9583                      .dwattr $C$DW$1012, DW_AT_type(*$C$DW$T$76)
    9584                      .dwattr $C$DW$1012, DW_AT_name("flag_enableDcBusComp")
    9585                      .dwattr $C$DW$1012, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    9586                      .dwattr $C$DW$1012, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    9587                      .dwattr $C$DW$1012, DW_AT_accessibility(DW_ACCESS_public)
    9588              
    9589              $C$DW$1013      .dwtag  DW_TAG_member
    9590                      .dwattr $C$DW$1013, DW_AT_type(*$C$DW$T$76)
    9591                      .dwattr $C$DW$1013, DW_AT_name("flag_enablePowerWarp")
    9592                      .dwattr $C$DW$1013, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    9593                      .dwattr $C$DW$1013, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    9594                      .dwattr $C$DW$1013, DW_AT_accessibility(DW_ACCESS_public)
    9595              
    9596              $C$DW$1014      .dwtag  DW_TAG_member
    9597                      .dwattr $C$DW$1014, DW_AT_type(*$C$DW$T$76)
    9598                      .dwattr $C$DW$1014, DW_AT_name("flag_enableOffset")
    9599                      .dwattr $C$DW$1014, DW_AT_TI_symbol_name("_flag_enableOffset")
    9600                      .dwattr $C$DW$1014, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    9601                      .dwattr $C$DW$1014, DW_AT_accessibility(DW_ACCESS_public)
    9602              
    9603              $C$DW$1015      .dwtag  DW_TAG_member
    9604                      .dwattr $C$DW$1015, DW_AT_type(*$C$DW$T$76)
    9605                      .dwattr $C$DW$1015, DW_AT_name("flag_enableSpeedCtrl")
    9606                      .dwattr $C$DW$1015, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    9607                      .dwattr $C$DW$1015, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    9608                      .dwattr $C$DW$1015, DW_AT_accessibility(DW_ACCESS_public)
    9609              
    9610              $C$DW$1016      .dwtag  DW_TAG_member
    9611                      .dwattr $C$DW$1016, DW_AT_type(*$C$DW$T$76)
    9612                      .dwattr $C$DW$1016, DW_AT_name("flag_enableUserMotorParams")
    9613                      .dwattr $C$DW$1016, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    9614                      .dwattr $C$DW$1016, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    9615                      .dwattr $C$DW$1016, DW_AT_accessibility(DW_ACCESS_public)
    9616              
    9617              $C$DW$1017      .dwtag  DW_TAG_member
    9618                      .dwattr $C$DW$1017, DW_AT_type(*$C$DW$T$75)
    9619                      .dwattr $C$DW$1017, DW_AT_name("Idq_offset_pu")
    9620                      .dwattr $C$DW$1017, DW_AT_TI_symbol_name("_Idq_offset_pu")
    9621                      .dwattr $C$DW$1017, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    9622                      .dwattr $C$DW$1017, DW_AT_accessibility(DW_ACCESS_public)
    9623              
    9624              $C$DW$1018      .dwtag  DW_TAG_member
    9625                      .dwattr $C$DW$1018, DW_AT_type(*$C$DW$T$75)
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:14:25 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F103A99A-D750-42FB-8923-AD93E2502D41} PAGE  188

    9626                      .dwattr $C$DW$1018, DW_AT_name("Vdq_offset_pu")
    9627                      .dwattr $C$DW$1018, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    9628                      .dwattr $C$DW$1018, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    9629                      .dwattr $C$DW$1018, DW_AT_accessibility(DW_ACCESS_public)
    9630              
    9631              $C$DW$1019      .dwtag  DW_TAG_member
    9632                      .dwattr $C$DW$1019, DW_AT_type(*$C$DW$T$35)
    9633                      .dwattr $C$DW$1019, DW_AT_name("angle_pu")
    9634                      .dwattr $C$DW$1019, DW_AT_TI_symbol_name("_angle_pu")
    9635                      .dwattr $C$DW$1019, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    9636                      .dwattr $C$DW$1019, DW_AT_accessibility(DW_ACCESS_public)
    9637              
    9638              $C$DW$1020      .dwtag  DW_TAG_member
    9639                      .dwattr $C$DW$1020, DW_AT_type(*$C$DW$T$35)
    9640                      .dwattr $C$DW$1020, DW_AT_name("speed_ref_pu")
    9641                      .dwattr $C$DW$1020, DW_AT_TI_symbol_name("_speed_ref_pu")
    9642                      .dwattr $C$DW$1020, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    9643                      .dwattr $C$DW$1020, DW_AT_accessibility(DW_ACCESS_public)
    9644              
    9645              $C$DW$1021      .dwtag  DW_TAG_member
    9646                      .dwattr $C$DW$1021, DW_AT_type(*$C$DW$T$35)
    9647                      .dwattr $C$DW$1021, DW_AT_name("speed_fb_pu")
    9648                      .dwattr $C$DW$1021, DW_AT_TI_symbol_name("_speed_fb_pu")
    9649                      .dwattr $C$DW$1021, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    9650                      .dwattr $C$DW$1021, DW_AT_accessibility(DW_ACCESS_public)
    9651              
    9652              $C$DW$1022      .dwtag  DW_TAG_member
    9653                      .dwattr $C$DW$1022, DW_AT_type(*$C$DW$T$35)
    9654                      .dwattr $C$DW$1022, DW_AT_name("speed_outMax_pu")
    9655                      .dwattr $C$DW$1022, DW_AT_TI_symbol_name("_speed_outMax_pu")
    9656                      .dwattr $C$DW$1022, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    9657                      .dwattr $C$DW$1022, DW_AT_accessibility(DW_ACCESS_public)
    9658              
    9659              $C$DW$1023      .dwtag  DW_TAG_member
    9660                      .dwattr $C$DW$1023, DW_AT_type(*$C$DW$T$76)
    9661                      .dwattr $C$DW$1023, DW_AT_name("flag_enableCurrentCtrl")
    9662                      .dwattr $C$DW$1023, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    9663                      .dwattr $C$DW$1023, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    9664                      .dwattr $C$DW$1023, DW_AT_accessibility(DW_ACCESS_public)
    9665              
    9666              $C$DW$1024      .dwtag  DW_TAG_member
    9667                      .dwattr $C$DW$1024, DW_AT_type(*$C$DW$T$35)
    9668                      .dwattr $C$DW$1024, DW_AT_name("torque_head_comm")
    9669                      .dwattr $C$DW$1024, DW_AT_TI_symbol_name("_torque_head_comm")
    9670                      .dwattr $C$DW$1024, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    9671                      .dwattr $C$DW$1024, DW_AT_accessibility(DW_ACCESS_public)
    9672              
    9673                      .dwendtag $C$DW$T$77
    9674              
    9675              $C$DW$T$248     .dwtag  DW_TAG_typedef
    9676                      .dwattr $C$DW$T$248, DW_AT_name("CTRL_Obj")
    9677                      .dwattr $C$DW$T$248, DW_AT_type(*$C$DW$T$77)
    9678                      .dwattr $C$DW$T$248, DW_AT_language(DW_LANG_C)
    9679              
    9680              $C$DW$T$249     .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:14:25 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F103A99A-D750-42FB-8923-AD93E2502D41} PAGE  189

    9681                      .dwattr $C$DW$T$249, DW_AT_type(*$C$DW$T$248)
    9682                      .dwattr $C$DW$T$249, DW_AT_address_class(0x20)
    9683              
    9684              $C$DW$T$203     .dwtag  DW_TAG_pointer_type
    9685                      .dwattr $C$DW$T$203, DW_AT_type(*$C$DW$T$77)
    9686                      .dwattr $C$DW$T$203, DW_AT_address_class(0x20)
    9687              
    9688              $C$DW$T$204     .dwtag  DW_TAG_typedef
    9689                      .dwattr $C$DW$T$204, DW_AT_name("CTRL_Handle")
    9690                      .dwattr $C$DW$T$204, DW_AT_type(*$C$DW$T$203)
    9691                      .dwattr $C$DW$T$204, DW_AT_language(DW_LANG_C)
    9692              
    9693              $C$DW$1025      .dwtag  DW_TAG_TI_far_type
    9694                      .dwattr $C$DW$1025, DW_AT_type(*$C$DW$T$204)
    9695              
    9696              $C$DW$T$250     .dwtag  DW_TAG_const_type
    9697                      .dwattr $C$DW$T$250, DW_AT_type(*$C$DW$1025)
    9698              
    9699              
    9700              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    9701                      .dwattr $C$DW$T$80, DW_AT_name("_CTRL_Version_")
    9702                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x04)
    9703              $C$DW$1026      .dwtag  DW_TAG_member
    9704                      .dwattr $C$DW$1026, DW_AT_type(*$C$DW$T$26)
    9705                      .dwattr $C$DW$1026, DW_AT_name("rsvd")
    9706                      .dwattr $C$DW$1026, DW_AT_TI_symbol_name("_rsvd")
    9707                      .dwattr $C$DW$1026, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9708                      .dwattr $C$DW$1026, DW_AT_accessibility(DW_ACCESS_public)
    9709              
    9710              $C$DW$1027      .dwtag  DW_TAG_member
    9711                      .dwattr $C$DW$1027, DW_AT_type(*$C$DW$T$79)
    9712                      .dwattr $C$DW$1027, DW_AT_name("targetProc")
    9713                      .dwattr $C$DW$1027, DW_AT_TI_symbol_name("_targetProc")
    9714                      .dwattr $C$DW$1027, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9715                      .dwattr $C$DW$1027, DW_AT_accessibility(DW_ACCESS_public)
    9716              
    9717              $C$DW$1028      .dwtag  DW_TAG_member
    9718                      .dwattr $C$DW$1028, DW_AT_type(*$C$DW$T$26)
    9719                      .dwattr $C$DW$1028, DW_AT_name("major")
    9720                      .dwattr $C$DW$1028, DW_AT_TI_symbol_name("_major")
    9721                      .dwattr $C$DW$1028, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9722                      .dwattr $C$DW$1028, DW_AT_accessibility(DW_ACCESS_public)
    9723              
    9724              $C$DW$1029      .dwtag  DW_TAG_member
    9725                      .dwattr $C$DW$1029, DW_AT_type(*$C$DW$T$26)
    9726                      .dwattr $C$DW$1029, DW_AT_name("minor")
    9727                      .dwattr $C$DW$1029, DW_AT_TI_symbol_name("_minor")
    9728                      .dwattr $C$DW$1029, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9729                      .dwattr $C$DW$1029, DW_AT_accessibility(DW_ACCESS_public)
    9730              
    9731                      .dwendtag $C$DW$T$80
    9732              
    9733              $C$DW$T$42      .dwtag  DW_TAG_typedef
    9734                      .dwattr $C$DW$T$42, DW_AT_name("CTRL_Version")
    9735                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$80)
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:14:25 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F103A99A-D750-42FB-8923-AD93E2502D41} PAGE  190

    9736                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    9737              
    9738              $C$DW$T$256     .dwtag  DW_TAG_pointer_type
    9739                      .dwattr $C$DW$T$256, DW_AT_type(*$C$DW$T$42)
    9740                      .dwattr $C$DW$T$256, DW_AT_address_class(0x20)
    9741              
    9742              
    9743              $C$DW$T$87      .dwtag  DW_TAG_structure_type
    9744                      .dwattr $C$DW$T$87, DW_AT_name("_DRV8301_Obj_")
    9745                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x08)
    9746              $C$DW$1030      .dwtag  DW_TAG_member
    9747                      .dwattr $C$DW$1030, DW_AT_type(*$C$DW$T$82)
    9748                      .dwattr $C$DW$1030, DW_AT_name("spiHandle")
    9749                      .dwattr $C$DW$1030, DW_AT_TI_symbol_name("_spiHandle")
    9750                      .dwattr $C$DW$1030, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9751                      .dwattr $C$DW$1030, DW_AT_accessibility(DW_ACCESS_public)
    9752              
    9753              $C$DW$1031      .dwtag  DW_TAG_member
    9754                      .dwattr $C$DW$1031, DW_AT_type(*$C$DW$T$84)
    9755                      .dwattr $C$DW$1031, DW_AT_name("gpioHandle")
    9756                      .dwattr $C$DW$1031, DW_AT_TI_symbol_name("_gpioHandle")
    9757                      .dwattr $C$DW$1031, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9758                      .dwattr $C$DW$1031, DW_AT_accessibility(DW_ACCESS_public)
    9759              
    9760              $C$DW$1032      .dwtag  DW_TAG_member
    9761                      .dwattr $C$DW$1032, DW_AT_type(*$C$DW$T$86)
    9762                      .dwattr $C$DW$1032, DW_AT_name("gpioNumber")
    9763                      .dwattr $C$DW$1032, DW_AT_TI_symbol_name("_gpioNumber")
    9764                      .dwattr $C$DW$1032, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9765                      .dwattr $C$DW$1032, DW_AT_accessibility(DW_ACCESS_public)
    9766              
    9767              $C$DW$1033      .dwtag  DW_TAG_member
    9768                      .dwattr $C$DW$1033, DW_AT_type(*$C$DW$T$76)
    9769                      .dwattr $C$DW$1033, DW_AT_name("RxTimeOut")
    9770                      .dwattr $C$DW$1033, DW_AT_TI_symbol_name("_RxTimeOut")
    9771                      .dwattr $C$DW$1033, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9772                      .dwattr $C$DW$1033, DW_AT_accessibility(DW_ACCESS_public)
    9773              
    9774              $C$DW$1034      .dwtag  DW_TAG_member
    9775                      .dwattr $C$DW$1034, DW_AT_type(*$C$DW$T$76)
    9776                      .dwattr $C$DW$1034, DW_AT_name("enableTimeOut")
    9777                      .dwattr $C$DW$1034, DW_AT_TI_symbol_name("_enableTimeOut")
    9778                      .dwattr $C$DW$1034, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9779                      .dwattr $C$DW$1034, DW_AT_accessibility(DW_ACCESS_public)
    9780              
    9781                      .dwendtag $C$DW$T$87
    9782              
    9783              $C$DW$T$156     .dwtag  DW_TAG_typedef
    9784                      .dwattr $C$DW$T$156, DW_AT_name("DRV8301_Obj")
    9785                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$87)
    9786                      .dwattr $C$DW$T$156, DW_AT_language(DW_LANG_C)
    9787              
    9788              $C$DW$T$154     .dwtag  DW_TAG_pointer_type
    9789                      .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$87)
    9790                      .dwattr $C$DW$T$154, DW_AT_address_class(0x20)
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:14:25 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F103A99A-D750-42FB-8923-AD93E2502D41} PAGE  191

    9791              
    9792              $C$DW$T$155     .dwtag  DW_TAG_typedef
    9793                      .dwattr $C$DW$T$155, DW_AT_name("DRV8301_Handle")
    9794                      .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$154)
    9795                      .dwattr $C$DW$T$155, DW_AT_language(DW_LANG_C)
    9796              
    9797              
    9798              $C$DW$T$98      .dwtag  DW_TAG_structure_type
    9799                      .dwattr $C$DW$T$98, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    9800                      .dwattr $C$DW$T$98, DW_AT_byte_size(0x05)
    9801              $C$DW$1035      .dwtag  DW_TAG_member
    9802                      .dwattr $C$DW$1035, DW_AT_type(*$C$DW$T$89)
    9803                      .dwattr $C$DW$1035, DW_AT_name("DRV8301_CURRENT")
    9804                      .dwattr $C$DW$1035, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    9805                      .dwattr $C$DW$1035, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9806                      .dwattr $C$DW$1035, DW_AT_accessibility(DW_ACCESS_public)
    9807              
    9808              $C$DW$1036      .dwtag  DW_TAG_member
    9809                      .dwattr $C$DW$1036, DW_AT_type(*$C$DW$T$91)
    9810                      .dwattr $C$DW$1036, DW_AT_name("DRV8301_RESET")
    9811                      .dwattr $C$DW$1036, DW_AT_TI_symbol_name("_DRV8301_RESET")
    9812                      .dwattr $C$DW$1036, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9813                      .dwattr $C$DW$1036, DW_AT_accessibility(DW_ACCESS_public)
    9814              
    9815              $C$DW$1037      .dwtag  DW_TAG_member
    9816                      .dwattr $C$DW$1037, DW_AT_type(*$C$DW$T$93)
    9817                      .dwattr $C$DW$1037, DW_AT_name("PWM_MODE")
    9818                      .dwattr $C$DW$1037, DW_AT_TI_symbol_name("_PWM_MODE")
    9819                      .dwattr $C$DW$1037, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9820                      .dwattr $C$DW$1037, DW_AT_accessibility(DW_ACCESS_public)
    9821              
    9822              $C$DW$1038      .dwtag  DW_TAG_member
    9823                      .dwattr $C$DW$1038, DW_AT_type(*$C$DW$T$95)
    9824                      .dwattr $C$DW$1038, DW_AT_name("OC_MODE")
    9825                      .dwattr $C$DW$1038, DW_AT_TI_symbol_name("_OC_MODE")
    9826                      .dwattr $C$DW$1038, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9827                      .dwattr $C$DW$1038, DW_AT_accessibility(DW_ACCESS_public)
    9828              
    9829              $C$DW$1039      .dwtag  DW_TAG_member
    9830                      .dwattr $C$DW$1039, DW_AT_type(*$C$DW$T$97)
    9831                      .dwattr $C$DW$1039, DW_AT_name("OC_ADJ_SET")
    9832                      .dwattr $C$DW$1039, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    9833                      .dwattr $C$DW$1039, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9834                      .dwattr $C$DW$1039, DW_AT_accessibility(DW_ACCESS_public)
    9835              
    9836                      .dwendtag $C$DW$T$98
    9837              
    9838              $C$DW$T$112     .dwtag  DW_TAG_typedef
    9839                      .dwattr $C$DW$T$112, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    9840                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$98)
    9841                      .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    9842              
    9843              
    9844              $C$DW$T$107     .dwtag  DW_TAG_structure_type
    9845                      .dwattr $C$DW$T$107, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:14:25 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F103A99A-D750-42FB-8923-AD93E2502D41} PAGE  192

    9846                      .dwattr $C$DW$T$107, DW_AT_byte_size(0x04)
    9847              $C$DW$1040      .dwtag  DW_TAG_member
    9848                      .dwattr $C$DW$1040, DW_AT_type(*$C$DW$T$100)
    9849                      .dwattr $C$DW$1040, DW_AT_name("OCTW_SET")
    9850                      .dwattr $C$DW$1040, DW_AT_TI_symbol_name("_OCTW_SET")
    9851                      .dwattr $C$DW$1040, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9852                      .dwattr $C$DW$1040, DW_AT_accessibility(DW_ACCESS_public)
    9853              
    9854              $C$DW$1041      .dwtag  DW_TAG_member
    9855                      .dwattr $C$DW$1041, DW_AT_type(*$C$DW$T$102)
    9856                      .dwattr $C$DW$1041, DW_AT_name("GAIN")
    9857                      .dwattr $C$DW$1041, DW_AT_TI_symbol_name("_GAIN")
    9858                      .dwattr $C$DW$1041, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9859                      .dwattr $C$DW$1041, DW_AT_accessibility(DW_ACCESS_public)
    9860              
    9861              $C$DW$1042      .dwtag  DW_TAG_member
    9862                      .dwattr $C$DW$1042, DW_AT_type(*$C$DW$T$104)
    9863                      .dwattr $C$DW$1042, DW_AT_name("DC_CAL_CH1p2")
    9864                      .dwattr $C$DW$1042, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    9865                      .dwattr $C$DW$1042, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9866                      .dwattr $C$DW$1042, DW_AT_accessibility(DW_ACCESS_public)
    9867              
    9868              $C$DW$1043      .dwtag  DW_TAG_member
    9869                      .dwattr $C$DW$1043, DW_AT_type(*$C$DW$T$106)
    9870                      .dwattr $C$DW$1043, DW_AT_name("OC_TOFF")
    9871                      .dwattr $C$DW$1043, DW_AT_TI_symbol_name("_OC_TOFF")
    9872                      .dwattr $C$DW$1043, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9873                      .dwattr $C$DW$1043, DW_AT_accessibility(DW_ACCESS_public)
    9874              
    9875                      .dwendtag $C$DW$T$107
    9876              
    9877              $C$DW$T$113     .dwtag  DW_TAG_typedef
    9878                      .dwattr $C$DW$T$113, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    9879                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$107)
    9880                      .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    9881              
    9882              
    9883              $C$DW$T$108     .dwtag  DW_TAG_structure_type
    9884                      .dwattr $C$DW$T$108, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    9885                      .dwattr $C$DW$T$108, DW_AT_byte_size(0x0b)
    9886              $C$DW$1044      .dwtag  DW_TAG_member
    9887                      .dwattr $C$DW$1044, DW_AT_type(*$C$DW$T$76)
    9888                      .dwattr $C$DW$1044, DW_AT_name("FAULT")
    9889                      .dwattr $C$DW$1044, DW_AT_TI_symbol_name("_FAULT")
    9890                      .dwattr $C$DW$1044, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9891                      .dwattr $C$DW$1044, DW_AT_accessibility(DW_ACCESS_public)
    9892              
    9893              $C$DW$1045      .dwtag  DW_TAG_member
    9894                      .dwattr $C$DW$1045, DW_AT_type(*$C$DW$T$76)
    9895                      .dwattr $C$DW$1045, DW_AT_name("GVDD_UV")
    9896                      .dwattr $C$DW$1045, DW_AT_TI_symbol_name("_GVDD_UV")
    9897                      .dwattr $C$DW$1045, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9898                      .dwattr $C$DW$1045, DW_AT_accessibility(DW_ACCESS_public)
    9899              
    9900              $C$DW$1046      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Fri Feb 17 15:14:25 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{F103A99A-D750-42FB-8923-AD93E2502D41} PAGE  193

    9901                      .dwattr $C$DW$1046, DW_AT_type(*$C$DW$T$76)
    9902                      .dwattr $C$DW$1046, DW_AT_name("PVDD_UV")
    9903                      .dwattr $C$DW$1046, DW_AT_TI_symbol_name("_PVDD_UV")
    9904                      .dwattr $C$DW$1046, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9905                      .dwattr $C$DW$1046, DW_AT_accessibility(DW_ACCESS_public)
    9906              
    9907              $C$DW$1047      .dwtag  DW_TAG_member
    9908                      .dwattr $C$DW$1047, DW_AT_type(*$C$DW$T$76)
    9909                      .dwattr $C$DW$1047, DW_AT_name("OTSD")
    9910                      .dwattr $C$DW$1047, DW_AT_TI_symbol_name("_OTSD")
    9911                      .dwattr $C$DW$1047, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9912                      .dwattr $C$DW$1047, DW_AT_accessibility(DW_ACCESS_public)
    9913              
    9914              $C$DW$1048      .dwtag  DW_TAG_member
    9915                      .dwattr $C$DW$1048, DW_AT_type(*$C$DW$T$76)
    9916                      .dwattr $C$DW$1048, DW_AT_name("OTW")
    9917                      .dwattr $C$DW$1048, DW_AT_TI_symbol_name("_OTW")
    9918                      .dwattr $C$DW$1048, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9919                      .dwattr $C$DW$1048, DW_AT_accessibility(DW_ACCESS_public)
    9920              
    9921              $C$DW$1049      .dwtag  DW_TAG_member
    9922                      .dwattr $C$DW$1049, DW_AT_type(*$C$DW$T$76)
    9923                      .dwattr $C$DW$1049, DW_AT_name("FETHA_OC")
    9924                      .dwattr $C$DW$1049, DW_AT_TI_symbol_name("_FETHA_OC")
    9925                      .dwattr $C$DW$1049, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9926                      .dwattr $C$DW$1049, DW_AT_accessibility(DW_ACCESS_public)
    9927              
    9928              $C$DW$1050      .dwtag  DW_TAG_member
    9929                      .dwattr $C$DW$1050, DW_AT_type(*$C$DW$T$76)
    9930                      .dwattr $C$DW$1050, DW_AT_name("FETLA_OC")
    9931                      .dwattr $C$DW$1050, DW_AT_TI_symbol_name("_FETLA_OC")
    9932                      .dwattr $C$DW$1050, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9933                      .dwattr $C$DW$1050, DW_AT_accessibility(DW_ACCESS_public)
    9934              
    9935              $C$DW$1051      .dwtag  DW_TAG_member
    9936                      .dwattr $C$DW$1051, DW_AT_type(*$C$DW$T$76)
    9937                      .dwattr $C$DW$1051, DW_AT_name("FETHB_OC")
    9938                      .dwattr $C$DW$1051, DW_AT_TI_symbol_name("_FETHB_OC")
    9939                      .dwattr $C$DW$1051, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    9940                      .dwattr $C$DW$1051, DW_AT_accessibility(DW_ACCESS_public)
    9941              
    9942              $C$DW$1052      .dwtag  DW_TAG_member
    9943                      .dwattr $C$DW$1052, DW_AT_type(*$C$DW$T$76)
    9944                      .dwattr $C$DW$1052, DW_AT_name("FETLB_OC")
    9945                      .dwattr $C$DW$1052, DW_AT_TI_symbol_name("_FETLB_OC")
    9946                      .dwattr $C$DW$1052, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
