TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:37:19 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{ED4D92FB-263E-4B1C-8874-2914AFE31498} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.0.LTS *
       3              ;* Date/Time created: Wed Feb 22 11:37:18 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/GIANT/GIANT_TI_instaspin/motorware/motorware_1_01_00_18/sw/solutions
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.0.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\GIANT\GIANT_TI_instaspin\motorware\motorware_1_01_00_18\sw\solut
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    8339              $C$DW$870       .dwtag  DW_TAG_enumerator
    8340                      .dwattr $C$DW$870, DW_AT_name("PIE_GroupNumber_7")
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:37:19 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{ED4D92FB-263E-4B1C-8874-2914AFE31498} PAGE  164

    8341                      .dwattr $C$DW$870, DW_AT_const_value(0x06)
    8342              
    8343              $C$DW$871       .dwtag  DW_TAG_enumerator
    8344                      .dwattr $C$DW$871, DW_AT_name("PIE_GroupNumber_8")
    8345                      .dwattr $C$DW$871, DW_AT_const_value(0x07)
    8346              
    8347              $C$DW$872       .dwtag  DW_TAG_enumerator
    8348                      .dwattr $C$DW$872, DW_AT_name("PIE_GroupNumber_9")
    8349                      .dwattr $C$DW$872, DW_AT_const_value(0x08)
    8350              
    8351              $C$DW$873       .dwtag  DW_TAG_enumerator
    8352                      .dwattr $C$DW$873, DW_AT_name("PIE_GroupNumber_10")
    8353                      .dwattr $C$DW$873, DW_AT_const_value(0x09)
    8354              
    8355              $C$DW$874       .dwtag  DW_TAG_enumerator
    8356                      .dwattr $C$DW$874, DW_AT_name("PIE_GroupNumber_11")
    8357                      .dwattr $C$DW$874, DW_AT_const_value(0x0a)
    8358              
    8359              $C$DW$875       .dwtag  DW_TAG_enumerator
    8360                      .dwattr $C$DW$875, DW_AT_name("PIE_GroupNumber_12")
    8361                      .dwattr $C$DW$875, DW_AT_const_value(0x0b)
    8362              
    8363                      .dwendtag $C$DW$T$221
    8364              
    8365              $C$DW$T$222     .dwtag  DW_TAG_typedef
    8366                      .dwattr $C$DW$T$222, DW_AT_name("PIE_GroupNumber_e")
    8367                      .dwattr $C$DW$T$222, DW_AT_type(*$C$DW$T$221)
    8368                      .dwattr $C$DW$T$222, DW_AT_language(DW_LANG_C)
    8369              
    8370              
    8371              $C$DW$T$224     .dwtag  DW_TAG_enumeration_type
    8372                      .dwattr $C$DW$T$224, DW_AT_byte_size(0x01)
    8373              $C$DW$876       .dwtag  DW_TAG_enumerator
    8374                      .dwattr $C$DW$876, DW_AT_name("CTRL_Type_PID_spd")
    8375                      .dwattr $C$DW$876, DW_AT_const_value(0x00)
    8376              
    8377              $C$DW$877       .dwtag  DW_TAG_enumerator
    8378                      .dwattr $C$DW$877, DW_AT_name("CTRL_Type_PID_Id")
    8379                      .dwattr $C$DW$877, DW_AT_const_value(0x01)
    8380              
    8381              $C$DW$878       .dwtag  DW_TAG_enumerator
    8382                      .dwattr $C$DW$878, DW_AT_name("CTRL_Type_PID_Iq")
    8383                      .dwattr $C$DW$878, DW_AT_const_value(0x02)
    8384              
    8385                      .dwendtag $C$DW$T$224
    8386              
    8387              $C$DW$T$225     .dwtag  DW_TAG_typedef
    8388                      .dwattr $C$DW$T$225, DW_AT_name("CTRL_Type_e")
    8389                      .dwattr $C$DW$T$225, DW_AT_type(*$C$DW$T$224)
    8390                      .dwattr $C$DW$T$225, DW_AT_language(DW_LANG_C)
    8391              
    8392              
    8393              $C$DW$T$227     .dwtag  DW_TAG_enumeration_type
    8394                      .dwattr $C$DW$T$227, DW_AT_byte_size(0x01)
    8395              $C$DW$879       .dwtag  DW_TAG_enumerator
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:37:19 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{ED4D92FB-263E-4B1C-8874-2914AFE31498} PAGE  165

    8396                      .dwattr $C$DW$879, DW_AT_name("HAL_SensorType_Current")
    8397                      .dwattr $C$DW$879, DW_AT_const_value(0x00)
    8398              
    8399              $C$DW$880       .dwtag  DW_TAG_enumerator
    8400                      .dwattr $C$DW$880, DW_AT_name("HAL_SensorType_Voltage")
    8401                      .dwattr $C$DW$880, DW_AT_const_value(0x01)
    8402              
    8403                      .dwendtag $C$DW$T$227
    8404              
    8405              $C$DW$T$228     .dwtag  DW_TAG_typedef
    8406                      .dwattr $C$DW$T$228, DW_AT_name("HAL_SensorType_e")
    8407                      .dwattr $C$DW$T$228, DW_AT_type(*$C$DW$T$227)
    8408                      .dwattr $C$DW$T$228, DW_AT_language(DW_LANG_C)
    8409              
    8410              
    8411              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    8412                      .dwattr $C$DW$T$19, DW_AT_name("IPD_HFI_Obj")
    8413                      .dwattr $C$DW$T$19, DW_AT_declaration
    8414                      .dwendtag $C$DW$T$19
    8415              
    8416              $C$DW$T$230     .dwtag  DW_TAG_pointer_type
    8417                      .dwattr $C$DW$T$230, DW_AT_type(*$C$DW$T$19)
    8418                      .dwattr $C$DW$T$230, DW_AT_address_class(0x20)
    8419              
    8420              $C$DW$T$231     .dwtag  DW_TAG_typedef
    8421                      .dwattr $C$DW$T$231, DW_AT_name("IPD_HFI_Handle")
    8422                      .dwattr $C$DW$T$231, DW_AT_type(*$C$DW$T$230)
    8423                      .dwattr $C$DW$T$231, DW_AT_language(DW_LANG_C)
    8424              
    8425              
    8426              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    8427                      .dwattr $C$DW$T$34, DW_AT_name("_ADC_Obj_")
    8428                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x6650)
    8429              $C$DW$881       .dwtag  DW_TAG_member
    8430                      .dwattr $C$DW$881, DW_AT_type(*$C$DW$T$28)
    8431                      .dwattr $C$DW$881, DW_AT_name("ADCRESULT")
    8432                      .dwattr $C$DW$881, DW_AT_TI_symbol_name("_ADCRESULT")
    8433                      .dwattr $C$DW$881, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8434                      .dwattr $C$DW$881, DW_AT_accessibility(DW_ACCESS_public)
    8435              
    8436              $C$DW$882       .dwtag  DW_TAG_member
    8437                      .dwattr $C$DW$882, DW_AT_type(*$C$DW$T$29)
    8438                      .dwattr $C$DW$882, DW_AT_name("resvd_1")
    8439                      .dwattr $C$DW$882, DW_AT_TI_symbol_name("_resvd_1")
    8440                      .dwattr $C$DW$882, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8441                      .dwattr $C$DW$882, DW_AT_accessibility(DW_ACCESS_public)
    8442              
    8443              $C$DW$883       .dwtag  DW_TAG_member
    8444                      .dwattr $C$DW$883, DW_AT_type(*$C$DW$T$27)
    8445                      .dwattr $C$DW$883, DW_AT_name("ADCCTL1")
    8446                      .dwattr $C$DW$883, DW_AT_TI_symbol_name("_ADCCTL1")
    8447                      .dwattr $C$DW$883, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    8448                      .dwattr $C$DW$883, DW_AT_accessibility(DW_ACCESS_public)
    8449              
    8450              $C$DW$884       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:37:19 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{ED4D92FB-263E-4B1C-8874-2914AFE31498} PAGE  166

    8451                      .dwattr $C$DW$884, DW_AT_type(*$C$DW$T$27)
    8452                      .dwattr $C$DW$884, DW_AT_name("ADCCTL2")
    8453                      .dwattr $C$DW$884, DW_AT_TI_symbol_name("_ADCCTL2")
    8454                      .dwattr $C$DW$884, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    8455                      .dwattr $C$DW$884, DW_AT_accessibility(DW_ACCESS_public)
    8456              
    8457              $C$DW$885       .dwtag  DW_TAG_member
    8458                      .dwattr $C$DW$885, DW_AT_type(*$C$DW$T$30)
    8459                      .dwattr $C$DW$885, DW_AT_name("rsvd_2")
    8460                      .dwattr $C$DW$885, DW_AT_TI_symbol_name("_rsvd_2")
    8461                      .dwattr $C$DW$885, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    8462                      .dwattr $C$DW$885, DW_AT_accessibility(DW_ACCESS_public)
    8463              
    8464              $C$DW$886       .dwtag  DW_TAG_member
    8465                      .dwattr $C$DW$886, DW_AT_type(*$C$DW$T$27)
    8466                      .dwattr $C$DW$886, DW_AT_name("ADCINTFLG")
    8467                      .dwattr $C$DW$886, DW_AT_TI_symbol_name("_ADCINTFLG")
    8468                      .dwattr $C$DW$886, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    8469                      .dwattr $C$DW$886, DW_AT_accessibility(DW_ACCESS_public)
    8470              
    8471              $C$DW$887       .dwtag  DW_TAG_member
    8472                      .dwattr $C$DW$887, DW_AT_type(*$C$DW$T$27)
    8473                      .dwattr $C$DW$887, DW_AT_name("ADCINTFLGCLR")
    8474                      .dwattr $C$DW$887, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    8475                      .dwattr $C$DW$887, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    8476                      .dwattr $C$DW$887, DW_AT_accessibility(DW_ACCESS_public)
    8477              
    8478              $C$DW$888       .dwtag  DW_TAG_member
    8479                      .dwattr $C$DW$888, DW_AT_type(*$C$DW$T$27)
    8480                      .dwattr $C$DW$888, DW_AT_name("ADCINTOVF")
    8481                      .dwattr $C$DW$888, DW_AT_TI_symbol_name("_ADCINTOVF")
    8482                      .dwattr $C$DW$888, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    8483                      .dwattr $C$DW$888, DW_AT_accessibility(DW_ACCESS_public)
    8484              
    8485              $C$DW$889       .dwtag  DW_TAG_member
    8486                      .dwattr $C$DW$889, DW_AT_type(*$C$DW$T$27)
    8487                      .dwattr $C$DW$889, DW_AT_name("ADCINTOVFCLR")
    8488                      .dwattr $C$DW$889, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    8489                      .dwattr $C$DW$889, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    8490                      .dwattr $C$DW$889, DW_AT_accessibility(DW_ACCESS_public)
    8491              
    8492              $C$DW$890       .dwtag  DW_TAG_member
    8493                      .dwattr $C$DW$890, DW_AT_type(*$C$DW$T$31)
    8494                      .dwattr $C$DW$890, DW_AT_name("INTSELxNy")
    8495                      .dwattr $C$DW$890, DW_AT_TI_symbol_name("_INTSELxNy")
    8496                      .dwattr $C$DW$890, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    8497                      .dwattr $C$DW$890, DW_AT_accessibility(DW_ACCESS_public)
    8498              
    8499              $C$DW$891       .dwtag  DW_TAG_member
    8500                      .dwattr $C$DW$891, DW_AT_type(*$C$DW$T$32)
    8501                      .dwattr $C$DW$891, DW_AT_name("rsvd_3")
    8502                      .dwattr $C$DW$891, DW_AT_TI_symbol_name("_rsvd_3")
    8503                      .dwattr $C$DW$891, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    8504                      .dwattr $C$DW$891, DW_AT_accessibility(DW_ACCESS_public)
    8505              
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:37:19 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{ED4D92FB-263E-4B1C-8874-2914AFE31498} PAGE  167

    8506              $C$DW$892       .dwtag  DW_TAG_member
    8507                      .dwattr $C$DW$892, DW_AT_type(*$C$DW$T$27)
    8508                      .dwattr $C$DW$892, DW_AT_name("SOCPRICTRL")
    8509                      .dwattr $C$DW$892, DW_AT_TI_symbol_name("_SOCPRICTRL")
    8510                      .dwattr $C$DW$892, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    8511                      .dwattr $C$DW$892, DW_AT_accessibility(DW_ACCESS_public)
    8512              
    8513              $C$DW$893       .dwtag  DW_TAG_member
    8514                      .dwattr $C$DW$893, DW_AT_type(*$C$DW$T$27)
    8515                      .dwattr $C$DW$893, DW_AT_name("rsvd_4")
    8516                      .dwattr $C$DW$893, DW_AT_TI_symbol_name("_rsvd_4")
    8517                      .dwattr $C$DW$893, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    8518                      .dwattr $C$DW$893, DW_AT_accessibility(DW_ACCESS_public)
    8519              
    8520              $C$DW$894       .dwtag  DW_TAG_member
    8521                      .dwattr $C$DW$894, DW_AT_type(*$C$DW$T$27)
    8522                      .dwattr $C$DW$894, DW_AT_name("ADCSAMPLEMODE")
    8523                      .dwattr $C$DW$894, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    8524                      .dwattr $C$DW$894, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    8525                      .dwattr $C$DW$894, DW_AT_accessibility(DW_ACCESS_public)
    8526              
    8527              $C$DW$895       .dwtag  DW_TAG_member
    8528                      .dwattr $C$DW$895, DW_AT_type(*$C$DW$T$27)
    8529                      .dwattr $C$DW$895, DW_AT_name("rsvd_5")
    8530                      .dwattr $C$DW$895, DW_AT_TI_symbol_name("_rsvd_5")
    8531                      .dwattr $C$DW$895, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    8532                      .dwattr $C$DW$895, DW_AT_accessibility(DW_ACCESS_public)
    8533              
    8534              $C$DW$896       .dwtag  DW_TAG_member
    8535                      .dwattr $C$DW$896, DW_AT_type(*$C$DW$T$27)
    8536                      .dwattr $C$DW$896, DW_AT_name("ADCINTSOCSEL1")
    8537                      .dwattr $C$DW$896, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    8538                      .dwattr $C$DW$896, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    8539                      .dwattr $C$DW$896, DW_AT_accessibility(DW_ACCESS_public)
    8540              
    8541              $C$DW$897       .dwtag  DW_TAG_member
    8542                      .dwattr $C$DW$897, DW_AT_type(*$C$DW$T$27)
    8543                      .dwattr $C$DW$897, DW_AT_name("ADCINTSOCSEL2")
    8544                      .dwattr $C$DW$897, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    8545                      .dwattr $C$DW$897, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    8546                      .dwattr $C$DW$897, DW_AT_accessibility(DW_ACCESS_public)
    8547              
    8548              $C$DW$898       .dwtag  DW_TAG_member
    8549                      .dwattr $C$DW$898, DW_AT_type(*$C$DW$T$30)
    8550                      .dwattr $C$DW$898, DW_AT_name("rsvd_6")
    8551                      .dwattr $C$DW$898, DW_AT_TI_symbol_name("_rsvd_6")
    8552                      .dwattr $C$DW$898, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    8553                      .dwattr $C$DW$898, DW_AT_accessibility(DW_ACCESS_public)
    8554              
    8555              $C$DW$899       .dwtag  DW_TAG_member
    8556                      .dwattr $C$DW$899, DW_AT_type(*$C$DW$T$27)
    8557                      .dwattr $C$DW$899, DW_AT_name("ADCSOCFLG1")
    8558                      .dwattr $C$DW$899, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    8559                      .dwattr $C$DW$899, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    8560                      .dwattr $C$DW$899, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:37:19 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{ED4D92FB-263E-4B1C-8874-2914AFE31498} PAGE  168

    8561              
    8562              $C$DW$900       .dwtag  DW_TAG_member
    8563                      .dwattr $C$DW$900, DW_AT_type(*$C$DW$T$27)
    8564                      .dwattr $C$DW$900, DW_AT_name("rsvd_7")
    8565                      .dwattr $C$DW$900, DW_AT_TI_symbol_name("_rsvd_7")
    8566                      .dwattr $C$DW$900, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    8567                      .dwattr $C$DW$900, DW_AT_accessibility(DW_ACCESS_public)
    8568              
    8569              $C$DW$901       .dwtag  DW_TAG_member
    8570                      .dwattr $C$DW$901, DW_AT_type(*$C$DW$T$27)
    8571                      .dwattr $C$DW$901, DW_AT_name("ADCSOCFRC1")
    8572                      .dwattr $C$DW$901, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    8573                      .dwattr $C$DW$901, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    8574                      .dwattr $C$DW$901, DW_AT_accessibility(DW_ACCESS_public)
    8575              
    8576              $C$DW$902       .dwtag  DW_TAG_member
    8577                      .dwattr $C$DW$902, DW_AT_type(*$C$DW$T$27)
    8578                      .dwattr $C$DW$902, DW_AT_name("rsvd_8")
    8579                      .dwattr $C$DW$902, DW_AT_TI_symbol_name("_rsvd_8")
    8580                      .dwattr $C$DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    8581                      .dwattr $C$DW$902, DW_AT_accessibility(DW_ACCESS_public)
    8582              
    8583              $C$DW$903       .dwtag  DW_TAG_member
    8584                      .dwattr $C$DW$903, DW_AT_type(*$C$DW$T$27)
    8585                      .dwattr $C$DW$903, DW_AT_name("ADCSOCOVF1")
    8586                      .dwattr $C$DW$903, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    8587                      .dwattr $C$DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    8588                      .dwattr $C$DW$903, DW_AT_accessibility(DW_ACCESS_public)
    8589              
    8590              $C$DW$904       .dwtag  DW_TAG_member
    8591                      .dwattr $C$DW$904, DW_AT_type(*$C$DW$T$27)
    8592                      .dwattr $C$DW$904, DW_AT_name("rsvd_9")
    8593                      .dwattr $C$DW$904, DW_AT_TI_symbol_name("_rsvd_9")
    8594                      .dwattr $C$DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    8595                      .dwattr $C$DW$904, DW_AT_accessibility(DW_ACCESS_public)
    8596              
    8597              $C$DW$905       .dwtag  DW_TAG_member
    8598                      .dwattr $C$DW$905, DW_AT_type(*$C$DW$T$27)
    8599                      .dwattr $C$DW$905, DW_AT_name("ADCSOCOVFCLR1")
    8600                      .dwattr $C$DW$905, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    8601                      .dwattr $C$DW$905, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    8602                      .dwattr $C$DW$905, DW_AT_accessibility(DW_ACCESS_public)
    8603              
    8604              $C$DW$906       .dwtag  DW_TAG_member
    8605                      .dwattr $C$DW$906, DW_AT_type(*$C$DW$T$27)
    8606                      .dwattr $C$DW$906, DW_AT_name("rsvd_10")
    8607                      .dwattr $C$DW$906, DW_AT_TI_symbol_name("_rsvd_10")
    8608                      .dwattr $C$DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    8609                      .dwattr $C$DW$906, DW_AT_accessibility(DW_ACCESS_public)
    8610              
    8611              $C$DW$907       .dwtag  DW_TAG_member
    8612                      .dwattr $C$DW$907, DW_AT_type(*$C$DW$T$28)
    8613                      .dwattr $C$DW$907, DW_AT_name("ADCSOCxCTL")
    8614                      .dwattr $C$DW$907, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    8615                      .dwattr $C$DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:37:19 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{ED4D92FB-263E-4B1C-8874-2914AFE31498} PAGE  169

    8616                      .dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
    8617              
    8618              $C$DW$908       .dwtag  DW_TAG_member
    8619                      .dwattr $C$DW$908, DW_AT_type(*$C$DW$T$28)
    8620                      .dwattr $C$DW$908, DW_AT_name("rsvd_11")
    8621                      .dwattr $C$DW$908, DW_AT_TI_symbol_name("_rsvd_11")
    8622                      .dwattr $C$DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    8623                      .dwattr $C$DW$908, DW_AT_accessibility(DW_ACCESS_public)
    8624              
    8625              $C$DW$909       .dwtag  DW_TAG_member
    8626                      .dwattr $C$DW$909, DW_AT_type(*$C$DW$T$27)
    8627                      .dwattr $C$DW$909, DW_AT_name("ADCREFTRIM")
    8628                      .dwattr $C$DW$909, DW_AT_TI_symbol_name("_ADCREFTRIM")
    8629                      .dwattr $C$DW$909, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    8630                      .dwattr $C$DW$909, DW_AT_accessibility(DW_ACCESS_public)
    8631              
    8632              $C$DW$910       .dwtag  DW_TAG_member
    8633                      .dwattr $C$DW$910, DW_AT_type(*$C$DW$T$27)
    8634                      .dwattr $C$DW$910, DW_AT_name("ADCOFFTRIM")
    8635                      .dwattr $C$DW$910, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    8636                      .dwattr $C$DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    8637                      .dwattr $C$DW$910, DW_AT_accessibility(DW_ACCESS_public)
    8638              
    8639              $C$DW$911       .dwtag  DW_TAG_member
    8640                      .dwattr $C$DW$911, DW_AT_type(*$C$DW$T$33)
    8641                      .dwattr $C$DW$911, DW_AT_name("resvd_12")
    8642                      .dwattr $C$DW$911, DW_AT_TI_symbol_name("_resvd_12")
    8643                      .dwattr $C$DW$911, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    8644                      .dwattr $C$DW$911, DW_AT_accessibility(DW_ACCESS_public)
    8645              
    8646              $C$DW$912       .dwtag  DW_TAG_member
    8647                      .dwattr $C$DW$912, DW_AT_type(*$C$DW$T$27)
    8648                      .dwattr $C$DW$912, DW_AT_name("ADCREV")
    8649                      .dwattr $C$DW$912, DW_AT_TI_symbol_name("_ADCREV")
    8650                      .dwattr $C$DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    8651                      .dwattr $C$DW$912, DW_AT_accessibility(DW_ACCESS_public)
    8652              
    8653                      .dwendtag $C$DW$T$34
    8654              
    8655              $C$DW$T$235     .dwtag  DW_TAG_typedef
    8656                      .dwattr $C$DW$T$235, DW_AT_name("ADC_Obj")
    8657                      .dwattr $C$DW$T$235, DW_AT_type(*$C$DW$T$34)
    8658                      .dwattr $C$DW$T$235, DW_AT_language(DW_LANG_C)
    8659              
    8660              $C$DW$T$124     .dwtag  DW_TAG_pointer_type
    8661                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$34)
    8662                      .dwattr $C$DW$T$124, DW_AT_address_class(0x20)
    8663              
    8664              $C$DW$T$125     .dwtag  DW_TAG_typedef
    8665                      .dwattr $C$DW$T$125, DW_AT_name("ADC_Handle")
    8666                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
    8667                      .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    8668              
    8669              
    8670              $C$DW$T$20      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:37:19 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{ED4D92FB-263E-4B1C-8874-2914AFE31498} PAGE  170

    8671                      .dwattr $C$DW$T$20, DW_AT_name("_AFSEL_Obj_")
    8672                      .dwattr $C$DW$T$20, DW_AT_declaration
    8673                      .dwendtag $C$DW$T$20
    8674              
    8675              $C$DW$T$236     .dwtag  DW_TAG_pointer_type
    8676                      .dwattr $C$DW$T$236, DW_AT_type(*$C$DW$T$20)
    8677                      .dwattr $C$DW$T$236, DW_AT_address_class(0x20)
    8678              
    8679              $C$DW$T$237     .dwtag  DW_TAG_typedef
    8680                      .dwattr $C$DW$T$237, DW_AT_name("AFSEL_Handle")
    8681                      .dwattr $C$DW$T$237, DW_AT_type(*$C$DW$T$236)
    8682                      .dwattr $C$DW$T$237, DW_AT_language(DW_LANG_C)
    8683              
    8684              
    8685              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    8686                      .dwattr $C$DW$T$38, DW_AT_name("_CLARKE_Obj_")
    8687                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x06)
    8688              $C$DW$913       .dwtag  DW_TAG_member
    8689                      .dwattr $C$DW$913, DW_AT_type(*$C$DW$T$35)
    8690                      .dwattr $C$DW$913, DW_AT_name("alpha_sf")
    8691                      .dwattr $C$DW$913, DW_AT_TI_symbol_name("_alpha_sf")
    8692                      .dwattr $C$DW$913, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8693                      .dwattr $C$DW$913, DW_AT_accessibility(DW_ACCESS_public)
    8694              
    8695              $C$DW$914       .dwtag  DW_TAG_member
    8696                      .dwattr $C$DW$914, DW_AT_type(*$C$DW$T$35)
    8697                      .dwattr $C$DW$914, DW_AT_name("beta_sf")
    8698                      .dwattr $C$DW$914, DW_AT_TI_symbol_name("_beta_sf")
    8699                      .dwattr $C$DW$914, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8700                      .dwattr $C$DW$914, DW_AT_accessibility(DW_ACCESS_public)
    8701              
    8702              $C$DW$915       .dwtag  DW_TAG_member
    8703                      .dwattr $C$DW$915, DW_AT_type(*$C$DW$T$37)
    8704                      .dwattr $C$DW$915, DW_AT_name("numSensors")
    8705                      .dwattr $C$DW$915, DW_AT_TI_symbol_name("_numSensors")
    8706                      .dwattr $C$DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8707                      .dwattr $C$DW$915, DW_AT_accessibility(DW_ACCESS_public)
    8708              
    8709                      .dwendtag $C$DW$T$38
    8710              
    8711              $C$DW$T$49      .dwtag  DW_TAG_typedef
    8712                      .dwattr $C$DW$T$49, DW_AT_name("CLARKE_Obj")
    8713                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$38)
    8714                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    8715              
    8716              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    8717                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$38)
    8718                      .dwattr $C$DW$T$47, DW_AT_address_class(0x20)
    8719              
    8720              $C$DW$T$48      .dwtag  DW_TAG_typedef
    8721                      .dwattr $C$DW$T$48, DW_AT_name("CLARKE_Handle")
    8722                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    8723                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    8724              
    8725              $C$DW$916       .dwtag  DW_TAG_TI_far_type
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:37:19 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{ED4D92FB-263E-4B1C-8874-2914AFE31498} PAGE  171

    8726                      .dwattr $C$DW$916, DW_AT_type(*$C$DW$T$48)
    8727              
    8728              $C$DW$T$241     .dwtag  DW_TAG_const_type
    8729                      .dwattr $C$DW$T$241, DW_AT_type(*$C$DW$916)
    8730              
    8731              
    8732              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    8733                      .dwattr $C$DW$T$40, DW_AT_name("_CLK_Obj_")
    8734                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x11)
    8735              $C$DW$917       .dwtag  DW_TAG_member
    8736                      .dwattr $C$DW$917, DW_AT_type(*$C$DW$T$27)
    8737                      .dwattr $C$DW$917, DW_AT_name("XCLK")
    8738                      .dwattr $C$DW$917, DW_AT_TI_symbol_name("_XCLK")
    8739                      .dwattr $C$DW$917, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8740                      .dwattr $C$DW$917, DW_AT_accessibility(DW_ACCESS_public)
    8741              
    8742              $C$DW$918       .dwtag  DW_TAG_member
    8743                      .dwattr $C$DW$918, DW_AT_type(*$C$DW$T$27)
    8744                      .dwattr $C$DW$918, DW_AT_name("rsvd_1")
    8745                      .dwattr $C$DW$918, DW_AT_TI_symbol_name("_rsvd_1")
    8746                      .dwattr $C$DW$918, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8747                      .dwattr $C$DW$918, DW_AT_accessibility(DW_ACCESS_public)
    8748              
    8749              $C$DW$919       .dwtag  DW_TAG_member
    8750                      .dwattr $C$DW$919, DW_AT_type(*$C$DW$T$27)
    8751                      .dwattr $C$DW$919, DW_AT_name("CLKCTL")
    8752                      .dwattr $C$DW$919, DW_AT_TI_symbol_name("_CLKCTL")
    8753                      .dwattr $C$DW$919, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8754                      .dwattr $C$DW$919, DW_AT_accessibility(DW_ACCESS_public)
    8755              
    8756              $C$DW$920       .dwtag  DW_TAG_member
    8757                      .dwattr $C$DW$920, DW_AT_type(*$C$DW$T$39)
    8758                      .dwattr $C$DW$920, DW_AT_name("rsvd_2")
    8759                      .dwattr $C$DW$920, DW_AT_TI_symbol_name("_rsvd_2")
    8760                      .dwattr $C$DW$920, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8761                      .dwattr $C$DW$920, DW_AT_accessibility(DW_ACCESS_public)
    8762              
    8763              $C$DW$921       .dwtag  DW_TAG_member
    8764                      .dwattr $C$DW$921, DW_AT_type(*$C$DW$T$27)
    8765                      .dwattr $C$DW$921, DW_AT_name("LOSPCP")
    8766                      .dwattr $C$DW$921, DW_AT_TI_symbol_name("_LOSPCP")
    8767                      .dwattr $C$DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    8768                      .dwattr $C$DW$921, DW_AT_accessibility(DW_ACCESS_public)
    8769              
    8770              $C$DW$922       .dwtag  DW_TAG_member
    8771                      .dwattr $C$DW$922, DW_AT_type(*$C$DW$T$27)
    8772                      .dwattr $C$DW$922, DW_AT_name("PCLKCR0")
    8773                      .dwattr $C$DW$922, DW_AT_TI_symbol_name("_PCLKCR0")
    8774                      .dwattr $C$DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8775                      .dwattr $C$DW$922, DW_AT_accessibility(DW_ACCESS_public)
    8776              
    8777              $C$DW$923       .dwtag  DW_TAG_member
    8778                      .dwattr $C$DW$923, DW_AT_type(*$C$DW$T$27)
    8779                      .dwattr $C$DW$923, DW_AT_name("PCLKCR1")
    8780                      .dwattr $C$DW$923, DW_AT_TI_symbol_name("_PCLKCR1")
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:37:19 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{ED4D92FB-263E-4B1C-8874-2914AFE31498} PAGE  172

    8781                      .dwattr $C$DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8782                      .dwattr $C$DW$923, DW_AT_accessibility(DW_ACCESS_public)
    8783              
    8784              $C$DW$924       .dwtag  DW_TAG_member
    8785                      .dwattr $C$DW$924, DW_AT_type(*$C$DW$T$30)
    8786                      .dwattr $C$DW$924, DW_AT_name("rsvd_3")
    8787                      .dwattr $C$DW$924, DW_AT_TI_symbol_name("_rsvd_3")
    8788                      .dwattr $C$DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8789                      .dwattr $C$DW$924, DW_AT_accessibility(DW_ACCESS_public)
    8790              
    8791              $C$DW$925       .dwtag  DW_TAG_member
    8792                      .dwattr $C$DW$925, DW_AT_type(*$C$DW$T$27)
    8793                      .dwattr $C$DW$925, DW_AT_name("PCLKCR3")
    8794                      .dwattr $C$DW$925, DW_AT_TI_symbol_name("_PCLKCR3")
    8795                      .dwattr $C$DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8796                      .dwattr $C$DW$925, DW_AT_accessibility(DW_ACCESS_public)
    8797              
    8798                      .dwendtag $C$DW$T$40
    8799              
    8800              $C$DW$T$126     .dwtag  DW_TAG_pointer_type
    8801                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$40)
    8802                      .dwattr $C$DW$T$126, DW_AT_address_class(0x20)
    8803              
    8804              $C$DW$T$127     .dwtag  DW_TAG_typedef
    8805                      .dwattr $C$DW$T$127, DW_AT_name("CLK_Handle")
    8806                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
    8807                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    8808              
    8809              
    8810              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    8811                      .dwattr $C$DW$T$41, DW_AT_name("_CPU_Obj_")
    8812                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    8813              $C$DW$926       .dwtag  DW_TAG_member
    8814                      .dwattr $C$DW$926, DW_AT_type(*$C$DW$T$37)
    8815                      .dwattr $C$DW$926, DW_AT_name("tmp")
    8816                      .dwattr $C$DW$926, DW_AT_TI_symbol_name("_tmp")
    8817                      .dwattr $C$DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8818                      .dwattr $C$DW$926, DW_AT_accessibility(DW_ACCESS_public)
    8819              
    8820                      .dwendtag $C$DW$T$41
    8821              
    8822              $C$DW$T$128     .dwtag  DW_TAG_pointer_type
    8823                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$41)
    8824                      .dwattr $C$DW$T$128, DW_AT_address_class(0x20)
    8825              
    8826              $C$DW$T$129     .dwtag  DW_TAG_typedef
    8827                      .dwattr $C$DW$T$129, DW_AT_name("CPU_Handle")
    8828                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$128)
    8829                      .dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
    8830              
    8831              
    8832              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    8833                      .dwattr $C$DW$T$77, DW_AT_name("_CTRL_Obj_")
    8834                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x10a)
    8835              $C$DW$927       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:37:19 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{ED4D92FB-263E-4B1C-8874-2914AFE31498} PAGE  173

    8836                      .dwattr $C$DW$927, DW_AT_type(*$C$DW$T$42)
    8837                      .dwattr $C$DW$927, DW_AT_name("version")
    8838                      .dwattr $C$DW$927, DW_AT_TI_symbol_name("_version")
    8839                      .dwattr $C$DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8840                      .dwattr $C$DW$927, DW_AT_accessibility(DW_ACCESS_public)
    8841              
    8842              $C$DW$928       .dwtag  DW_TAG_member
    8843                      .dwattr $C$DW$928, DW_AT_type(*$C$DW$T$44)
    8844                      .dwattr $C$DW$928, DW_AT_name("state")
    8845                      .dwattr $C$DW$928, DW_AT_TI_symbol_name("_state")
    8846                      .dwattr $C$DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8847                      .dwattr $C$DW$928, DW_AT_accessibility(DW_ACCESS_public)
    8848              
    8849              $C$DW$929       .dwtag  DW_TAG_member
    8850                      .dwattr $C$DW$929, DW_AT_type(*$C$DW$T$44)
    8851                      .dwattr $C$DW$929, DW_AT_name("prevState")
    8852                      .dwattr $C$DW$929, DW_AT_TI_symbol_name("_prevState")
    8853                      .dwattr $C$DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8854                      .dwattr $C$DW$929, DW_AT_accessibility(DW_ACCESS_public)
    8855              
    8856              $C$DW$930       .dwtag  DW_TAG_member
    8857                      .dwattr $C$DW$930, DW_AT_type(*$C$DW$T$46)
    8858                      .dwattr $C$DW$930, DW_AT_name("errorCode")
    8859                      .dwattr $C$DW$930, DW_AT_TI_symbol_name("_errorCode")
    8860                      .dwattr $C$DW$930, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8861                      .dwattr $C$DW$930, DW_AT_accessibility(DW_ACCESS_public)
    8862              
    8863              $C$DW$931       .dwtag  DW_TAG_member
    8864                      .dwattr $C$DW$931, DW_AT_type(*$C$DW$T$48)
    8865                      .dwattr $C$DW$931, DW_AT_name("clarkeHandle_I")
    8866                      .dwattr $C$DW$931, DW_AT_TI_symbol_name("_clarkeHandle_I")
    8867                      .dwattr $C$DW$931, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8868                      .dwattr $C$DW$931, DW_AT_accessibility(DW_ACCESS_public)
    8869              
    8870              $C$DW$932       .dwtag  DW_TAG_member
    8871                      .dwattr $C$DW$932, DW_AT_type(*$C$DW$T$49)
    8872                      .dwattr $C$DW$932, DW_AT_name("clarke_I")
    8873                      .dwattr $C$DW$932, DW_AT_TI_symbol_name("_clarke_I")
    8874                      .dwattr $C$DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8875                      .dwattr $C$DW$932, DW_AT_accessibility(DW_ACCESS_public)
    8876              
    8877              $C$DW$933       .dwtag  DW_TAG_member
    8878                      .dwattr $C$DW$933, DW_AT_type(*$C$DW$T$48)
    8879                      .dwattr $C$DW$933, DW_AT_name("clarkeHandle_V")
    8880                      .dwattr $C$DW$933, DW_AT_TI_symbol_name("_clarkeHandle_V")
    8881                      .dwattr $C$DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8882                      .dwattr $C$DW$933, DW_AT_accessibility(DW_ACCESS_public)
    8883              
    8884              $C$DW$934       .dwtag  DW_TAG_member
    8885                      .dwattr $C$DW$934, DW_AT_type(*$C$DW$T$49)
    8886                      .dwattr $C$DW$934, DW_AT_name("clarke_V")
    8887                      .dwattr $C$DW$934, DW_AT_TI_symbol_name("_clarke_V")
    8888                      .dwattr $C$DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8889                      .dwattr $C$DW$934, DW_AT_accessibility(DW_ACCESS_public)
    8890              
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:37:19 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{ED4D92FB-263E-4B1C-8874-2914AFE31498} PAGE  174

    8891              $C$DW$935       .dwtag  DW_TAG_member
    8892                      .dwattr $C$DW$935, DW_AT_type(*$C$DW$T$51)
    8893                      .dwattr $C$DW$935, DW_AT_name("estHandle")
    8894                      .dwattr $C$DW$935, DW_AT_TI_symbol_name("_estHandle")
    8895                      .dwattr $C$DW$935, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8896                      .dwattr $C$DW$935, DW_AT_accessibility(DW_ACCESS_public)
    8897              
    8898              $C$DW$936       .dwtag  DW_TAG_member
    8899                      .dwattr $C$DW$936, DW_AT_type(*$C$DW$T$53)
    8900                      .dwattr $C$DW$936, DW_AT_name("parkHandle")
    8901                      .dwattr $C$DW$936, DW_AT_TI_symbol_name("_parkHandle")
    8902                      .dwattr $C$DW$936, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    8903                      .dwattr $C$DW$936, DW_AT_accessibility(DW_ACCESS_public)
    8904              
    8905              $C$DW$937       .dwtag  DW_TAG_member
    8906                      .dwattr $C$DW$937, DW_AT_type(*$C$DW$T$54)
    8907                      .dwattr $C$DW$937, DW_AT_name("park")
    8908                      .dwattr $C$DW$937, DW_AT_TI_symbol_name("_park")
    8909                      .dwattr $C$DW$937, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8910                      .dwattr $C$DW$937, DW_AT_accessibility(DW_ACCESS_public)
    8911              
    8912              $C$DW$938       .dwtag  DW_TAG_member
    8913                      .dwattr $C$DW$938, DW_AT_type(*$C$DW$T$56)
    8914                      .dwattr $C$DW$938, DW_AT_name("pidHandle_Id")
    8915                      .dwattr $C$DW$938, DW_AT_TI_symbol_name("_pidHandle_Id")
    8916                      .dwattr $C$DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8917                      .dwattr $C$DW$938, DW_AT_accessibility(DW_ACCESS_public)
    8918              
    8919              $C$DW$939       .dwtag  DW_TAG_member
    8920                      .dwattr $C$DW$939, DW_AT_type(*$C$DW$T$57)
    8921                      .dwattr $C$DW$939, DW_AT_name("pid_Id")
    8922                      .dwattr $C$DW$939, DW_AT_TI_symbol_name("_pid_Id")
    8923                      .dwattr $C$DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    8924                      .dwattr $C$DW$939, DW_AT_accessibility(DW_ACCESS_public)
    8925              
    8926              $C$DW$940       .dwtag  DW_TAG_member
    8927                      .dwattr $C$DW$940, DW_AT_type(*$C$DW$T$56)
    8928                      .dwattr $C$DW$940, DW_AT_name("pidHandle_Iq")
    8929                      .dwattr $C$DW$940, DW_AT_TI_symbol_name("_pidHandle_Iq")
    8930                      .dwattr $C$DW$940, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    8931                      .dwattr $C$DW$940, DW_AT_accessibility(DW_ACCESS_public)
    8932              
    8933              $C$DW$941       .dwtag  DW_TAG_member
    8934                      .dwattr $C$DW$941, DW_AT_type(*$C$DW$T$57)
    8935                      .dwattr $C$DW$941, DW_AT_name("pid_Iq")
    8936                      .dwattr $C$DW$941, DW_AT_TI_symbol_name("_pid_Iq")
    8937                      .dwattr $C$DW$941, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    8938                      .dwattr $C$DW$941, DW_AT_accessibility(DW_ACCESS_public)
    8939              
    8940              $C$DW$942       .dwtag  DW_TAG_member
    8941                      .dwattr $C$DW$942, DW_AT_type(*$C$DW$T$56)
    8942                      .dwattr $C$DW$942, DW_AT_name("pidHandle_spd")
    8943                      .dwattr $C$DW$942, DW_AT_TI_symbol_name("_pidHandle_spd")
    8944                      .dwattr $C$DW$942, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    8945                      .dwattr $C$DW$942, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:37:19 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{ED4D92FB-263E-4B1C-8874-2914AFE31498} PAGE  175

    8946              
    8947              $C$DW$943       .dwtag  DW_TAG_member
    8948                      .dwattr $C$DW$943, DW_AT_type(*$C$DW$T$57)
    8949                      .dwattr $C$DW$943, DW_AT_name("pid_spd")
    8950                      .dwattr $C$DW$943, DW_AT_TI_symbol_name("_pid_spd")
    8951                      .dwattr $C$DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    8952                      .dwattr $C$DW$943, DW_AT_accessibility(DW_ACCESS_public)
    8953              
    8954              $C$DW$944       .dwtag  DW_TAG_member
    8955                      .dwattr $C$DW$944, DW_AT_type(*$C$DW$T$59)
    8956                      .dwattr $C$DW$944, DW_AT_name("iparkHandle")
    8957                      .dwattr $C$DW$944, DW_AT_TI_symbol_name("_iparkHandle")
    8958                      .dwattr $C$DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    8959                      .dwattr $C$DW$944, DW_AT_accessibility(DW_ACCESS_public)
    8960              
    8961              $C$DW$945       .dwtag  DW_TAG_member
    8962                      .dwattr $C$DW$945, DW_AT_type(*$C$DW$T$60)
    8963                      .dwattr $C$DW$945, DW_AT_name("ipark")
    8964                      .dwattr $C$DW$945, DW_AT_TI_symbol_name("_ipark")
    8965                      .dwattr $C$DW$945, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    8966                      .dwattr $C$DW$945, DW_AT_accessibility(DW_ACCESS_public)
    8967              
    8968              $C$DW$946       .dwtag  DW_TAG_member
    8969                      .dwattr $C$DW$946, DW_AT_type(*$C$DW$T$62)
    8970                      .dwattr $C$DW$946, DW_AT_name("svgenHandle")
    8971                      .dwattr $C$DW$946, DW_AT_TI_symbol_name("_svgenHandle")
    8972                      .dwattr $C$DW$946, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    8973                      .dwattr $C$DW$946, DW_AT_accessibility(DW_ACCESS_public)
    8974              
    8975              $C$DW$947       .dwtag  DW_TAG_member
    8976                      .dwattr $C$DW$947, DW_AT_type(*$C$DW$T$63)
    8977                      .dwattr $C$DW$947, DW_AT_name("svgen")
    8978                      .dwattr $C$DW$947, DW_AT_TI_symbol_name("_svgen")
    8979                      .dwattr $C$DW$947, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    8980                      .dwattr $C$DW$947, DW_AT_accessibility(DW_ACCESS_public)
    8981              
    8982              $C$DW$948       .dwtag  DW_TAG_member
    8983                      .dwattr $C$DW$948, DW_AT_type(*$C$DW$T$65)
    8984                      .dwattr $C$DW$948, DW_AT_name("trajHandle_Id")
    8985                      .dwattr $C$DW$948, DW_AT_TI_symbol_name("_trajHandle_Id")
    8986                      .dwattr $C$DW$948, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    8987                      .dwattr $C$DW$948, DW_AT_accessibility(DW_ACCESS_public)
    8988              
    8989              $C$DW$949       .dwtag  DW_TAG_member
    8990                      .dwattr $C$DW$949, DW_AT_type(*$C$DW$T$66)
    8991                      .dwattr $C$DW$949, DW_AT_name("traj_Id")
    8992                      .dwattr $C$DW$949, DW_AT_TI_symbol_name("_traj_Id")
    8993                      .dwattr $C$DW$949, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    8994                      .dwattr $C$DW$949, DW_AT_accessibility(DW_ACCESS_public)
    8995              
    8996              $C$DW$950       .dwtag  DW_TAG_member
    8997                      .dwattr $C$DW$950, DW_AT_type(*$C$DW$T$65)
    8998                      .dwattr $C$DW$950, DW_AT_name("trajHandle_spd")
    8999                      .dwattr $C$DW$950, DW_AT_TI_symbol_name("_trajHandle_spd")
    9000                      .dwattr $C$DW$950, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:37:19 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{ED4D92FB-263E-4B1C-8874-2914AFE31498} PAGE  176

    9001                      .dwattr $C$DW$950, DW_AT_accessibility(DW_ACCESS_public)
    9002              
    9003              $C$DW$951       .dwtag  DW_TAG_member
    9004                      .dwattr $C$DW$951, DW_AT_type(*$C$DW$T$66)
    9005                      .dwattr $C$DW$951, DW_AT_name("traj_spd")
    9006                      .dwattr $C$DW$951, DW_AT_TI_symbol_name("_traj_spd")
    9007                      .dwattr $C$DW$951, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    9008                      .dwattr $C$DW$951, DW_AT_accessibility(DW_ACCESS_public)
    9009              
    9010              $C$DW$952       .dwtag  DW_TAG_member
    9011                      .dwattr $C$DW$952, DW_AT_type(*$C$DW$T$65)
    9012                      .dwattr $C$DW$952, DW_AT_name("trajHandle_spdMax")
    9013                      .dwattr $C$DW$952, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    9014                      .dwattr $C$DW$952, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    9015                      .dwattr $C$DW$952, DW_AT_accessibility(DW_ACCESS_public)
    9016              
    9017              $C$DW$953       .dwtag  DW_TAG_member
    9018                      .dwattr $C$DW$953, DW_AT_type(*$C$DW$T$66)
    9019                      .dwattr $C$DW$953, DW_AT_name("traj_spdMax")
    9020                      .dwattr $C$DW$953, DW_AT_TI_symbol_name("_traj_spdMax")
    9021                      .dwattr $C$DW$953, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    9022                      .dwattr $C$DW$953, DW_AT_accessibility(DW_ACCESS_public)
    9023              
    9024              $C$DW$954       .dwtag  DW_TAG_member
    9025                      .dwattr $C$DW$954, DW_AT_type(*$C$DW$T$67)
    9026                      .dwattr $C$DW$954, DW_AT_name("motorParams")
    9027                      .dwattr $C$DW$954, DW_AT_TI_symbol_name("_motorParams")
    9028                      .dwattr $C$DW$954, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    9029                      .dwattr $C$DW$954, DW_AT_accessibility(DW_ACCESS_public)
    9030              
    9031              $C$DW$955       .dwtag  DW_TAG_member
    9032                      .dwattr $C$DW$955, DW_AT_type(*$C$DW$T$71)
    9033                      .dwattr $C$DW$955, DW_AT_name("waitTimes")
    9034                      .dwattr $C$DW$955, DW_AT_TI_symbol_name("_waitTimes")
    9035                      .dwattr $C$DW$955, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    9036                      .dwattr $C$DW$955, DW_AT_accessibility(DW_ACCESS_public)
    9037              
    9038              $C$DW$956       .dwtag  DW_TAG_member
    9039                      .dwattr $C$DW$956, DW_AT_type(*$C$DW$T$70)
    9040                      .dwattr $C$DW$956, DW_AT_name("counter_state")
    9041                      .dwattr $C$DW$956, DW_AT_TI_symbol_name("_counter_state")
    9042                      .dwattr $C$DW$956, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    9043                      .dwattr $C$DW$956, DW_AT_accessibility(DW_ACCESS_public)
    9044              
    9045              $C$DW$957       .dwtag  DW_TAG_member
    9046                      .dwattr $C$DW$957, DW_AT_type(*$C$DW$T$73)
    9047                      .dwattr $C$DW$957, DW_AT_name("numIsrTicksPerCtrlTick")
    9048                      .dwattr $C$DW$957, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    9049                      .dwattr $C$DW$957, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    9050                      .dwattr $C$DW$957, DW_AT_accessibility(DW_ACCESS_public)
    9051              
    9052              $C$DW$958       .dwtag  DW_TAG_member
    9053                      .dwattr $C$DW$958, DW_AT_type(*$C$DW$T$73)
    9054                      .dwattr $C$DW$958, DW_AT_name("numCtrlTicksPerCurrentTick")
    9055                      .dwattr $C$DW$958, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:37:19 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{ED4D92FB-263E-4B1C-8874-2914AFE31498} PAGE  177

    9056                      .dwattr $C$DW$958, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    9057                      .dwattr $C$DW$958, DW_AT_accessibility(DW_ACCESS_public)
    9058              
    9059              $C$DW$959       .dwtag  DW_TAG_member
    9060                      .dwattr $C$DW$959, DW_AT_type(*$C$DW$T$73)
    9061                      .dwattr $C$DW$959, DW_AT_name("numCtrlTicksPerSpeedTick")
    9062                      .dwattr $C$DW$959, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    9063                      .dwattr $C$DW$959, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    9064                      .dwattr $C$DW$959, DW_AT_accessibility(DW_ACCESS_public)
    9065              
    9066              $C$DW$960       .dwtag  DW_TAG_member
    9067                      .dwattr $C$DW$960, DW_AT_type(*$C$DW$T$73)
    9068                      .dwattr $C$DW$960, DW_AT_name("numCtrlTicksPerTrajTick")
    9069                      .dwattr $C$DW$960, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    9070                      .dwattr $C$DW$960, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    9071                      .dwattr $C$DW$960, DW_AT_accessibility(DW_ACCESS_public)
    9072              
    9073              $C$DW$961       .dwtag  DW_TAG_member
    9074                      .dwattr $C$DW$961, DW_AT_type(*$C$DW$T$70)
    9075                      .dwattr $C$DW$961, DW_AT_name("ctrlFreq_Hz")
    9076                      .dwattr $C$DW$961, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    9077                      .dwattr $C$DW$961, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    9078                      .dwattr $C$DW$961, DW_AT_accessibility(DW_ACCESS_public)
    9079              
    9080              $C$DW$962       .dwtag  DW_TAG_member
    9081                      .dwattr $C$DW$962, DW_AT_type(*$C$DW$T$70)
    9082                      .dwattr $C$DW$962, DW_AT_name("trajFreq_Hz")
    9083                      .dwattr $C$DW$962, DW_AT_TI_symbol_name("_trajFreq_Hz")
    9084                      .dwattr $C$DW$962, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    9085                      .dwattr $C$DW$962, DW_AT_accessibility(DW_ACCESS_public)
    9086              
    9087              $C$DW$963       .dwtag  DW_TAG_member
    9088                      .dwattr $C$DW$963, DW_AT_type(*$C$DW$T$35)
    9089                      .dwattr $C$DW$963, DW_AT_name("trajPeriod_sec")
    9090                      .dwattr $C$DW$963, DW_AT_TI_symbol_name("_trajPeriod_sec")
    9091                      .dwattr $C$DW$963, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    9092                      .dwattr $C$DW$963, DW_AT_accessibility(DW_ACCESS_public)
    9093              
    9094              $C$DW$964       .dwtag  DW_TAG_member
    9095                      .dwattr $C$DW$964, DW_AT_type(*$C$DW$T$74)
    9096                      .dwattr $C$DW$964, DW_AT_name("ctrlPeriod_sec")
    9097                      .dwattr $C$DW$964, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    9098                      .dwattr $C$DW$964, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    9099                      .dwattr $C$DW$964, DW_AT_accessibility(DW_ACCESS_public)
    9100              
    9101              $C$DW$965       .dwtag  DW_TAG_member
    9102                      .dwattr $C$DW$965, DW_AT_type(*$C$DW$T$35)
    9103                      .dwattr $C$DW$965, DW_AT_name("maxVsMag_pu")
    9104                      .dwattr $C$DW$965, DW_AT_TI_symbol_name("_maxVsMag_pu")
    9105                      .dwattr $C$DW$965, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    9106                      .dwattr $C$DW$965, DW_AT_accessibility(DW_ACCESS_public)
    9107              
    9108              $C$DW$966       .dwtag  DW_TAG_member
    9109                      .dwattr $C$DW$966, DW_AT_type(*$C$DW$T$75)
    9110                      .dwattr $C$DW$966, DW_AT_name("Iab_in")
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:37:19 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{ED4D92FB-263E-4B1C-8874-2914AFE31498} PAGE  178

    9111                      .dwattr $C$DW$966, DW_AT_TI_symbol_name("_Iab_in")
    9112                      .dwattr $C$DW$966, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    9113                      .dwattr $C$DW$966, DW_AT_accessibility(DW_ACCESS_public)
    9114              
    9115              $C$DW$967       .dwtag  DW_TAG_member
    9116                      .dwattr $C$DW$967, DW_AT_type(*$C$DW$T$75)
    9117                      .dwattr $C$DW$967, DW_AT_name("Iab_filt")
    9118                      .dwattr $C$DW$967, DW_AT_TI_symbol_name("_Iab_filt")
    9119                      .dwattr $C$DW$967, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    9120                      .dwattr $C$DW$967, DW_AT_accessibility(DW_ACCESS_public)
    9121              
    9122              $C$DW$968       .dwtag  DW_TAG_member
    9123                      .dwattr $C$DW$968, DW_AT_type(*$C$DW$T$75)
    9124                      .dwattr $C$DW$968, DW_AT_name("Idq_in")
    9125                      .dwattr $C$DW$968, DW_AT_TI_symbol_name("_Idq_in")
    9126                      .dwattr $C$DW$968, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    9127                      .dwattr $C$DW$968, DW_AT_accessibility(DW_ACCESS_public)
    9128              
    9129              $C$DW$969       .dwtag  DW_TAG_member
    9130                      .dwattr $C$DW$969, DW_AT_type(*$C$DW$T$75)
    9131                      .dwattr $C$DW$969, DW_AT_name("Vab_in")
    9132                      .dwattr $C$DW$969, DW_AT_TI_symbol_name("_Vab_in")
    9133                      .dwattr $C$DW$969, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    9134                      .dwattr $C$DW$969, DW_AT_accessibility(DW_ACCESS_public)
    9135              
    9136              $C$DW$970       .dwtag  DW_TAG_member
    9137                      .dwattr $C$DW$970, DW_AT_type(*$C$DW$T$35)
    9138                      .dwattr $C$DW$970, DW_AT_name("spd_out")
    9139                      .dwattr $C$DW$970, DW_AT_TI_symbol_name("_spd_out")
    9140                      .dwattr $C$DW$970, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    9141                      .dwattr $C$DW$970, DW_AT_accessibility(DW_ACCESS_public)
    9142              
    9143              $C$DW$971       .dwtag  DW_TAG_member
    9144                      .dwattr $C$DW$971, DW_AT_type(*$C$DW$T$75)
    9145                      .dwattr $C$DW$971, DW_AT_name("Vab_out")
    9146                      .dwattr $C$DW$971, DW_AT_TI_symbol_name("_Vab_out")
    9147                      .dwattr $C$DW$971, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    9148                      .dwattr $C$DW$971, DW_AT_accessibility(DW_ACCESS_public)
    9149              
    9150              $C$DW$972       .dwtag  DW_TAG_member
    9151                      .dwattr $C$DW$972, DW_AT_type(*$C$DW$T$75)
    9152                      .dwattr $C$DW$972, DW_AT_name("Vdq_out")
    9153                      .dwattr $C$DW$972, DW_AT_TI_symbol_name("_Vdq_out")
    9154                      .dwattr $C$DW$972, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    9155                      .dwattr $C$DW$972, DW_AT_accessibility(DW_ACCESS_public)
    9156              
    9157              $C$DW$973       .dwtag  DW_TAG_member
    9158                      .dwattr $C$DW$973, DW_AT_type(*$C$DW$T$74)
    9159                      .dwattr $C$DW$973, DW_AT_name("Rhf")
    9160                      .dwattr $C$DW$973, DW_AT_TI_symbol_name("_Rhf")
    9161                      .dwattr $C$DW$973, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    9162                      .dwattr $C$DW$973, DW_AT_accessibility(DW_ACCESS_public)
    9163              
    9164              $C$DW$974       .dwtag  DW_TAG_member
    9165                      .dwattr $C$DW$974, DW_AT_type(*$C$DW$T$74)
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:37:19 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{ED4D92FB-263E-4B1C-8874-2914AFE31498} PAGE  179

    9166                      .dwattr $C$DW$974, DW_AT_name("Lhf")
    9167                      .dwattr $C$DW$974, DW_AT_TI_symbol_name("_Lhf")
    9168                      .dwattr $C$DW$974, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    9169                      .dwattr $C$DW$974, DW_AT_accessibility(DW_ACCESS_public)
    9170              
    9171              $C$DW$975       .dwtag  DW_TAG_member
    9172                      .dwattr $C$DW$975, DW_AT_type(*$C$DW$T$74)
    9173                      .dwattr $C$DW$975, DW_AT_name("RoverL")
    9174                      .dwattr $C$DW$975, DW_AT_TI_symbol_name("_RoverL")
    9175                      .dwattr $C$DW$975, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    9176                      .dwattr $C$DW$975, DW_AT_accessibility(DW_ACCESS_public)
    9177              
    9178              $C$DW$976       .dwtag  DW_TAG_member
    9179                      .dwattr $C$DW$976, DW_AT_type(*$C$DW$T$35)
    9180                      .dwattr $C$DW$976, DW_AT_name("Kp_Id")
    9181                      .dwattr $C$DW$976, DW_AT_TI_symbol_name("_Kp_Id")
    9182                      .dwattr $C$DW$976, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    9183                      .dwattr $C$DW$976, DW_AT_accessibility(DW_ACCESS_public)
    9184              
    9185              $C$DW$977       .dwtag  DW_TAG_member
    9186                      .dwattr $C$DW$977, DW_AT_type(*$C$DW$T$35)
    9187                      .dwattr $C$DW$977, DW_AT_name("Kp_Iq")
    9188                      .dwattr $C$DW$977, DW_AT_TI_symbol_name("_Kp_Iq")
    9189                      .dwattr $C$DW$977, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    9190                      .dwattr $C$DW$977, DW_AT_accessibility(DW_ACCESS_public)
    9191              
    9192              $C$DW$978       .dwtag  DW_TAG_member
    9193                      .dwattr $C$DW$978, DW_AT_type(*$C$DW$T$35)
    9194                      .dwattr $C$DW$978, DW_AT_name("Kp_spd")
    9195                      .dwattr $C$DW$978, DW_AT_TI_symbol_name("_Kp_spd")
    9196                      .dwattr $C$DW$978, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    9197                      .dwattr $C$DW$978, DW_AT_accessibility(DW_ACCESS_public)
    9198              
    9199              $C$DW$979       .dwtag  DW_TAG_member
    9200                      .dwattr $C$DW$979, DW_AT_type(*$C$DW$T$35)
    9201                      .dwattr $C$DW$979, DW_AT_name("Ki_Id")
    9202                      .dwattr $C$DW$979, DW_AT_TI_symbol_name("_Ki_Id")
    9203                      .dwattr $C$DW$979, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    9204                      .dwattr $C$DW$979, DW_AT_accessibility(DW_ACCESS_public)
    9205              
    9206              $C$DW$980       .dwtag  DW_TAG_member
    9207                      .dwattr $C$DW$980, DW_AT_type(*$C$DW$T$35)
    9208                      .dwattr $C$DW$980, DW_AT_name("Ki_Iq")
    9209                      .dwattr $C$DW$980, DW_AT_TI_symbol_name("_Ki_Iq")
    9210                      .dwattr $C$DW$980, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    9211                      .dwattr $C$DW$980, DW_AT_accessibility(DW_ACCESS_public)
    9212              
    9213              $C$DW$981       .dwtag  DW_TAG_member
    9214                      .dwattr $C$DW$981, DW_AT_type(*$C$DW$T$35)
    9215                      .dwattr $C$DW$981, DW_AT_name("Ki_spd")
    9216                      .dwattr $C$DW$981, DW_AT_TI_symbol_name("_Ki_spd")
    9217                      .dwattr $C$DW$981, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    9218                      .dwattr $C$DW$981, DW_AT_accessibility(DW_ACCESS_public)
    9219              
    9220              $C$DW$982       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:37:19 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{ED4D92FB-263E-4B1C-8874-2914AFE31498} PAGE  180

    9221                      .dwattr $C$DW$982, DW_AT_type(*$C$DW$T$35)
    9222                      .dwattr $C$DW$982, DW_AT_name("Kd_Id")
    9223                      .dwattr $C$DW$982, DW_AT_TI_symbol_name("_Kd_Id")
    9224                      .dwattr $C$DW$982, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    9225                      .dwattr $C$DW$982, DW_AT_accessibility(DW_ACCESS_public)
    9226              
    9227              $C$DW$983       .dwtag  DW_TAG_member
    9228                      .dwattr $C$DW$983, DW_AT_type(*$C$DW$T$35)
    9229                      .dwattr $C$DW$983, DW_AT_name("Kd_Iq")
    9230                      .dwattr $C$DW$983, DW_AT_TI_symbol_name("_Kd_Iq")
    9231                      .dwattr $C$DW$983, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    9232                      .dwattr $C$DW$983, DW_AT_accessibility(DW_ACCESS_public)
    9233              
    9234              $C$DW$984       .dwtag  DW_TAG_member
    9235                      .dwattr $C$DW$984, DW_AT_type(*$C$DW$T$35)
    9236                      .dwattr $C$DW$984, DW_AT_name("Kd_spd")
    9237                      .dwattr $C$DW$984, DW_AT_TI_symbol_name("_Kd_spd")
    9238                      .dwattr $C$DW$984, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    9239                      .dwattr $C$DW$984, DW_AT_accessibility(DW_ACCESS_public)
    9240              
    9241              $C$DW$985       .dwtag  DW_TAG_member
    9242                      .dwattr $C$DW$985, DW_AT_type(*$C$DW$T$35)
    9243                      .dwattr $C$DW$985, DW_AT_name("Ui_Id")
    9244                      .dwattr $C$DW$985, DW_AT_TI_symbol_name("_Ui_Id")
    9245                      .dwattr $C$DW$985, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    9246                      .dwattr $C$DW$985, DW_AT_accessibility(DW_ACCESS_public)
    9247              
    9248              $C$DW$986       .dwtag  DW_TAG_member
    9249                      .dwattr $C$DW$986, DW_AT_type(*$C$DW$T$35)
    9250                      .dwattr $C$DW$986, DW_AT_name("Ui_Iq")
    9251                      .dwattr $C$DW$986, DW_AT_TI_symbol_name("_Ui_Iq")
    9252                      .dwattr $C$DW$986, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    9253                      .dwattr $C$DW$986, DW_AT_accessibility(DW_ACCESS_public)
    9254              
    9255              $C$DW$987       .dwtag  DW_TAG_member
    9256                      .dwattr $C$DW$987, DW_AT_type(*$C$DW$T$35)
    9257                      .dwattr $C$DW$987, DW_AT_name("Ui_spd")
    9258                      .dwattr $C$DW$987, DW_AT_TI_symbol_name("_Ui_spd")
    9259                      .dwattr $C$DW$987, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    9260                      .dwattr $C$DW$987, DW_AT_accessibility(DW_ACCESS_public)
    9261              
    9262              $C$DW$988       .dwtag  DW_TAG_member
    9263                      .dwattr $C$DW$988, DW_AT_type(*$C$DW$T$75)
    9264                      .dwattr $C$DW$988, DW_AT_name("Idq_ref")
    9265                      .dwattr $C$DW$988, DW_AT_TI_symbol_name("_Idq_ref")
    9266                      .dwattr $C$DW$988, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    9267                      .dwattr $C$DW$988, DW_AT_accessibility(DW_ACCESS_public)
    9268              
    9269              $C$DW$989       .dwtag  DW_TAG_member
    9270                      .dwattr $C$DW$989, DW_AT_type(*$C$DW$T$35)
    9271                      .dwattr $C$DW$989, DW_AT_name("IdRated")
    9272                      .dwattr $C$DW$989, DW_AT_TI_symbol_name("_IdRated")
    9273                      .dwattr $C$DW$989, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    9274                      .dwattr $C$DW$989, DW_AT_accessibility(DW_ACCESS_public)
    9275              
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:37:19 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{ED4D92FB-263E-4B1C-8874-2914AFE31498} PAGE  181

    9276              $C$DW$990       .dwtag  DW_TAG_member
    9277                      .dwattr $C$DW$990, DW_AT_type(*$C$DW$T$35)
    9278                      .dwattr $C$DW$990, DW_AT_name("spd_ref")
    9279                      .dwattr $C$DW$990, DW_AT_TI_symbol_name("_spd_ref")
    9280                      .dwattr $C$DW$990, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    9281                      .dwattr $C$DW$990, DW_AT_accessibility(DW_ACCESS_public)
    9282              
    9283              $C$DW$991       .dwtag  DW_TAG_member
    9284                      .dwattr $C$DW$991, DW_AT_type(*$C$DW$T$35)
    9285                      .dwattr $C$DW$991, DW_AT_name("spd_max")
    9286                      .dwattr $C$DW$991, DW_AT_TI_symbol_name("_spd_max")
    9287                      .dwattr $C$DW$991, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    9288                      .dwattr $C$DW$991, DW_AT_accessibility(DW_ACCESS_public)
    9289              
    9290              $C$DW$992       .dwtag  DW_TAG_member
    9291                      .dwattr $C$DW$992, DW_AT_type(*$C$DW$T$73)
    9292                      .dwattr $C$DW$992, DW_AT_name("counter_current")
    9293                      .dwattr $C$DW$992, DW_AT_TI_symbol_name("_counter_current")
    9294                      .dwattr $C$DW$992, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    9295                      .dwattr $C$DW$992, DW_AT_accessibility(DW_ACCESS_public)
    9296              
    9297              $C$DW$993       .dwtag  DW_TAG_member
    9298                      .dwattr $C$DW$993, DW_AT_type(*$C$DW$T$73)
    9299                      .dwattr $C$DW$993, DW_AT_name("counter_isr")
    9300                      .dwattr $C$DW$993, DW_AT_TI_symbol_name("_counter_isr")
    9301                      .dwattr $C$DW$993, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    9302                      .dwattr $C$DW$993, DW_AT_accessibility(DW_ACCESS_public)
    9303              
    9304              $C$DW$994       .dwtag  DW_TAG_member
    9305                      .dwattr $C$DW$994, DW_AT_type(*$C$DW$T$73)
    9306                      .dwattr $C$DW$994, DW_AT_name("counter_speed")
    9307                      .dwattr $C$DW$994, DW_AT_TI_symbol_name("_counter_speed")
    9308                      .dwattr $C$DW$994, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    9309                      .dwattr $C$DW$994, DW_AT_accessibility(DW_ACCESS_public)
    9310              
    9311              $C$DW$995       .dwtag  DW_TAG_member
    9312                      .dwattr $C$DW$995, DW_AT_type(*$C$DW$T$73)
    9313                      .dwattr $C$DW$995, DW_AT_name("counter_traj")
    9314                      .dwattr $C$DW$995, DW_AT_TI_symbol_name("_counter_traj")
    9315                      .dwattr $C$DW$995, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    9316                      .dwattr $C$DW$995, DW_AT_accessibility(DW_ACCESS_public)
    9317              
    9318              $C$DW$996       .dwtag  DW_TAG_member
    9319                      .dwattr $C$DW$996, DW_AT_type(*$C$DW$T$76)
    9320                      .dwattr $C$DW$996, DW_AT_name("flag_enableCtrl")
    9321                      .dwattr $C$DW$996, DW_AT_TI_symbol_name("_flag_enableCtrl")
    9322                      .dwattr $C$DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    9323                      .dwattr $C$DW$996, DW_AT_accessibility(DW_ACCESS_public)
    9324              
    9325              $C$DW$997       .dwtag  DW_TAG_member
    9326                      .dwattr $C$DW$997, DW_AT_type(*$C$DW$T$76)
    9327                      .dwattr $C$DW$997, DW_AT_name("flag_enableDcBusComp")
    9328                      .dwattr $C$DW$997, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    9329                      .dwattr $C$DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    9330                      .dwattr $C$DW$997, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:37:19 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{ED4D92FB-263E-4B1C-8874-2914AFE31498} PAGE  182

    9331              
    9332              $C$DW$998       .dwtag  DW_TAG_member
    9333                      .dwattr $C$DW$998, DW_AT_type(*$C$DW$T$76)
    9334                      .dwattr $C$DW$998, DW_AT_name("flag_enablePowerWarp")
    9335                      .dwattr $C$DW$998, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    9336                      .dwattr $C$DW$998, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    9337                      .dwattr $C$DW$998, DW_AT_accessibility(DW_ACCESS_public)
    9338              
    9339              $C$DW$999       .dwtag  DW_TAG_member
    9340                      .dwattr $C$DW$999, DW_AT_type(*$C$DW$T$76)
    9341                      .dwattr $C$DW$999, DW_AT_name("flag_enableOffset")
    9342                      .dwattr $C$DW$999, DW_AT_TI_symbol_name("_flag_enableOffset")
    9343                      .dwattr $C$DW$999, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    9344                      .dwattr $C$DW$999, DW_AT_accessibility(DW_ACCESS_public)
    9345              
    9346              $C$DW$1000      .dwtag  DW_TAG_member
    9347                      .dwattr $C$DW$1000, DW_AT_type(*$C$DW$T$76)
    9348                      .dwattr $C$DW$1000, DW_AT_name("flag_enableSpeedCtrl")
    9349                      .dwattr $C$DW$1000, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    9350                      .dwattr $C$DW$1000, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    9351                      .dwattr $C$DW$1000, DW_AT_accessibility(DW_ACCESS_public)
    9352              
    9353              $C$DW$1001      .dwtag  DW_TAG_member
    9354                      .dwattr $C$DW$1001, DW_AT_type(*$C$DW$T$76)
    9355                      .dwattr $C$DW$1001, DW_AT_name("flag_enableUserMotorParams")
    9356                      .dwattr $C$DW$1001, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    9357                      .dwattr $C$DW$1001, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    9358                      .dwattr $C$DW$1001, DW_AT_accessibility(DW_ACCESS_public)
    9359              
    9360              $C$DW$1002      .dwtag  DW_TAG_member
    9361                      .dwattr $C$DW$1002, DW_AT_type(*$C$DW$T$75)
    9362                      .dwattr $C$DW$1002, DW_AT_name("Idq_offset_pu")
    9363                      .dwattr $C$DW$1002, DW_AT_TI_symbol_name("_Idq_offset_pu")
    9364                      .dwattr $C$DW$1002, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    9365                      .dwattr $C$DW$1002, DW_AT_accessibility(DW_ACCESS_public)
    9366              
    9367              $C$DW$1003      .dwtag  DW_TAG_member
    9368                      .dwattr $C$DW$1003, DW_AT_type(*$C$DW$T$75)
    9369                      .dwattr $C$DW$1003, DW_AT_name("Vdq_offset_pu")
    9370                      .dwattr $C$DW$1003, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    9371                      .dwattr $C$DW$1003, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    9372                      .dwattr $C$DW$1003, DW_AT_accessibility(DW_ACCESS_public)
    9373              
    9374              $C$DW$1004      .dwtag  DW_TAG_member
    9375                      .dwattr $C$DW$1004, DW_AT_type(*$C$DW$T$35)
    9376                      .dwattr $C$DW$1004, DW_AT_name("angle_pu")
    9377                      .dwattr $C$DW$1004, DW_AT_TI_symbol_name("_angle_pu")
    9378                      .dwattr $C$DW$1004, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    9379                      .dwattr $C$DW$1004, DW_AT_accessibility(DW_ACCESS_public)
    9380              
    9381              $C$DW$1005      .dwtag  DW_TAG_member
    9382                      .dwattr $C$DW$1005, DW_AT_type(*$C$DW$T$35)
    9383                      .dwattr $C$DW$1005, DW_AT_name("speed_ref_pu")
    9384                      .dwattr $C$DW$1005, DW_AT_TI_symbol_name("_speed_ref_pu")
    9385                      .dwattr $C$DW$1005, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:37:19 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{ED4D92FB-263E-4B1C-8874-2914AFE31498} PAGE  183

    9386                      .dwattr $C$DW$1005, DW_AT_accessibility(DW_ACCESS_public)
    9387              
    9388              $C$DW$1006      .dwtag  DW_TAG_member
    9389                      .dwattr $C$DW$1006, DW_AT_type(*$C$DW$T$35)
    9390                      .dwattr $C$DW$1006, DW_AT_name("speed_fb_pu")
    9391                      .dwattr $C$DW$1006, DW_AT_TI_symbol_name("_speed_fb_pu")
    9392                      .dwattr $C$DW$1006, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    9393                      .dwattr $C$DW$1006, DW_AT_accessibility(DW_ACCESS_public)
    9394              
    9395              $C$DW$1007      .dwtag  DW_TAG_member
    9396                      .dwattr $C$DW$1007, DW_AT_type(*$C$DW$T$35)
    9397                      .dwattr $C$DW$1007, DW_AT_name("speed_outMax_pu")
    9398                      .dwattr $C$DW$1007, DW_AT_TI_symbol_name("_speed_outMax_pu")
    9399                      .dwattr $C$DW$1007, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    9400                      .dwattr $C$DW$1007, DW_AT_accessibility(DW_ACCESS_public)
    9401              
    9402              $C$DW$1008      .dwtag  DW_TAG_member
    9403                      .dwattr $C$DW$1008, DW_AT_type(*$C$DW$T$76)
    9404                      .dwattr $C$DW$1008, DW_AT_name("flag_enableCurrentCtrl")
    9405                      .dwattr $C$DW$1008, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    9406                      .dwattr $C$DW$1008, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    9407                      .dwattr $C$DW$1008, DW_AT_accessibility(DW_ACCESS_public)
    9408              
    9409              $C$DW$1009      .dwtag  DW_TAG_member
    9410                      .dwattr $C$DW$1009, DW_AT_type(*$C$DW$T$35)
    9411                      .dwattr $C$DW$1009, DW_AT_name("torque_head_comm")
    9412                      .dwattr $C$DW$1009, DW_AT_TI_symbol_name("_torque_head_comm")
    9413                      .dwattr $C$DW$1009, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    9414                      .dwattr $C$DW$1009, DW_AT_accessibility(DW_ACCESS_public)
    9415              
    9416                      .dwendtag $C$DW$T$77
    9417              
    9418              $C$DW$T$248     .dwtag  DW_TAG_typedef
    9419                      .dwattr $C$DW$T$248, DW_AT_name("CTRL_Obj")
    9420                      .dwattr $C$DW$T$248, DW_AT_type(*$C$DW$T$77)
    9421                      .dwattr $C$DW$T$248, DW_AT_language(DW_LANG_C)
    9422              
    9423              $C$DW$T$249     .dwtag  DW_TAG_pointer_type
    9424                      .dwattr $C$DW$T$249, DW_AT_type(*$C$DW$T$248)
    9425                      .dwattr $C$DW$T$249, DW_AT_address_class(0x20)
    9426              
    9427              $C$DW$T$203     .dwtag  DW_TAG_pointer_type
    9428                      .dwattr $C$DW$T$203, DW_AT_type(*$C$DW$T$77)
    9429                      .dwattr $C$DW$T$203, DW_AT_address_class(0x20)
    9430              
    9431              $C$DW$T$204     .dwtag  DW_TAG_typedef
    9432                      .dwattr $C$DW$T$204, DW_AT_name("CTRL_Handle")
    9433                      .dwattr $C$DW$T$204, DW_AT_type(*$C$DW$T$203)
    9434                      .dwattr $C$DW$T$204, DW_AT_language(DW_LANG_C)
    9435              
    9436              $C$DW$1010      .dwtag  DW_TAG_TI_far_type
    9437                      .dwattr $C$DW$1010, DW_AT_type(*$C$DW$T$204)
    9438              
    9439              $C$DW$T$250     .dwtag  DW_TAG_const_type
    9440                      .dwattr $C$DW$T$250, DW_AT_type(*$C$DW$1010)
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:37:19 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{ED4D92FB-263E-4B1C-8874-2914AFE31498} PAGE  184

    9441              
    9442              
    9443              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    9444                      .dwattr $C$DW$T$80, DW_AT_name("_CTRL_Version_")
    9445                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x04)
    9446              $C$DW$1011      .dwtag  DW_TAG_member
    9447                      .dwattr $C$DW$1011, DW_AT_type(*$C$DW$T$26)
    9448                      .dwattr $C$DW$1011, DW_AT_name("rsvd")
    9449                      .dwattr $C$DW$1011, DW_AT_TI_symbol_name("_rsvd")
    9450                      .dwattr $C$DW$1011, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9451                      .dwattr $C$DW$1011, DW_AT_accessibility(DW_ACCESS_public)
    9452              
    9453              $C$DW$1012      .dwtag  DW_TAG_member
    9454                      .dwattr $C$DW$1012, DW_AT_type(*$C$DW$T$79)
    9455                      .dwattr $C$DW$1012, DW_AT_name("targetProc")
    9456                      .dwattr $C$DW$1012, DW_AT_TI_symbol_name("_targetProc")
    9457                      .dwattr $C$DW$1012, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9458                      .dwattr $C$DW$1012, DW_AT_accessibility(DW_ACCESS_public)
    9459              
    9460              $C$DW$1013      .dwtag  DW_TAG_member
    9461                      .dwattr $C$DW$1013, DW_AT_type(*$C$DW$T$26)
    9462                      .dwattr $C$DW$1013, DW_AT_name("major")
    9463                      .dwattr $C$DW$1013, DW_AT_TI_symbol_name("_major")
    9464                      .dwattr $C$DW$1013, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9465                      .dwattr $C$DW$1013, DW_AT_accessibility(DW_ACCESS_public)
    9466              
    9467              $C$DW$1014      .dwtag  DW_TAG_member
    9468                      .dwattr $C$DW$1014, DW_AT_type(*$C$DW$T$26)
    9469                      .dwattr $C$DW$1014, DW_AT_name("minor")
    9470                      .dwattr $C$DW$1014, DW_AT_TI_symbol_name("_minor")
    9471                      .dwattr $C$DW$1014, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9472                      .dwattr $C$DW$1014, DW_AT_accessibility(DW_ACCESS_public)
    9473              
    9474                      .dwendtag $C$DW$T$80
    9475              
    9476              $C$DW$T$42      .dwtag  DW_TAG_typedef
    9477                      .dwattr $C$DW$T$42, DW_AT_name("CTRL_Version")
    9478                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$80)
    9479                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    9480              
    9481              $C$DW$T$256     .dwtag  DW_TAG_pointer_type
    9482                      .dwattr $C$DW$T$256, DW_AT_type(*$C$DW$T$42)
    9483                      .dwattr $C$DW$T$256, DW_AT_address_class(0x20)
    9484              
    9485              
    9486              $C$DW$T$87      .dwtag  DW_TAG_structure_type
    9487                      .dwattr $C$DW$T$87, DW_AT_name("_DRV8301_Obj_")
    9488                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x08)
    9489              $C$DW$1015      .dwtag  DW_TAG_member
    9490                      .dwattr $C$DW$1015, DW_AT_type(*$C$DW$T$82)
    9491                      .dwattr $C$DW$1015, DW_AT_name("spiHandle")
    9492                      .dwattr $C$DW$1015, DW_AT_TI_symbol_name("_spiHandle")
    9493                      .dwattr $C$DW$1015, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9494                      .dwattr $C$DW$1015, DW_AT_accessibility(DW_ACCESS_public)
    9495              
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:37:19 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{ED4D92FB-263E-4B1C-8874-2914AFE31498} PAGE  185

    9496              $C$DW$1016      .dwtag  DW_TAG_member
    9497                      .dwattr $C$DW$1016, DW_AT_type(*$C$DW$T$84)
    9498                      .dwattr $C$DW$1016, DW_AT_name("gpioHandle")
    9499                      .dwattr $C$DW$1016, DW_AT_TI_symbol_name("_gpioHandle")
    9500                      .dwattr $C$DW$1016, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9501                      .dwattr $C$DW$1016, DW_AT_accessibility(DW_ACCESS_public)
    9502              
    9503              $C$DW$1017      .dwtag  DW_TAG_member
    9504                      .dwattr $C$DW$1017, DW_AT_type(*$C$DW$T$86)
    9505                      .dwattr $C$DW$1017, DW_AT_name("gpioNumber")
    9506                      .dwattr $C$DW$1017, DW_AT_TI_symbol_name("_gpioNumber")
    9507                      .dwattr $C$DW$1017, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9508                      .dwattr $C$DW$1017, DW_AT_accessibility(DW_ACCESS_public)
    9509              
    9510              $C$DW$1018      .dwtag  DW_TAG_member
    9511                      .dwattr $C$DW$1018, DW_AT_type(*$C$DW$T$76)
    9512                      .dwattr $C$DW$1018, DW_AT_name("RxTimeOut")
    9513                      .dwattr $C$DW$1018, DW_AT_TI_symbol_name("_RxTimeOut")
    9514                      .dwattr $C$DW$1018, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9515                      .dwattr $C$DW$1018, DW_AT_accessibility(DW_ACCESS_public)
    9516              
    9517              $C$DW$1019      .dwtag  DW_TAG_member
    9518                      .dwattr $C$DW$1019, DW_AT_type(*$C$DW$T$76)
    9519                      .dwattr $C$DW$1019, DW_AT_name("enableTimeOut")
    9520                      .dwattr $C$DW$1019, DW_AT_TI_symbol_name("_enableTimeOut")
    9521                      .dwattr $C$DW$1019, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9522                      .dwattr $C$DW$1019, DW_AT_accessibility(DW_ACCESS_public)
    9523              
    9524                      .dwendtag $C$DW$T$87
    9525              
    9526              $C$DW$T$156     .dwtag  DW_TAG_typedef
    9527                      .dwattr $C$DW$T$156, DW_AT_name("DRV8301_Obj")
    9528                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$87)
    9529                      .dwattr $C$DW$T$156, DW_AT_language(DW_LANG_C)
    9530              
    9531              $C$DW$T$154     .dwtag  DW_TAG_pointer_type
    9532                      .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$87)
    9533                      .dwattr $C$DW$T$154, DW_AT_address_class(0x20)
    9534              
    9535              $C$DW$T$155     .dwtag  DW_TAG_typedef
    9536                      .dwattr $C$DW$T$155, DW_AT_name("DRV8301_Handle")
    9537                      .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$154)
    9538                      .dwattr $C$DW$T$155, DW_AT_language(DW_LANG_C)
    9539              
    9540              
    9541              $C$DW$T$98      .dwtag  DW_TAG_structure_type
    9542                      .dwattr $C$DW$T$98, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    9543                      .dwattr $C$DW$T$98, DW_AT_byte_size(0x05)
    9544              $C$DW$1020      .dwtag  DW_TAG_member
    9545                      .dwattr $C$DW$1020, DW_AT_type(*$C$DW$T$89)
    9546                      .dwattr $C$DW$1020, DW_AT_name("DRV8301_CURRENT")
    9547                      .dwattr $C$DW$1020, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    9548                      .dwattr $C$DW$1020, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9549                      .dwattr $C$DW$1020, DW_AT_accessibility(DW_ACCESS_public)
    9550              
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:37:19 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{ED4D92FB-263E-4B1C-8874-2914AFE31498} PAGE  186

    9551              $C$DW$1021      .dwtag  DW_TAG_member
    9552                      .dwattr $C$DW$1021, DW_AT_type(*$C$DW$T$91)
    9553                      .dwattr $C$DW$1021, DW_AT_name("DRV8301_RESET")
    9554                      .dwattr $C$DW$1021, DW_AT_TI_symbol_name("_DRV8301_RESET")
    9555                      .dwattr $C$DW$1021, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9556                      .dwattr $C$DW$1021, DW_AT_accessibility(DW_ACCESS_public)
    9557              
    9558              $C$DW$1022      .dwtag  DW_TAG_member
    9559                      .dwattr $C$DW$1022, DW_AT_type(*$C$DW$T$93)
    9560                      .dwattr $C$DW$1022, DW_AT_name("PWM_MODE")
    9561                      .dwattr $C$DW$1022, DW_AT_TI_symbol_name("_PWM_MODE")
    9562                      .dwattr $C$DW$1022, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9563                      .dwattr $C$DW$1022, DW_AT_accessibility(DW_ACCESS_public)
    9564              
    9565              $C$DW$1023      .dwtag  DW_TAG_member
    9566                      .dwattr $C$DW$1023, DW_AT_type(*$C$DW$T$95)
    9567                      .dwattr $C$DW$1023, DW_AT_name("OC_MODE")
    9568                      .dwattr $C$DW$1023, DW_AT_TI_symbol_name("_OC_MODE")
    9569                      .dwattr $C$DW$1023, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9570                      .dwattr $C$DW$1023, DW_AT_accessibility(DW_ACCESS_public)
    9571              
    9572              $C$DW$1024      .dwtag  DW_TAG_member
    9573                      .dwattr $C$DW$1024, DW_AT_type(*$C$DW$T$97)
    9574                      .dwattr $C$DW$1024, DW_AT_name("OC_ADJ_SET")
    9575                      .dwattr $C$DW$1024, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    9576                      .dwattr $C$DW$1024, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9577                      .dwattr $C$DW$1024, DW_AT_accessibility(DW_ACCESS_public)
    9578              
    9579                      .dwendtag $C$DW$T$98
    9580              
    9581              $C$DW$T$112     .dwtag  DW_TAG_typedef
    9582                      .dwattr $C$DW$T$112, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    9583                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$98)
    9584                      .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    9585              
    9586              
    9587              $C$DW$T$107     .dwtag  DW_TAG_structure_type
    9588                      .dwattr $C$DW$T$107, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    9589                      .dwattr $C$DW$T$107, DW_AT_byte_size(0x04)
    9590              $C$DW$1025      .dwtag  DW_TAG_member
    9591                      .dwattr $C$DW$1025, DW_AT_type(*$C$DW$T$100)
    9592                      .dwattr $C$DW$1025, DW_AT_name("OCTW_SET")
    9593                      .dwattr $C$DW$1025, DW_AT_TI_symbol_name("_OCTW_SET")
    9594                      .dwattr $C$DW$1025, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9595                      .dwattr $C$DW$1025, DW_AT_accessibility(DW_ACCESS_public)
    9596              
    9597              $C$DW$1026      .dwtag  DW_TAG_member
    9598                      .dwattr $C$DW$1026, DW_AT_type(*$C$DW$T$102)
    9599                      .dwattr $C$DW$1026, DW_AT_name("GAIN")
    9600                      .dwattr $C$DW$1026, DW_AT_TI_symbol_name("_GAIN")
    9601                      .dwattr $C$DW$1026, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9602                      .dwattr $C$DW$1026, DW_AT_accessibility(DW_ACCESS_public)
    9603              
    9604              $C$DW$1027      .dwtag  DW_TAG_member
    9605                      .dwattr $C$DW$1027, DW_AT_type(*$C$DW$T$104)
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:37:19 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{ED4D92FB-263E-4B1C-8874-2914AFE31498} PAGE  187

    9606                      .dwattr $C$DW$1027, DW_AT_name("DC_CAL_CH1p2")
    9607                      .dwattr $C$DW$1027, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    9608                      .dwattr $C$DW$1027, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9609                      .dwattr $C$DW$1027, DW_AT_accessibility(DW_ACCESS_public)
    9610              
    9611              $C$DW$1028      .dwtag  DW_TAG_member
    9612                      .dwattr $C$DW$1028, DW_AT_type(*$C$DW$T$106)
    9613                      .dwattr $C$DW$1028, DW_AT_name("OC_TOFF")
    9614                      .dwattr $C$DW$1028, DW_AT_TI_symbol_name("_OC_TOFF")
    9615                      .dwattr $C$DW$1028, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9616                      .dwattr $C$DW$1028, DW_AT_accessibility(DW_ACCESS_public)
    9617              
    9618                      .dwendtag $C$DW$T$107
    9619              
    9620              $C$DW$T$113     .dwtag  DW_TAG_typedef
    9621                      .dwattr $C$DW$T$113, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    9622                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$107)
    9623                      .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    9624              
    9625              
    9626              $C$DW$T$108     .dwtag  DW_TAG_structure_type
    9627                      .dwattr $C$DW$T$108, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    9628                      .dwattr $C$DW$T$108, DW_AT_byte_size(0x0b)
    9629              $C$DW$1029      .dwtag  DW_TAG_member
    9630                      .dwattr $C$DW$1029, DW_AT_type(*$C$DW$T$76)
    9631                      .dwattr $C$DW$1029, DW_AT_name("FAULT")
    9632                      .dwattr $C$DW$1029, DW_AT_TI_symbol_name("_FAULT")
    9633                      .dwattr $C$DW$1029, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9634                      .dwattr $C$DW$1029, DW_AT_accessibility(DW_ACCESS_public)
    9635              
    9636              $C$DW$1030      .dwtag  DW_TAG_member
    9637                      .dwattr $C$DW$1030, DW_AT_type(*$C$DW$T$76)
    9638                      .dwattr $C$DW$1030, DW_AT_name("GVDD_UV")
    9639                      .dwattr $C$DW$1030, DW_AT_TI_symbol_name("_GVDD_UV")
    9640                      .dwattr $C$DW$1030, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9641                      .dwattr $C$DW$1030, DW_AT_accessibility(DW_ACCESS_public)
    9642              
    9643              $C$DW$1031      .dwtag  DW_TAG_member
    9644                      .dwattr $C$DW$1031, DW_AT_type(*$C$DW$T$76)
    9645                      .dwattr $C$DW$1031, DW_AT_name("PVDD_UV")
    9646                      .dwattr $C$DW$1031, DW_AT_TI_symbol_name("_PVDD_UV")
    9647                      .dwattr $C$DW$1031, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9648                      .dwattr $C$DW$1031, DW_AT_accessibility(DW_ACCESS_public)
    9649              
    9650              $C$DW$1032      .dwtag  DW_TAG_member
    9651                      .dwattr $C$DW$1032, DW_AT_type(*$C$DW$T$76)
    9652                      .dwattr $C$DW$1032, DW_AT_name("OTSD")
    9653                      .dwattr $C$DW$1032, DW_AT_TI_symbol_name("_OTSD")
    9654                      .dwattr $C$DW$1032, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9655                      .dwattr $C$DW$1032, DW_AT_accessibility(DW_ACCESS_public)
    9656              
    9657              $C$DW$1033      .dwtag  DW_TAG_member
    9658                      .dwattr $C$DW$1033, DW_AT_type(*$C$DW$T$76)
    9659                      .dwattr $C$DW$1033, DW_AT_name("OTW")
    9660                      .dwattr $C$DW$1033, DW_AT_TI_symbol_name("_OTW")
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 11:37:19 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{ED4D92FB-263E-4B1C-8874-2914AFE31498} PAGE  188

    9661                      .dwattr $C$DW$1033, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9662                      .dwattr $C$DW$1033, DW_AT_accessibility(DW_ACCESS_public)
    9663              
    9664              $C$DW$1034      .dwtag  DW_TAG_member
    9665                      .dwattr $C$DW$1034, DW_AT_type(*$C$DW$T$76)
    9666                      .dwattr $C$DW$1034, DW_AT_name("FETHA_OC")
    9667                      .dwattr $C$DW$1034, DW_AT_TI_symbol_name("_FETHA_OC")
    9668                      .dwattr $C$DW$1034, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9669                      .dwattr $C$DW$1034, DW_AT_accessibility(DW_ACCESS_public)
    9670              
    9671              $C$DW$1035      .dwtag  DW_TAG_member
    9672                      .dwattr $C$DW$1035, DW_AT_type(*$C$DW$T$76)
    9673                      .dwattr $C$DW$1035, DW_AT_name("FETLA_OC")
    9674                      .dwattr $C$DW$1035, DW_AT_TI_symbol_name("_FETLA_OC")
    9675                      .dwattr $C$DW$1035, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9676                      .dwattr $C$DW$1035, DW_AT_accessibility(DW_ACCESS_public)
    9677              
    9678              $C$DW$1036      .dwtag  DW_TAG_member
    9679                      .dwattr $C$DW$1036, DW_AT_type(*$C$DW$T$76)
    9680                      .dwattr $C$DW$1036, DW_AT_name("FETHB_OC")
    9681                      .dwattr $C$DW$1036, DW_AT_TI_symbol_name("_FETHB_OC")
    9682                      .dwattr $C$DW$1036, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    9683                      .dwattr $C$DW$1036, DW_AT_accessibility(DW_ACCESS_public)
    9684              
    9685              $C$DW$1037      .dwtag  DW_TAG_member
    9686                      .dwattr $C$DW$1037, DW_AT_type(*$C$DW$T$76)
    9687                      .dwattr $C$DW$1037, DW_AT_name("FETLB_OC")
    9688                      .dwattr $C$DW$1037, DW_AT_TI_symbol_name("_FETLB_OC")
    9689                      .dwattr $C$DW$1037, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9690                      .dwattr $C$DW$1037, DW_AT_accessibility(DW_ACCESS_public)
    9691              
