TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 17:12:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{CF1CE8BB-0BA9-4705-B421-53C212847974} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.0.LTS *
       3              ;* Date/Time created: Mon Mar  6 17:12:05 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/GIANT/GIANT_TI_instaspin/TI_instaspin_indoor_smart_trainer/motorware
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.0.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\GIANT\GIANT_TI_instaspin\TI_instaspin_indoor_smart_trainer\motor
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    8800              $C$DW$896       .dwtag  DW_TAG_enumerator
    8801                      .dwattr $C$DW$896, DW_AT_name("PIE_GroupNumber_7")
    8802                      .dwattr $C$DW$896, DW_AT_const_value(0x06)
    8803              
    8804              $C$DW$897       .dwtag  DW_TAG_enumerator
    8805                      .dwattr $C$DW$897, DW_AT_name("PIE_GroupNumber_8")
    8806                      .dwattr $C$DW$897, DW_AT_const_value(0x07)
    8807              
    8808              $C$DW$898       .dwtag  DW_TAG_enumerator
    8809                      .dwattr $C$DW$898, DW_AT_name("PIE_GroupNumber_9")
    8810                      .dwattr $C$DW$898, DW_AT_const_value(0x08)
    8811              
    8812              $C$DW$899       .dwtag  DW_TAG_enumerator
    8813                      .dwattr $C$DW$899, DW_AT_name("PIE_GroupNumber_10")
    8814                      .dwattr $C$DW$899, DW_AT_const_value(0x09)
    8815              
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 17:12:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{CF1CE8BB-0BA9-4705-B421-53C212847974} PAGE  174

    8816              $C$DW$900       .dwtag  DW_TAG_enumerator
    8817                      .dwattr $C$DW$900, DW_AT_name("PIE_GroupNumber_11")
    8818                      .dwattr $C$DW$900, DW_AT_const_value(0x0a)
    8819              
    8820              $C$DW$901       .dwtag  DW_TAG_enumerator
    8821                      .dwattr $C$DW$901, DW_AT_name("PIE_GroupNumber_12")
    8822                      .dwattr $C$DW$901, DW_AT_const_value(0x0b)
    8823              
    8824                      .dwendtag $C$DW$T$221
    8825              
    8826              $C$DW$T$222     .dwtag  DW_TAG_typedef
    8827                      .dwattr $C$DW$T$222, DW_AT_name("PIE_GroupNumber_e")
    8828                      .dwattr $C$DW$T$222, DW_AT_type(*$C$DW$T$221)
    8829                      .dwattr $C$DW$T$222, DW_AT_language(DW_LANG_C)
    8830              
    8831              
    8832              $C$DW$T$224     .dwtag  DW_TAG_enumeration_type
    8833                      .dwattr $C$DW$T$224, DW_AT_byte_size(0x01)
    8834              $C$DW$902       .dwtag  DW_TAG_enumerator
    8835                      .dwattr $C$DW$902, DW_AT_name("CTRL_Type_PID_spd")
    8836                      .dwattr $C$DW$902, DW_AT_const_value(0x00)
    8837              
    8838              $C$DW$903       .dwtag  DW_TAG_enumerator
    8839                      .dwattr $C$DW$903, DW_AT_name("CTRL_Type_PID_Id")
    8840                      .dwattr $C$DW$903, DW_AT_const_value(0x01)
    8841              
    8842              $C$DW$904       .dwtag  DW_TAG_enumerator
    8843                      .dwattr $C$DW$904, DW_AT_name("CTRL_Type_PID_Iq")
    8844                      .dwattr $C$DW$904, DW_AT_const_value(0x02)
    8845              
    8846                      .dwendtag $C$DW$T$224
    8847              
    8848              $C$DW$T$225     .dwtag  DW_TAG_typedef
    8849                      .dwattr $C$DW$T$225, DW_AT_name("CTRL_Type_e")
    8850                      .dwattr $C$DW$T$225, DW_AT_type(*$C$DW$T$224)
    8851                      .dwattr $C$DW$T$225, DW_AT_language(DW_LANG_C)
    8852              
    8853              
    8854              $C$DW$T$227     .dwtag  DW_TAG_enumeration_type
    8855                      .dwattr $C$DW$T$227, DW_AT_byte_size(0x01)
    8856              $C$DW$905       .dwtag  DW_TAG_enumerator
    8857                      .dwattr $C$DW$905, DW_AT_name("HAL_SensorType_Current")
    8858                      .dwattr $C$DW$905, DW_AT_const_value(0x00)
    8859              
    8860              $C$DW$906       .dwtag  DW_TAG_enumerator
    8861                      .dwattr $C$DW$906, DW_AT_name("HAL_SensorType_Voltage")
    8862                      .dwattr $C$DW$906, DW_AT_const_value(0x01)
    8863              
    8864                      .dwendtag $C$DW$T$227
    8865              
    8866              $C$DW$T$228     .dwtag  DW_TAG_typedef
    8867                      .dwattr $C$DW$T$228, DW_AT_name("HAL_SensorType_e")
    8868                      .dwattr $C$DW$T$228, DW_AT_type(*$C$DW$T$227)
    8869                      .dwattr $C$DW$T$228, DW_AT_language(DW_LANG_C)
    8870              
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 17:12:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{CF1CE8BB-0BA9-4705-B421-53C212847974} PAGE  175

    8871              
    8872              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    8873                      .dwattr $C$DW$T$19, DW_AT_name("IPD_HFI_Obj")
    8874                      .dwattr $C$DW$T$19, DW_AT_declaration
    8875                      .dwendtag $C$DW$T$19
    8876              
    8877              $C$DW$T$230     .dwtag  DW_TAG_pointer_type
    8878                      .dwattr $C$DW$T$230, DW_AT_type(*$C$DW$T$19)
    8879                      .dwattr $C$DW$T$230, DW_AT_address_class(0x20)
    8880              
    8881              $C$DW$T$231     .dwtag  DW_TAG_typedef
    8882                      .dwattr $C$DW$T$231, DW_AT_name("IPD_HFI_Handle")
    8883                      .dwattr $C$DW$T$231, DW_AT_type(*$C$DW$T$230)
    8884                      .dwattr $C$DW$T$231, DW_AT_language(DW_LANG_C)
    8885              
    8886              
    8887              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    8888                      .dwattr $C$DW$T$34, DW_AT_name("_ADC_Obj_")
    8889                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x6650)
    8890              $C$DW$907       .dwtag  DW_TAG_member
    8891                      .dwattr $C$DW$907, DW_AT_type(*$C$DW$T$28)
    8892                      .dwattr $C$DW$907, DW_AT_name("ADCRESULT")
    8893                      .dwattr $C$DW$907, DW_AT_TI_symbol_name("_ADCRESULT")
    8894                      .dwattr $C$DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8895                      .dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
    8896              
    8897              $C$DW$908       .dwtag  DW_TAG_member
    8898                      .dwattr $C$DW$908, DW_AT_type(*$C$DW$T$29)
    8899                      .dwattr $C$DW$908, DW_AT_name("resvd_1")
    8900                      .dwattr $C$DW$908, DW_AT_TI_symbol_name("_resvd_1")
    8901                      .dwattr $C$DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8902                      .dwattr $C$DW$908, DW_AT_accessibility(DW_ACCESS_public)
    8903              
    8904              $C$DW$909       .dwtag  DW_TAG_member
    8905                      .dwattr $C$DW$909, DW_AT_type(*$C$DW$T$27)
    8906                      .dwattr $C$DW$909, DW_AT_name("ADCCTL1")
    8907                      .dwattr $C$DW$909, DW_AT_TI_symbol_name("_ADCCTL1")
    8908                      .dwattr $C$DW$909, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    8909                      .dwattr $C$DW$909, DW_AT_accessibility(DW_ACCESS_public)
    8910              
    8911              $C$DW$910       .dwtag  DW_TAG_member
    8912                      .dwattr $C$DW$910, DW_AT_type(*$C$DW$T$27)
    8913                      .dwattr $C$DW$910, DW_AT_name("ADCCTL2")
    8914                      .dwattr $C$DW$910, DW_AT_TI_symbol_name("_ADCCTL2")
    8915                      .dwattr $C$DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    8916                      .dwattr $C$DW$910, DW_AT_accessibility(DW_ACCESS_public)
    8917              
    8918              $C$DW$911       .dwtag  DW_TAG_member
    8919                      .dwattr $C$DW$911, DW_AT_type(*$C$DW$T$30)
    8920                      .dwattr $C$DW$911, DW_AT_name("rsvd_2")
    8921                      .dwattr $C$DW$911, DW_AT_TI_symbol_name("_rsvd_2")
    8922                      .dwattr $C$DW$911, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    8923                      .dwattr $C$DW$911, DW_AT_accessibility(DW_ACCESS_public)
    8924              
    8925              $C$DW$912       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 17:12:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{CF1CE8BB-0BA9-4705-B421-53C212847974} PAGE  176

    8926                      .dwattr $C$DW$912, DW_AT_type(*$C$DW$T$27)
    8927                      .dwattr $C$DW$912, DW_AT_name("ADCINTFLG")
    8928                      .dwattr $C$DW$912, DW_AT_TI_symbol_name("_ADCINTFLG")
    8929                      .dwattr $C$DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    8930                      .dwattr $C$DW$912, DW_AT_accessibility(DW_ACCESS_public)
    8931              
    8932              $C$DW$913       .dwtag  DW_TAG_member
    8933                      .dwattr $C$DW$913, DW_AT_type(*$C$DW$T$27)
    8934                      .dwattr $C$DW$913, DW_AT_name("ADCINTFLGCLR")
    8935                      .dwattr $C$DW$913, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    8936                      .dwattr $C$DW$913, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    8937                      .dwattr $C$DW$913, DW_AT_accessibility(DW_ACCESS_public)
    8938              
    8939              $C$DW$914       .dwtag  DW_TAG_member
    8940                      .dwattr $C$DW$914, DW_AT_type(*$C$DW$T$27)
    8941                      .dwattr $C$DW$914, DW_AT_name("ADCINTOVF")
    8942                      .dwattr $C$DW$914, DW_AT_TI_symbol_name("_ADCINTOVF")
    8943                      .dwattr $C$DW$914, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    8944                      .dwattr $C$DW$914, DW_AT_accessibility(DW_ACCESS_public)
    8945              
    8946              $C$DW$915       .dwtag  DW_TAG_member
    8947                      .dwattr $C$DW$915, DW_AT_type(*$C$DW$T$27)
    8948                      .dwattr $C$DW$915, DW_AT_name("ADCINTOVFCLR")
    8949                      .dwattr $C$DW$915, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    8950                      .dwattr $C$DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    8951                      .dwattr $C$DW$915, DW_AT_accessibility(DW_ACCESS_public)
    8952              
    8953              $C$DW$916       .dwtag  DW_TAG_member
    8954                      .dwattr $C$DW$916, DW_AT_type(*$C$DW$T$31)
    8955                      .dwattr $C$DW$916, DW_AT_name("INTSELxNy")
    8956                      .dwattr $C$DW$916, DW_AT_TI_symbol_name("_INTSELxNy")
    8957                      .dwattr $C$DW$916, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    8958                      .dwattr $C$DW$916, DW_AT_accessibility(DW_ACCESS_public)
    8959              
    8960              $C$DW$917       .dwtag  DW_TAG_member
    8961                      .dwattr $C$DW$917, DW_AT_type(*$C$DW$T$32)
    8962                      .dwattr $C$DW$917, DW_AT_name("rsvd_3")
    8963                      .dwattr $C$DW$917, DW_AT_TI_symbol_name("_rsvd_3")
    8964                      .dwattr $C$DW$917, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    8965                      .dwattr $C$DW$917, DW_AT_accessibility(DW_ACCESS_public)
    8966              
    8967              $C$DW$918       .dwtag  DW_TAG_member
    8968                      .dwattr $C$DW$918, DW_AT_type(*$C$DW$T$27)
    8969                      .dwattr $C$DW$918, DW_AT_name("SOCPRICTRL")
    8970                      .dwattr $C$DW$918, DW_AT_TI_symbol_name("_SOCPRICTRL")
    8971                      .dwattr $C$DW$918, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    8972                      .dwattr $C$DW$918, DW_AT_accessibility(DW_ACCESS_public)
    8973              
    8974              $C$DW$919       .dwtag  DW_TAG_member
    8975                      .dwattr $C$DW$919, DW_AT_type(*$C$DW$T$27)
    8976                      .dwattr $C$DW$919, DW_AT_name("rsvd_4")
    8977                      .dwattr $C$DW$919, DW_AT_TI_symbol_name("_rsvd_4")
    8978                      .dwattr $C$DW$919, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    8979                      .dwattr $C$DW$919, DW_AT_accessibility(DW_ACCESS_public)
    8980              
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 17:12:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{CF1CE8BB-0BA9-4705-B421-53C212847974} PAGE  177

    8981              $C$DW$920       .dwtag  DW_TAG_member
    8982                      .dwattr $C$DW$920, DW_AT_type(*$C$DW$T$27)
    8983                      .dwattr $C$DW$920, DW_AT_name("ADCSAMPLEMODE")
    8984                      .dwattr $C$DW$920, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    8985                      .dwattr $C$DW$920, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    8986                      .dwattr $C$DW$920, DW_AT_accessibility(DW_ACCESS_public)
    8987              
    8988              $C$DW$921       .dwtag  DW_TAG_member
    8989                      .dwattr $C$DW$921, DW_AT_type(*$C$DW$T$27)
    8990                      .dwattr $C$DW$921, DW_AT_name("rsvd_5")
    8991                      .dwattr $C$DW$921, DW_AT_TI_symbol_name("_rsvd_5")
    8992                      .dwattr $C$DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    8993                      .dwattr $C$DW$921, DW_AT_accessibility(DW_ACCESS_public)
    8994              
    8995              $C$DW$922       .dwtag  DW_TAG_member
    8996                      .dwattr $C$DW$922, DW_AT_type(*$C$DW$T$27)
    8997                      .dwattr $C$DW$922, DW_AT_name("ADCINTSOCSEL1")
    8998                      .dwattr $C$DW$922, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    8999                      .dwattr $C$DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    9000                      .dwattr $C$DW$922, DW_AT_accessibility(DW_ACCESS_public)
    9001              
    9002              $C$DW$923       .dwtag  DW_TAG_member
    9003                      .dwattr $C$DW$923, DW_AT_type(*$C$DW$T$27)
    9004                      .dwattr $C$DW$923, DW_AT_name("ADCINTSOCSEL2")
    9005                      .dwattr $C$DW$923, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    9006                      .dwattr $C$DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    9007                      .dwattr $C$DW$923, DW_AT_accessibility(DW_ACCESS_public)
    9008              
    9009              $C$DW$924       .dwtag  DW_TAG_member
    9010                      .dwattr $C$DW$924, DW_AT_type(*$C$DW$T$30)
    9011                      .dwattr $C$DW$924, DW_AT_name("rsvd_6")
    9012                      .dwattr $C$DW$924, DW_AT_TI_symbol_name("_rsvd_6")
    9013                      .dwattr $C$DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    9014                      .dwattr $C$DW$924, DW_AT_accessibility(DW_ACCESS_public)
    9015              
    9016              $C$DW$925       .dwtag  DW_TAG_member
    9017                      .dwattr $C$DW$925, DW_AT_type(*$C$DW$T$27)
    9018                      .dwattr $C$DW$925, DW_AT_name("ADCSOCFLG1")
    9019                      .dwattr $C$DW$925, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    9020                      .dwattr $C$DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    9021                      .dwattr $C$DW$925, DW_AT_accessibility(DW_ACCESS_public)
    9022              
    9023              $C$DW$926       .dwtag  DW_TAG_member
    9024                      .dwattr $C$DW$926, DW_AT_type(*$C$DW$T$27)
    9025                      .dwattr $C$DW$926, DW_AT_name("rsvd_7")
    9026                      .dwattr $C$DW$926, DW_AT_TI_symbol_name("_rsvd_7")
    9027                      .dwattr $C$DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    9028                      .dwattr $C$DW$926, DW_AT_accessibility(DW_ACCESS_public)
    9029              
    9030              $C$DW$927       .dwtag  DW_TAG_member
    9031                      .dwattr $C$DW$927, DW_AT_type(*$C$DW$T$27)
    9032                      .dwattr $C$DW$927, DW_AT_name("ADCSOCFRC1")
    9033                      .dwattr $C$DW$927, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    9034                      .dwattr $C$DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    9035                      .dwattr $C$DW$927, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 17:12:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{CF1CE8BB-0BA9-4705-B421-53C212847974} PAGE  178

    9036              
    9037              $C$DW$928       .dwtag  DW_TAG_member
    9038                      .dwattr $C$DW$928, DW_AT_type(*$C$DW$T$27)
    9039                      .dwattr $C$DW$928, DW_AT_name("rsvd_8")
    9040                      .dwattr $C$DW$928, DW_AT_TI_symbol_name("_rsvd_8")
    9041                      .dwattr $C$DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    9042                      .dwattr $C$DW$928, DW_AT_accessibility(DW_ACCESS_public)
    9043              
    9044              $C$DW$929       .dwtag  DW_TAG_member
    9045                      .dwattr $C$DW$929, DW_AT_type(*$C$DW$T$27)
    9046                      .dwattr $C$DW$929, DW_AT_name("ADCSOCOVF1")
    9047                      .dwattr $C$DW$929, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    9048                      .dwattr $C$DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    9049                      .dwattr $C$DW$929, DW_AT_accessibility(DW_ACCESS_public)
    9050              
    9051              $C$DW$930       .dwtag  DW_TAG_member
    9052                      .dwattr $C$DW$930, DW_AT_type(*$C$DW$T$27)
    9053                      .dwattr $C$DW$930, DW_AT_name("rsvd_9")
    9054                      .dwattr $C$DW$930, DW_AT_TI_symbol_name("_rsvd_9")
    9055                      .dwattr $C$DW$930, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    9056                      .dwattr $C$DW$930, DW_AT_accessibility(DW_ACCESS_public)
    9057              
    9058              $C$DW$931       .dwtag  DW_TAG_member
    9059                      .dwattr $C$DW$931, DW_AT_type(*$C$DW$T$27)
    9060                      .dwattr $C$DW$931, DW_AT_name("ADCSOCOVFCLR1")
    9061                      .dwattr $C$DW$931, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    9062                      .dwattr $C$DW$931, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    9063                      .dwattr $C$DW$931, DW_AT_accessibility(DW_ACCESS_public)
    9064              
    9065              $C$DW$932       .dwtag  DW_TAG_member
    9066                      .dwattr $C$DW$932, DW_AT_type(*$C$DW$T$27)
    9067                      .dwattr $C$DW$932, DW_AT_name("rsvd_10")
    9068                      .dwattr $C$DW$932, DW_AT_TI_symbol_name("_rsvd_10")
    9069                      .dwattr $C$DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    9070                      .dwattr $C$DW$932, DW_AT_accessibility(DW_ACCESS_public)
    9071              
    9072              $C$DW$933       .dwtag  DW_TAG_member
    9073                      .dwattr $C$DW$933, DW_AT_type(*$C$DW$T$28)
    9074                      .dwattr $C$DW$933, DW_AT_name("ADCSOCxCTL")
    9075                      .dwattr $C$DW$933, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    9076                      .dwattr $C$DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    9077                      .dwattr $C$DW$933, DW_AT_accessibility(DW_ACCESS_public)
    9078              
    9079              $C$DW$934       .dwtag  DW_TAG_member
    9080                      .dwattr $C$DW$934, DW_AT_type(*$C$DW$T$28)
    9081                      .dwattr $C$DW$934, DW_AT_name("rsvd_11")
    9082                      .dwattr $C$DW$934, DW_AT_TI_symbol_name("_rsvd_11")
    9083                      .dwattr $C$DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    9084                      .dwattr $C$DW$934, DW_AT_accessibility(DW_ACCESS_public)
    9085              
    9086              $C$DW$935       .dwtag  DW_TAG_member
    9087                      .dwattr $C$DW$935, DW_AT_type(*$C$DW$T$27)
    9088                      .dwattr $C$DW$935, DW_AT_name("ADCREFTRIM")
    9089                      .dwattr $C$DW$935, DW_AT_TI_symbol_name("_ADCREFTRIM")
    9090                      .dwattr $C$DW$935, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 17:12:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{CF1CE8BB-0BA9-4705-B421-53C212847974} PAGE  179

    9091                      .dwattr $C$DW$935, DW_AT_accessibility(DW_ACCESS_public)
    9092              
    9093              $C$DW$936       .dwtag  DW_TAG_member
    9094                      .dwattr $C$DW$936, DW_AT_type(*$C$DW$T$27)
    9095                      .dwattr $C$DW$936, DW_AT_name("ADCOFFTRIM")
    9096                      .dwattr $C$DW$936, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    9097                      .dwattr $C$DW$936, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    9098                      .dwattr $C$DW$936, DW_AT_accessibility(DW_ACCESS_public)
    9099              
    9100              $C$DW$937       .dwtag  DW_TAG_member
    9101                      .dwattr $C$DW$937, DW_AT_type(*$C$DW$T$33)
    9102                      .dwattr $C$DW$937, DW_AT_name("resvd_12")
    9103                      .dwattr $C$DW$937, DW_AT_TI_symbol_name("_resvd_12")
    9104                      .dwattr $C$DW$937, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    9105                      .dwattr $C$DW$937, DW_AT_accessibility(DW_ACCESS_public)
    9106              
    9107              $C$DW$938       .dwtag  DW_TAG_member
    9108                      .dwattr $C$DW$938, DW_AT_type(*$C$DW$T$27)
    9109                      .dwattr $C$DW$938, DW_AT_name("ADCREV")
    9110                      .dwattr $C$DW$938, DW_AT_TI_symbol_name("_ADCREV")
    9111                      .dwattr $C$DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    9112                      .dwattr $C$DW$938, DW_AT_accessibility(DW_ACCESS_public)
    9113              
    9114                      .dwendtag $C$DW$T$34
    9115              
    9116              $C$DW$T$235     .dwtag  DW_TAG_typedef
    9117                      .dwattr $C$DW$T$235, DW_AT_name("ADC_Obj")
    9118                      .dwattr $C$DW$T$235, DW_AT_type(*$C$DW$T$34)
    9119                      .dwattr $C$DW$T$235, DW_AT_language(DW_LANG_C)
    9120              
    9121              $C$DW$T$124     .dwtag  DW_TAG_pointer_type
    9122                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$34)
    9123                      .dwattr $C$DW$T$124, DW_AT_address_class(0x20)
    9124              
    9125              $C$DW$T$125     .dwtag  DW_TAG_typedef
    9126                      .dwattr $C$DW$T$125, DW_AT_name("ADC_Handle")
    9127                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
    9128                      .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    9129              
    9130              
    9131              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    9132                      .dwattr $C$DW$T$20, DW_AT_name("_AFSEL_Obj_")
    9133                      .dwattr $C$DW$T$20, DW_AT_declaration
    9134                      .dwendtag $C$DW$T$20
    9135              
    9136              $C$DW$T$236     .dwtag  DW_TAG_pointer_type
    9137                      .dwattr $C$DW$T$236, DW_AT_type(*$C$DW$T$20)
    9138                      .dwattr $C$DW$T$236, DW_AT_address_class(0x20)
    9139              
    9140              $C$DW$T$237     .dwtag  DW_TAG_typedef
    9141                      .dwattr $C$DW$T$237, DW_AT_name("AFSEL_Handle")
    9142                      .dwattr $C$DW$T$237, DW_AT_type(*$C$DW$T$236)
    9143                      .dwattr $C$DW$T$237, DW_AT_language(DW_LANG_C)
    9144              
    9145              
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 17:12:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{CF1CE8BB-0BA9-4705-B421-53C212847974} PAGE  180

    9146              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    9147                      .dwattr $C$DW$T$38, DW_AT_name("_CLARKE_Obj_")
    9148                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x06)
    9149              $C$DW$939       .dwtag  DW_TAG_member
    9150                      .dwattr $C$DW$939, DW_AT_type(*$C$DW$T$35)
    9151                      .dwattr $C$DW$939, DW_AT_name("alpha_sf")
    9152                      .dwattr $C$DW$939, DW_AT_TI_symbol_name("_alpha_sf")
    9153                      .dwattr $C$DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9154                      .dwattr $C$DW$939, DW_AT_accessibility(DW_ACCESS_public)
    9155              
    9156              $C$DW$940       .dwtag  DW_TAG_member
    9157                      .dwattr $C$DW$940, DW_AT_type(*$C$DW$T$35)
    9158                      .dwattr $C$DW$940, DW_AT_name("beta_sf")
    9159                      .dwattr $C$DW$940, DW_AT_TI_symbol_name("_beta_sf")
    9160                      .dwattr $C$DW$940, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9161                      .dwattr $C$DW$940, DW_AT_accessibility(DW_ACCESS_public)
    9162              
    9163              $C$DW$941       .dwtag  DW_TAG_member
    9164                      .dwattr $C$DW$941, DW_AT_type(*$C$DW$T$37)
    9165                      .dwattr $C$DW$941, DW_AT_name("numSensors")
    9166                      .dwattr $C$DW$941, DW_AT_TI_symbol_name("_numSensors")
    9167                      .dwattr $C$DW$941, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9168                      .dwattr $C$DW$941, DW_AT_accessibility(DW_ACCESS_public)
    9169              
    9170                      .dwendtag $C$DW$T$38
    9171              
    9172              $C$DW$T$49      .dwtag  DW_TAG_typedef
    9173                      .dwattr $C$DW$T$49, DW_AT_name("CLARKE_Obj")
    9174                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$38)
    9175                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    9176              
    9177              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    9178                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$38)
    9179                      .dwattr $C$DW$T$47, DW_AT_address_class(0x20)
    9180              
    9181              $C$DW$T$48      .dwtag  DW_TAG_typedef
    9182                      .dwattr $C$DW$T$48, DW_AT_name("CLARKE_Handle")
    9183                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    9184                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    9185              
    9186              $C$DW$942       .dwtag  DW_TAG_TI_far_type
    9187                      .dwattr $C$DW$942, DW_AT_type(*$C$DW$T$48)
    9188              
    9189              $C$DW$T$241     .dwtag  DW_TAG_const_type
    9190                      .dwattr $C$DW$T$241, DW_AT_type(*$C$DW$942)
    9191              
    9192              
    9193              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    9194                      .dwattr $C$DW$T$40, DW_AT_name("_CLK_Obj_")
    9195                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x11)
    9196              $C$DW$943       .dwtag  DW_TAG_member
    9197                      .dwattr $C$DW$943, DW_AT_type(*$C$DW$T$27)
    9198                      .dwattr $C$DW$943, DW_AT_name("XCLK")
    9199                      .dwattr $C$DW$943, DW_AT_TI_symbol_name("_XCLK")
    9200                      .dwattr $C$DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 17:12:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{CF1CE8BB-0BA9-4705-B421-53C212847974} PAGE  181

    9201                      .dwattr $C$DW$943, DW_AT_accessibility(DW_ACCESS_public)
    9202              
    9203              $C$DW$944       .dwtag  DW_TAG_member
    9204                      .dwattr $C$DW$944, DW_AT_type(*$C$DW$T$27)
    9205                      .dwattr $C$DW$944, DW_AT_name("rsvd_1")
    9206                      .dwattr $C$DW$944, DW_AT_TI_symbol_name("_rsvd_1")
    9207                      .dwattr $C$DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9208                      .dwattr $C$DW$944, DW_AT_accessibility(DW_ACCESS_public)
    9209              
    9210              $C$DW$945       .dwtag  DW_TAG_member
    9211                      .dwattr $C$DW$945, DW_AT_type(*$C$DW$T$27)
    9212                      .dwattr $C$DW$945, DW_AT_name("CLKCTL")
    9213                      .dwattr $C$DW$945, DW_AT_TI_symbol_name("_CLKCTL")
    9214                      .dwattr $C$DW$945, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9215                      .dwattr $C$DW$945, DW_AT_accessibility(DW_ACCESS_public)
    9216              
    9217              $C$DW$946       .dwtag  DW_TAG_member
    9218                      .dwattr $C$DW$946, DW_AT_type(*$C$DW$T$39)
    9219                      .dwattr $C$DW$946, DW_AT_name("rsvd_2")
    9220                      .dwattr $C$DW$946, DW_AT_TI_symbol_name("_rsvd_2")
    9221                      .dwattr $C$DW$946, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9222                      .dwattr $C$DW$946, DW_AT_accessibility(DW_ACCESS_public)
    9223              
    9224              $C$DW$947       .dwtag  DW_TAG_member
    9225                      .dwattr $C$DW$947, DW_AT_type(*$C$DW$T$27)
    9226                      .dwattr $C$DW$947, DW_AT_name("LOSPCP")
    9227                      .dwattr $C$DW$947, DW_AT_TI_symbol_name("_LOSPCP")
    9228                      .dwattr $C$DW$947, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    9229                      .dwattr $C$DW$947, DW_AT_accessibility(DW_ACCESS_public)
    9230              
    9231              $C$DW$948       .dwtag  DW_TAG_member
    9232                      .dwattr $C$DW$948, DW_AT_type(*$C$DW$T$27)
    9233                      .dwattr $C$DW$948, DW_AT_name("PCLKCR0")
    9234                      .dwattr $C$DW$948, DW_AT_TI_symbol_name("_PCLKCR0")
    9235                      .dwattr $C$DW$948, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9236                      .dwattr $C$DW$948, DW_AT_accessibility(DW_ACCESS_public)
    9237              
    9238              $C$DW$949       .dwtag  DW_TAG_member
    9239                      .dwattr $C$DW$949, DW_AT_type(*$C$DW$T$27)
    9240                      .dwattr $C$DW$949, DW_AT_name("PCLKCR1")
    9241                      .dwattr $C$DW$949, DW_AT_TI_symbol_name("_PCLKCR1")
    9242                      .dwattr $C$DW$949, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    9243                      .dwattr $C$DW$949, DW_AT_accessibility(DW_ACCESS_public)
    9244              
    9245              $C$DW$950       .dwtag  DW_TAG_member
    9246                      .dwattr $C$DW$950, DW_AT_type(*$C$DW$T$30)
    9247                      .dwattr $C$DW$950, DW_AT_name("rsvd_3")
    9248                      .dwattr $C$DW$950, DW_AT_TI_symbol_name("_rsvd_3")
    9249                      .dwattr $C$DW$950, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9250                      .dwattr $C$DW$950, DW_AT_accessibility(DW_ACCESS_public)
    9251              
    9252              $C$DW$951       .dwtag  DW_TAG_member
    9253                      .dwattr $C$DW$951, DW_AT_type(*$C$DW$T$27)
    9254                      .dwattr $C$DW$951, DW_AT_name("PCLKCR3")
    9255                      .dwattr $C$DW$951, DW_AT_TI_symbol_name("_PCLKCR3")
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 17:12:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{CF1CE8BB-0BA9-4705-B421-53C212847974} PAGE  182

    9256                      .dwattr $C$DW$951, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9257                      .dwattr $C$DW$951, DW_AT_accessibility(DW_ACCESS_public)
    9258              
    9259                      .dwendtag $C$DW$T$40
    9260              
    9261              $C$DW$T$126     .dwtag  DW_TAG_pointer_type
    9262                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$40)
    9263                      .dwattr $C$DW$T$126, DW_AT_address_class(0x20)
    9264              
    9265              $C$DW$T$127     .dwtag  DW_TAG_typedef
    9266                      .dwattr $C$DW$T$127, DW_AT_name("CLK_Handle")
    9267                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
    9268                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    9269              
    9270              
    9271              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    9272                      .dwattr $C$DW$T$41, DW_AT_name("_CPU_Obj_")
    9273                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    9274              $C$DW$952       .dwtag  DW_TAG_member
    9275                      .dwattr $C$DW$952, DW_AT_type(*$C$DW$T$37)
    9276                      .dwattr $C$DW$952, DW_AT_name("tmp")
    9277                      .dwattr $C$DW$952, DW_AT_TI_symbol_name("_tmp")
    9278                      .dwattr $C$DW$952, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9279                      .dwattr $C$DW$952, DW_AT_accessibility(DW_ACCESS_public)
    9280              
    9281                      .dwendtag $C$DW$T$41
    9282              
    9283              $C$DW$T$128     .dwtag  DW_TAG_pointer_type
    9284                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$41)
    9285                      .dwattr $C$DW$T$128, DW_AT_address_class(0x20)
    9286              
    9287              $C$DW$T$129     .dwtag  DW_TAG_typedef
    9288                      .dwattr $C$DW$T$129, DW_AT_name("CPU_Handle")
    9289                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$128)
    9290                      .dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
    9291              
    9292              
    9293              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    9294                      .dwattr $C$DW$T$77, DW_AT_name("_CTRL_Obj_")
    9295                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x10a)
    9296              $C$DW$953       .dwtag  DW_TAG_member
    9297                      .dwattr $C$DW$953, DW_AT_type(*$C$DW$T$42)
    9298                      .dwattr $C$DW$953, DW_AT_name("version")
    9299                      .dwattr $C$DW$953, DW_AT_TI_symbol_name("_version")
    9300                      .dwattr $C$DW$953, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9301                      .dwattr $C$DW$953, DW_AT_accessibility(DW_ACCESS_public)
    9302              
    9303              $C$DW$954       .dwtag  DW_TAG_member
    9304                      .dwattr $C$DW$954, DW_AT_type(*$C$DW$T$44)
    9305                      .dwattr $C$DW$954, DW_AT_name("state")
    9306                      .dwattr $C$DW$954, DW_AT_TI_symbol_name("_state")
    9307                      .dwattr $C$DW$954, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9308                      .dwattr $C$DW$954, DW_AT_accessibility(DW_ACCESS_public)
    9309              
    9310              $C$DW$955       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 17:12:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{CF1CE8BB-0BA9-4705-B421-53C212847974} PAGE  183

    9311                      .dwattr $C$DW$955, DW_AT_type(*$C$DW$T$44)
    9312                      .dwattr $C$DW$955, DW_AT_name("prevState")
    9313                      .dwattr $C$DW$955, DW_AT_TI_symbol_name("_prevState")
    9314                      .dwattr $C$DW$955, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9315                      .dwattr $C$DW$955, DW_AT_accessibility(DW_ACCESS_public)
    9316              
    9317              $C$DW$956       .dwtag  DW_TAG_member
    9318                      .dwattr $C$DW$956, DW_AT_type(*$C$DW$T$46)
    9319                      .dwattr $C$DW$956, DW_AT_name("errorCode")
    9320                      .dwattr $C$DW$956, DW_AT_TI_symbol_name("_errorCode")
    9321                      .dwattr $C$DW$956, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9322                      .dwattr $C$DW$956, DW_AT_accessibility(DW_ACCESS_public)
    9323              
    9324              $C$DW$957       .dwtag  DW_TAG_member
    9325                      .dwattr $C$DW$957, DW_AT_type(*$C$DW$T$48)
    9326                      .dwattr $C$DW$957, DW_AT_name("clarkeHandle_I")
    9327                      .dwattr $C$DW$957, DW_AT_TI_symbol_name("_clarkeHandle_I")
    9328                      .dwattr $C$DW$957, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9329                      .dwattr $C$DW$957, DW_AT_accessibility(DW_ACCESS_public)
    9330              
    9331              $C$DW$958       .dwtag  DW_TAG_member
    9332                      .dwattr $C$DW$958, DW_AT_type(*$C$DW$T$49)
    9333                      .dwattr $C$DW$958, DW_AT_name("clarke_I")
    9334                      .dwattr $C$DW$958, DW_AT_TI_symbol_name("_clarke_I")
    9335                      .dwattr $C$DW$958, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9336                      .dwattr $C$DW$958, DW_AT_accessibility(DW_ACCESS_public)
    9337              
    9338              $C$DW$959       .dwtag  DW_TAG_member
    9339                      .dwattr $C$DW$959, DW_AT_type(*$C$DW$T$48)
    9340                      .dwattr $C$DW$959, DW_AT_name("clarkeHandle_V")
    9341                      .dwattr $C$DW$959, DW_AT_TI_symbol_name("_clarkeHandle_V")
    9342                      .dwattr $C$DW$959, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9343                      .dwattr $C$DW$959, DW_AT_accessibility(DW_ACCESS_public)
    9344              
    9345              $C$DW$960       .dwtag  DW_TAG_member
    9346                      .dwattr $C$DW$960, DW_AT_type(*$C$DW$T$49)
    9347                      .dwattr $C$DW$960, DW_AT_name("clarke_V")
    9348                      .dwattr $C$DW$960, DW_AT_TI_symbol_name("_clarke_V")
    9349                      .dwattr $C$DW$960, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9350                      .dwattr $C$DW$960, DW_AT_accessibility(DW_ACCESS_public)
    9351              
    9352              $C$DW$961       .dwtag  DW_TAG_member
    9353                      .dwattr $C$DW$961, DW_AT_type(*$C$DW$T$51)
    9354                      .dwattr $C$DW$961, DW_AT_name("estHandle")
    9355                      .dwattr $C$DW$961, DW_AT_TI_symbol_name("_estHandle")
    9356                      .dwattr $C$DW$961, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9357                      .dwattr $C$DW$961, DW_AT_accessibility(DW_ACCESS_public)
    9358              
    9359              $C$DW$962       .dwtag  DW_TAG_member
    9360                      .dwattr $C$DW$962, DW_AT_type(*$C$DW$T$53)
    9361                      .dwattr $C$DW$962, DW_AT_name("parkHandle")
    9362                      .dwattr $C$DW$962, DW_AT_TI_symbol_name("_parkHandle")
    9363                      .dwattr $C$DW$962, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9364                      .dwattr $C$DW$962, DW_AT_accessibility(DW_ACCESS_public)
    9365              
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 17:12:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{CF1CE8BB-0BA9-4705-B421-53C212847974} PAGE  184

    9366              $C$DW$963       .dwtag  DW_TAG_member
    9367                      .dwattr $C$DW$963, DW_AT_type(*$C$DW$T$54)
    9368                      .dwattr $C$DW$963, DW_AT_name("park")
    9369                      .dwattr $C$DW$963, DW_AT_TI_symbol_name("_park")
    9370                      .dwattr $C$DW$963, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9371                      .dwattr $C$DW$963, DW_AT_accessibility(DW_ACCESS_public)
    9372              
    9373              $C$DW$964       .dwtag  DW_TAG_member
    9374                      .dwattr $C$DW$964, DW_AT_type(*$C$DW$T$56)
    9375                      .dwattr $C$DW$964, DW_AT_name("pidHandle_Id")
    9376                      .dwattr $C$DW$964, DW_AT_TI_symbol_name("_pidHandle_Id")
    9377                      .dwattr $C$DW$964, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    9378                      .dwattr $C$DW$964, DW_AT_accessibility(DW_ACCESS_public)
    9379              
    9380              $C$DW$965       .dwtag  DW_TAG_member
    9381                      .dwattr $C$DW$965, DW_AT_type(*$C$DW$T$57)
    9382                      .dwattr $C$DW$965, DW_AT_name("pid_Id")
    9383                      .dwattr $C$DW$965, DW_AT_TI_symbol_name("_pid_Id")
    9384                      .dwattr $C$DW$965, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    9385                      .dwattr $C$DW$965, DW_AT_accessibility(DW_ACCESS_public)
    9386              
    9387              $C$DW$966       .dwtag  DW_TAG_member
    9388                      .dwattr $C$DW$966, DW_AT_type(*$C$DW$T$56)
    9389                      .dwattr $C$DW$966, DW_AT_name("pidHandle_Iq")
    9390                      .dwattr $C$DW$966, DW_AT_TI_symbol_name("_pidHandle_Iq")
    9391                      .dwattr $C$DW$966, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    9392                      .dwattr $C$DW$966, DW_AT_accessibility(DW_ACCESS_public)
    9393              
    9394              $C$DW$967       .dwtag  DW_TAG_member
    9395                      .dwattr $C$DW$967, DW_AT_type(*$C$DW$T$57)
    9396                      .dwattr $C$DW$967, DW_AT_name("pid_Iq")
    9397                      .dwattr $C$DW$967, DW_AT_TI_symbol_name("_pid_Iq")
    9398                      .dwattr $C$DW$967, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    9399                      .dwattr $C$DW$967, DW_AT_accessibility(DW_ACCESS_public)
    9400              
    9401              $C$DW$968       .dwtag  DW_TAG_member
    9402                      .dwattr $C$DW$968, DW_AT_type(*$C$DW$T$56)
    9403                      .dwattr $C$DW$968, DW_AT_name("pidHandle_spd")
    9404                      .dwattr $C$DW$968, DW_AT_TI_symbol_name("_pidHandle_spd")
    9405                      .dwattr $C$DW$968, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    9406                      .dwattr $C$DW$968, DW_AT_accessibility(DW_ACCESS_public)
    9407              
    9408              $C$DW$969       .dwtag  DW_TAG_member
    9409                      .dwattr $C$DW$969, DW_AT_type(*$C$DW$T$57)
    9410                      .dwattr $C$DW$969, DW_AT_name("pid_spd")
    9411                      .dwattr $C$DW$969, DW_AT_TI_symbol_name("_pid_spd")
    9412                      .dwattr $C$DW$969, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    9413                      .dwattr $C$DW$969, DW_AT_accessibility(DW_ACCESS_public)
    9414              
    9415              $C$DW$970       .dwtag  DW_TAG_member
    9416                      .dwattr $C$DW$970, DW_AT_type(*$C$DW$T$59)
    9417                      .dwattr $C$DW$970, DW_AT_name("iparkHandle")
    9418                      .dwattr $C$DW$970, DW_AT_TI_symbol_name("_iparkHandle")
    9419                      .dwattr $C$DW$970, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    9420                      .dwattr $C$DW$970, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 17:12:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{CF1CE8BB-0BA9-4705-B421-53C212847974} PAGE  185

    9421              
    9422              $C$DW$971       .dwtag  DW_TAG_member
    9423                      .dwattr $C$DW$971, DW_AT_type(*$C$DW$T$60)
    9424                      .dwattr $C$DW$971, DW_AT_name("ipark")
    9425                      .dwattr $C$DW$971, DW_AT_TI_symbol_name("_ipark")
    9426                      .dwattr $C$DW$971, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    9427                      .dwattr $C$DW$971, DW_AT_accessibility(DW_ACCESS_public)
    9428              
    9429              $C$DW$972       .dwtag  DW_TAG_member
    9430                      .dwattr $C$DW$972, DW_AT_type(*$C$DW$T$62)
    9431                      .dwattr $C$DW$972, DW_AT_name("svgenHandle")
    9432                      .dwattr $C$DW$972, DW_AT_TI_symbol_name("_svgenHandle")
    9433                      .dwattr $C$DW$972, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    9434                      .dwattr $C$DW$972, DW_AT_accessibility(DW_ACCESS_public)
    9435              
    9436              $C$DW$973       .dwtag  DW_TAG_member
    9437                      .dwattr $C$DW$973, DW_AT_type(*$C$DW$T$63)
    9438                      .dwattr $C$DW$973, DW_AT_name("svgen")
    9439                      .dwattr $C$DW$973, DW_AT_TI_symbol_name("_svgen")
    9440                      .dwattr $C$DW$973, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    9441                      .dwattr $C$DW$973, DW_AT_accessibility(DW_ACCESS_public)
    9442              
    9443              $C$DW$974       .dwtag  DW_TAG_member
    9444                      .dwattr $C$DW$974, DW_AT_type(*$C$DW$T$65)
    9445                      .dwattr $C$DW$974, DW_AT_name("trajHandle_Id")
    9446                      .dwattr $C$DW$974, DW_AT_TI_symbol_name("_trajHandle_Id")
    9447                      .dwattr $C$DW$974, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    9448                      .dwattr $C$DW$974, DW_AT_accessibility(DW_ACCESS_public)
    9449              
    9450              $C$DW$975       .dwtag  DW_TAG_member
    9451                      .dwattr $C$DW$975, DW_AT_type(*$C$DW$T$66)
    9452                      .dwattr $C$DW$975, DW_AT_name("traj_Id")
    9453                      .dwattr $C$DW$975, DW_AT_TI_symbol_name("_traj_Id")
    9454                      .dwattr $C$DW$975, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    9455                      .dwattr $C$DW$975, DW_AT_accessibility(DW_ACCESS_public)
    9456              
    9457              $C$DW$976       .dwtag  DW_TAG_member
    9458                      .dwattr $C$DW$976, DW_AT_type(*$C$DW$T$65)
    9459                      .dwattr $C$DW$976, DW_AT_name("trajHandle_spd")
    9460                      .dwattr $C$DW$976, DW_AT_TI_symbol_name("_trajHandle_spd")
    9461                      .dwattr $C$DW$976, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    9462                      .dwattr $C$DW$976, DW_AT_accessibility(DW_ACCESS_public)
    9463              
    9464              $C$DW$977       .dwtag  DW_TAG_member
    9465                      .dwattr $C$DW$977, DW_AT_type(*$C$DW$T$66)
    9466                      .dwattr $C$DW$977, DW_AT_name("traj_spd")
    9467                      .dwattr $C$DW$977, DW_AT_TI_symbol_name("_traj_spd")
    9468                      .dwattr $C$DW$977, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    9469                      .dwattr $C$DW$977, DW_AT_accessibility(DW_ACCESS_public)
    9470              
    9471              $C$DW$978       .dwtag  DW_TAG_member
    9472                      .dwattr $C$DW$978, DW_AT_type(*$C$DW$T$65)
    9473                      .dwattr $C$DW$978, DW_AT_name("trajHandle_spdMax")
    9474                      .dwattr $C$DW$978, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    9475                      .dwattr $C$DW$978, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 17:12:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{CF1CE8BB-0BA9-4705-B421-53C212847974} PAGE  186

    9476                      .dwattr $C$DW$978, DW_AT_accessibility(DW_ACCESS_public)
    9477              
    9478              $C$DW$979       .dwtag  DW_TAG_member
    9479                      .dwattr $C$DW$979, DW_AT_type(*$C$DW$T$66)
    9480                      .dwattr $C$DW$979, DW_AT_name("traj_spdMax")
    9481                      .dwattr $C$DW$979, DW_AT_TI_symbol_name("_traj_spdMax")
    9482                      .dwattr $C$DW$979, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    9483                      .dwattr $C$DW$979, DW_AT_accessibility(DW_ACCESS_public)
    9484              
    9485              $C$DW$980       .dwtag  DW_TAG_member
    9486                      .dwattr $C$DW$980, DW_AT_type(*$C$DW$T$67)
    9487                      .dwattr $C$DW$980, DW_AT_name("motorParams")
    9488                      .dwattr $C$DW$980, DW_AT_TI_symbol_name("_motorParams")
    9489                      .dwattr $C$DW$980, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    9490                      .dwattr $C$DW$980, DW_AT_accessibility(DW_ACCESS_public)
    9491              
    9492              $C$DW$981       .dwtag  DW_TAG_member
    9493                      .dwattr $C$DW$981, DW_AT_type(*$C$DW$T$71)
    9494                      .dwattr $C$DW$981, DW_AT_name("waitTimes")
    9495                      .dwattr $C$DW$981, DW_AT_TI_symbol_name("_waitTimes")
    9496                      .dwattr $C$DW$981, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    9497                      .dwattr $C$DW$981, DW_AT_accessibility(DW_ACCESS_public)
    9498              
    9499              $C$DW$982       .dwtag  DW_TAG_member
    9500                      .dwattr $C$DW$982, DW_AT_type(*$C$DW$T$70)
    9501                      .dwattr $C$DW$982, DW_AT_name("counter_state")
    9502                      .dwattr $C$DW$982, DW_AT_TI_symbol_name("_counter_state")
    9503                      .dwattr $C$DW$982, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    9504                      .dwattr $C$DW$982, DW_AT_accessibility(DW_ACCESS_public)
    9505              
    9506              $C$DW$983       .dwtag  DW_TAG_member
    9507                      .dwattr $C$DW$983, DW_AT_type(*$C$DW$T$73)
    9508                      .dwattr $C$DW$983, DW_AT_name("numIsrTicksPerCtrlTick")
    9509                      .dwattr $C$DW$983, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    9510                      .dwattr $C$DW$983, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    9511                      .dwattr $C$DW$983, DW_AT_accessibility(DW_ACCESS_public)
    9512              
    9513              $C$DW$984       .dwtag  DW_TAG_member
    9514                      .dwattr $C$DW$984, DW_AT_type(*$C$DW$T$73)
    9515                      .dwattr $C$DW$984, DW_AT_name("numCtrlTicksPerCurrentTick")
    9516                      .dwattr $C$DW$984, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    9517                      .dwattr $C$DW$984, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    9518                      .dwattr $C$DW$984, DW_AT_accessibility(DW_ACCESS_public)
    9519              
    9520              $C$DW$985       .dwtag  DW_TAG_member
    9521                      .dwattr $C$DW$985, DW_AT_type(*$C$DW$T$73)
    9522                      .dwattr $C$DW$985, DW_AT_name("numCtrlTicksPerSpeedTick")
    9523                      .dwattr $C$DW$985, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    9524                      .dwattr $C$DW$985, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    9525                      .dwattr $C$DW$985, DW_AT_accessibility(DW_ACCESS_public)
    9526              
    9527              $C$DW$986       .dwtag  DW_TAG_member
    9528                      .dwattr $C$DW$986, DW_AT_type(*$C$DW$T$73)
    9529                      .dwattr $C$DW$986, DW_AT_name("numCtrlTicksPerTrajTick")
    9530                      .dwattr $C$DW$986, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 17:12:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{CF1CE8BB-0BA9-4705-B421-53C212847974} PAGE  187

    9531                      .dwattr $C$DW$986, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    9532                      .dwattr $C$DW$986, DW_AT_accessibility(DW_ACCESS_public)
    9533              
    9534              $C$DW$987       .dwtag  DW_TAG_member
    9535                      .dwattr $C$DW$987, DW_AT_type(*$C$DW$T$70)
    9536                      .dwattr $C$DW$987, DW_AT_name("ctrlFreq_Hz")
    9537                      .dwattr $C$DW$987, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    9538                      .dwattr $C$DW$987, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    9539                      .dwattr $C$DW$987, DW_AT_accessibility(DW_ACCESS_public)
    9540              
    9541              $C$DW$988       .dwtag  DW_TAG_member
    9542                      .dwattr $C$DW$988, DW_AT_type(*$C$DW$T$70)
    9543                      .dwattr $C$DW$988, DW_AT_name("trajFreq_Hz")
    9544                      .dwattr $C$DW$988, DW_AT_TI_symbol_name("_trajFreq_Hz")
    9545                      .dwattr $C$DW$988, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    9546                      .dwattr $C$DW$988, DW_AT_accessibility(DW_ACCESS_public)
    9547              
    9548              $C$DW$989       .dwtag  DW_TAG_member
    9549                      .dwattr $C$DW$989, DW_AT_type(*$C$DW$T$35)
    9550                      .dwattr $C$DW$989, DW_AT_name("trajPeriod_sec")
    9551                      .dwattr $C$DW$989, DW_AT_TI_symbol_name("_trajPeriod_sec")
    9552                      .dwattr $C$DW$989, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    9553                      .dwattr $C$DW$989, DW_AT_accessibility(DW_ACCESS_public)
    9554              
    9555              $C$DW$990       .dwtag  DW_TAG_member
    9556                      .dwattr $C$DW$990, DW_AT_type(*$C$DW$T$74)
    9557                      .dwattr $C$DW$990, DW_AT_name("ctrlPeriod_sec")
    9558                      .dwattr $C$DW$990, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    9559                      .dwattr $C$DW$990, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    9560                      .dwattr $C$DW$990, DW_AT_accessibility(DW_ACCESS_public)
    9561              
    9562              $C$DW$991       .dwtag  DW_TAG_member
    9563                      .dwattr $C$DW$991, DW_AT_type(*$C$DW$T$35)
    9564                      .dwattr $C$DW$991, DW_AT_name("maxVsMag_pu")
    9565                      .dwattr $C$DW$991, DW_AT_TI_symbol_name("_maxVsMag_pu")
    9566                      .dwattr $C$DW$991, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    9567                      .dwattr $C$DW$991, DW_AT_accessibility(DW_ACCESS_public)
    9568              
    9569              $C$DW$992       .dwtag  DW_TAG_member
    9570                      .dwattr $C$DW$992, DW_AT_type(*$C$DW$T$75)
    9571                      .dwattr $C$DW$992, DW_AT_name("Iab_in")
    9572                      .dwattr $C$DW$992, DW_AT_TI_symbol_name("_Iab_in")
    9573                      .dwattr $C$DW$992, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    9574                      .dwattr $C$DW$992, DW_AT_accessibility(DW_ACCESS_public)
    9575              
    9576              $C$DW$993       .dwtag  DW_TAG_member
    9577                      .dwattr $C$DW$993, DW_AT_type(*$C$DW$T$75)
    9578                      .dwattr $C$DW$993, DW_AT_name("Iab_filt")
    9579                      .dwattr $C$DW$993, DW_AT_TI_symbol_name("_Iab_filt")
    9580                      .dwattr $C$DW$993, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    9581                      .dwattr $C$DW$993, DW_AT_accessibility(DW_ACCESS_public)
    9582              
    9583              $C$DW$994       .dwtag  DW_TAG_member
    9584                      .dwattr $C$DW$994, DW_AT_type(*$C$DW$T$75)
    9585                      .dwattr $C$DW$994, DW_AT_name("Idq_in")
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 17:12:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{CF1CE8BB-0BA9-4705-B421-53C212847974} PAGE  188

    9586                      .dwattr $C$DW$994, DW_AT_TI_symbol_name("_Idq_in")
    9587                      .dwattr $C$DW$994, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    9588                      .dwattr $C$DW$994, DW_AT_accessibility(DW_ACCESS_public)
    9589              
    9590              $C$DW$995       .dwtag  DW_TAG_member
    9591                      .dwattr $C$DW$995, DW_AT_type(*$C$DW$T$75)
    9592                      .dwattr $C$DW$995, DW_AT_name("Vab_in")
    9593                      .dwattr $C$DW$995, DW_AT_TI_symbol_name("_Vab_in")
    9594                      .dwattr $C$DW$995, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    9595                      .dwattr $C$DW$995, DW_AT_accessibility(DW_ACCESS_public)
    9596              
    9597              $C$DW$996       .dwtag  DW_TAG_member
    9598                      .dwattr $C$DW$996, DW_AT_type(*$C$DW$T$35)
    9599                      .dwattr $C$DW$996, DW_AT_name("spd_out")
    9600                      .dwattr $C$DW$996, DW_AT_TI_symbol_name("_spd_out")
    9601                      .dwattr $C$DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    9602                      .dwattr $C$DW$996, DW_AT_accessibility(DW_ACCESS_public)
    9603              
    9604              $C$DW$997       .dwtag  DW_TAG_member
    9605                      .dwattr $C$DW$997, DW_AT_type(*$C$DW$T$75)
    9606                      .dwattr $C$DW$997, DW_AT_name("Vab_out")
    9607                      .dwattr $C$DW$997, DW_AT_TI_symbol_name("_Vab_out")
    9608                      .dwattr $C$DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    9609                      .dwattr $C$DW$997, DW_AT_accessibility(DW_ACCESS_public)
    9610              
    9611              $C$DW$998       .dwtag  DW_TAG_member
    9612                      .dwattr $C$DW$998, DW_AT_type(*$C$DW$T$75)
    9613                      .dwattr $C$DW$998, DW_AT_name("Vdq_out")
    9614                      .dwattr $C$DW$998, DW_AT_TI_symbol_name("_Vdq_out")
    9615                      .dwattr $C$DW$998, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    9616                      .dwattr $C$DW$998, DW_AT_accessibility(DW_ACCESS_public)
    9617              
    9618              $C$DW$999       .dwtag  DW_TAG_member
    9619                      .dwattr $C$DW$999, DW_AT_type(*$C$DW$T$74)
    9620                      .dwattr $C$DW$999, DW_AT_name("Rhf")
    9621                      .dwattr $C$DW$999, DW_AT_TI_symbol_name("_Rhf")
    9622                      .dwattr $C$DW$999, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    9623                      .dwattr $C$DW$999, DW_AT_accessibility(DW_ACCESS_public)
    9624              
    9625              $C$DW$1000      .dwtag  DW_TAG_member
    9626                      .dwattr $C$DW$1000, DW_AT_type(*$C$DW$T$74)
    9627                      .dwattr $C$DW$1000, DW_AT_name("Lhf")
    9628                      .dwattr $C$DW$1000, DW_AT_TI_symbol_name("_Lhf")
    9629                      .dwattr $C$DW$1000, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    9630                      .dwattr $C$DW$1000, DW_AT_accessibility(DW_ACCESS_public)
    9631              
    9632              $C$DW$1001      .dwtag  DW_TAG_member
    9633                      .dwattr $C$DW$1001, DW_AT_type(*$C$DW$T$74)
    9634                      .dwattr $C$DW$1001, DW_AT_name("RoverL")
    9635                      .dwattr $C$DW$1001, DW_AT_TI_symbol_name("_RoverL")
    9636                      .dwattr $C$DW$1001, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    9637                      .dwattr $C$DW$1001, DW_AT_accessibility(DW_ACCESS_public)
    9638              
    9639              $C$DW$1002      .dwtag  DW_TAG_member
    9640                      .dwattr $C$DW$1002, DW_AT_type(*$C$DW$T$35)
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 17:12:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{CF1CE8BB-0BA9-4705-B421-53C212847974} PAGE  189

    9641                      .dwattr $C$DW$1002, DW_AT_name("Kp_Id")
    9642                      .dwattr $C$DW$1002, DW_AT_TI_symbol_name("_Kp_Id")
    9643                      .dwattr $C$DW$1002, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    9644                      .dwattr $C$DW$1002, DW_AT_accessibility(DW_ACCESS_public)
    9645              
    9646              $C$DW$1003      .dwtag  DW_TAG_member
    9647                      .dwattr $C$DW$1003, DW_AT_type(*$C$DW$T$35)
    9648                      .dwattr $C$DW$1003, DW_AT_name("Kp_Iq")
    9649                      .dwattr $C$DW$1003, DW_AT_TI_symbol_name("_Kp_Iq")
    9650                      .dwattr $C$DW$1003, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    9651                      .dwattr $C$DW$1003, DW_AT_accessibility(DW_ACCESS_public)
    9652              
    9653              $C$DW$1004      .dwtag  DW_TAG_member
    9654                      .dwattr $C$DW$1004, DW_AT_type(*$C$DW$T$35)
    9655                      .dwattr $C$DW$1004, DW_AT_name("Kp_spd")
    9656                      .dwattr $C$DW$1004, DW_AT_TI_symbol_name("_Kp_spd")
    9657                      .dwattr $C$DW$1004, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    9658                      .dwattr $C$DW$1004, DW_AT_accessibility(DW_ACCESS_public)
    9659              
    9660              $C$DW$1005      .dwtag  DW_TAG_member
    9661                      .dwattr $C$DW$1005, DW_AT_type(*$C$DW$T$35)
    9662                      .dwattr $C$DW$1005, DW_AT_name("Ki_Id")
    9663                      .dwattr $C$DW$1005, DW_AT_TI_symbol_name("_Ki_Id")
    9664                      .dwattr $C$DW$1005, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    9665                      .dwattr $C$DW$1005, DW_AT_accessibility(DW_ACCESS_public)
    9666              
    9667              $C$DW$1006      .dwtag  DW_TAG_member
    9668                      .dwattr $C$DW$1006, DW_AT_type(*$C$DW$T$35)
    9669                      .dwattr $C$DW$1006, DW_AT_name("Ki_Iq")
    9670                      .dwattr $C$DW$1006, DW_AT_TI_symbol_name("_Ki_Iq")
    9671                      .dwattr $C$DW$1006, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    9672                      .dwattr $C$DW$1006, DW_AT_accessibility(DW_ACCESS_public)
    9673              
    9674              $C$DW$1007      .dwtag  DW_TAG_member
    9675                      .dwattr $C$DW$1007, DW_AT_type(*$C$DW$T$35)
    9676                      .dwattr $C$DW$1007, DW_AT_name("Ki_spd")
    9677                      .dwattr $C$DW$1007, DW_AT_TI_symbol_name("_Ki_spd")
    9678                      .dwattr $C$DW$1007, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    9679                      .dwattr $C$DW$1007, DW_AT_accessibility(DW_ACCESS_public)
    9680              
    9681              $C$DW$1008      .dwtag  DW_TAG_member
    9682                      .dwattr $C$DW$1008, DW_AT_type(*$C$DW$T$35)
    9683                      .dwattr $C$DW$1008, DW_AT_name("Kd_Id")
    9684                      .dwattr $C$DW$1008, DW_AT_TI_symbol_name("_Kd_Id")
    9685                      .dwattr $C$DW$1008, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    9686                      .dwattr $C$DW$1008, DW_AT_accessibility(DW_ACCESS_public)
    9687              
    9688              $C$DW$1009      .dwtag  DW_TAG_member
    9689                      .dwattr $C$DW$1009, DW_AT_type(*$C$DW$T$35)
    9690                      .dwattr $C$DW$1009, DW_AT_name("Kd_Iq")
    9691                      .dwattr $C$DW$1009, DW_AT_TI_symbol_name("_Kd_Iq")
    9692                      .dwattr $C$DW$1009, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    9693                      .dwattr $C$DW$1009, DW_AT_accessibility(DW_ACCESS_public)
    9694              
    9695              $C$DW$1010      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 17:12:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{CF1CE8BB-0BA9-4705-B421-53C212847974} PAGE  190

    9696                      .dwattr $C$DW$1010, DW_AT_type(*$C$DW$T$35)
    9697                      .dwattr $C$DW$1010, DW_AT_name("Kd_spd")
    9698                      .dwattr $C$DW$1010, DW_AT_TI_symbol_name("_Kd_spd")
    9699                      .dwattr $C$DW$1010, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    9700                      .dwattr $C$DW$1010, DW_AT_accessibility(DW_ACCESS_public)
    9701              
    9702              $C$DW$1011      .dwtag  DW_TAG_member
    9703                      .dwattr $C$DW$1011, DW_AT_type(*$C$DW$T$35)
    9704                      .dwattr $C$DW$1011, DW_AT_name("Ui_Id")
    9705                      .dwattr $C$DW$1011, DW_AT_TI_symbol_name("_Ui_Id")
    9706                      .dwattr $C$DW$1011, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    9707                      .dwattr $C$DW$1011, DW_AT_accessibility(DW_ACCESS_public)
    9708              
    9709              $C$DW$1012      .dwtag  DW_TAG_member
    9710                      .dwattr $C$DW$1012, DW_AT_type(*$C$DW$T$35)
    9711                      .dwattr $C$DW$1012, DW_AT_name("Ui_Iq")
    9712                      .dwattr $C$DW$1012, DW_AT_TI_symbol_name("_Ui_Iq")
    9713                      .dwattr $C$DW$1012, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    9714                      .dwattr $C$DW$1012, DW_AT_accessibility(DW_ACCESS_public)
    9715              
    9716              $C$DW$1013      .dwtag  DW_TAG_member
    9717                      .dwattr $C$DW$1013, DW_AT_type(*$C$DW$T$35)
    9718                      .dwattr $C$DW$1013, DW_AT_name("Ui_spd")
    9719                      .dwattr $C$DW$1013, DW_AT_TI_symbol_name("_Ui_spd")
    9720                      .dwattr $C$DW$1013, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    9721                      .dwattr $C$DW$1013, DW_AT_accessibility(DW_ACCESS_public)
    9722              
    9723              $C$DW$1014      .dwtag  DW_TAG_member
    9724                      .dwattr $C$DW$1014, DW_AT_type(*$C$DW$T$75)
    9725                      .dwattr $C$DW$1014, DW_AT_name("Idq_ref")
    9726                      .dwattr $C$DW$1014, DW_AT_TI_symbol_name("_Idq_ref")
    9727                      .dwattr $C$DW$1014, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    9728                      .dwattr $C$DW$1014, DW_AT_accessibility(DW_ACCESS_public)
    9729              
    9730              $C$DW$1015      .dwtag  DW_TAG_member
    9731                      .dwattr $C$DW$1015, DW_AT_type(*$C$DW$T$35)
    9732                      .dwattr $C$DW$1015, DW_AT_name("IdRated")
    9733                      .dwattr $C$DW$1015, DW_AT_TI_symbol_name("_IdRated")
    9734                      .dwattr $C$DW$1015, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    9735                      .dwattr $C$DW$1015, DW_AT_accessibility(DW_ACCESS_public)
    9736              
    9737              $C$DW$1016      .dwtag  DW_TAG_member
    9738                      .dwattr $C$DW$1016, DW_AT_type(*$C$DW$T$35)
    9739                      .dwattr $C$DW$1016, DW_AT_name("spd_ref")
    9740                      .dwattr $C$DW$1016, DW_AT_TI_symbol_name("_spd_ref")
    9741                      .dwattr $C$DW$1016, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    9742                      .dwattr $C$DW$1016, DW_AT_accessibility(DW_ACCESS_public)
    9743              
    9744              $C$DW$1017      .dwtag  DW_TAG_member
    9745                      .dwattr $C$DW$1017, DW_AT_type(*$C$DW$T$35)
    9746                      .dwattr $C$DW$1017, DW_AT_name("spd_max")
    9747                      .dwattr $C$DW$1017, DW_AT_TI_symbol_name("_spd_max")
    9748                      .dwattr $C$DW$1017, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    9749                      .dwattr $C$DW$1017, DW_AT_accessibility(DW_ACCESS_public)
    9750              
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 17:12:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{CF1CE8BB-0BA9-4705-B421-53C212847974} PAGE  191

    9751              $C$DW$1018      .dwtag  DW_TAG_member
    9752                      .dwattr $C$DW$1018, DW_AT_type(*$C$DW$T$73)
    9753                      .dwattr $C$DW$1018, DW_AT_name("counter_current")
    9754                      .dwattr $C$DW$1018, DW_AT_TI_symbol_name("_counter_current")
    9755                      .dwattr $C$DW$1018, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    9756                      .dwattr $C$DW$1018, DW_AT_accessibility(DW_ACCESS_public)
    9757              
    9758              $C$DW$1019      .dwtag  DW_TAG_member
    9759                      .dwattr $C$DW$1019, DW_AT_type(*$C$DW$T$73)
    9760                      .dwattr $C$DW$1019, DW_AT_name("counter_isr")
    9761                      .dwattr $C$DW$1019, DW_AT_TI_symbol_name("_counter_isr")
    9762                      .dwattr $C$DW$1019, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    9763                      .dwattr $C$DW$1019, DW_AT_accessibility(DW_ACCESS_public)
    9764              
    9765              $C$DW$1020      .dwtag  DW_TAG_member
    9766                      .dwattr $C$DW$1020, DW_AT_type(*$C$DW$T$73)
    9767                      .dwattr $C$DW$1020, DW_AT_name("counter_speed")
    9768                      .dwattr $C$DW$1020, DW_AT_TI_symbol_name("_counter_speed")
    9769                      .dwattr $C$DW$1020, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    9770                      .dwattr $C$DW$1020, DW_AT_accessibility(DW_ACCESS_public)
    9771              
    9772              $C$DW$1021      .dwtag  DW_TAG_member
    9773                      .dwattr $C$DW$1021, DW_AT_type(*$C$DW$T$73)
    9774                      .dwattr $C$DW$1021, DW_AT_name("counter_traj")
    9775                      .dwattr $C$DW$1021, DW_AT_TI_symbol_name("_counter_traj")
    9776                      .dwattr $C$DW$1021, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    9777                      .dwattr $C$DW$1021, DW_AT_accessibility(DW_ACCESS_public)
    9778              
    9779              $C$DW$1022      .dwtag  DW_TAG_member
    9780                      .dwattr $C$DW$1022, DW_AT_type(*$C$DW$T$76)
    9781                      .dwattr $C$DW$1022, DW_AT_name("flag_enableCtrl")
    9782                      .dwattr $C$DW$1022, DW_AT_TI_symbol_name("_flag_enableCtrl")
    9783                      .dwattr $C$DW$1022, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    9784                      .dwattr $C$DW$1022, DW_AT_accessibility(DW_ACCESS_public)
    9785              
    9786              $C$DW$1023      .dwtag  DW_TAG_member
    9787                      .dwattr $C$DW$1023, DW_AT_type(*$C$DW$T$76)
    9788                      .dwattr $C$DW$1023, DW_AT_name("flag_enableDcBusComp")
    9789                      .dwattr $C$DW$1023, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    9790                      .dwattr $C$DW$1023, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    9791                      .dwattr $C$DW$1023, DW_AT_accessibility(DW_ACCESS_public)
    9792              
    9793              $C$DW$1024      .dwtag  DW_TAG_member
    9794                      .dwattr $C$DW$1024, DW_AT_type(*$C$DW$T$76)
    9795                      .dwattr $C$DW$1024, DW_AT_name("flag_enablePowerWarp")
    9796                      .dwattr $C$DW$1024, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    9797                      .dwattr $C$DW$1024, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    9798                      .dwattr $C$DW$1024, DW_AT_accessibility(DW_ACCESS_public)
    9799              
    9800              $C$DW$1025      .dwtag  DW_TAG_member
    9801                      .dwattr $C$DW$1025, DW_AT_type(*$C$DW$T$76)
    9802                      .dwattr $C$DW$1025, DW_AT_name("flag_enableOffset")
    9803                      .dwattr $C$DW$1025, DW_AT_TI_symbol_name("_flag_enableOffset")
    9804                      .dwattr $C$DW$1025, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    9805                      .dwattr $C$DW$1025, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 17:12:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{CF1CE8BB-0BA9-4705-B421-53C212847974} PAGE  192

    9806              
    9807              $C$DW$1026      .dwtag  DW_TAG_member
    9808                      .dwattr $C$DW$1026, DW_AT_type(*$C$DW$T$76)
    9809                      .dwattr $C$DW$1026, DW_AT_name("flag_enableSpeedCtrl")
    9810                      .dwattr $C$DW$1026, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    9811                      .dwattr $C$DW$1026, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    9812                      .dwattr $C$DW$1026, DW_AT_accessibility(DW_ACCESS_public)
    9813              
    9814              $C$DW$1027      .dwtag  DW_TAG_member
    9815                      .dwattr $C$DW$1027, DW_AT_type(*$C$DW$T$76)
    9816                      .dwattr $C$DW$1027, DW_AT_name("flag_enableUserMotorParams")
    9817                      .dwattr $C$DW$1027, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    9818                      .dwattr $C$DW$1027, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    9819                      .dwattr $C$DW$1027, DW_AT_accessibility(DW_ACCESS_public)
    9820              
    9821              $C$DW$1028      .dwtag  DW_TAG_member
    9822                      .dwattr $C$DW$1028, DW_AT_type(*$C$DW$T$75)
    9823                      .dwattr $C$DW$1028, DW_AT_name("Idq_offset_pu")
    9824                      .dwattr $C$DW$1028, DW_AT_TI_symbol_name("_Idq_offset_pu")
    9825                      .dwattr $C$DW$1028, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    9826                      .dwattr $C$DW$1028, DW_AT_accessibility(DW_ACCESS_public)
    9827              
    9828              $C$DW$1029      .dwtag  DW_TAG_member
    9829                      .dwattr $C$DW$1029, DW_AT_type(*$C$DW$T$75)
    9830                      .dwattr $C$DW$1029, DW_AT_name("Vdq_offset_pu")
    9831                      .dwattr $C$DW$1029, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    9832                      .dwattr $C$DW$1029, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    9833                      .dwattr $C$DW$1029, DW_AT_accessibility(DW_ACCESS_public)
    9834              
    9835              $C$DW$1030      .dwtag  DW_TAG_member
    9836                      .dwattr $C$DW$1030, DW_AT_type(*$C$DW$T$35)
    9837                      .dwattr $C$DW$1030, DW_AT_name("angle_pu")
    9838                      .dwattr $C$DW$1030, DW_AT_TI_symbol_name("_angle_pu")
    9839                      .dwattr $C$DW$1030, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    9840                      .dwattr $C$DW$1030, DW_AT_accessibility(DW_ACCESS_public)
    9841              
    9842              $C$DW$1031      .dwtag  DW_TAG_member
    9843                      .dwattr $C$DW$1031, DW_AT_type(*$C$DW$T$35)
    9844                      .dwattr $C$DW$1031, DW_AT_name("speed_ref_pu")
    9845                      .dwattr $C$DW$1031, DW_AT_TI_symbol_name("_speed_ref_pu")
    9846                      .dwattr $C$DW$1031, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    9847                      .dwattr $C$DW$1031, DW_AT_accessibility(DW_ACCESS_public)
    9848              
    9849              $C$DW$1032      .dwtag  DW_TAG_member
    9850                      .dwattr $C$DW$1032, DW_AT_type(*$C$DW$T$35)
    9851                      .dwattr $C$DW$1032, DW_AT_name("speed_fb_pu")
    9852                      .dwattr $C$DW$1032, DW_AT_TI_symbol_name("_speed_fb_pu")
    9853                      .dwattr $C$DW$1032, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    9854                      .dwattr $C$DW$1032, DW_AT_accessibility(DW_ACCESS_public)
    9855              
    9856              $C$DW$1033      .dwtag  DW_TAG_member
    9857                      .dwattr $C$DW$1033, DW_AT_type(*$C$DW$T$35)
    9858                      .dwattr $C$DW$1033, DW_AT_name("speed_outMax_pu")
    9859                      .dwattr $C$DW$1033, DW_AT_TI_symbol_name("_speed_outMax_pu")
    9860                      .dwattr $C$DW$1033, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 17:12:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{CF1CE8BB-0BA9-4705-B421-53C212847974} PAGE  193

    9861                      .dwattr $C$DW$1033, DW_AT_accessibility(DW_ACCESS_public)
    9862              
    9863              $C$DW$1034      .dwtag  DW_TAG_member
    9864                      .dwattr $C$DW$1034, DW_AT_type(*$C$DW$T$76)
    9865                      .dwattr $C$DW$1034, DW_AT_name("flag_enableCurrentCtrl")
    9866                      .dwattr $C$DW$1034, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    9867                      .dwattr $C$DW$1034, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    9868                      .dwattr $C$DW$1034, DW_AT_accessibility(DW_ACCESS_public)
    9869              
    9870              $C$DW$1035      .dwtag  DW_TAG_member
    9871                      .dwattr $C$DW$1035, DW_AT_type(*$C$DW$T$35)
    9872                      .dwattr $C$DW$1035, DW_AT_name("torque_head_comm")
    9873                      .dwattr $C$DW$1035, DW_AT_TI_symbol_name("_torque_head_comm")
    9874                      .dwattr $C$DW$1035, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    9875                      .dwattr $C$DW$1035, DW_AT_accessibility(DW_ACCESS_public)
    9876              
    9877                      .dwendtag $C$DW$T$77
    9878              
    9879              $C$DW$T$248     .dwtag  DW_TAG_typedef
    9880                      .dwattr $C$DW$T$248, DW_AT_name("CTRL_Obj")
    9881                      .dwattr $C$DW$T$248, DW_AT_type(*$C$DW$T$77)
    9882                      .dwattr $C$DW$T$248, DW_AT_language(DW_LANG_C)
    9883              
    9884              $C$DW$T$249     .dwtag  DW_TAG_pointer_type
    9885                      .dwattr $C$DW$T$249, DW_AT_type(*$C$DW$T$248)
    9886                      .dwattr $C$DW$T$249, DW_AT_address_class(0x20)
    9887              
    9888              $C$DW$T$203     .dwtag  DW_TAG_pointer_type
    9889                      .dwattr $C$DW$T$203, DW_AT_type(*$C$DW$T$77)
    9890                      .dwattr $C$DW$T$203, DW_AT_address_class(0x20)
    9891              
    9892              $C$DW$T$204     .dwtag  DW_TAG_typedef
    9893                      .dwattr $C$DW$T$204, DW_AT_name("CTRL_Handle")
    9894                      .dwattr $C$DW$T$204, DW_AT_type(*$C$DW$T$203)
    9895                      .dwattr $C$DW$T$204, DW_AT_language(DW_LANG_C)
    9896              
    9897              $C$DW$1036      .dwtag  DW_TAG_TI_far_type
    9898                      .dwattr $C$DW$1036, DW_AT_type(*$C$DW$T$204)
    9899              
    9900              $C$DW$T$250     .dwtag  DW_TAG_const_type
    9901                      .dwattr $C$DW$T$250, DW_AT_type(*$C$DW$1036)
    9902              
    9903              
    9904              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    9905                      .dwattr $C$DW$T$80, DW_AT_name("_CTRL_Version_")
    9906                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x04)
    9907              $C$DW$1037      .dwtag  DW_TAG_member
    9908                      .dwattr $C$DW$1037, DW_AT_type(*$C$DW$T$26)
    9909                      .dwattr $C$DW$1037, DW_AT_name("rsvd")
    9910                      .dwattr $C$DW$1037, DW_AT_TI_symbol_name("_rsvd")
    9911                      .dwattr $C$DW$1037, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9912                      .dwattr $C$DW$1037, DW_AT_accessibility(DW_ACCESS_public)
    9913              
    9914              $C$DW$1038      .dwtag  DW_TAG_member
    9915                      .dwattr $C$DW$1038, DW_AT_type(*$C$DW$T$79)
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 17:12:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{CF1CE8BB-0BA9-4705-B421-53C212847974} PAGE  194

    9916                      .dwattr $C$DW$1038, DW_AT_name("targetProc")
    9917                      .dwattr $C$DW$1038, DW_AT_TI_symbol_name("_targetProc")
    9918                      .dwattr $C$DW$1038, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9919                      .dwattr $C$DW$1038, DW_AT_accessibility(DW_ACCESS_public)
    9920              
    9921              $C$DW$1039      .dwtag  DW_TAG_member
    9922                      .dwattr $C$DW$1039, DW_AT_type(*$C$DW$T$26)
    9923                      .dwattr $C$DW$1039, DW_AT_name("major")
    9924                      .dwattr $C$DW$1039, DW_AT_TI_symbol_name("_major")
    9925                      .dwattr $C$DW$1039, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9926                      .dwattr $C$DW$1039, DW_AT_accessibility(DW_ACCESS_public)
    9927              
    9928              $C$DW$1040      .dwtag  DW_TAG_member
    9929                      .dwattr $C$DW$1040, DW_AT_type(*$C$DW$T$26)
    9930                      .dwattr $C$DW$1040, DW_AT_name("minor")
    9931                      .dwattr $C$DW$1040, DW_AT_TI_symbol_name("_minor")
    9932                      .dwattr $C$DW$1040, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9933                      .dwattr $C$DW$1040, DW_AT_accessibility(DW_ACCESS_public)
    9934              
    9935                      .dwendtag $C$DW$T$80
    9936              
    9937              $C$DW$T$42      .dwtag  DW_TAG_typedef
    9938                      .dwattr $C$DW$T$42, DW_AT_name("CTRL_Version")
    9939                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$80)
    9940                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    9941              
    9942              $C$DW$T$256     .dwtag  DW_TAG_pointer_type
    9943                      .dwattr $C$DW$T$256, DW_AT_type(*$C$DW$T$42)
    9944                      .dwattr $C$DW$T$256, DW_AT_address_class(0x20)
    9945              
    9946              
    9947              $C$DW$T$87      .dwtag  DW_TAG_structure_type
    9948                      .dwattr $C$DW$T$87, DW_AT_name("_DRV8301_Obj_")
    9949                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x08)
    9950              $C$DW$1041      .dwtag  DW_TAG_member
    9951                      .dwattr $C$DW$1041, DW_AT_type(*$C$DW$T$82)
    9952                      .dwattr $C$DW$1041, DW_AT_name("spiHandle")
    9953                      .dwattr $C$DW$1041, DW_AT_TI_symbol_name("_spiHandle")
    9954                      .dwattr $C$DW$1041, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9955                      .dwattr $C$DW$1041, DW_AT_accessibility(DW_ACCESS_public)
    9956              
    9957              $C$DW$1042      .dwtag  DW_TAG_member
    9958                      .dwattr $C$DW$1042, DW_AT_type(*$C$DW$T$84)
    9959                      .dwattr $C$DW$1042, DW_AT_name("gpioHandle")
    9960                      .dwattr $C$DW$1042, DW_AT_TI_symbol_name("_gpioHandle")
    9961                      .dwattr $C$DW$1042, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9962                      .dwattr $C$DW$1042, DW_AT_accessibility(DW_ACCESS_public)
    9963              
    9964              $C$DW$1043      .dwtag  DW_TAG_member
    9965                      .dwattr $C$DW$1043, DW_AT_type(*$C$DW$T$86)
    9966                      .dwattr $C$DW$1043, DW_AT_name("gpioNumber")
    9967                      .dwattr $C$DW$1043, DW_AT_TI_symbol_name("_gpioNumber")
    9968                      .dwattr $C$DW$1043, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9969                      .dwattr $C$DW$1043, DW_AT_accessibility(DW_ACCESS_public)
    9970              
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 17:12:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{CF1CE8BB-0BA9-4705-B421-53C212847974} PAGE  195

    9971              $C$DW$1044      .dwtag  DW_TAG_member
    9972                      .dwattr $C$DW$1044, DW_AT_type(*$C$DW$T$76)
    9973                      .dwattr $C$DW$1044, DW_AT_name("RxTimeOut")
    9974                      .dwattr $C$DW$1044, DW_AT_TI_symbol_name("_RxTimeOut")
    9975                      .dwattr $C$DW$1044, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9976                      .dwattr $C$DW$1044, DW_AT_accessibility(DW_ACCESS_public)
    9977              
    9978              $C$DW$1045      .dwtag  DW_TAG_member
    9979                      .dwattr $C$DW$1045, DW_AT_type(*$C$DW$T$76)
    9980                      .dwattr $C$DW$1045, DW_AT_name("enableTimeOut")
    9981                      .dwattr $C$DW$1045, DW_AT_TI_symbol_name("_enableTimeOut")
    9982                      .dwattr $C$DW$1045, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9983                      .dwattr $C$DW$1045, DW_AT_accessibility(DW_ACCESS_public)
    9984              
    9985                      .dwendtag $C$DW$T$87
    9986              
    9987              $C$DW$T$156     .dwtag  DW_TAG_typedef
    9988                      .dwattr $C$DW$T$156, DW_AT_name("DRV8301_Obj")
    9989                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$87)
    9990                      .dwattr $C$DW$T$156, DW_AT_language(DW_LANG_C)
    9991              
    9992              $C$DW$T$154     .dwtag  DW_TAG_pointer_type
    9993                      .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$87)
    9994                      .dwattr $C$DW$T$154, DW_AT_address_class(0x20)
    9995              
    9996              $C$DW$T$155     .dwtag  DW_TAG_typedef
    9997                      .dwattr $C$DW$T$155, DW_AT_name("DRV8301_Handle")
    9998                      .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$154)
    9999                      .dwattr $C$DW$T$155, DW_AT_language(DW_LANG_C)
   10000              
   10001              
   10002              $C$DW$T$98      .dwtag  DW_TAG_structure_type
   10003                      .dwattr $C$DW$T$98, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
   10004                      .dwattr $C$DW$T$98, DW_AT_byte_size(0x05)
   10005              $C$DW$1046      .dwtag  DW_TAG_member
   10006                      .dwattr $C$DW$1046, DW_AT_type(*$C$DW$T$89)
   10007                      .dwattr $C$DW$1046, DW_AT_name("DRV8301_CURRENT")
   10008                      .dwattr $C$DW$1046, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
   10009                      .dwattr $C$DW$1046, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10010                      .dwattr $C$DW$1046, DW_AT_accessibility(DW_ACCESS_public)
   10011              
   10012              $C$DW$1047      .dwtag  DW_TAG_member
   10013                      .dwattr $C$DW$1047, DW_AT_type(*$C$DW$T$91)
   10014                      .dwattr $C$DW$1047, DW_AT_name("DRV8301_RESET")
   10015                      .dwattr $C$DW$1047, DW_AT_TI_symbol_name("_DRV8301_RESET")
   10016                      .dwattr $C$DW$1047, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10017                      .dwattr $C$DW$1047, DW_AT_accessibility(DW_ACCESS_public)
   10018              
   10019              $C$DW$1048      .dwtag  DW_TAG_member
   10020                      .dwattr $C$DW$1048, DW_AT_type(*$C$DW$T$93)
   10021                      .dwattr $C$DW$1048, DW_AT_name("PWM_MODE")
   10022                      .dwattr $C$DW$1048, DW_AT_TI_symbol_name("_PWM_MODE")
   10023                      .dwattr $C$DW$1048, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10024                      .dwattr $C$DW$1048, DW_AT_accessibility(DW_ACCESS_public)
   10025              
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 17:12:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{CF1CE8BB-0BA9-4705-B421-53C212847974} PAGE  196

   10026              $C$DW$1049      .dwtag  DW_TAG_member
   10027                      .dwattr $C$DW$1049, DW_AT_type(*$C$DW$T$95)
   10028                      .dwattr $C$DW$1049, DW_AT_name("OC_MODE")
   10029                      .dwattr $C$DW$1049, DW_AT_TI_symbol_name("_OC_MODE")
   10030                      .dwattr $C$DW$1049, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10031                      .dwattr $C$DW$1049, DW_AT_accessibility(DW_ACCESS_public)
   10032              
   10033              $C$DW$1050      .dwtag  DW_TAG_member
   10034                      .dwattr $C$DW$1050, DW_AT_type(*$C$DW$T$97)
   10035                      .dwattr $C$DW$1050, DW_AT_name("OC_ADJ_SET")
   10036                      .dwattr $C$DW$1050, DW_AT_TI_symbol_name("_OC_ADJ_SET")
   10037                      .dwattr $C$DW$1050, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10038                      .dwattr $C$DW$1050, DW_AT_accessibility(DW_ACCESS_public)
   10039              
   10040                      .dwendtag $C$DW$T$98
   10041              
   10042              $C$DW$T$112     .dwtag  DW_TAG_typedef
   10043                      .dwattr $C$DW$T$112, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
   10044                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$98)
   10045                      .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
   10046              
   10047              
   10048              $C$DW$T$107     .dwtag  DW_TAG_structure_type
   10049                      .dwattr $C$DW$T$107, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
   10050                      .dwattr $C$DW$T$107, DW_AT_byte_size(0x04)
   10051              $C$DW$1051      .dwtag  DW_TAG_member
   10052                      .dwattr $C$DW$1051, DW_AT_type(*$C$DW$T$100)
   10053                      .dwattr $C$DW$1051, DW_AT_name("OCTW_SET")
   10054                      .dwattr $C$DW$1051, DW_AT_TI_symbol_name("_OCTW_SET")
   10055                      .dwattr $C$DW$1051, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10056                      .dwattr $C$DW$1051, DW_AT_accessibility(DW_ACCESS_public)
   10057              
   10058              $C$DW$1052      .dwtag  DW_TAG_member
   10059                      .dwattr $C$DW$1052, DW_AT_type(*$C$DW$T$102)
   10060                      .dwattr $C$DW$1052, DW_AT_name("GAIN")
   10061                      .dwattr $C$DW$1052, DW_AT_TI_symbol_name("_GAIN")
   10062                      .dwattr $C$DW$1052, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10063                      .dwattr $C$DW$1052, DW_AT_accessibility(DW_ACCESS_public)
   10064              
   10065              $C$DW$1053      .dwtag  DW_TAG_member
   10066                      .dwattr $C$DW$1053, DW_AT_type(*$C$DW$T$104)
   10067                      .dwattr $C$DW$1053, DW_AT_name("DC_CAL_CH1p2")
   10068                      .dwattr $C$DW$1053, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
   10069                      .dwattr $C$DW$1053, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10070                      .dwattr $C$DW$1053, DW_AT_accessibility(DW_ACCESS_public)
   10071              
   10072              $C$DW$1054      .dwtag  DW_TAG_member
   10073                      .dwattr $C$DW$1054, DW_AT_type(*$C$DW$T$106)
   10074                      .dwattr $C$DW$1054, DW_AT_name("OC_TOFF")
   10075                      .dwattr $C$DW$1054, DW_AT_TI_symbol_name("_OC_TOFF")
   10076                      .dwattr $C$DW$1054, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10077                      .dwattr $C$DW$1054, DW_AT_accessibility(DW_ACCESS_public)
   10078              
   10079                      .dwendtag $C$DW$T$107
   10080              
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 17:12:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{CF1CE8BB-0BA9-4705-B421-53C212847974} PAGE  197

   10081              $C$DW$T$113     .dwtag  DW_TAG_typedef
   10082                      .dwattr $C$DW$T$113, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
   10083                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$107)
   10084                      .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
   10085              
   10086              
   10087              $C$DW$T$108     .dwtag  DW_TAG_structure_type
   10088                      .dwattr $C$DW$T$108, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
   10089                      .dwattr $C$DW$T$108, DW_AT_byte_size(0x0b)
   10090              $C$DW$1055      .dwtag  DW_TAG_member
   10091                      .dwattr $C$DW$1055, DW_AT_type(*$C$DW$T$76)
   10092                      .dwattr $C$DW$1055, DW_AT_name("FAULT")
   10093                      .dwattr $C$DW$1055, DW_AT_TI_symbol_name("_FAULT")
   10094                      .dwattr $C$DW$1055, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10095                      .dwattr $C$DW$1055, DW_AT_accessibility(DW_ACCESS_public)
   10096              
   10097              $C$DW$1056      .dwtag  DW_TAG_member
   10098                      .dwattr $C$DW$1056, DW_AT_type(*$C$DW$T$76)
   10099                      .dwattr $C$DW$1056, DW_AT_name("GVDD_UV")
   10100                      .dwattr $C$DW$1056, DW_AT_TI_symbol_name("_GVDD_UV")
   10101                      .dwattr $C$DW$1056, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10102                      .dwattr $C$DW$1056, DW_AT_accessibility(DW_ACCESS_public)
   10103              
   10104              $C$DW$1057      .dwtag  DW_TAG_member
   10105                      .dwattr $C$DW$1057, DW_AT_type(*$C$DW$T$76)
   10106                      .dwattr $C$DW$1057, DW_AT_name("PVDD_UV")
   10107                      .dwattr $C$DW$1057, DW_AT_TI_symbol_name("_PVDD_UV")
   10108                      .dwattr $C$DW$1057, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10109                      .dwattr $C$DW$1057, DW_AT_accessibility(DW_ACCESS_public)
   10110              
   10111              $C$DW$1058      .dwtag  DW_TAG_member
   10112                      .dwattr $C$DW$1058, DW_AT_type(*$C$DW$T$76)
   10113                      .dwattr $C$DW$1058, DW_AT_name("OTSD")
   10114                      .dwattr $C$DW$1058, DW_AT_TI_symbol_name("_OTSD")
   10115                      .dwattr $C$DW$1058, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10116                      .dwattr $C$DW$1058, DW_AT_accessibility(DW_ACCESS_public)
   10117              
   10118              $C$DW$1059      .dwtag  DW_TAG_member
   10119                      .dwattr $C$DW$1059, DW_AT_type(*$C$DW$T$76)
   10120                      .dwattr $C$DW$1059, DW_AT_name("OTW")
   10121                      .dwattr $C$DW$1059, DW_AT_TI_symbol_name("_OTW")
   10122                      .dwattr $C$DW$1059, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10123                      .dwattr $C$DW$1059, DW_AT_accessibility(DW_ACCESS_public)
   10124              
   10125              $C$DW$1060      .dwtag  DW_TAG_member
   10126                      .dwattr $C$DW$1060, DW_AT_type(*$C$DW$T$76)
   10127                      .dwattr $C$DW$1060, DW_AT_name("FETHA_OC")
   10128                      .dwattr $C$DW$1060, DW_AT_TI_symbol_name("_FETHA_OC")
   10129                      .dwattr $C$DW$1060, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10130                      .dwattr $C$DW$1060, DW_AT_accessibility(DW_ACCESS_public)
   10131              
   10132              $C$DW$1061      .dwtag  DW_TAG_member
   10133                      .dwattr $C$DW$1061, DW_AT_type(*$C$DW$T$76)
   10134                      .dwattr $C$DW$1061, DW_AT_name("FETLA_OC")
   10135                      .dwattr $C$DW$1061, DW_AT_TI_symbol_name("_FETLA_OC")
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 17:12:05 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{CF1CE8BB-0BA9-4705-B421-53C212847974} PAGE  198

   10136                      .dwattr $C$DW$1061, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10137                      .dwattr $C$DW$1061, DW_AT_accessibility(DW_ACCESS_public)
   10138              
   10139              $C$DW$1062      .dwtag  DW_TAG_member
   10140                      .dwattr $C$DW$1062, DW_AT_type(*$C$DW$T$76)
   10141                      .dwattr $C$DW$1062, DW_AT_name("FETHB_OC")
   10142                      .dwattr $C$DW$1062, DW_AT_TI_symbol_name("_FETHB_OC")
   10143                      .dwattr $C$DW$1062, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   10144                      .dwattr $C$DW$1062, DW_AT_accessibility(DW_ACCESS_public)
   10145              
   10146              $C$DW$1063      .dwtag  DW_TAG_member
   10147                      .dwattr $C$DW$1063, DW_AT_type(*$C$DW$T$76)
   10148                      .dwattr $C$DW$1063, DW_AT_name("FETLB_OC")
   10149                      .dwattr $C$DW$1063, DW_AT_TI_symbol_name("_FETLB_OC")
   10150                      .dwattr $C$DW$1063, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
