TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 18:02:35 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{E5A9845F-AFE3-402C-91FC-562B1CD6729F} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.0.LTS *
       3              ;* Date/Time created: Wed Feb 22 18:02:34 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/GIANT/GIANT_TI_instaspin/motorware/motorware_1_01_00_18/sw/solutions
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.0.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\GIANT\GIANT_TI_instaspin\motorware\motorware_1_01_00_18\sw\solut
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    8582              $C$DW$883       .dwtag  DW_TAG_enumerator
    8583                      .dwattr $C$DW$883, DW_AT_name("PIE_GroupNumber_6")
    8584                      .dwattr $C$DW$883, DW_AT_const_value(0x05)
    8585              
    8586              $C$DW$884       .dwtag  DW_TAG_enumerator
    8587                      .dwattr $C$DW$884, DW_AT_name("PIE_GroupNumber_7")
    8588                      .dwattr $C$DW$884, DW_AT_const_value(0x06)
    8589              
    8590              $C$DW$885       .dwtag  DW_TAG_enumerator
    8591                      .dwattr $C$DW$885, DW_AT_name("PIE_GroupNumber_8")
    8592                      .dwattr $C$DW$885, DW_AT_const_value(0x07)
    8593              
    8594              $C$DW$886       .dwtag  DW_TAG_enumerator
    8595                      .dwattr $C$DW$886, DW_AT_name("PIE_GroupNumber_9")
    8596                      .dwattr $C$DW$886, DW_AT_const_value(0x08)
    8597              
    8598              $C$DW$887       .dwtag  DW_TAG_enumerator
    8599                      .dwattr $C$DW$887, DW_AT_name("PIE_GroupNumber_10")
    8600                      .dwattr $C$DW$887, DW_AT_const_value(0x09)
    8601              
    8602              $C$DW$888       .dwtag  DW_TAG_enumerator
    8603                      .dwattr $C$DW$888, DW_AT_name("PIE_GroupNumber_11")
    8604                      .dwattr $C$DW$888, DW_AT_const_value(0x0a)
    8605              
    8606              $C$DW$889       .dwtag  DW_TAG_enumerator
    8607                      .dwattr $C$DW$889, DW_AT_name("PIE_GroupNumber_12")
    8608                      .dwattr $C$DW$889, DW_AT_const_value(0x0b)
    8609              
    8610                      .dwendtag $C$DW$T$221
    8611              
    8612              $C$DW$T$222     .dwtag  DW_TAG_typedef
    8613                      .dwattr $C$DW$T$222, DW_AT_name("PIE_GroupNumber_e")
    8614                      .dwattr $C$DW$T$222, DW_AT_type(*$C$DW$T$221)
    8615                      .dwattr $C$DW$T$222, DW_AT_language(DW_LANG_C)
    8616              
    8617              
    8618              $C$DW$T$224     .dwtag  DW_TAG_enumeration_type
    8619                      .dwattr $C$DW$T$224, DW_AT_byte_size(0x01)
    8620              $C$DW$890       .dwtag  DW_TAG_enumerator
    8621                      .dwattr $C$DW$890, DW_AT_name("CTRL_Type_PID_spd")
    8622                      .dwattr $C$DW$890, DW_AT_const_value(0x00)
    8623              
    8624              $C$DW$891       .dwtag  DW_TAG_enumerator
    8625                      .dwattr $C$DW$891, DW_AT_name("CTRL_Type_PID_Id")
    8626                      .dwattr $C$DW$891, DW_AT_const_value(0x01)
    8627              
    8628              $C$DW$892       .dwtag  DW_TAG_enumerator
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 18:02:35 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{E5A9845F-AFE3-402C-91FC-562B1CD6729F} PAGE  170

    8629                      .dwattr $C$DW$892, DW_AT_name("CTRL_Type_PID_Iq")
    8630                      .dwattr $C$DW$892, DW_AT_const_value(0x02)
    8631              
    8632                      .dwendtag $C$DW$T$224
    8633              
    8634              $C$DW$T$225     .dwtag  DW_TAG_typedef
    8635                      .dwattr $C$DW$T$225, DW_AT_name("CTRL_Type_e")
    8636                      .dwattr $C$DW$T$225, DW_AT_type(*$C$DW$T$224)
    8637                      .dwattr $C$DW$T$225, DW_AT_language(DW_LANG_C)
    8638              
    8639              
    8640              $C$DW$T$227     .dwtag  DW_TAG_enumeration_type
    8641                      .dwattr $C$DW$T$227, DW_AT_byte_size(0x01)
    8642              $C$DW$893       .dwtag  DW_TAG_enumerator
    8643                      .dwattr $C$DW$893, DW_AT_name("HAL_SensorType_Current")
    8644                      .dwattr $C$DW$893, DW_AT_const_value(0x00)
    8645              
    8646              $C$DW$894       .dwtag  DW_TAG_enumerator
    8647                      .dwattr $C$DW$894, DW_AT_name("HAL_SensorType_Voltage")
    8648                      .dwattr $C$DW$894, DW_AT_const_value(0x01)
    8649              
    8650                      .dwendtag $C$DW$T$227
    8651              
    8652              $C$DW$T$228     .dwtag  DW_TAG_typedef
    8653                      .dwattr $C$DW$T$228, DW_AT_name("HAL_SensorType_e")
    8654                      .dwattr $C$DW$T$228, DW_AT_type(*$C$DW$T$227)
    8655                      .dwattr $C$DW$T$228, DW_AT_language(DW_LANG_C)
    8656              
    8657              
    8658              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    8659                      .dwattr $C$DW$T$19, DW_AT_name("IPD_HFI_Obj")
    8660                      .dwattr $C$DW$T$19, DW_AT_declaration
    8661                      .dwendtag $C$DW$T$19
    8662              
    8663              $C$DW$T$230     .dwtag  DW_TAG_pointer_type
    8664                      .dwattr $C$DW$T$230, DW_AT_type(*$C$DW$T$19)
    8665                      .dwattr $C$DW$T$230, DW_AT_address_class(0x20)
    8666              
    8667              $C$DW$T$231     .dwtag  DW_TAG_typedef
    8668                      .dwattr $C$DW$T$231, DW_AT_name("IPD_HFI_Handle")
    8669                      .dwattr $C$DW$T$231, DW_AT_type(*$C$DW$T$230)
    8670                      .dwattr $C$DW$T$231, DW_AT_language(DW_LANG_C)
    8671              
    8672              
    8673              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    8674                      .dwattr $C$DW$T$34, DW_AT_name("_ADC_Obj_")
    8675                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x6650)
    8676              $C$DW$895       .dwtag  DW_TAG_member
    8677                      .dwattr $C$DW$895, DW_AT_type(*$C$DW$T$28)
    8678                      .dwattr $C$DW$895, DW_AT_name("ADCRESULT")
    8679                      .dwattr $C$DW$895, DW_AT_TI_symbol_name("_ADCRESULT")
    8680                      .dwattr $C$DW$895, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8681                      .dwattr $C$DW$895, DW_AT_accessibility(DW_ACCESS_public)
    8682              
    8683              $C$DW$896       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 18:02:35 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{E5A9845F-AFE3-402C-91FC-562B1CD6729F} PAGE  171

    8684                      .dwattr $C$DW$896, DW_AT_type(*$C$DW$T$29)
    8685                      .dwattr $C$DW$896, DW_AT_name("resvd_1")
    8686                      .dwattr $C$DW$896, DW_AT_TI_symbol_name("_resvd_1")
    8687                      .dwattr $C$DW$896, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8688                      .dwattr $C$DW$896, DW_AT_accessibility(DW_ACCESS_public)
    8689              
    8690              $C$DW$897       .dwtag  DW_TAG_member
    8691                      .dwattr $C$DW$897, DW_AT_type(*$C$DW$T$27)
    8692                      .dwattr $C$DW$897, DW_AT_name("ADCCTL1")
    8693                      .dwattr $C$DW$897, DW_AT_TI_symbol_name("_ADCCTL1")
    8694                      .dwattr $C$DW$897, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    8695                      .dwattr $C$DW$897, DW_AT_accessibility(DW_ACCESS_public)
    8696              
    8697              $C$DW$898       .dwtag  DW_TAG_member
    8698                      .dwattr $C$DW$898, DW_AT_type(*$C$DW$T$27)
    8699                      .dwattr $C$DW$898, DW_AT_name("ADCCTL2")
    8700                      .dwattr $C$DW$898, DW_AT_TI_symbol_name("_ADCCTL2")
    8701                      .dwattr $C$DW$898, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    8702                      .dwattr $C$DW$898, DW_AT_accessibility(DW_ACCESS_public)
    8703              
    8704              $C$DW$899       .dwtag  DW_TAG_member
    8705                      .dwattr $C$DW$899, DW_AT_type(*$C$DW$T$30)
    8706                      .dwattr $C$DW$899, DW_AT_name("rsvd_2")
    8707                      .dwattr $C$DW$899, DW_AT_TI_symbol_name("_rsvd_2")
    8708                      .dwattr $C$DW$899, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    8709                      .dwattr $C$DW$899, DW_AT_accessibility(DW_ACCESS_public)
    8710              
    8711              $C$DW$900       .dwtag  DW_TAG_member
    8712                      .dwattr $C$DW$900, DW_AT_type(*$C$DW$T$27)
    8713                      .dwattr $C$DW$900, DW_AT_name("ADCINTFLG")
    8714                      .dwattr $C$DW$900, DW_AT_TI_symbol_name("_ADCINTFLG")
    8715                      .dwattr $C$DW$900, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    8716                      .dwattr $C$DW$900, DW_AT_accessibility(DW_ACCESS_public)
    8717              
    8718              $C$DW$901       .dwtag  DW_TAG_member
    8719                      .dwattr $C$DW$901, DW_AT_type(*$C$DW$T$27)
    8720                      .dwattr $C$DW$901, DW_AT_name("ADCINTFLGCLR")
    8721                      .dwattr $C$DW$901, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    8722                      .dwattr $C$DW$901, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    8723                      .dwattr $C$DW$901, DW_AT_accessibility(DW_ACCESS_public)
    8724              
    8725              $C$DW$902       .dwtag  DW_TAG_member
    8726                      .dwattr $C$DW$902, DW_AT_type(*$C$DW$T$27)
    8727                      .dwattr $C$DW$902, DW_AT_name("ADCINTOVF")
    8728                      .dwattr $C$DW$902, DW_AT_TI_symbol_name("_ADCINTOVF")
    8729                      .dwattr $C$DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    8730                      .dwattr $C$DW$902, DW_AT_accessibility(DW_ACCESS_public)
    8731              
    8732              $C$DW$903       .dwtag  DW_TAG_member
    8733                      .dwattr $C$DW$903, DW_AT_type(*$C$DW$T$27)
    8734                      .dwattr $C$DW$903, DW_AT_name("ADCINTOVFCLR")
    8735                      .dwattr $C$DW$903, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    8736                      .dwattr $C$DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    8737                      .dwattr $C$DW$903, DW_AT_accessibility(DW_ACCESS_public)
    8738              
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 18:02:35 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{E5A9845F-AFE3-402C-91FC-562B1CD6729F} PAGE  172

    8739              $C$DW$904       .dwtag  DW_TAG_member
    8740                      .dwattr $C$DW$904, DW_AT_type(*$C$DW$T$31)
    8741                      .dwattr $C$DW$904, DW_AT_name("INTSELxNy")
    8742                      .dwattr $C$DW$904, DW_AT_TI_symbol_name("_INTSELxNy")
    8743                      .dwattr $C$DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    8744                      .dwattr $C$DW$904, DW_AT_accessibility(DW_ACCESS_public)
    8745              
    8746              $C$DW$905       .dwtag  DW_TAG_member
    8747                      .dwattr $C$DW$905, DW_AT_type(*$C$DW$T$32)
    8748                      .dwattr $C$DW$905, DW_AT_name("rsvd_3")
    8749                      .dwattr $C$DW$905, DW_AT_TI_symbol_name("_rsvd_3")
    8750                      .dwattr $C$DW$905, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    8751                      .dwattr $C$DW$905, DW_AT_accessibility(DW_ACCESS_public)
    8752              
    8753              $C$DW$906       .dwtag  DW_TAG_member
    8754                      .dwattr $C$DW$906, DW_AT_type(*$C$DW$T$27)
    8755                      .dwattr $C$DW$906, DW_AT_name("SOCPRICTRL")
    8756                      .dwattr $C$DW$906, DW_AT_TI_symbol_name("_SOCPRICTRL")
    8757                      .dwattr $C$DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    8758                      .dwattr $C$DW$906, DW_AT_accessibility(DW_ACCESS_public)
    8759              
    8760              $C$DW$907       .dwtag  DW_TAG_member
    8761                      .dwattr $C$DW$907, DW_AT_type(*$C$DW$T$27)
    8762                      .dwattr $C$DW$907, DW_AT_name("rsvd_4")
    8763                      .dwattr $C$DW$907, DW_AT_TI_symbol_name("_rsvd_4")
    8764                      .dwattr $C$DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    8765                      .dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
    8766              
    8767              $C$DW$908       .dwtag  DW_TAG_member
    8768                      .dwattr $C$DW$908, DW_AT_type(*$C$DW$T$27)
    8769                      .dwattr $C$DW$908, DW_AT_name("ADCSAMPLEMODE")
    8770                      .dwattr $C$DW$908, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    8771                      .dwattr $C$DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    8772                      .dwattr $C$DW$908, DW_AT_accessibility(DW_ACCESS_public)
    8773              
    8774              $C$DW$909       .dwtag  DW_TAG_member
    8775                      .dwattr $C$DW$909, DW_AT_type(*$C$DW$T$27)
    8776                      .dwattr $C$DW$909, DW_AT_name("rsvd_5")
    8777                      .dwattr $C$DW$909, DW_AT_TI_symbol_name("_rsvd_5")
    8778                      .dwattr $C$DW$909, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    8779                      .dwattr $C$DW$909, DW_AT_accessibility(DW_ACCESS_public)
    8780              
    8781              $C$DW$910       .dwtag  DW_TAG_member
    8782                      .dwattr $C$DW$910, DW_AT_type(*$C$DW$T$27)
    8783                      .dwattr $C$DW$910, DW_AT_name("ADCINTSOCSEL1")
    8784                      .dwattr $C$DW$910, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    8785                      .dwattr $C$DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    8786                      .dwattr $C$DW$910, DW_AT_accessibility(DW_ACCESS_public)
    8787              
    8788              $C$DW$911       .dwtag  DW_TAG_member
    8789                      .dwattr $C$DW$911, DW_AT_type(*$C$DW$T$27)
    8790                      .dwattr $C$DW$911, DW_AT_name("ADCINTSOCSEL2")
    8791                      .dwattr $C$DW$911, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    8792                      .dwattr $C$DW$911, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    8793                      .dwattr $C$DW$911, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 18:02:35 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{E5A9845F-AFE3-402C-91FC-562B1CD6729F} PAGE  173

    8794              
    8795              $C$DW$912       .dwtag  DW_TAG_member
    8796                      .dwattr $C$DW$912, DW_AT_type(*$C$DW$T$30)
    8797                      .dwattr $C$DW$912, DW_AT_name("rsvd_6")
    8798                      .dwattr $C$DW$912, DW_AT_TI_symbol_name("_rsvd_6")
    8799                      .dwattr $C$DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    8800                      .dwattr $C$DW$912, DW_AT_accessibility(DW_ACCESS_public)
    8801              
    8802              $C$DW$913       .dwtag  DW_TAG_member
    8803                      .dwattr $C$DW$913, DW_AT_type(*$C$DW$T$27)
    8804                      .dwattr $C$DW$913, DW_AT_name("ADCSOCFLG1")
    8805                      .dwattr $C$DW$913, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    8806                      .dwattr $C$DW$913, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    8807                      .dwattr $C$DW$913, DW_AT_accessibility(DW_ACCESS_public)
    8808              
    8809              $C$DW$914       .dwtag  DW_TAG_member
    8810                      .dwattr $C$DW$914, DW_AT_type(*$C$DW$T$27)
    8811                      .dwattr $C$DW$914, DW_AT_name("rsvd_7")
    8812                      .dwattr $C$DW$914, DW_AT_TI_symbol_name("_rsvd_7")
    8813                      .dwattr $C$DW$914, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    8814                      .dwattr $C$DW$914, DW_AT_accessibility(DW_ACCESS_public)
    8815              
    8816              $C$DW$915       .dwtag  DW_TAG_member
    8817                      .dwattr $C$DW$915, DW_AT_type(*$C$DW$T$27)
    8818                      .dwattr $C$DW$915, DW_AT_name("ADCSOCFRC1")
    8819                      .dwattr $C$DW$915, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    8820                      .dwattr $C$DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    8821                      .dwattr $C$DW$915, DW_AT_accessibility(DW_ACCESS_public)
    8822              
    8823              $C$DW$916       .dwtag  DW_TAG_member
    8824                      .dwattr $C$DW$916, DW_AT_type(*$C$DW$T$27)
    8825                      .dwattr $C$DW$916, DW_AT_name("rsvd_8")
    8826                      .dwattr $C$DW$916, DW_AT_TI_symbol_name("_rsvd_8")
    8827                      .dwattr $C$DW$916, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    8828                      .dwattr $C$DW$916, DW_AT_accessibility(DW_ACCESS_public)
    8829              
    8830              $C$DW$917       .dwtag  DW_TAG_member
    8831                      .dwattr $C$DW$917, DW_AT_type(*$C$DW$T$27)
    8832                      .dwattr $C$DW$917, DW_AT_name("ADCSOCOVF1")
    8833                      .dwattr $C$DW$917, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    8834                      .dwattr $C$DW$917, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    8835                      .dwattr $C$DW$917, DW_AT_accessibility(DW_ACCESS_public)
    8836              
    8837              $C$DW$918       .dwtag  DW_TAG_member
    8838                      .dwattr $C$DW$918, DW_AT_type(*$C$DW$T$27)
    8839                      .dwattr $C$DW$918, DW_AT_name("rsvd_9")
    8840                      .dwattr $C$DW$918, DW_AT_TI_symbol_name("_rsvd_9")
    8841                      .dwattr $C$DW$918, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    8842                      .dwattr $C$DW$918, DW_AT_accessibility(DW_ACCESS_public)
    8843              
    8844              $C$DW$919       .dwtag  DW_TAG_member
    8845                      .dwattr $C$DW$919, DW_AT_type(*$C$DW$T$27)
    8846                      .dwattr $C$DW$919, DW_AT_name("ADCSOCOVFCLR1")
    8847                      .dwattr $C$DW$919, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    8848                      .dwattr $C$DW$919, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 18:02:35 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{E5A9845F-AFE3-402C-91FC-562B1CD6729F} PAGE  174

    8849                      .dwattr $C$DW$919, DW_AT_accessibility(DW_ACCESS_public)
    8850              
    8851              $C$DW$920       .dwtag  DW_TAG_member
    8852                      .dwattr $C$DW$920, DW_AT_type(*$C$DW$T$27)
    8853                      .dwattr $C$DW$920, DW_AT_name("rsvd_10")
    8854                      .dwattr $C$DW$920, DW_AT_TI_symbol_name("_rsvd_10")
    8855                      .dwattr $C$DW$920, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    8856                      .dwattr $C$DW$920, DW_AT_accessibility(DW_ACCESS_public)
    8857              
    8858              $C$DW$921       .dwtag  DW_TAG_member
    8859                      .dwattr $C$DW$921, DW_AT_type(*$C$DW$T$28)
    8860                      .dwattr $C$DW$921, DW_AT_name("ADCSOCxCTL")
    8861                      .dwattr $C$DW$921, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    8862                      .dwattr $C$DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    8863                      .dwattr $C$DW$921, DW_AT_accessibility(DW_ACCESS_public)
    8864              
    8865              $C$DW$922       .dwtag  DW_TAG_member
    8866                      .dwattr $C$DW$922, DW_AT_type(*$C$DW$T$28)
    8867                      .dwattr $C$DW$922, DW_AT_name("rsvd_11")
    8868                      .dwattr $C$DW$922, DW_AT_TI_symbol_name("_rsvd_11")
    8869                      .dwattr $C$DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    8870                      .dwattr $C$DW$922, DW_AT_accessibility(DW_ACCESS_public)
    8871              
    8872              $C$DW$923       .dwtag  DW_TAG_member
    8873                      .dwattr $C$DW$923, DW_AT_type(*$C$DW$T$27)
    8874                      .dwattr $C$DW$923, DW_AT_name("ADCREFTRIM")
    8875                      .dwattr $C$DW$923, DW_AT_TI_symbol_name("_ADCREFTRIM")
    8876                      .dwattr $C$DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    8877                      .dwattr $C$DW$923, DW_AT_accessibility(DW_ACCESS_public)
    8878              
    8879              $C$DW$924       .dwtag  DW_TAG_member
    8880                      .dwattr $C$DW$924, DW_AT_type(*$C$DW$T$27)
    8881                      .dwattr $C$DW$924, DW_AT_name("ADCOFFTRIM")
    8882                      .dwattr $C$DW$924, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    8883                      .dwattr $C$DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    8884                      .dwattr $C$DW$924, DW_AT_accessibility(DW_ACCESS_public)
    8885              
    8886              $C$DW$925       .dwtag  DW_TAG_member
    8887                      .dwattr $C$DW$925, DW_AT_type(*$C$DW$T$33)
    8888                      .dwattr $C$DW$925, DW_AT_name("resvd_12")
    8889                      .dwattr $C$DW$925, DW_AT_TI_symbol_name("_resvd_12")
    8890                      .dwattr $C$DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    8891                      .dwattr $C$DW$925, DW_AT_accessibility(DW_ACCESS_public)
    8892              
    8893              $C$DW$926       .dwtag  DW_TAG_member
    8894                      .dwattr $C$DW$926, DW_AT_type(*$C$DW$T$27)
    8895                      .dwattr $C$DW$926, DW_AT_name("ADCREV")
    8896                      .dwattr $C$DW$926, DW_AT_TI_symbol_name("_ADCREV")
    8897                      .dwattr $C$DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    8898                      .dwattr $C$DW$926, DW_AT_accessibility(DW_ACCESS_public)
    8899              
    8900                      .dwendtag $C$DW$T$34
    8901              
    8902              $C$DW$T$235     .dwtag  DW_TAG_typedef
    8903                      .dwattr $C$DW$T$235, DW_AT_name("ADC_Obj")
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 18:02:35 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{E5A9845F-AFE3-402C-91FC-562B1CD6729F} PAGE  175

    8904                      .dwattr $C$DW$T$235, DW_AT_type(*$C$DW$T$34)
    8905                      .dwattr $C$DW$T$235, DW_AT_language(DW_LANG_C)
    8906              
    8907              $C$DW$T$124     .dwtag  DW_TAG_pointer_type
    8908                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$34)
    8909                      .dwattr $C$DW$T$124, DW_AT_address_class(0x20)
    8910              
    8911              $C$DW$T$125     .dwtag  DW_TAG_typedef
    8912                      .dwattr $C$DW$T$125, DW_AT_name("ADC_Handle")
    8913                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
    8914                      .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    8915              
    8916              
    8917              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    8918                      .dwattr $C$DW$T$20, DW_AT_name("_AFSEL_Obj_")
    8919                      .dwattr $C$DW$T$20, DW_AT_declaration
    8920                      .dwendtag $C$DW$T$20
    8921              
    8922              $C$DW$T$236     .dwtag  DW_TAG_pointer_type
    8923                      .dwattr $C$DW$T$236, DW_AT_type(*$C$DW$T$20)
    8924                      .dwattr $C$DW$T$236, DW_AT_address_class(0x20)
    8925              
    8926              $C$DW$T$237     .dwtag  DW_TAG_typedef
    8927                      .dwattr $C$DW$T$237, DW_AT_name("AFSEL_Handle")
    8928                      .dwattr $C$DW$T$237, DW_AT_type(*$C$DW$T$236)
    8929                      .dwattr $C$DW$T$237, DW_AT_language(DW_LANG_C)
    8930              
    8931              
    8932              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    8933                      .dwattr $C$DW$T$38, DW_AT_name("_CLARKE_Obj_")
    8934                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x06)
    8935              $C$DW$927       .dwtag  DW_TAG_member
    8936                      .dwattr $C$DW$927, DW_AT_type(*$C$DW$T$35)
    8937                      .dwattr $C$DW$927, DW_AT_name("alpha_sf")
    8938                      .dwattr $C$DW$927, DW_AT_TI_symbol_name("_alpha_sf")
    8939                      .dwattr $C$DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8940                      .dwattr $C$DW$927, DW_AT_accessibility(DW_ACCESS_public)
    8941              
    8942              $C$DW$928       .dwtag  DW_TAG_member
    8943                      .dwattr $C$DW$928, DW_AT_type(*$C$DW$T$35)
    8944                      .dwattr $C$DW$928, DW_AT_name("beta_sf")
    8945                      .dwattr $C$DW$928, DW_AT_TI_symbol_name("_beta_sf")
    8946                      .dwattr $C$DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8947                      .dwattr $C$DW$928, DW_AT_accessibility(DW_ACCESS_public)
    8948              
    8949              $C$DW$929       .dwtag  DW_TAG_member
    8950                      .dwattr $C$DW$929, DW_AT_type(*$C$DW$T$37)
    8951                      .dwattr $C$DW$929, DW_AT_name("numSensors")
    8952                      .dwattr $C$DW$929, DW_AT_TI_symbol_name("_numSensors")
    8953                      .dwattr $C$DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8954                      .dwattr $C$DW$929, DW_AT_accessibility(DW_ACCESS_public)
    8955              
    8956                      .dwendtag $C$DW$T$38
    8957              
    8958              $C$DW$T$49      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 18:02:35 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{E5A9845F-AFE3-402C-91FC-562B1CD6729F} PAGE  176

    8959                      .dwattr $C$DW$T$49, DW_AT_name("CLARKE_Obj")
    8960                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$38)
    8961                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    8962              
    8963              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    8964                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$38)
    8965                      .dwattr $C$DW$T$47, DW_AT_address_class(0x20)
    8966              
    8967              $C$DW$T$48      .dwtag  DW_TAG_typedef
    8968                      .dwattr $C$DW$T$48, DW_AT_name("CLARKE_Handle")
    8969                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    8970                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    8971              
    8972              $C$DW$930       .dwtag  DW_TAG_TI_far_type
    8973                      .dwattr $C$DW$930, DW_AT_type(*$C$DW$T$48)
    8974              
    8975              $C$DW$T$241     .dwtag  DW_TAG_const_type
    8976                      .dwattr $C$DW$T$241, DW_AT_type(*$C$DW$930)
    8977              
    8978              
    8979              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    8980                      .dwattr $C$DW$T$40, DW_AT_name("_CLK_Obj_")
    8981                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x11)
    8982              $C$DW$931       .dwtag  DW_TAG_member
    8983                      .dwattr $C$DW$931, DW_AT_type(*$C$DW$T$27)
    8984                      .dwattr $C$DW$931, DW_AT_name("XCLK")
    8985                      .dwattr $C$DW$931, DW_AT_TI_symbol_name("_XCLK")
    8986                      .dwattr $C$DW$931, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8987                      .dwattr $C$DW$931, DW_AT_accessibility(DW_ACCESS_public)
    8988              
    8989              $C$DW$932       .dwtag  DW_TAG_member
    8990                      .dwattr $C$DW$932, DW_AT_type(*$C$DW$T$27)
    8991                      .dwattr $C$DW$932, DW_AT_name("rsvd_1")
    8992                      .dwattr $C$DW$932, DW_AT_TI_symbol_name("_rsvd_1")
    8993                      .dwattr $C$DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8994                      .dwattr $C$DW$932, DW_AT_accessibility(DW_ACCESS_public)
    8995              
    8996              $C$DW$933       .dwtag  DW_TAG_member
    8997                      .dwattr $C$DW$933, DW_AT_type(*$C$DW$T$27)
    8998                      .dwattr $C$DW$933, DW_AT_name("CLKCTL")
    8999                      .dwattr $C$DW$933, DW_AT_TI_symbol_name("_CLKCTL")
    9000                      .dwattr $C$DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9001                      .dwattr $C$DW$933, DW_AT_accessibility(DW_ACCESS_public)
    9002              
    9003              $C$DW$934       .dwtag  DW_TAG_member
    9004                      .dwattr $C$DW$934, DW_AT_type(*$C$DW$T$39)
    9005                      .dwattr $C$DW$934, DW_AT_name("rsvd_2")
    9006                      .dwattr $C$DW$934, DW_AT_TI_symbol_name("_rsvd_2")
    9007                      .dwattr $C$DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9008                      .dwattr $C$DW$934, DW_AT_accessibility(DW_ACCESS_public)
    9009              
    9010              $C$DW$935       .dwtag  DW_TAG_member
    9011                      .dwattr $C$DW$935, DW_AT_type(*$C$DW$T$27)
    9012                      .dwattr $C$DW$935, DW_AT_name("LOSPCP")
    9013                      .dwattr $C$DW$935, DW_AT_TI_symbol_name("_LOSPCP")
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 18:02:35 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{E5A9845F-AFE3-402C-91FC-562B1CD6729F} PAGE  177

    9014                      .dwattr $C$DW$935, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    9015                      .dwattr $C$DW$935, DW_AT_accessibility(DW_ACCESS_public)
    9016              
    9017              $C$DW$936       .dwtag  DW_TAG_member
    9018                      .dwattr $C$DW$936, DW_AT_type(*$C$DW$T$27)
    9019                      .dwattr $C$DW$936, DW_AT_name("PCLKCR0")
    9020                      .dwattr $C$DW$936, DW_AT_TI_symbol_name("_PCLKCR0")
    9021                      .dwattr $C$DW$936, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9022                      .dwattr $C$DW$936, DW_AT_accessibility(DW_ACCESS_public)
    9023              
    9024              $C$DW$937       .dwtag  DW_TAG_member
    9025                      .dwattr $C$DW$937, DW_AT_type(*$C$DW$T$27)
    9026                      .dwattr $C$DW$937, DW_AT_name("PCLKCR1")
    9027                      .dwattr $C$DW$937, DW_AT_TI_symbol_name("_PCLKCR1")
    9028                      .dwattr $C$DW$937, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    9029                      .dwattr $C$DW$937, DW_AT_accessibility(DW_ACCESS_public)
    9030              
    9031              $C$DW$938       .dwtag  DW_TAG_member
    9032                      .dwattr $C$DW$938, DW_AT_type(*$C$DW$T$30)
    9033                      .dwattr $C$DW$938, DW_AT_name("rsvd_3")
    9034                      .dwattr $C$DW$938, DW_AT_TI_symbol_name("_rsvd_3")
    9035                      .dwattr $C$DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9036                      .dwattr $C$DW$938, DW_AT_accessibility(DW_ACCESS_public)
    9037              
    9038              $C$DW$939       .dwtag  DW_TAG_member
    9039                      .dwattr $C$DW$939, DW_AT_type(*$C$DW$T$27)
    9040                      .dwattr $C$DW$939, DW_AT_name("PCLKCR3")
    9041                      .dwattr $C$DW$939, DW_AT_TI_symbol_name("_PCLKCR3")
    9042                      .dwattr $C$DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9043                      .dwattr $C$DW$939, DW_AT_accessibility(DW_ACCESS_public)
    9044              
    9045                      .dwendtag $C$DW$T$40
    9046              
    9047              $C$DW$T$126     .dwtag  DW_TAG_pointer_type
    9048                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$40)
    9049                      .dwattr $C$DW$T$126, DW_AT_address_class(0x20)
    9050              
    9051              $C$DW$T$127     .dwtag  DW_TAG_typedef
    9052                      .dwattr $C$DW$T$127, DW_AT_name("CLK_Handle")
    9053                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
    9054                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    9055              
    9056              
    9057              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    9058                      .dwattr $C$DW$T$41, DW_AT_name("_CPU_Obj_")
    9059                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    9060              $C$DW$940       .dwtag  DW_TAG_member
    9061                      .dwattr $C$DW$940, DW_AT_type(*$C$DW$T$37)
    9062                      .dwattr $C$DW$940, DW_AT_name("tmp")
    9063                      .dwattr $C$DW$940, DW_AT_TI_symbol_name("_tmp")
    9064                      .dwattr $C$DW$940, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9065                      .dwattr $C$DW$940, DW_AT_accessibility(DW_ACCESS_public)
    9066              
    9067                      .dwendtag $C$DW$T$41
    9068              
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 18:02:35 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{E5A9845F-AFE3-402C-91FC-562B1CD6729F} PAGE  178

    9069              $C$DW$T$128     .dwtag  DW_TAG_pointer_type
    9070                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$41)
    9071                      .dwattr $C$DW$T$128, DW_AT_address_class(0x20)
    9072              
    9073              $C$DW$T$129     .dwtag  DW_TAG_typedef
    9074                      .dwattr $C$DW$T$129, DW_AT_name("CPU_Handle")
    9075                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$128)
    9076                      .dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
    9077              
    9078              
    9079              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    9080                      .dwattr $C$DW$T$77, DW_AT_name("_CTRL_Obj_")
    9081                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x10a)
    9082              $C$DW$941       .dwtag  DW_TAG_member
    9083                      .dwattr $C$DW$941, DW_AT_type(*$C$DW$T$42)
    9084                      .dwattr $C$DW$941, DW_AT_name("version")
    9085                      .dwattr $C$DW$941, DW_AT_TI_symbol_name("_version")
    9086                      .dwattr $C$DW$941, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9087                      .dwattr $C$DW$941, DW_AT_accessibility(DW_ACCESS_public)
    9088              
    9089              $C$DW$942       .dwtag  DW_TAG_member
    9090                      .dwattr $C$DW$942, DW_AT_type(*$C$DW$T$44)
    9091                      .dwattr $C$DW$942, DW_AT_name("state")
    9092                      .dwattr $C$DW$942, DW_AT_TI_symbol_name("_state")
    9093                      .dwattr $C$DW$942, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9094                      .dwattr $C$DW$942, DW_AT_accessibility(DW_ACCESS_public)
    9095              
    9096              $C$DW$943       .dwtag  DW_TAG_member
    9097                      .dwattr $C$DW$943, DW_AT_type(*$C$DW$T$44)
    9098                      .dwattr $C$DW$943, DW_AT_name("prevState")
    9099                      .dwattr $C$DW$943, DW_AT_TI_symbol_name("_prevState")
    9100                      .dwattr $C$DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9101                      .dwattr $C$DW$943, DW_AT_accessibility(DW_ACCESS_public)
    9102              
    9103              $C$DW$944       .dwtag  DW_TAG_member
    9104                      .dwattr $C$DW$944, DW_AT_type(*$C$DW$T$46)
    9105                      .dwattr $C$DW$944, DW_AT_name("errorCode")
    9106                      .dwattr $C$DW$944, DW_AT_TI_symbol_name("_errorCode")
    9107                      .dwattr $C$DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9108                      .dwattr $C$DW$944, DW_AT_accessibility(DW_ACCESS_public)
    9109              
    9110              $C$DW$945       .dwtag  DW_TAG_member
    9111                      .dwattr $C$DW$945, DW_AT_type(*$C$DW$T$48)
    9112                      .dwattr $C$DW$945, DW_AT_name("clarkeHandle_I")
    9113                      .dwattr $C$DW$945, DW_AT_TI_symbol_name("_clarkeHandle_I")
    9114                      .dwattr $C$DW$945, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9115                      .dwattr $C$DW$945, DW_AT_accessibility(DW_ACCESS_public)
    9116              
    9117              $C$DW$946       .dwtag  DW_TAG_member
    9118                      .dwattr $C$DW$946, DW_AT_type(*$C$DW$T$49)
    9119                      .dwattr $C$DW$946, DW_AT_name("clarke_I")
    9120                      .dwattr $C$DW$946, DW_AT_TI_symbol_name("_clarke_I")
    9121                      .dwattr $C$DW$946, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9122                      .dwattr $C$DW$946, DW_AT_accessibility(DW_ACCESS_public)
    9123              
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 18:02:35 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{E5A9845F-AFE3-402C-91FC-562B1CD6729F} PAGE  179

    9124              $C$DW$947       .dwtag  DW_TAG_member
    9125                      .dwattr $C$DW$947, DW_AT_type(*$C$DW$T$48)
    9126                      .dwattr $C$DW$947, DW_AT_name("clarkeHandle_V")
    9127                      .dwattr $C$DW$947, DW_AT_TI_symbol_name("_clarkeHandle_V")
    9128                      .dwattr $C$DW$947, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9129                      .dwattr $C$DW$947, DW_AT_accessibility(DW_ACCESS_public)
    9130              
    9131              $C$DW$948       .dwtag  DW_TAG_member
    9132                      .dwattr $C$DW$948, DW_AT_type(*$C$DW$T$49)
    9133                      .dwattr $C$DW$948, DW_AT_name("clarke_V")
    9134                      .dwattr $C$DW$948, DW_AT_TI_symbol_name("_clarke_V")
    9135                      .dwattr $C$DW$948, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9136                      .dwattr $C$DW$948, DW_AT_accessibility(DW_ACCESS_public)
    9137              
    9138              $C$DW$949       .dwtag  DW_TAG_member
    9139                      .dwattr $C$DW$949, DW_AT_type(*$C$DW$T$51)
    9140                      .dwattr $C$DW$949, DW_AT_name("estHandle")
    9141                      .dwattr $C$DW$949, DW_AT_TI_symbol_name("_estHandle")
    9142                      .dwattr $C$DW$949, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9143                      .dwattr $C$DW$949, DW_AT_accessibility(DW_ACCESS_public)
    9144              
    9145              $C$DW$950       .dwtag  DW_TAG_member
    9146                      .dwattr $C$DW$950, DW_AT_type(*$C$DW$T$53)
    9147                      .dwattr $C$DW$950, DW_AT_name("parkHandle")
    9148                      .dwattr $C$DW$950, DW_AT_TI_symbol_name("_parkHandle")
    9149                      .dwattr $C$DW$950, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9150                      .dwattr $C$DW$950, DW_AT_accessibility(DW_ACCESS_public)
    9151              
    9152              $C$DW$951       .dwtag  DW_TAG_member
    9153                      .dwattr $C$DW$951, DW_AT_type(*$C$DW$T$54)
    9154                      .dwattr $C$DW$951, DW_AT_name("park")
    9155                      .dwattr $C$DW$951, DW_AT_TI_symbol_name("_park")
    9156                      .dwattr $C$DW$951, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9157                      .dwattr $C$DW$951, DW_AT_accessibility(DW_ACCESS_public)
    9158              
    9159              $C$DW$952       .dwtag  DW_TAG_member
    9160                      .dwattr $C$DW$952, DW_AT_type(*$C$DW$T$56)
    9161                      .dwattr $C$DW$952, DW_AT_name("pidHandle_Id")
    9162                      .dwattr $C$DW$952, DW_AT_TI_symbol_name("_pidHandle_Id")
    9163                      .dwattr $C$DW$952, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    9164                      .dwattr $C$DW$952, DW_AT_accessibility(DW_ACCESS_public)
    9165              
    9166              $C$DW$953       .dwtag  DW_TAG_member
    9167                      .dwattr $C$DW$953, DW_AT_type(*$C$DW$T$57)
    9168                      .dwattr $C$DW$953, DW_AT_name("pid_Id")
    9169                      .dwattr $C$DW$953, DW_AT_TI_symbol_name("_pid_Id")
    9170                      .dwattr $C$DW$953, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    9171                      .dwattr $C$DW$953, DW_AT_accessibility(DW_ACCESS_public)
    9172              
    9173              $C$DW$954       .dwtag  DW_TAG_member
    9174                      .dwattr $C$DW$954, DW_AT_type(*$C$DW$T$56)
    9175                      .dwattr $C$DW$954, DW_AT_name("pidHandle_Iq")
    9176                      .dwattr $C$DW$954, DW_AT_TI_symbol_name("_pidHandle_Iq")
    9177                      .dwattr $C$DW$954, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    9178                      .dwattr $C$DW$954, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 18:02:35 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{E5A9845F-AFE3-402C-91FC-562B1CD6729F} PAGE  180

    9179              
    9180              $C$DW$955       .dwtag  DW_TAG_member
    9181                      .dwattr $C$DW$955, DW_AT_type(*$C$DW$T$57)
    9182                      .dwattr $C$DW$955, DW_AT_name("pid_Iq")
    9183                      .dwattr $C$DW$955, DW_AT_TI_symbol_name("_pid_Iq")
    9184                      .dwattr $C$DW$955, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    9185                      .dwattr $C$DW$955, DW_AT_accessibility(DW_ACCESS_public)
    9186              
    9187              $C$DW$956       .dwtag  DW_TAG_member
    9188                      .dwattr $C$DW$956, DW_AT_type(*$C$DW$T$56)
    9189                      .dwattr $C$DW$956, DW_AT_name("pidHandle_spd")
    9190                      .dwattr $C$DW$956, DW_AT_TI_symbol_name("_pidHandle_spd")
    9191                      .dwattr $C$DW$956, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    9192                      .dwattr $C$DW$956, DW_AT_accessibility(DW_ACCESS_public)
    9193              
    9194              $C$DW$957       .dwtag  DW_TAG_member
    9195                      .dwattr $C$DW$957, DW_AT_type(*$C$DW$T$57)
    9196                      .dwattr $C$DW$957, DW_AT_name("pid_spd")
    9197                      .dwattr $C$DW$957, DW_AT_TI_symbol_name("_pid_spd")
    9198                      .dwattr $C$DW$957, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    9199                      .dwattr $C$DW$957, DW_AT_accessibility(DW_ACCESS_public)
    9200              
    9201              $C$DW$958       .dwtag  DW_TAG_member
    9202                      .dwattr $C$DW$958, DW_AT_type(*$C$DW$T$59)
    9203                      .dwattr $C$DW$958, DW_AT_name("iparkHandle")
    9204                      .dwattr $C$DW$958, DW_AT_TI_symbol_name("_iparkHandle")
    9205                      .dwattr $C$DW$958, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    9206                      .dwattr $C$DW$958, DW_AT_accessibility(DW_ACCESS_public)
    9207              
    9208              $C$DW$959       .dwtag  DW_TAG_member
    9209                      .dwattr $C$DW$959, DW_AT_type(*$C$DW$T$60)
    9210                      .dwattr $C$DW$959, DW_AT_name("ipark")
    9211                      .dwattr $C$DW$959, DW_AT_TI_symbol_name("_ipark")
    9212                      .dwattr $C$DW$959, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    9213                      .dwattr $C$DW$959, DW_AT_accessibility(DW_ACCESS_public)
    9214              
    9215              $C$DW$960       .dwtag  DW_TAG_member
    9216                      .dwattr $C$DW$960, DW_AT_type(*$C$DW$T$62)
    9217                      .dwattr $C$DW$960, DW_AT_name("svgenHandle")
    9218                      .dwattr $C$DW$960, DW_AT_TI_symbol_name("_svgenHandle")
    9219                      .dwattr $C$DW$960, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    9220                      .dwattr $C$DW$960, DW_AT_accessibility(DW_ACCESS_public)
    9221              
    9222              $C$DW$961       .dwtag  DW_TAG_member
    9223                      .dwattr $C$DW$961, DW_AT_type(*$C$DW$T$63)
    9224                      .dwattr $C$DW$961, DW_AT_name("svgen")
    9225                      .dwattr $C$DW$961, DW_AT_TI_symbol_name("_svgen")
    9226                      .dwattr $C$DW$961, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    9227                      .dwattr $C$DW$961, DW_AT_accessibility(DW_ACCESS_public)
    9228              
    9229              $C$DW$962       .dwtag  DW_TAG_member
    9230                      .dwattr $C$DW$962, DW_AT_type(*$C$DW$T$65)
    9231                      .dwattr $C$DW$962, DW_AT_name("trajHandle_Id")
    9232                      .dwattr $C$DW$962, DW_AT_TI_symbol_name("_trajHandle_Id")
    9233                      .dwattr $C$DW$962, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 18:02:35 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{E5A9845F-AFE3-402C-91FC-562B1CD6729F} PAGE  181

    9234                      .dwattr $C$DW$962, DW_AT_accessibility(DW_ACCESS_public)
    9235              
    9236              $C$DW$963       .dwtag  DW_TAG_member
    9237                      .dwattr $C$DW$963, DW_AT_type(*$C$DW$T$66)
    9238                      .dwattr $C$DW$963, DW_AT_name("traj_Id")
    9239                      .dwattr $C$DW$963, DW_AT_TI_symbol_name("_traj_Id")
    9240                      .dwattr $C$DW$963, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    9241                      .dwattr $C$DW$963, DW_AT_accessibility(DW_ACCESS_public)
    9242              
    9243              $C$DW$964       .dwtag  DW_TAG_member
    9244                      .dwattr $C$DW$964, DW_AT_type(*$C$DW$T$65)
    9245                      .dwattr $C$DW$964, DW_AT_name("trajHandle_spd")
    9246                      .dwattr $C$DW$964, DW_AT_TI_symbol_name("_trajHandle_spd")
    9247                      .dwattr $C$DW$964, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    9248                      .dwattr $C$DW$964, DW_AT_accessibility(DW_ACCESS_public)
    9249              
    9250              $C$DW$965       .dwtag  DW_TAG_member
    9251                      .dwattr $C$DW$965, DW_AT_type(*$C$DW$T$66)
    9252                      .dwattr $C$DW$965, DW_AT_name("traj_spd")
    9253                      .dwattr $C$DW$965, DW_AT_TI_symbol_name("_traj_spd")
    9254                      .dwattr $C$DW$965, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    9255                      .dwattr $C$DW$965, DW_AT_accessibility(DW_ACCESS_public)
    9256              
    9257              $C$DW$966       .dwtag  DW_TAG_member
    9258                      .dwattr $C$DW$966, DW_AT_type(*$C$DW$T$65)
    9259                      .dwattr $C$DW$966, DW_AT_name("trajHandle_spdMax")
    9260                      .dwattr $C$DW$966, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    9261                      .dwattr $C$DW$966, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    9262                      .dwattr $C$DW$966, DW_AT_accessibility(DW_ACCESS_public)
    9263              
    9264              $C$DW$967       .dwtag  DW_TAG_member
    9265                      .dwattr $C$DW$967, DW_AT_type(*$C$DW$T$66)
    9266                      .dwattr $C$DW$967, DW_AT_name("traj_spdMax")
    9267                      .dwattr $C$DW$967, DW_AT_TI_symbol_name("_traj_spdMax")
    9268                      .dwattr $C$DW$967, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    9269                      .dwattr $C$DW$967, DW_AT_accessibility(DW_ACCESS_public)
    9270              
    9271              $C$DW$968       .dwtag  DW_TAG_member
    9272                      .dwattr $C$DW$968, DW_AT_type(*$C$DW$T$67)
    9273                      .dwattr $C$DW$968, DW_AT_name("motorParams")
    9274                      .dwattr $C$DW$968, DW_AT_TI_symbol_name("_motorParams")
    9275                      .dwattr $C$DW$968, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    9276                      .dwattr $C$DW$968, DW_AT_accessibility(DW_ACCESS_public)
    9277              
    9278              $C$DW$969       .dwtag  DW_TAG_member
    9279                      .dwattr $C$DW$969, DW_AT_type(*$C$DW$T$71)
    9280                      .dwattr $C$DW$969, DW_AT_name("waitTimes")
    9281                      .dwattr $C$DW$969, DW_AT_TI_symbol_name("_waitTimes")
    9282                      .dwattr $C$DW$969, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    9283                      .dwattr $C$DW$969, DW_AT_accessibility(DW_ACCESS_public)
    9284              
    9285              $C$DW$970       .dwtag  DW_TAG_member
    9286                      .dwattr $C$DW$970, DW_AT_type(*$C$DW$T$70)
    9287                      .dwattr $C$DW$970, DW_AT_name("counter_state")
    9288                      .dwattr $C$DW$970, DW_AT_TI_symbol_name("_counter_state")
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 18:02:35 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{E5A9845F-AFE3-402C-91FC-562B1CD6729F} PAGE  182

    9289                      .dwattr $C$DW$970, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    9290                      .dwattr $C$DW$970, DW_AT_accessibility(DW_ACCESS_public)
    9291              
    9292              $C$DW$971       .dwtag  DW_TAG_member
    9293                      .dwattr $C$DW$971, DW_AT_type(*$C$DW$T$73)
    9294                      .dwattr $C$DW$971, DW_AT_name("numIsrTicksPerCtrlTick")
    9295                      .dwattr $C$DW$971, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    9296                      .dwattr $C$DW$971, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    9297                      .dwattr $C$DW$971, DW_AT_accessibility(DW_ACCESS_public)
    9298              
    9299              $C$DW$972       .dwtag  DW_TAG_member
    9300                      .dwattr $C$DW$972, DW_AT_type(*$C$DW$T$73)
    9301                      .dwattr $C$DW$972, DW_AT_name("numCtrlTicksPerCurrentTick")
    9302                      .dwattr $C$DW$972, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    9303                      .dwattr $C$DW$972, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    9304                      .dwattr $C$DW$972, DW_AT_accessibility(DW_ACCESS_public)
    9305              
    9306              $C$DW$973       .dwtag  DW_TAG_member
    9307                      .dwattr $C$DW$973, DW_AT_type(*$C$DW$T$73)
    9308                      .dwattr $C$DW$973, DW_AT_name("numCtrlTicksPerSpeedTick")
    9309                      .dwattr $C$DW$973, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    9310                      .dwattr $C$DW$973, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    9311                      .dwattr $C$DW$973, DW_AT_accessibility(DW_ACCESS_public)
    9312              
    9313              $C$DW$974       .dwtag  DW_TAG_member
    9314                      .dwattr $C$DW$974, DW_AT_type(*$C$DW$T$73)
    9315                      .dwattr $C$DW$974, DW_AT_name("numCtrlTicksPerTrajTick")
    9316                      .dwattr $C$DW$974, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    9317                      .dwattr $C$DW$974, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    9318                      .dwattr $C$DW$974, DW_AT_accessibility(DW_ACCESS_public)
    9319              
    9320              $C$DW$975       .dwtag  DW_TAG_member
    9321                      .dwattr $C$DW$975, DW_AT_type(*$C$DW$T$70)
    9322                      .dwattr $C$DW$975, DW_AT_name("ctrlFreq_Hz")
    9323                      .dwattr $C$DW$975, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    9324                      .dwattr $C$DW$975, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    9325                      .dwattr $C$DW$975, DW_AT_accessibility(DW_ACCESS_public)
    9326              
    9327              $C$DW$976       .dwtag  DW_TAG_member
    9328                      .dwattr $C$DW$976, DW_AT_type(*$C$DW$T$70)
    9329                      .dwattr $C$DW$976, DW_AT_name("trajFreq_Hz")
    9330                      .dwattr $C$DW$976, DW_AT_TI_symbol_name("_trajFreq_Hz")
    9331                      .dwattr $C$DW$976, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    9332                      .dwattr $C$DW$976, DW_AT_accessibility(DW_ACCESS_public)
    9333              
    9334              $C$DW$977       .dwtag  DW_TAG_member
    9335                      .dwattr $C$DW$977, DW_AT_type(*$C$DW$T$35)
    9336                      .dwattr $C$DW$977, DW_AT_name("trajPeriod_sec")
    9337                      .dwattr $C$DW$977, DW_AT_TI_symbol_name("_trajPeriod_sec")
    9338                      .dwattr $C$DW$977, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    9339                      .dwattr $C$DW$977, DW_AT_accessibility(DW_ACCESS_public)
    9340              
    9341              $C$DW$978       .dwtag  DW_TAG_member
    9342                      .dwattr $C$DW$978, DW_AT_type(*$C$DW$T$74)
    9343                      .dwattr $C$DW$978, DW_AT_name("ctrlPeriod_sec")
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 18:02:35 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{E5A9845F-AFE3-402C-91FC-562B1CD6729F} PAGE  183

    9344                      .dwattr $C$DW$978, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    9345                      .dwattr $C$DW$978, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    9346                      .dwattr $C$DW$978, DW_AT_accessibility(DW_ACCESS_public)
    9347              
    9348              $C$DW$979       .dwtag  DW_TAG_member
    9349                      .dwattr $C$DW$979, DW_AT_type(*$C$DW$T$35)
    9350                      .dwattr $C$DW$979, DW_AT_name("maxVsMag_pu")
    9351                      .dwattr $C$DW$979, DW_AT_TI_symbol_name("_maxVsMag_pu")
    9352                      .dwattr $C$DW$979, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    9353                      .dwattr $C$DW$979, DW_AT_accessibility(DW_ACCESS_public)
    9354              
    9355              $C$DW$980       .dwtag  DW_TAG_member
    9356                      .dwattr $C$DW$980, DW_AT_type(*$C$DW$T$75)
    9357                      .dwattr $C$DW$980, DW_AT_name("Iab_in")
    9358                      .dwattr $C$DW$980, DW_AT_TI_symbol_name("_Iab_in")
    9359                      .dwattr $C$DW$980, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    9360                      .dwattr $C$DW$980, DW_AT_accessibility(DW_ACCESS_public)
    9361              
    9362              $C$DW$981       .dwtag  DW_TAG_member
    9363                      .dwattr $C$DW$981, DW_AT_type(*$C$DW$T$75)
    9364                      .dwattr $C$DW$981, DW_AT_name("Iab_filt")
    9365                      .dwattr $C$DW$981, DW_AT_TI_symbol_name("_Iab_filt")
    9366                      .dwattr $C$DW$981, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    9367                      .dwattr $C$DW$981, DW_AT_accessibility(DW_ACCESS_public)
    9368              
    9369              $C$DW$982       .dwtag  DW_TAG_member
    9370                      .dwattr $C$DW$982, DW_AT_type(*$C$DW$T$75)
    9371                      .dwattr $C$DW$982, DW_AT_name("Idq_in")
    9372                      .dwattr $C$DW$982, DW_AT_TI_symbol_name("_Idq_in")
    9373                      .dwattr $C$DW$982, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    9374                      .dwattr $C$DW$982, DW_AT_accessibility(DW_ACCESS_public)
    9375              
    9376              $C$DW$983       .dwtag  DW_TAG_member
    9377                      .dwattr $C$DW$983, DW_AT_type(*$C$DW$T$75)
    9378                      .dwattr $C$DW$983, DW_AT_name("Vab_in")
    9379                      .dwattr $C$DW$983, DW_AT_TI_symbol_name("_Vab_in")
    9380                      .dwattr $C$DW$983, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    9381                      .dwattr $C$DW$983, DW_AT_accessibility(DW_ACCESS_public)
    9382              
    9383              $C$DW$984       .dwtag  DW_TAG_member
    9384                      .dwattr $C$DW$984, DW_AT_type(*$C$DW$T$35)
    9385                      .dwattr $C$DW$984, DW_AT_name("spd_out")
    9386                      .dwattr $C$DW$984, DW_AT_TI_symbol_name("_spd_out")
    9387                      .dwattr $C$DW$984, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    9388                      .dwattr $C$DW$984, DW_AT_accessibility(DW_ACCESS_public)
    9389              
    9390              $C$DW$985       .dwtag  DW_TAG_member
    9391                      .dwattr $C$DW$985, DW_AT_type(*$C$DW$T$75)
    9392                      .dwattr $C$DW$985, DW_AT_name("Vab_out")
    9393                      .dwattr $C$DW$985, DW_AT_TI_symbol_name("_Vab_out")
    9394                      .dwattr $C$DW$985, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    9395                      .dwattr $C$DW$985, DW_AT_accessibility(DW_ACCESS_public)
    9396              
    9397              $C$DW$986       .dwtag  DW_TAG_member
    9398                      .dwattr $C$DW$986, DW_AT_type(*$C$DW$T$75)
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 18:02:35 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{E5A9845F-AFE3-402C-91FC-562B1CD6729F} PAGE  184

    9399                      .dwattr $C$DW$986, DW_AT_name("Vdq_out")
    9400                      .dwattr $C$DW$986, DW_AT_TI_symbol_name("_Vdq_out")
    9401                      .dwattr $C$DW$986, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    9402                      .dwattr $C$DW$986, DW_AT_accessibility(DW_ACCESS_public)
    9403              
    9404              $C$DW$987       .dwtag  DW_TAG_member
    9405                      .dwattr $C$DW$987, DW_AT_type(*$C$DW$T$74)
    9406                      .dwattr $C$DW$987, DW_AT_name("Rhf")
    9407                      .dwattr $C$DW$987, DW_AT_TI_symbol_name("_Rhf")
    9408                      .dwattr $C$DW$987, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    9409                      .dwattr $C$DW$987, DW_AT_accessibility(DW_ACCESS_public)
    9410              
    9411              $C$DW$988       .dwtag  DW_TAG_member
    9412                      .dwattr $C$DW$988, DW_AT_type(*$C$DW$T$74)
    9413                      .dwattr $C$DW$988, DW_AT_name("Lhf")
    9414                      .dwattr $C$DW$988, DW_AT_TI_symbol_name("_Lhf")
    9415                      .dwattr $C$DW$988, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    9416                      .dwattr $C$DW$988, DW_AT_accessibility(DW_ACCESS_public)
    9417              
    9418              $C$DW$989       .dwtag  DW_TAG_member
    9419                      .dwattr $C$DW$989, DW_AT_type(*$C$DW$T$74)
    9420                      .dwattr $C$DW$989, DW_AT_name("RoverL")
    9421                      .dwattr $C$DW$989, DW_AT_TI_symbol_name("_RoverL")
    9422                      .dwattr $C$DW$989, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    9423                      .dwattr $C$DW$989, DW_AT_accessibility(DW_ACCESS_public)
    9424              
    9425              $C$DW$990       .dwtag  DW_TAG_member
    9426                      .dwattr $C$DW$990, DW_AT_type(*$C$DW$T$35)
    9427                      .dwattr $C$DW$990, DW_AT_name("Kp_Id")
    9428                      .dwattr $C$DW$990, DW_AT_TI_symbol_name("_Kp_Id")
    9429                      .dwattr $C$DW$990, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    9430                      .dwattr $C$DW$990, DW_AT_accessibility(DW_ACCESS_public)
    9431              
    9432              $C$DW$991       .dwtag  DW_TAG_member
    9433                      .dwattr $C$DW$991, DW_AT_type(*$C$DW$T$35)
    9434                      .dwattr $C$DW$991, DW_AT_name("Kp_Iq")
    9435                      .dwattr $C$DW$991, DW_AT_TI_symbol_name("_Kp_Iq")
    9436                      .dwattr $C$DW$991, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    9437                      .dwattr $C$DW$991, DW_AT_accessibility(DW_ACCESS_public)
    9438              
    9439              $C$DW$992       .dwtag  DW_TAG_member
    9440                      .dwattr $C$DW$992, DW_AT_type(*$C$DW$T$35)
    9441                      .dwattr $C$DW$992, DW_AT_name("Kp_spd")
    9442                      .dwattr $C$DW$992, DW_AT_TI_symbol_name("_Kp_spd")
    9443                      .dwattr $C$DW$992, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    9444                      .dwattr $C$DW$992, DW_AT_accessibility(DW_ACCESS_public)
    9445              
    9446              $C$DW$993       .dwtag  DW_TAG_member
    9447                      .dwattr $C$DW$993, DW_AT_type(*$C$DW$T$35)
    9448                      .dwattr $C$DW$993, DW_AT_name("Ki_Id")
    9449                      .dwattr $C$DW$993, DW_AT_TI_symbol_name("_Ki_Id")
    9450                      .dwattr $C$DW$993, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    9451                      .dwattr $C$DW$993, DW_AT_accessibility(DW_ACCESS_public)
    9452              
    9453              $C$DW$994       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 18:02:35 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{E5A9845F-AFE3-402C-91FC-562B1CD6729F} PAGE  185

    9454                      .dwattr $C$DW$994, DW_AT_type(*$C$DW$T$35)
    9455                      .dwattr $C$DW$994, DW_AT_name("Ki_Iq")
    9456                      .dwattr $C$DW$994, DW_AT_TI_symbol_name("_Ki_Iq")
    9457                      .dwattr $C$DW$994, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    9458                      .dwattr $C$DW$994, DW_AT_accessibility(DW_ACCESS_public)
    9459              
    9460              $C$DW$995       .dwtag  DW_TAG_member
    9461                      .dwattr $C$DW$995, DW_AT_type(*$C$DW$T$35)
    9462                      .dwattr $C$DW$995, DW_AT_name("Ki_spd")
    9463                      .dwattr $C$DW$995, DW_AT_TI_symbol_name("_Ki_spd")
    9464                      .dwattr $C$DW$995, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    9465                      .dwattr $C$DW$995, DW_AT_accessibility(DW_ACCESS_public)
    9466              
    9467              $C$DW$996       .dwtag  DW_TAG_member
    9468                      .dwattr $C$DW$996, DW_AT_type(*$C$DW$T$35)
    9469                      .dwattr $C$DW$996, DW_AT_name("Kd_Id")
    9470                      .dwattr $C$DW$996, DW_AT_TI_symbol_name("_Kd_Id")
    9471                      .dwattr $C$DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    9472                      .dwattr $C$DW$996, DW_AT_accessibility(DW_ACCESS_public)
    9473              
    9474              $C$DW$997       .dwtag  DW_TAG_member
    9475                      .dwattr $C$DW$997, DW_AT_type(*$C$DW$T$35)
    9476                      .dwattr $C$DW$997, DW_AT_name("Kd_Iq")
    9477                      .dwattr $C$DW$997, DW_AT_TI_symbol_name("_Kd_Iq")
    9478                      .dwattr $C$DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    9479                      .dwattr $C$DW$997, DW_AT_accessibility(DW_ACCESS_public)
    9480              
    9481              $C$DW$998       .dwtag  DW_TAG_member
    9482                      .dwattr $C$DW$998, DW_AT_type(*$C$DW$T$35)
    9483                      .dwattr $C$DW$998, DW_AT_name("Kd_spd")
    9484                      .dwattr $C$DW$998, DW_AT_TI_symbol_name("_Kd_spd")
    9485                      .dwattr $C$DW$998, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    9486                      .dwattr $C$DW$998, DW_AT_accessibility(DW_ACCESS_public)
    9487              
    9488              $C$DW$999       .dwtag  DW_TAG_member
    9489                      .dwattr $C$DW$999, DW_AT_type(*$C$DW$T$35)
    9490                      .dwattr $C$DW$999, DW_AT_name("Ui_Id")
    9491                      .dwattr $C$DW$999, DW_AT_TI_symbol_name("_Ui_Id")
    9492                      .dwattr $C$DW$999, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    9493                      .dwattr $C$DW$999, DW_AT_accessibility(DW_ACCESS_public)
    9494              
    9495              $C$DW$1000      .dwtag  DW_TAG_member
    9496                      .dwattr $C$DW$1000, DW_AT_type(*$C$DW$T$35)
    9497                      .dwattr $C$DW$1000, DW_AT_name("Ui_Iq")
    9498                      .dwattr $C$DW$1000, DW_AT_TI_symbol_name("_Ui_Iq")
    9499                      .dwattr $C$DW$1000, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    9500                      .dwattr $C$DW$1000, DW_AT_accessibility(DW_ACCESS_public)
    9501              
    9502              $C$DW$1001      .dwtag  DW_TAG_member
    9503                      .dwattr $C$DW$1001, DW_AT_type(*$C$DW$T$35)
    9504                      .dwattr $C$DW$1001, DW_AT_name("Ui_spd")
    9505                      .dwattr $C$DW$1001, DW_AT_TI_symbol_name("_Ui_spd")
    9506                      .dwattr $C$DW$1001, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    9507                      .dwattr $C$DW$1001, DW_AT_accessibility(DW_ACCESS_public)
    9508              
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 18:02:35 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{E5A9845F-AFE3-402C-91FC-562B1CD6729F} PAGE  186

    9509              $C$DW$1002      .dwtag  DW_TAG_member
    9510                      .dwattr $C$DW$1002, DW_AT_type(*$C$DW$T$75)
    9511                      .dwattr $C$DW$1002, DW_AT_name("Idq_ref")
    9512                      .dwattr $C$DW$1002, DW_AT_TI_symbol_name("_Idq_ref")
    9513                      .dwattr $C$DW$1002, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    9514                      .dwattr $C$DW$1002, DW_AT_accessibility(DW_ACCESS_public)
    9515              
    9516              $C$DW$1003      .dwtag  DW_TAG_member
    9517                      .dwattr $C$DW$1003, DW_AT_type(*$C$DW$T$35)
    9518                      .dwattr $C$DW$1003, DW_AT_name("IdRated")
    9519                      .dwattr $C$DW$1003, DW_AT_TI_symbol_name("_IdRated")
    9520                      .dwattr $C$DW$1003, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    9521                      .dwattr $C$DW$1003, DW_AT_accessibility(DW_ACCESS_public)
    9522              
    9523              $C$DW$1004      .dwtag  DW_TAG_member
    9524                      .dwattr $C$DW$1004, DW_AT_type(*$C$DW$T$35)
    9525                      .dwattr $C$DW$1004, DW_AT_name("spd_ref")
    9526                      .dwattr $C$DW$1004, DW_AT_TI_symbol_name("_spd_ref")
    9527                      .dwattr $C$DW$1004, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    9528                      .dwattr $C$DW$1004, DW_AT_accessibility(DW_ACCESS_public)
    9529              
    9530              $C$DW$1005      .dwtag  DW_TAG_member
    9531                      .dwattr $C$DW$1005, DW_AT_type(*$C$DW$T$35)
    9532                      .dwattr $C$DW$1005, DW_AT_name("spd_max")
    9533                      .dwattr $C$DW$1005, DW_AT_TI_symbol_name("_spd_max")
    9534                      .dwattr $C$DW$1005, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    9535                      .dwattr $C$DW$1005, DW_AT_accessibility(DW_ACCESS_public)
    9536              
    9537              $C$DW$1006      .dwtag  DW_TAG_member
    9538                      .dwattr $C$DW$1006, DW_AT_type(*$C$DW$T$73)
    9539                      .dwattr $C$DW$1006, DW_AT_name("counter_current")
    9540                      .dwattr $C$DW$1006, DW_AT_TI_symbol_name("_counter_current")
    9541                      .dwattr $C$DW$1006, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    9542                      .dwattr $C$DW$1006, DW_AT_accessibility(DW_ACCESS_public)
    9543              
    9544              $C$DW$1007      .dwtag  DW_TAG_member
    9545                      .dwattr $C$DW$1007, DW_AT_type(*$C$DW$T$73)
    9546                      .dwattr $C$DW$1007, DW_AT_name("counter_isr")
    9547                      .dwattr $C$DW$1007, DW_AT_TI_symbol_name("_counter_isr")
    9548                      .dwattr $C$DW$1007, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    9549                      .dwattr $C$DW$1007, DW_AT_accessibility(DW_ACCESS_public)
    9550              
    9551              $C$DW$1008      .dwtag  DW_TAG_member
    9552                      .dwattr $C$DW$1008, DW_AT_type(*$C$DW$T$73)
    9553                      .dwattr $C$DW$1008, DW_AT_name("counter_speed")
    9554                      .dwattr $C$DW$1008, DW_AT_TI_symbol_name("_counter_speed")
    9555                      .dwattr $C$DW$1008, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    9556                      .dwattr $C$DW$1008, DW_AT_accessibility(DW_ACCESS_public)
    9557              
    9558              $C$DW$1009      .dwtag  DW_TAG_member
    9559                      .dwattr $C$DW$1009, DW_AT_type(*$C$DW$T$73)
    9560                      .dwattr $C$DW$1009, DW_AT_name("counter_traj")
    9561                      .dwattr $C$DW$1009, DW_AT_TI_symbol_name("_counter_traj")
    9562                      .dwattr $C$DW$1009, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    9563                      .dwattr $C$DW$1009, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 18:02:35 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{E5A9845F-AFE3-402C-91FC-562B1CD6729F} PAGE  187

    9564              
    9565              $C$DW$1010      .dwtag  DW_TAG_member
    9566                      .dwattr $C$DW$1010, DW_AT_type(*$C$DW$T$76)
    9567                      .dwattr $C$DW$1010, DW_AT_name("flag_enableCtrl")
    9568                      .dwattr $C$DW$1010, DW_AT_TI_symbol_name("_flag_enableCtrl")
    9569                      .dwattr $C$DW$1010, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    9570                      .dwattr $C$DW$1010, DW_AT_accessibility(DW_ACCESS_public)
    9571              
    9572              $C$DW$1011      .dwtag  DW_TAG_member
    9573                      .dwattr $C$DW$1011, DW_AT_type(*$C$DW$T$76)
    9574                      .dwattr $C$DW$1011, DW_AT_name("flag_enableDcBusComp")
    9575                      .dwattr $C$DW$1011, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    9576                      .dwattr $C$DW$1011, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    9577                      .dwattr $C$DW$1011, DW_AT_accessibility(DW_ACCESS_public)
    9578              
    9579              $C$DW$1012      .dwtag  DW_TAG_member
    9580                      .dwattr $C$DW$1012, DW_AT_type(*$C$DW$T$76)
    9581                      .dwattr $C$DW$1012, DW_AT_name("flag_enablePowerWarp")
    9582                      .dwattr $C$DW$1012, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    9583                      .dwattr $C$DW$1012, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    9584                      .dwattr $C$DW$1012, DW_AT_accessibility(DW_ACCESS_public)
    9585              
    9586              $C$DW$1013      .dwtag  DW_TAG_member
    9587                      .dwattr $C$DW$1013, DW_AT_type(*$C$DW$T$76)
    9588                      .dwattr $C$DW$1013, DW_AT_name("flag_enableOffset")
    9589                      .dwattr $C$DW$1013, DW_AT_TI_symbol_name("_flag_enableOffset")
    9590                      .dwattr $C$DW$1013, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    9591                      .dwattr $C$DW$1013, DW_AT_accessibility(DW_ACCESS_public)
    9592              
    9593              $C$DW$1014      .dwtag  DW_TAG_member
    9594                      .dwattr $C$DW$1014, DW_AT_type(*$C$DW$T$76)
    9595                      .dwattr $C$DW$1014, DW_AT_name("flag_enableSpeedCtrl")
    9596                      .dwattr $C$DW$1014, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    9597                      .dwattr $C$DW$1014, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    9598                      .dwattr $C$DW$1014, DW_AT_accessibility(DW_ACCESS_public)
    9599              
    9600              $C$DW$1015      .dwtag  DW_TAG_member
    9601                      .dwattr $C$DW$1015, DW_AT_type(*$C$DW$T$76)
    9602                      .dwattr $C$DW$1015, DW_AT_name("flag_enableUserMotorParams")
    9603                      .dwattr $C$DW$1015, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    9604                      .dwattr $C$DW$1015, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    9605                      .dwattr $C$DW$1015, DW_AT_accessibility(DW_ACCESS_public)
    9606              
    9607              $C$DW$1016      .dwtag  DW_TAG_member
    9608                      .dwattr $C$DW$1016, DW_AT_type(*$C$DW$T$75)
    9609                      .dwattr $C$DW$1016, DW_AT_name("Idq_offset_pu")
    9610                      .dwattr $C$DW$1016, DW_AT_TI_symbol_name("_Idq_offset_pu")
    9611                      .dwattr $C$DW$1016, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    9612                      .dwattr $C$DW$1016, DW_AT_accessibility(DW_ACCESS_public)
    9613              
    9614              $C$DW$1017      .dwtag  DW_TAG_member
    9615                      .dwattr $C$DW$1017, DW_AT_type(*$C$DW$T$75)
    9616                      .dwattr $C$DW$1017, DW_AT_name("Vdq_offset_pu")
    9617                      .dwattr $C$DW$1017, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    9618                      .dwattr $C$DW$1017, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 18:02:35 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{E5A9845F-AFE3-402C-91FC-562B1CD6729F} PAGE  188

    9619                      .dwattr $C$DW$1017, DW_AT_accessibility(DW_ACCESS_public)
    9620              
    9621              $C$DW$1018      .dwtag  DW_TAG_member
    9622                      .dwattr $C$DW$1018, DW_AT_type(*$C$DW$T$35)
    9623                      .dwattr $C$DW$1018, DW_AT_name("angle_pu")
    9624                      .dwattr $C$DW$1018, DW_AT_TI_symbol_name("_angle_pu")
    9625                      .dwattr $C$DW$1018, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    9626                      .dwattr $C$DW$1018, DW_AT_accessibility(DW_ACCESS_public)
    9627              
    9628              $C$DW$1019      .dwtag  DW_TAG_member
    9629                      .dwattr $C$DW$1019, DW_AT_type(*$C$DW$T$35)
    9630                      .dwattr $C$DW$1019, DW_AT_name("speed_ref_pu")
    9631                      .dwattr $C$DW$1019, DW_AT_TI_symbol_name("_speed_ref_pu")
    9632                      .dwattr $C$DW$1019, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    9633                      .dwattr $C$DW$1019, DW_AT_accessibility(DW_ACCESS_public)
    9634              
    9635              $C$DW$1020      .dwtag  DW_TAG_member
    9636                      .dwattr $C$DW$1020, DW_AT_type(*$C$DW$T$35)
    9637                      .dwattr $C$DW$1020, DW_AT_name("speed_fb_pu")
    9638                      .dwattr $C$DW$1020, DW_AT_TI_symbol_name("_speed_fb_pu")
    9639                      .dwattr $C$DW$1020, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    9640                      .dwattr $C$DW$1020, DW_AT_accessibility(DW_ACCESS_public)
    9641              
    9642              $C$DW$1021      .dwtag  DW_TAG_member
    9643                      .dwattr $C$DW$1021, DW_AT_type(*$C$DW$T$35)
    9644                      .dwattr $C$DW$1021, DW_AT_name("speed_outMax_pu")
    9645                      .dwattr $C$DW$1021, DW_AT_TI_symbol_name("_speed_outMax_pu")
    9646                      .dwattr $C$DW$1021, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    9647                      .dwattr $C$DW$1021, DW_AT_accessibility(DW_ACCESS_public)
    9648              
    9649              $C$DW$1022      .dwtag  DW_TAG_member
    9650                      .dwattr $C$DW$1022, DW_AT_type(*$C$DW$T$76)
    9651                      .dwattr $C$DW$1022, DW_AT_name("flag_enableCurrentCtrl")
    9652                      .dwattr $C$DW$1022, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    9653                      .dwattr $C$DW$1022, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    9654                      .dwattr $C$DW$1022, DW_AT_accessibility(DW_ACCESS_public)
    9655              
    9656              $C$DW$1023      .dwtag  DW_TAG_member
    9657                      .dwattr $C$DW$1023, DW_AT_type(*$C$DW$T$35)
    9658                      .dwattr $C$DW$1023, DW_AT_name("torque_head_comm")
    9659                      .dwattr $C$DW$1023, DW_AT_TI_symbol_name("_torque_head_comm")
    9660                      .dwattr $C$DW$1023, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    9661                      .dwattr $C$DW$1023, DW_AT_accessibility(DW_ACCESS_public)
    9662              
    9663                      .dwendtag $C$DW$T$77
    9664              
    9665              $C$DW$T$248     .dwtag  DW_TAG_typedef
    9666                      .dwattr $C$DW$T$248, DW_AT_name("CTRL_Obj")
    9667                      .dwattr $C$DW$T$248, DW_AT_type(*$C$DW$T$77)
    9668                      .dwattr $C$DW$T$248, DW_AT_language(DW_LANG_C)
    9669              
    9670              $C$DW$T$249     .dwtag  DW_TAG_pointer_type
    9671                      .dwattr $C$DW$T$249, DW_AT_type(*$C$DW$T$248)
    9672                      .dwattr $C$DW$T$249, DW_AT_address_class(0x20)
    9673              
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 18:02:35 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{E5A9845F-AFE3-402C-91FC-562B1CD6729F} PAGE  189

    9674              $C$DW$T$203     .dwtag  DW_TAG_pointer_type
    9675                      .dwattr $C$DW$T$203, DW_AT_type(*$C$DW$T$77)
    9676                      .dwattr $C$DW$T$203, DW_AT_address_class(0x20)
    9677              
    9678              $C$DW$T$204     .dwtag  DW_TAG_typedef
    9679                      .dwattr $C$DW$T$204, DW_AT_name("CTRL_Handle")
    9680                      .dwattr $C$DW$T$204, DW_AT_type(*$C$DW$T$203)
    9681                      .dwattr $C$DW$T$204, DW_AT_language(DW_LANG_C)
    9682              
    9683              $C$DW$1024      .dwtag  DW_TAG_TI_far_type
    9684                      .dwattr $C$DW$1024, DW_AT_type(*$C$DW$T$204)
    9685              
    9686              $C$DW$T$250     .dwtag  DW_TAG_const_type
    9687                      .dwattr $C$DW$T$250, DW_AT_type(*$C$DW$1024)
    9688              
    9689              
    9690              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    9691                      .dwattr $C$DW$T$80, DW_AT_name("_CTRL_Version_")
    9692                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x04)
    9693              $C$DW$1025      .dwtag  DW_TAG_member
    9694                      .dwattr $C$DW$1025, DW_AT_type(*$C$DW$T$26)
    9695                      .dwattr $C$DW$1025, DW_AT_name("rsvd")
    9696                      .dwattr $C$DW$1025, DW_AT_TI_symbol_name("_rsvd")
    9697                      .dwattr $C$DW$1025, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9698                      .dwattr $C$DW$1025, DW_AT_accessibility(DW_ACCESS_public)
    9699              
    9700              $C$DW$1026      .dwtag  DW_TAG_member
    9701                      .dwattr $C$DW$1026, DW_AT_type(*$C$DW$T$79)
    9702                      .dwattr $C$DW$1026, DW_AT_name("targetProc")
    9703                      .dwattr $C$DW$1026, DW_AT_TI_symbol_name("_targetProc")
    9704                      .dwattr $C$DW$1026, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9705                      .dwattr $C$DW$1026, DW_AT_accessibility(DW_ACCESS_public)
    9706              
    9707              $C$DW$1027      .dwtag  DW_TAG_member
    9708                      .dwattr $C$DW$1027, DW_AT_type(*$C$DW$T$26)
    9709                      .dwattr $C$DW$1027, DW_AT_name("major")
    9710                      .dwattr $C$DW$1027, DW_AT_TI_symbol_name("_major")
    9711                      .dwattr $C$DW$1027, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9712                      .dwattr $C$DW$1027, DW_AT_accessibility(DW_ACCESS_public)
    9713              
    9714              $C$DW$1028      .dwtag  DW_TAG_member
    9715                      .dwattr $C$DW$1028, DW_AT_type(*$C$DW$T$26)
    9716                      .dwattr $C$DW$1028, DW_AT_name("minor")
    9717                      .dwattr $C$DW$1028, DW_AT_TI_symbol_name("_minor")
    9718                      .dwattr $C$DW$1028, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9719                      .dwattr $C$DW$1028, DW_AT_accessibility(DW_ACCESS_public)
    9720              
    9721                      .dwendtag $C$DW$T$80
    9722              
    9723              $C$DW$T$42      .dwtag  DW_TAG_typedef
    9724                      .dwattr $C$DW$T$42, DW_AT_name("CTRL_Version")
    9725                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$80)
    9726                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    9727              
    9728              $C$DW$T$256     .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 18:02:35 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{E5A9845F-AFE3-402C-91FC-562B1CD6729F} PAGE  190

    9729                      .dwattr $C$DW$T$256, DW_AT_type(*$C$DW$T$42)
    9730                      .dwattr $C$DW$T$256, DW_AT_address_class(0x20)
    9731              
    9732              
    9733              $C$DW$T$87      .dwtag  DW_TAG_structure_type
    9734                      .dwattr $C$DW$T$87, DW_AT_name("_DRV8301_Obj_")
    9735                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x08)
    9736              $C$DW$1029      .dwtag  DW_TAG_member
    9737                      .dwattr $C$DW$1029, DW_AT_type(*$C$DW$T$82)
    9738                      .dwattr $C$DW$1029, DW_AT_name("spiHandle")
    9739                      .dwattr $C$DW$1029, DW_AT_TI_symbol_name("_spiHandle")
    9740                      .dwattr $C$DW$1029, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9741                      .dwattr $C$DW$1029, DW_AT_accessibility(DW_ACCESS_public)
    9742              
    9743              $C$DW$1030      .dwtag  DW_TAG_member
    9744                      .dwattr $C$DW$1030, DW_AT_type(*$C$DW$T$84)
    9745                      .dwattr $C$DW$1030, DW_AT_name("gpioHandle")
    9746                      .dwattr $C$DW$1030, DW_AT_TI_symbol_name("_gpioHandle")
    9747                      .dwattr $C$DW$1030, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9748                      .dwattr $C$DW$1030, DW_AT_accessibility(DW_ACCESS_public)
    9749              
    9750              $C$DW$1031      .dwtag  DW_TAG_member
    9751                      .dwattr $C$DW$1031, DW_AT_type(*$C$DW$T$86)
    9752                      .dwattr $C$DW$1031, DW_AT_name("gpioNumber")
    9753                      .dwattr $C$DW$1031, DW_AT_TI_symbol_name("_gpioNumber")
    9754                      .dwattr $C$DW$1031, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9755                      .dwattr $C$DW$1031, DW_AT_accessibility(DW_ACCESS_public)
    9756              
    9757              $C$DW$1032      .dwtag  DW_TAG_member
    9758                      .dwattr $C$DW$1032, DW_AT_type(*$C$DW$T$76)
    9759                      .dwattr $C$DW$1032, DW_AT_name("RxTimeOut")
    9760                      .dwattr $C$DW$1032, DW_AT_TI_symbol_name("_RxTimeOut")
    9761                      .dwattr $C$DW$1032, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9762                      .dwattr $C$DW$1032, DW_AT_accessibility(DW_ACCESS_public)
    9763              
    9764              $C$DW$1033      .dwtag  DW_TAG_member
    9765                      .dwattr $C$DW$1033, DW_AT_type(*$C$DW$T$76)
    9766                      .dwattr $C$DW$1033, DW_AT_name("enableTimeOut")
    9767                      .dwattr $C$DW$1033, DW_AT_TI_symbol_name("_enableTimeOut")
    9768                      .dwattr $C$DW$1033, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9769                      .dwattr $C$DW$1033, DW_AT_accessibility(DW_ACCESS_public)
    9770              
    9771                      .dwendtag $C$DW$T$87
    9772              
    9773              $C$DW$T$156     .dwtag  DW_TAG_typedef
    9774                      .dwattr $C$DW$T$156, DW_AT_name("DRV8301_Obj")
    9775                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$87)
    9776                      .dwattr $C$DW$T$156, DW_AT_language(DW_LANG_C)
    9777              
    9778              $C$DW$T$154     .dwtag  DW_TAG_pointer_type
    9779                      .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$87)
    9780                      .dwattr $C$DW$T$154, DW_AT_address_class(0x20)
    9781              
    9782              $C$DW$T$155     .dwtag  DW_TAG_typedef
    9783                      .dwattr $C$DW$T$155, DW_AT_name("DRV8301_Handle")
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 18:02:35 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{E5A9845F-AFE3-402C-91FC-562B1CD6729F} PAGE  191

    9784                      .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$154)
    9785                      .dwattr $C$DW$T$155, DW_AT_language(DW_LANG_C)
    9786              
    9787              
    9788              $C$DW$T$98      .dwtag  DW_TAG_structure_type
    9789                      .dwattr $C$DW$T$98, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    9790                      .dwattr $C$DW$T$98, DW_AT_byte_size(0x05)
    9791              $C$DW$1034      .dwtag  DW_TAG_member
    9792                      .dwattr $C$DW$1034, DW_AT_type(*$C$DW$T$89)
    9793                      .dwattr $C$DW$1034, DW_AT_name("DRV8301_CURRENT")
    9794                      .dwattr $C$DW$1034, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    9795                      .dwattr $C$DW$1034, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9796                      .dwattr $C$DW$1034, DW_AT_accessibility(DW_ACCESS_public)
    9797              
    9798              $C$DW$1035      .dwtag  DW_TAG_member
    9799                      .dwattr $C$DW$1035, DW_AT_type(*$C$DW$T$91)
    9800                      .dwattr $C$DW$1035, DW_AT_name("DRV8301_RESET")
    9801                      .dwattr $C$DW$1035, DW_AT_TI_symbol_name("_DRV8301_RESET")
    9802                      .dwattr $C$DW$1035, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9803                      .dwattr $C$DW$1035, DW_AT_accessibility(DW_ACCESS_public)
    9804              
    9805              $C$DW$1036      .dwtag  DW_TAG_member
    9806                      .dwattr $C$DW$1036, DW_AT_type(*$C$DW$T$93)
    9807                      .dwattr $C$DW$1036, DW_AT_name("PWM_MODE")
    9808                      .dwattr $C$DW$1036, DW_AT_TI_symbol_name("_PWM_MODE")
    9809                      .dwattr $C$DW$1036, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9810                      .dwattr $C$DW$1036, DW_AT_accessibility(DW_ACCESS_public)
    9811              
    9812              $C$DW$1037      .dwtag  DW_TAG_member
    9813                      .dwattr $C$DW$1037, DW_AT_type(*$C$DW$T$95)
    9814                      .dwattr $C$DW$1037, DW_AT_name("OC_MODE")
    9815                      .dwattr $C$DW$1037, DW_AT_TI_symbol_name("_OC_MODE")
    9816                      .dwattr $C$DW$1037, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9817                      .dwattr $C$DW$1037, DW_AT_accessibility(DW_ACCESS_public)
    9818              
    9819              $C$DW$1038      .dwtag  DW_TAG_member
    9820                      .dwattr $C$DW$1038, DW_AT_type(*$C$DW$T$97)
    9821                      .dwattr $C$DW$1038, DW_AT_name("OC_ADJ_SET")
    9822                      .dwattr $C$DW$1038, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    9823                      .dwattr $C$DW$1038, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9824                      .dwattr $C$DW$1038, DW_AT_accessibility(DW_ACCESS_public)
    9825              
    9826                      .dwendtag $C$DW$T$98
    9827              
    9828              $C$DW$T$112     .dwtag  DW_TAG_typedef
    9829                      .dwattr $C$DW$T$112, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    9830                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$98)
    9831                      .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    9832              
    9833              
    9834              $C$DW$T$107     .dwtag  DW_TAG_structure_type
    9835                      .dwattr $C$DW$T$107, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    9836                      .dwattr $C$DW$T$107, DW_AT_byte_size(0x04)
    9837              $C$DW$1039      .dwtag  DW_TAG_member
    9838                      .dwattr $C$DW$1039, DW_AT_type(*$C$DW$T$100)
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 18:02:35 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{E5A9845F-AFE3-402C-91FC-562B1CD6729F} PAGE  192

    9839                      .dwattr $C$DW$1039, DW_AT_name("OCTW_SET")
    9840                      .dwattr $C$DW$1039, DW_AT_TI_symbol_name("_OCTW_SET")
    9841                      .dwattr $C$DW$1039, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9842                      .dwattr $C$DW$1039, DW_AT_accessibility(DW_ACCESS_public)
    9843              
    9844              $C$DW$1040      .dwtag  DW_TAG_member
    9845                      .dwattr $C$DW$1040, DW_AT_type(*$C$DW$T$102)
    9846                      .dwattr $C$DW$1040, DW_AT_name("GAIN")
    9847                      .dwattr $C$DW$1040, DW_AT_TI_symbol_name("_GAIN")
    9848                      .dwattr $C$DW$1040, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9849                      .dwattr $C$DW$1040, DW_AT_accessibility(DW_ACCESS_public)
    9850              
    9851              $C$DW$1041      .dwtag  DW_TAG_member
    9852                      .dwattr $C$DW$1041, DW_AT_type(*$C$DW$T$104)
    9853                      .dwattr $C$DW$1041, DW_AT_name("DC_CAL_CH1p2")
    9854                      .dwattr $C$DW$1041, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    9855                      .dwattr $C$DW$1041, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9856                      .dwattr $C$DW$1041, DW_AT_accessibility(DW_ACCESS_public)
    9857              
    9858              $C$DW$1042      .dwtag  DW_TAG_member
    9859                      .dwattr $C$DW$1042, DW_AT_type(*$C$DW$T$106)
    9860                      .dwattr $C$DW$1042, DW_AT_name("OC_TOFF")
    9861                      .dwattr $C$DW$1042, DW_AT_TI_symbol_name("_OC_TOFF")
    9862                      .dwattr $C$DW$1042, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9863                      .dwattr $C$DW$1042, DW_AT_accessibility(DW_ACCESS_public)
    9864              
    9865                      .dwendtag $C$DW$T$107
    9866              
    9867              $C$DW$T$113     .dwtag  DW_TAG_typedef
    9868                      .dwattr $C$DW$T$113, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    9869                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$107)
    9870                      .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    9871              
    9872              
    9873              $C$DW$T$108     .dwtag  DW_TAG_structure_type
    9874                      .dwattr $C$DW$T$108, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    9875                      .dwattr $C$DW$T$108, DW_AT_byte_size(0x0b)
    9876              $C$DW$1043      .dwtag  DW_TAG_member
    9877                      .dwattr $C$DW$1043, DW_AT_type(*$C$DW$T$76)
    9878                      .dwattr $C$DW$1043, DW_AT_name("FAULT")
    9879                      .dwattr $C$DW$1043, DW_AT_TI_symbol_name("_FAULT")
    9880                      .dwattr $C$DW$1043, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9881                      .dwattr $C$DW$1043, DW_AT_accessibility(DW_ACCESS_public)
    9882              
    9883              $C$DW$1044      .dwtag  DW_TAG_member
    9884                      .dwattr $C$DW$1044, DW_AT_type(*$C$DW$T$76)
    9885                      .dwattr $C$DW$1044, DW_AT_name("GVDD_UV")
    9886                      .dwattr $C$DW$1044, DW_AT_TI_symbol_name("_GVDD_UV")
    9887                      .dwattr $C$DW$1044, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9888                      .dwattr $C$DW$1044, DW_AT_accessibility(DW_ACCESS_public)
    9889              
    9890              $C$DW$1045      .dwtag  DW_TAG_member
    9891                      .dwattr $C$DW$1045, DW_AT_type(*$C$DW$T$76)
    9892                      .dwattr $C$DW$1045, DW_AT_name("PVDD_UV")
    9893                      .dwattr $C$DW$1045, DW_AT_TI_symbol_name("_PVDD_UV")
TMS320C2000 Assembler PC v22.6.0 Wed Feb 22 18:02:35 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{E5A9845F-AFE3-402C-91FC-562B1CD6729F} PAGE  193

    9894                      .dwattr $C$DW$1045, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9895                      .dwattr $C$DW$1045, DW_AT_accessibility(DW_ACCESS_public)
    9896              
    9897              $C$DW$1046      .dwtag  DW_TAG_member
    9898                      .dwattr $C$DW$1046, DW_AT_type(*$C$DW$T$76)
    9899                      .dwattr $C$DW$1046, DW_AT_name("OTSD")
    9900                      .dwattr $C$DW$1046, DW_AT_TI_symbol_name("_OTSD")
    9901                      .dwattr $C$DW$1046, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9902                      .dwattr $C$DW$1046, DW_AT_accessibility(DW_ACCESS_public)
    9903              
    9904              $C$DW$1047      .dwtag  DW_TAG_member
    9905                      .dwattr $C$DW$1047, DW_AT_type(*$C$DW$T$76)
    9906                      .dwattr $C$DW$1047, DW_AT_name("OTW")
    9907                      .dwattr $C$DW$1047, DW_AT_TI_symbol_name("_OTW")
    9908                      .dwattr $C$DW$1047, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9909                      .dwattr $C$DW$1047, DW_AT_accessibility(DW_ACCESS_public)
    9910              
    9911              $C$DW$1048      .dwtag  DW_TAG_member
    9912                      .dwattr $C$DW$1048, DW_AT_type(*$C$DW$T$76)
    9913                      .dwattr $C$DW$1048, DW_AT_name("FETHA_OC")
    9914                      .dwattr $C$DW$1048, DW_AT_TI_symbol_name("_FETHA_OC")
    9915                      .dwattr $C$DW$1048, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9916                      .dwattr $C$DW$1048, DW_AT_accessibility(DW_ACCESS_public)
    9917              
    9918              $C$DW$1049      .dwtag  DW_TAG_member
    9919                      .dwattr $C$DW$1049, DW_AT_type(*$C$DW$T$76)
    9920                      .dwattr $C$DW$1049, DW_AT_name("FETLA_OC")
    9921                      .dwattr $C$DW$1049, DW_AT_TI_symbol_name("_FETLA_OC")
    9922                      .dwattr $C$DW$1049, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9923                      .dwattr $C$DW$1049, DW_AT_accessibility(DW_ACCESS_public)
    9924              
    9925              $C$DW$1050      .dwtag  DW_TAG_member
    9926                      .dwattr $C$DW$1050, DW_AT_type(*$C$DW$T$76)
    9927                      .dwattr $C$DW$1050, DW_AT_name("FETHB_OC")
    9928                      .dwattr $C$DW$1050, DW_AT_TI_symbol_name("_FETHB_OC")
    9929                      .dwattr $C$DW$1050, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    9930                      .dwattr $C$DW$1050, DW_AT_accessibility(DW_ACCESS_public)
    9931              
    9932              $C$DW$1051      .dwtag  DW_TAG_member
    9933                      .dwattr $C$DW$1051, DW_AT_type(*$C$DW$T$76)
    9934                      .dwattr $C$DW$1051, DW_AT_name("FETLB_OC")
    9935                      .dwattr $C$DW$1051, DW_AT_TI_symbol_name("_FETLB_OC")
    9936                      .dwattr $C$DW$1051, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
