TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 14:01:10 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{05E34366-D316-4032-A5DC-F5883D36D03E} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.0.LTS *
       3              ;* Date/Time created: Mon Mar  6 14:01:09 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/GIANT/GIANT_TI_instaspin/TI_instaspin_indoor_smart_trainer/motorware
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.0.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\GIANT\GIANT_TI_instaspin\TI_instaspin_indoor_smart_trainer\motor
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    8965              $C$DW$923       .dwtag  DW_TAG_enumerator
    8966                      .dwattr $C$DW$923, DW_AT_name("PIE_GroupNumber_3")
    8967                      .dwattr $C$DW$923, DW_AT_const_value(0x02)
    8968              
    8969              $C$DW$924       .dwtag  DW_TAG_enumerator
    8970                      .dwattr $C$DW$924, DW_AT_name("PIE_GroupNumber_4")
    8971                      .dwattr $C$DW$924, DW_AT_const_value(0x03)
    8972              
    8973              $C$DW$925       .dwtag  DW_TAG_enumerator
    8974                      .dwattr $C$DW$925, DW_AT_name("PIE_GroupNumber_5")
    8975                      .dwattr $C$DW$925, DW_AT_const_value(0x04)
    8976              
    8977              $C$DW$926       .dwtag  DW_TAG_enumerator
    8978                      .dwattr $C$DW$926, DW_AT_name("PIE_GroupNumber_6")
    8979                      .dwattr $C$DW$926, DW_AT_const_value(0x05)
    8980              
    8981              $C$DW$927       .dwtag  DW_TAG_enumerator
    8982                      .dwattr $C$DW$927, DW_AT_name("PIE_GroupNumber_7")
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 14:01:10 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{05E34366-D316-4032-A5DC-F5883D36D03E} PAGE  177

    8983                      .dwattr $C$DW$927, DW_AT_const_value(0x06)
    8984              
    8985              $C$DW$928       .dwtag  DW_TAG_enumerator
    8986                      .dwattr $C$DW$928, DW_AT_name("PIE_GroupNumber_8")
    8987                      .dwattr $C$DW$928, DW_AT_const_value(0x07)
    8988              
    8989              $C$DW$929       .dwtag  DW_TAG_enumerator
    8990                      .dwattr $C$DW$929, DW_AT_name("PIE_GroupNumber_9")
    8991                      .dwattr $C$DW$929, DW_AT_const_value(0x08)
    8992              
    8993              $C$DW$930       .dwtag  DW_TAG_enumerator
    8994                      .dwattr $C$DW$930, DW_AT_name("PIE_GroupNumber_10")
    8995                      .dwattr $C$DW$930, DW_AT_const_value(0x09)
    8996              
    8997              $C$DW$931       .dwtag  DW_TAG_enumerator
    8998                      .dwattr $C$DW$931, DW_AT_name("PIE_GroupNumber_11")
    8999                      .dwattr $C$DW$931, DW_AT_const_value(0x0a)
    9000              
    9001              $C$DW$932       .dwtag  DW_TAG_enumerator
    9002                      .dwattr $C$DW$932, DW_AT_name("PIE_GroupNumber_12")
    9003                      .dwattr $C$DW$932, DW_AT_const_value(0x0b)
    9004              
    9005                      .dwendtag $C$DW$T$297
    9006              
    9007              $C$DW$T$298     .dwtag  DW_TAG_typedef
    9008                      .dwattr $C$DW$T$298, DW_AT_name("PIE_GroupNumber_e")
    9009                      .dwattr $C$DW$T$298, DW_AT_type(*$C$DW$T$297)
    9010                      .dwattr $C$DW$T$298, DW_AT_language(DW_LANG_C)
    9011              
    9012              
    9013              $C$DW$T$300     .dwtag  DW_TAG_enumeration_type
    9014                      .dwattr $C$DW$T$300, DW_AT_byte_size(0x01)
    9015              $C$DW$933       .dwtag  DW_TAG_enumerator
    9016                      .dwattr $C$DW$933, DW_AT_name("CTRL_Type_PID_spd")
    9017                      .dwattr $C$DW$933, DW_AT_const_value(0x00)
    9018              
    9019              $C$DW$934       .dwtag  DW_TAG_enumerator
    9020                      .dwattr $C$DW$934, DW_AT_name("CTRL_Type_PID_Id")
    9021                      .dwattr $C$DW$934, DW_AT_const_value(0x01)
    9022              
    9023              $C$DW$935       .dwtag  DW_TAG_enumerator
    9024                      .dwattr $C$DW$935, DW_AT_name("CTRL_Type_PID_Iq")
    9025                      .dwattr $C$DW$935, DW_AT_const_value(0x02)
    9026              
    9027                      .dwendtag $C$DW$T$300
    9028              
    9029              $C$DW$T$301     .dwtag  DW_TAG_typedef
    9030                      .dwattr $C$DW$T$301, DW_AT_name("CTRL_Type_e")
    9031                      .dwattr $C$DW$T$301, DW_AT_type(*$C$DW$T$300)
    9032                      .dwattr $C$DW$T$301, DW_AT_language(DW_LANG_C)
    9033              
    9034              
    9035              $C$DW$T$303     .dwtag  DW_TAG_enumeration_type
    9036                      .dwattr $C$DW$T$303, DW_AT_byte_size(0x01)
    9037              $C$DW$936       .dwtag  DW_TAG_enumerator
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 14:01:10 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{05E34366-D316-4032-A5DC-F5883D36D03E} PAGE  178

    9038                      .dwattr $C$DW$936, DW_AT_name("HAL_SensorType_Current")
    9039                      .dwattr $C$DW$936, DW_AT_const_value(0x00)
    9040              
    9041              $C$DW$937       .dwtag  DW_TAG_enumerator
    9042                      .dwattr $C$DW$937, DW_AT_name("HAL_SensorType_Voltage")
    9043                      .dwattr $C$DW$937, DW_AT_const_value(0x01)
    9044              
    9045                      .dwendtag $C$DW$T$303
    9046              
    9047              $C$DW$T$304     .dwtag  DW_TAG_typedef
    9048                      .dwattr $C$DW$T$304, DW_AT_name("HAL_SensorType_e")
    9049                      .dwattr $C$DW$T$304, DW_AT_type(*$C$DW$T$303)
    9050                      .dwattr $C$DW$T$304, DW_AT_language(DW_LANG_C)
    9051              
    9052              
    9053              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    9054                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x12)
    9055              $C$DW$938       .dwtag  DW_TAG_member
    9056                      .dwattr $C$DW$938, DW_AT_type(*$C$DW$T$32)
    9057                      .dwattr $C$DW$938, DW_AT_name("T_sec")
    9058                      .dwattr $C$DW$938, DW_AT_TI_symbol_name("_T_sec")
    9059                      .dwattr $C$DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9060                      .dwattr $C$DW$938, DW_AT_accessibility(DW_ACCESS_public)
    9061              
    9062              $C$DW$939       .dwtag  DW_TAG_member
    9063                      .dwattr $C$DW$939, DW_AT_type(*$C$DW$T$32)
    9064                      .dwattr $C$DW$939, DW_AT_name("ROMax_erev")
    9065                      .dwattr $C$DW$939, DW_AT_TI_symbol_name("_ROMax_erev")
    9066                      .dwattr $C$DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9067                      .dwattr $C$DW$939, DW_AT_accessibility(DW_ACCESS_public)
    9068              
    9069              $C$DW$940       .dwtag  DW_TAG_member
    9070                      .dwattr $C$DW$940, DW_AT_type(*$C$DW$T$32)
    9071                      .dwattr $C$DW$940, DW_AT_name("ROMin_erev")
    9072                      .dwattr $C$DW$940, DW_AT_TI_symbol_name("_ROMin_erev")
    9073                      .dwattr $C$DW$940, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9074                      .dwattr $C$DW$940, DW_AT_accessibility(DW_ACCESS_public)
    9075              
    9076              $C$DW$941       .dwtag  DW_TAG_member
    9077                      .dwattr $C$DW$941, DW_AT_type(*$C$DW$T$32)
    9078                      .dwattr $C$DW$941, DW_AT_name("erev_TO_pu_ps")
    9079                      .dwattr $C$DW$941, DW_AT_TI_symbol_name("_erev_TO_pu_ps")
    9080                      .dwattr $C$DW$941, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9081                      .dwattr $C$DW$941, DW_AT_accessibility(DW_ACCESS_public)
    9082              
    9083              $C$DW$942       .dwtag  DW_TAG_member
    9084                      .dwattr $C$DW$942, DW_AT_type(*$C$DW$T$32)
    9085                      .dwattr $C$DW$942, DW_AT_name("PolePairs")
    9086                      .dwattr $C$DW$942, DW_AT_TI_symbol_name("_PolePairs")
    9087                      .dwattr $C$DW$942, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9088                      .dwattr $C$DW$942, DW_AT_accessibility(DW_ACCESS_public)
    9089              
    9090              $C$DW$943       .dwtag  DW_TAG_member
    9091                      .dwattr $C$DW$943, DW_AT_type(*$C$DW$T$32)
    9092                      .dwattr $C$DW$943, DW_AT_name("ROMax_mrev")
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 14:01:10 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{05E34366-D316-4032-A5DC-F5883D36D03E} PAGE  179

    9093                      .dwattr $C$DW$943, DW_AT_TI_symbol_name("_ROMax_mrev")
    9094                      .dwattr $C$DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9095                      .dwattr $C$DW$943, DW_AT_accessibility(DW_ACCESS_public)
    9096              
    9097              $C$DW$944       .dwtag  DW_TAG_member
    9098                      .dwattr $C$DW$944, DW_AT_type(*$C$DW$T$34)
    9099                      .dwattr $C$DW$944, DW_AT_name("LpfTime_tick")
    9100                      .dwattr $C$DW$944, DW_AT_TI_symbol_name("_LpfTime_tick")
    9101                      .dwattr $C$DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9102                      .dwattr $C$DW$944, DW_AT_accessibility(DW_ACCESS_public)
    9103              
    9104              $C$DW$945       .dwtag  DW_TAG_member
    9105                      .dwattr $C$DW$945, DW_AT_type(*$C$DW$T$32)
    9106                      .dwattr $C$DW$945, DW_AT_name("SampleTimeOverTimeConst")
    9107                      .dwattr $C$DW$945, DW_AT_TI_symbol_name("_SampleTimeOverTimeConst")
    9108                      .dwattr $C$DW$945, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9109                      .dwattr $C$DW$945, DW_AT_accessibility(DW_ACCESS_public)
    9110              
    9111              $C$DW$946       .dwtag  DW_TAG_member
    9112                      .dwattr $C$DW$946, DW_AT_type(*$C$DW$T$32)
    9113                      .dwattr $C$DW$946, DW_AT_name("OneOverFreqTimeConst")
    9114                      .dwattr $C$DW$946, DW_AT_TI_symbol_name("_OneOverFreqTimeConst")
    9115                      .dwattr $C$DW$946, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9116                      .dwattr $C$DW$946, DW_AT_accessibility(DW_ACCESS_public)
    9117              
    9118                      .dwendtag $C$DW$T$35
    9119              
    9120              $C$DW$T$36      .dwtag  DW_TAG_typedef
    9121                      .dwattr $C$DW$T$36, DW_AT_name("ST_PosConvCfg_t")
    9122                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    9123                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    9124              
    9125              
    9126              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    9127                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x4c)
    9128              $C$DW$947       .dwtag  DW_TAG_member
    9129                      .dwattr $C$DW$947, DW_AT_type(*$C$DW$T$36)
    9130                      .dwattr $C$DW$947, DW_AT_name("cfg")
    9131                      .dwattr $C$DW$947, DW_AT_TI_symbol_name("_cfg")
    9132                      .dwattr $C$DW$947, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9133                      .dwattr $C$DW$947, DW_AT_accessibility(DW_ACCESS_public)
    9134              
    9135              $C$DW$948       .dwtag  DW_TAG_member
    9136                      .dwattr $C$DW$948, DW_AT_type(*$C$DW$T$32)
    9137                      .dwattr $C$DW$948, DW_AT_name("Pos_erev")
    9138                      .dwattr $C$DW$948, DW_AT_TI_symbol_name("_Pos_erev")
    9139                      .dwattr $C$DW$948, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9140                      .dwattr $C$DW$948, DW_AT_accessibility(DW_ACCESS_public)
    9141              
    9142              $C$DW$949       .dwtag  DW_TAG_member
    9143                      .dwattr $C$DW$949, DW_AT_type(*$C$DW$T$32)
    9144                      .dwattr $C$DW$949, DW_AT_name("Id")
    9145                      .dwattr $C$DW$949, DW_AT_TI_symbol_name("_Id")
    9146                      .dwattr $C$DW$949, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9147                      .dwattr $C$DW$949, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 14:01:10 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{05E34366-D316-4032-A5DC-F5883D36D03E} PAGE  180

    9148              
    9149              $C$DW$950       .dwtag  DW_TAG_member
    9150                      .dwattr $C$DW$950, DW_AT_type(*$C$DW$T$32)
    9151                      .dwattr $C$DW$950, DW_AT_name("Iq")
    9152                      .dwattr $C$DW$950, DW_AT_TI_symbol_name("_Iq")
    9153                      .dwattr $C$DW$950, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    9154                      .dwattr $C$DW$950, DW_AT_accessibility(DW_ACCESS_public)
    9155              
    9156              $C$DW$951       .dwtag  DW_TAG_member
    9157                      .dwattr $C$DW$951, DW_AT_type(*$C$DW$T$37)
    9158                      .dwattr $C$DW$951, DW_AT_name("ENB")
    9159                      .dwattr $C$DW$951, DW_AT_TI_symbol_name("_ENB")
    9160                      .dwattr $C$DW$951, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9161                      .dwattr $C$DW$951, DW_AT_accessibility(DW_ACCESS_public)
    9162              
    9163              $C$DW$952       .dwtag  DW_TAG_member
    9164                      .dwattr $C$DW$952, DW_AT_type(*$C$DW$T$32)
    9165                      .dwattr $C$DW$952, DW_AT_name("Vel")
    9166                      .dwattr $C$DW$952, DW_AT_TI_symbol_name("_Vel")
    9167                      .dwattr $C$DW$952, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9168                      .dwattr $C$DW$952, DW_AT_accessibility(DW_ACCESS_public)
    9169              
    9170              $C$DW$953       .dwtag  DW_TAG_member
    9171                      .dwattr $C$DW$953, DW_AT_type(*$C$DW$T$32)
    9172                      .dwattr $C$DW$953, DW_AT_name("VelLpf")
    9173                      .dwattr $C$DW$953, DW_AT_TI_symbol_name("_VelLpf")
    9174                      .dwattr $C$DW$953, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9175                      .dwattr $C$DW$953, DW_AT_accessibility(DW_ACCESS_public)
    9176              
    9177              $C$DW$954       .dwtag  DW_TAG_member
    9178                      .dwattr $C$DW$954, DW_AT_type(*$C$DW$T$32)
    9179                      .dwattr $C$DW$954, DW_AT_name("Pos_mrev")
    9180                      .dwattr $C$DW$954, DW_AT_TI_symbol_name("_Pos_mrev")
    9181                      .dwattr $C$DW$954, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    9182                      .dwattr $C$DW$954, DW_AT_accessibility(DW_ACCESS_public)
    9183              
    9184              $C$DW$955       .dwtag  DW_TAG_member
    9185                      .dwattr $C$DW$955, DW_AT_type(*$C$DW$T$39)
    9186                      .dwattr $C$DW$955, DW_AT_name("PosROCounts")
    9187                      .dwattr $C$DW$955, DW_AT_TI_symbol_name("_PosROCounts")
    9188                      .dwattr $C$DW$955, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    9189                      .dwattr $C$DW$955, DW_AT_accessibility(DW_ACCESS_public)
    9190              
    9191              $C$DW$956       .dwtag  DW_TAG_member
    9192                      .dwattr $C$DW$956, DW_AT_type(*$C$DW$T$32)
    9193                      .dwattr $C$DW$956, DW_AT_name("SlipVel")
    9194                      .dwattr $C$DW$956, DW_AT_TI_symbol_name("_SlipVel")
    9195                      .dwattr $C$DW$956, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    9196                      .dwattr $C$DW$956, DW_AT_accessibility(DW_ACCESS_public)
    9197              
    9198              $C$DW$957       .dwtag  DW_TAG_member
    9199                      .dwattr $C$DW$957, DW_AT_type(*$C$DW$T$41)
    9200                      .dwattr $C$DW$957, DW_AT_name("STATUS")
    9201                      .dwattr $C$DW$957, DW_AT_TI_symbol_name("_STATUS")
    9202                      .dwattr $C$DW$957, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 14:01:10 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{05E34366-D316-4032-A5DC-F5883D36D03E} PAGE  181

    9203                      .dwattr $C$DW$957, DW_AT_accessibility(DW_ACCESS_public)
    9204              
    9205              $C$DW$958       .dwtag  DW_TAG_member
    9206                      .dwattr $C$DW$958, DW_AT_type(*$C$DW$T$43)
    9207                      .dwattr $C$DW$958, DW_AT_name("ERR_ID")
    9208                      .dwattr $C$DW$958, DW_AT_TI_symbol_name("_ERR_ID")
    9209                      .dwattr $C$DW$958, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    9210                      .dwattr $C$DW$958, DW_AT_accessibility(DW_ACCESS_public)
    9211              
    9212              $C$DW$959       .dwtag  DW_TAG_member
    9213                      .dwattr $C$DW$959, DW_AT_type(*$C$DW$T$46)
    9214                      .dwattr $C$DW$959, DW_AT_name("s0")
    9215                      .dwattr $C$DW$959, DW_AT_TI_symbol_name("_s0")
    9216                      .dwattr $C$DW$959, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    9217                      .dwattr $C$DW$959, DW_AT_accessibility(DW_ACCESS_public)
    9218              
    9219                      .dwendtag $C$DW$T$47
    9220              
    9221              $C$DW$T$272     .dwtag  DW_TAG_typedef
    9222                      .dwattr $C$DW$T$272, DW_AT_name("ST_PosConv_t")
    9223                      .dwattr $C$DW$T$272, DW_AT_type(*$C$DW$T$47)
    9224                      .dwattr $C$DW$T$272, DW_AT_language(DW_LANG_C)
    9225              
    9226              
    9227              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    9228                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x0a)
    9229              $C$DW$960       .dwtag  DW_TAG_member
    9230                      .dwattr $C$DW$960, DW_AT_type(*$C$DW$T$49)
    9231                      .dwattr $C$DW$960, DW_AT_name("Axis")
    9232                      .dwattr $C$DW$960, DW_AT_TI_symbol_name("_Axis")
    9233                      .dwattr $C$DW$960, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9234                      .dwattr $C$DW$960, DW_AT_accessibility(DW_ACCESS_public)
    9235              
    9236              $C$DW$961       .dwtag  DW_TAG_member
    9237                      .dwattr $C$DW$961, DW_AT_type(*$C$DW$T$32)
    9238                      .dwattr $C$DW$961, DW_AT_name("T_sec")
    9239                      .dwattr $C$DW$961, DW_AT_TI_symbol_name("_T_sec")
    9240                      .dwattr $C$DW$961, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9241                      .dwattr $C$DW$961, DW_AT_accessibility(DW_ACCESS_public)
    9242              
    9243              $C$DW$962       .dwtag  DW_TAG_member
    9244                      .dwattr $C$DW$962, DW_AT_type(*$C$DW$T$37)
    9245                      .dwattr $C$DW$962, DW_AT_name("FiltEN")
    9246                      .dwattr $C$DW$962, DW_AT_TI_symbol_name("_FiltEN")
    9247                      .dwattr $C$DW$962, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9248                      .dwattr $C$DW$962, DW_AT_accessibility(DW_ACCESS_public)
    9249              
    9250              $C$DW$963       .dwtag  DW_TAG_member
    9251                      .dwattr $C$DW$963, DW_AT_type(*$C$DW$T$32)
    9252                      .dwattr $C$DW$963, DW_AT_name("OutMax")
    9253                      .dwattr $C$DW$963, DW_AT_TI_symbol_name("_OutMax")
    9254                      .dwattr $C$DW$963, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9255                      .dwattr $C$DW$963, DW_AT_accessibility(DW_ACCESS_public)
    9256              
    9257              $C$DW$964       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 14:01:10 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{05E34366-D316-4032-A5DC-F5883D36D03E} PAGE  182

    9258                      .dwattr $C$DW$964, DW_AT_type(*$C$DW$T$32)
    9259                      .dwattr $C$DW$964, DW_AT_name("OutMin")
    9260                      .dwattr $C$DW$964, DW_AT_TI_symbol_name("_OutMin")
    9261                      .dwattr $C$DW$964, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9262                      .dwattr $C$DW$964, DW_AT_accessibility(DW_ACCESS_public)
    9263              
    9264                      .dwendtag $C$DW$T$50
    9265              
    9266              $C$DW$T$51      .dwtag  DW_TAG_typedef
    9267                      .dwattr $C$DW$T$51, DW_AT_name("ST_VelCtlCfg_t")
    9268                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    9269                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    9270              
    9271              
    9272              $C$DW$T$56      .dwtag  DW_TAG_structure_type
    9273                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x30)
    9274              $C$DW$965       .dwtag  DW_TAG_member
    9275                      .dwattr $C$DW$965, DW_AT_type(*$C$DW$T$51)
    9276                      .dwattr $C$DW$965, DW_AT_name("cfg")
    9277                      .dwattr $C$DW$965, DW_AT_TI_symbol_name("_cfg")
    9278                      .dwattr $C$DW$965, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9279                      .dwattr $C$DW$965, DW_AT_accessibility(DW_ACCESS_public)
    9280              
    9281              $C$DW$966       .dwtag  DW_TAG_member
    9282                      .dwattr $C$DW$966, DW_AT_type(*$C$DW$T$32)
    9283                      .dwattr $C$DW$966, DW_AT_name("VelRef")
    9284                      .dwattr $C$DW$966, DW_AT_TI_symbol_name("_VelRef")
    9285                      .dwattr $C$DW$966, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9286                      .dwattr $C$DW$966, DW_AT_accessibility(DW_ACCESS_public)
    9287              
    9288              $C$DW$967       .dwtag  DW_TAG_member
    9289                      .dwattr $C$DW$967, DW_AT_type(*$C$DW$T$32)
    9290                      .dwattr $C$DW$967, DW_AT_name("AccRef")
    9291                      .dwattr $C$DW$967, DW_AT_TI_symbol_name("_AccRef")
    9292                      .dwattr $C$DW$967, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9293                      .dwattr $C$DW$967, DW_AT_accessibility(DW_ACCESS_public)
    9294              
    9295              $C$DW$968       .dwtag  DW_TAG_member
    9296                      .dwattr $C$DW$968, DW_AT_type(*$C$DW$T$32)
    9297                      .dwattr $C$DW$968, DW_AT_name("VelFdb")
    9298                      .dwattr $C$DW$968, DW_AT_TI_symbol_name("_VelFdb")
    9299                      .dwattr $C$DW$968, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9300                      .dwattr $C$DW$968, DW_AT_accessibility(DW_ACCESS_public)
    9301              
    9302              $C$DW$969       .dwtag  DW_TAG_member
    9303                      .dwattr $C$DW$969, DW_AT_type(*$C$DW$T$32)
    9304                      .dwattr $C$DW$969, DW_AT_name("Inertia")
    9305                      .dwattr $C$DW$969, DW_AT_TI_symbol_name("_Inertia")
    9306                      .dwattr $C$DW$969, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9307                      .dwattr $C$DW$969, DW_AT_accessibility(DW_ACCESS_public)
    9308              
    9309              $C$DW$970       .dwtag  DW_TAG_member
    9310                      .dwattr $C$DW$970, DW_AT_type(*$C$DW$T$32)
    9311                      .dwattr $C$DW$970, DW_AT_name("Friction")
    9312                      .dwattr $C$DW$970, DW_AT_TI_symbol_name("_Friction")
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 14:01:10 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{05E34366-D316-4032-A5DC-F5883D36D03E} PAGE  183

    9313                      .dwattr $C$DW$970, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9314                      .dwattr $C$DW$970, DW_AT_accessibility(DW_ACCESS_public)
    9315              
    9316              $C$DW$971       .dwtag  DW_TAG_member
    9317                      .dwattr $C$DW$971, DW_AT_type(*$C$DW$T$52)
    9318                      .dwattr $C$DW$971, DW_AT_name("Bw_radps")
    9319                      .dwattr $C$DW$971, DW_AT_TI_symbol_name("_Bw_radps")
    9320                      .dwattr $C$DW$971, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9321                      .dwattr $C$DW$971, DW_AT_accessibility(DW_ACCESS_public)
    9322              
    9323              $C$DW$972       .dwtag  DW_TAG_member
    9324                      .dwattr $C$DW$972, DW_AT_type(*$C$DW$T$37)
    9325                      .dwattr $C$DW$972, DW_AT_name("ENB")
    9326                      .dwattr $C$DW$972, DW_AT_TI_symbol_name("_ENB")
    9327                      .dwattr $C$DW$972, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    9328                      .dwattr $C$DW$972, DW_AT_accessibility(DW_ACCESS_public)
    9329              
    9330              $C$DW$973       .dwtag  DW_TAG_member
    9331                      .dwattr $C$DW$973, DW_AT_type(*$C$DW$T$32)
    9332                      .dwattr $C$DW$973, DW_AT_name("Out")
    9333                      .dwattr $C$DW$973, DW_AT_TI_symbol_name("_Out")
    9334                      .dwattr $C$DW$973, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9335                      .dwattr $C$DW$973, DW_AT_accessibility(DW_ACCESS_public)
    9336              
    9337              $C$DW$974       .dwtag  DW_TAG_member
    9338                      .dwattr $C$DW$974, DW_AT_type(*$C$DW$T$54)
    9339                      .dwattr $C$DW$974, DW_AT_name("STATUS")
    9340                      .dwattr $C$DW$974, DW_AT_TI_symbol_name("_STATUS")
    9341                      .dwattr $C$DW$974, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9342                      .dwattr $C$DW$974, DW_AT_accessibility(DW_ACCESS_public)
    9343              
    9344              $C$DW$975       .dwtag  DW_TAG_member
    9345                      .dwattr $C$DW$975, DW_AT_type(*$C$DW$T$43)
    9346                      .dwattr $C$DW$975, DW_AT_name("ERR_ID")
    9347                      .dwattr $C$DW$975, DW_AT_TI_symbol_name("_ERR_ID")
    9348                      .dwattr $C$DW$975, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    9349                      .dwattr $C$DW$975, DW_AT_accessibility(DW_ACCESS_public)
    9350              
    9351              $C$DW$976       .dwtag  DW_TAG_member
    9352                      .dwattr $C$DW$976, DW_AT_type(*$C$DW$T$55)
    9353                      .dwattr $C$DW$976, DW_AT_name("s1")
    9354                      .dwattr $C$DW$976, DW_AT_TI_symbol_name("_s1")
    9355                      .dwattr $C$DW$976, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9356                      .dwattr $C$DW$976, DW_AT_accessibility(DW_ACCESS_public)
    9357              
    9358                      .dwendtag $C$DW$T$56
    9359              
    9360              $C$DW$T$273     .dwtag  DW_TAG_typedef
    9361                      .dwattr $C$DW$T$273, DW_AT_name("ST_VelCtl_t")
    9362                      .dwattr $C$DW$T$273, DW_AT_type(*$C$DW$T$56)
    9363                      .dwattr $C$DW$T$273, DW_AT_language(DW_LANG_C)
    9364              
    9365              
    9366              $C$DW$T$59      .dwtag  DW_TAG_structure_type
    9367                      .dwattr $C$DW$T$59, DW_AT_byte_size(0x0a)
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 14:01:10 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{05E34366-D316-4032-A5DC-F5883D36D03E} PAGE  184

    9368              $C$DW$977       .dwtag  DW_TAG_member
    9369                      .dwattr $C$DW$977, DW_AT_type(*$C$DW$T$49)
    9370                      .dwattr $C$DW$977, DW_AT_name("Axis")
    9371                      .dwattr $C$DW$977, DW_AT_TI_symbol_name("_Axis")
    9372                      .dwattr $C$DW$977, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9373                      .dwattr $C$DW$977, DW_AT_accessibility(DW_ACCESS_public)
    9374              
    9375              $C$DW$978       .dwtag  DW_TAG_member
    9376                      .dwattr $C$DW$978, DW_AT_type(*$C$DW$T$32)
    9377                      .dwattr $C$DW$978, DW_AT_name("T_sec")
    9378                      .dwattr $C$DW$978, DW_AT_TI_symbol_name("_T_sec")
    9379                      .dwattr $C$DW$978, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9380                      .dwattr $C$DW$978, DW_AT_accessibility(DW_ACCESS_public)
    9381              
    9382              $C$DW$979       .dwtag  DW_TAG_member
    9383                      .dwattr $C$DW$979, DW_AT_type(*$C$DW$T$52)
    9384                      .dwattr $C$DW$979, DW_AT_name("HaltJrkLim")
    9385                      .dwattr $C$DW$979, DW_AT_TI_symbol_name("_HaltJrkLim")
    9386                      .dwattr $C$DW$979, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9387                      .dwattr $C$DW$979, DW_AT_accessibility(DW_ACCESS_public)
    9388              
    9389              $C$DW$980       .dwtag  DW_TAG_member
    9390                      .dwattr $C$DW$980, DW_AT_type(*$C$DW$T$58)
    9391                      .dwattr $C$DW$980, DW_AT_name("CurveType")
    9392                      .dwattr $C$DW$980, DW_AT_TI_symbol_name("_CurveType")
    9393                      .dwattr $C$DW$980, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9394                      .dwattr $C$DW$980, DW_AT_accessibility(DW_ACCESS_public)
    9395              
    9396              $C$DW$981       .dwtag  DW_TAG_member
    9397                      .dwattr $C$DW$981, DW_AT_type(*$C$DW$T$32)
    9398                      .dwattr $C$DW$981, DW_AT_name("VelStart")
    9399                      .dwattr $C$DW$981, DW_AT_TI_symbol_name("_VelStart")
    9400                      .dwattr $C$DW$981, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9401                      .dwattr $C$DW$981, DW_AT_accessibility(DW_ACCESS_public)
    9402              
    9403                      .dwendtag $C$DW$T$59
    9404              
    9405              $C$DW$T$61      .dwtag  DW_TAG_typedef
    9406                      .dwattr $C$DW$T$61, DW_AT_name("ST_VelMoveCfg_t")
    9407                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$59)
    9408                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    9409              
    9410              
    9411              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    9412                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x06)
    9413              $C$DW$982       .dwtag  DW_TAG_member
    9414                      .dwattr $C$DW$982, DW_AT_type(*$C$DW$T$45)
    9415                      .dwattr $C$DW$982, DW_AT_name("ProTime_tick")
    9416                      .dwattr $C$DW$982, DW_AT_TI_symbol_name("_ProTime_tick")
    9417                      .dwattr $C$DW$982, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9418                      .dwattr $C$DW$982, DW_AT_accessibility(DW_ACCESS_public)
    9419              
    9420              $C$DW$983       .dwtag  DW_TAG_member
    9421                      .dwattr $C$DW$983, DW_AT_type(*$C$DW$T$32)
    9422                      .dwattr $C$DW$983, DW_AT_name("ActualAccLim")
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 14:01:10 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{05E34366-D316-4032-A5DC-F5883D36D03E} PAGE  185

    9423                      .dwattr $C$DW$983, DW_AT_TI_symbol_name("_ActualAccLim")
    9424                      .dwattr $C$DW$983, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9425                      .dwattr $C$DW$983, DW_AT_accessibility(DW_ACCESS_public)
    9426              
    9427              $C$DW$984       .dwtag  DW_TAG_member
    9428                      .dwattr $C$DW$984, DW_AT_type(*$C$DW$T$52)
    9429                      .dwattr $C$DW$984, DW_AT_name("ActualJrkLim")
    9430                      .dwattr $C$DW$984, DW_AT_TI_symbol_name("_ActualJrkLim")
    9431                      .dwattr $C$DW$984, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9432                      .dwattr $C$DW$984, DW_AT_accessibility(DW_ACCESS_public)
    9433              
    9434                      .dwendtag $C$DW$T$60
    9435              
    9436              $C$DW$T$62      .dwtag  DW_TAG_typedef
    9437                      .dwattr $C$DW$T$62, DW_AT_name("ST_VelMoveMsg_t")
    9438                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$60)
    9439                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    9440              
    9441              
    9442              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    9443                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x4e)
    9444              $C$DW$985       .dwtag  DW_TAG_member
    9445                      .dwattr $C$DW$985, DW_AT_type(*$C$DW$T$61)
    9446                      .dwattr $C$DW$985, DW_AT_name("cfg")
    9447                      .dwattr $C$DW$985, DW_AT_TI_symbol_name("_cfg")
    9448                      .dwattr $C$DW$985, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9449                      .dwattr $C$DW$985, DW_AT_accessibility(DW_ACCESS_public)
    9450              
    9451              $C$DW$986       .dwtag  DW_TAG_member
    9452                      .dwattr $C$DW$986, DW_AT_type(*$C$DW$T$62)
    9453                      .dwattr $C$DW$986, DW_AT_name("msg")
    9454                      .dwattr $C$DW$986, DW_AT_TI_symbol_name("_msg")
    9455                      .dwattr $C$DW$986, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9456                      .dwattr $C$DW$986, DW_AT_accessibility(DW_ACCESS_public)
    9457              
    9458              $C$DW$987       .dwtag  DW_TAG_member
    9459                      .dwattr $C$DW$987, DW_AT_type(*$C$DW$T$32)
    9460                      .dwattr $C$DW$987, DW_AT_name("VelEnd")
    9461                      .dwattr $C$DW$987, DW_AT_TI_symbol_name("_VelEnd")
    9462                      .dwattr $C$DW$987, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9463                      .dwattr $C$DW$987, DW_AT_accessibility(DW_ACCESS_public)
    9464              
    9465              $C$DW$988       .dwtag  DW_TAG_member
    9466                      .dwattr $C$DW$988, DW_AT_type(*$C$DW$T$32)
    9467                      .dwattr $C$DW$988, DW_AT_name("AccLim")
    9468                      .dwattr $C$DW$988, DW_AT_TI_symbol_name("_AccLim")
    9469                      .dwattr $C$DW$988, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9470                      .dwattr $C$DW$988, DW_AT_accessibility(DW_ACCESS_public)
    9471              
    9472              $C$DW$989       .dwtag  DW_TAG_member
    9473                      .dwattr $C$DW$989, DW_AT_type(*$C$DW$T$52)
    9474                      .dwattr $C$DW$989, DW_AT_name("JrkLim")
    9475                      .dwattr $C$DW$989, DW_AT_TI_symbol_name("_JrkLim")
    9476                      .dwattr $C$DW$989, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9477                      .dwattr $C$DW$989, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 14:01:10 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{05E34366-D316-4032-A5DC-F5883D36D03E} PAGE  186

    9478              
    9479              $C$DW$990       .dwtag  DW_TAG_member
    9480                      .dwattr $C$DW$990, DW_AT_type(*$C$DW$T$37)
    9481                      .dwattr $C$DW$990, DW_AT_name("ENB")
    9482                      .dwattr $C$DW$990, DW_AT_TI_symbol_name("_ENB")
    9483                      .dwattr $C$DW$990, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    9484                      .dwattr $C$DW$990, DW_AT_accessibility(DW_ACCESS_public)
    9485              
    9486              $C$DW$991       .dwtag  DW_TAG_member
    9487                      .dwattr $C$DW$991, DW_AT_type(*$C$DW$T$37)
    9488                      .dwattr $C$DW$991, DW_AT_name("TST")
    9489                      .dwattr $C$DW$991, DW_AT_TI_symbol_name("_TST")
    9490                      .dwattr $C$DW$991, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    9491                      .dwattr $C$DW$991, DW_AT_accessibility(DW_ACCESS_public)
    9492              
    9493              $C$DW$992       .dwtag  DW_TAG_member
    9494                      .dwattr $C$DW$992, DW_AT_type(*$C$DW$T$32)
    9495                      .dwattr $C$DW$992, DW_AT_name("VelRef")
    9496                      .dwattr $C$DW$992, DW_AT_TI_symbol_name("_VelRef")
    9497                      .dwattr $C$DW$992, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9498                      .dwattr $C$DW$992, DW_AT_accessibility(DW_ACCESS_public)
    9499              
    9500              $C$DW$993       .dwtag  DW_TAG_member
    9501                      .dwattr $C$DW$993, DW_AT_type(*$C$DW$T$32)
    9502                      .dwattr $C$DW$993, DW_AT_name("AccRef")
    9503                      .dwattr $C$DW$993, DW_AT_TI_symbol_name("_AccRef")
    9504                      .dwattr $C$DW$993, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9505                      .dwattr $C$DW$993, DW_AT_accessibility(DW_ACCESS_public)
    9506              
    9507              $C$DW$994       .dwtag  DW_TAG_member
    9508                      .dwattr $C$DW$994, DW_AT_type(*$C$DW$T$52)
    9509                      .dwattr $C$DW$994, DW_AT_name("JrkRef")
    9510                      .dwattr $C$DW$994, DW_AT_TI_symbol_name("_JrkRef")
    9511                      .dwattr $C$DW$994, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9512                      .dwattr $C$DW$994, DW_AT_accessibility(DW_ACCESS_public)
    9513              
    9514              $C$DW$995       .dwtag  DW_TAG_member
    9515                      .dwattr $C$DW$995, DW_AT_type(*$C$DW$T$64)
    9516                      .dwattr $C$DW$995, DW_AT_name("STATUS")
    9517                      .dwattr $C$DW$995, DW_AT_TI_symbol_name("_STATUS")
    9518                      .dwattr $C$DW$995, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    9519                      .dwattr $C$DW$995, DW_AT_accessibility(DW_ACCESS_public)
    9520              
    9521              $C$DW$996       .dwtag  DW_TAG_member
    9522                      .dwattr $C$DW$996, DW_AT_type(*$C$DW$T$43)
    9523                      .dwattr $C$DW$996, DW_AT_name("ERR_ID")
    9524                      .dwattr $C$DW$996, DW_AT_TI_symbol_name("_ERR_ID")
    9525                      .dwattr $C$DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    9526                      .dwattr $C$DW$996, DW_AT_accessibility(DW_ACCESS_public)
    9527              
    9528              $C$DW$997       .dwtag  DW_TAG_member
    9529                      .dwattr $C$DW$997, DW_AT_type(*$C$DW$T$65)
    9530                      .dwattr $C$DW$997, DW_AT_name("s1")
    9531                      .dwattr $C$DW$997, DW_AT_TI_symbol_name("_s1")
    9532                      .dwattr $C$DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 14:01:10 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{05E34366-D316-4032-A5DC-F5883D36D03E} PAGE  187

    9533                      .dwattr $C$DW$997, DW_AT_accessibility(DW_ACCESS_public)
    9534              
    9535                      .dwendtag $C$DW$T$66
    9536              
    9537              $C$DW$T$274     .dwtag  DW_TAG_typedef
    9538                      .dwattr $C$DW$T$274, DW_AT_name("ST_VelMove_t")
    9539                      .dwattr $C$DW$T$274, DW_AT_type(*$C$DW$T$66)
    9540                      .dwattr $C$DW$T$274, DW_AT_language(DW_LANG_C)
    9541              
    9542              
    9543              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    9544                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x02)
    9545              $C$DW$998       .dwtag  DW_TAG_member
    9546                      .dwattr $C$DW$998, DW_AT_type(*$C$DW$T$43)
    9547                      .dwattr $C$DW$998, DW_AT_name("ERR_idx")
    9548                      .dwattr $C$DW$998, DW_AT_TI_symbol_name("_ERR_idx")
    9549                      .dwattr $C$DW$998, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9550                      .dwattr $C$DW$998, DW_AT_accessibility(DW_ACCESS_public)
    9551              
    9552              $C$DW$999       .dwtag  DW_TAG_member
    9553                      .dwattr $C$DW$999, DW_AT_type(*$C$DW$T$43)
    9554                      .dwattr $C$DW$999, DW_AT_name("ERR_code")
    9555                      .dwattr $C$DW$999, DW_AT_TI_symbol_name("_ERR_code")
    9556                      .dwattr $C$DW$999, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9557                      .dwattr $C$DW$999, DW_AT_accessibility(DW_ACCESS_public)
    9558              
    9559                      .dwendtag $C$DW$T$67
    9560              
    9561              $C$DW$T$72      .dwtag  DW_TAG_typedef
    9562                      .dwattr $C$DW$T$72, DW_AT_name("ST_PlanError_t")
    9563                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$67)
    9564                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    9565              
    9566              
    9567              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    9568                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x46)
    9569              $C$DW$1000      .dwtag  DW_TAG_member
    9570                      .dwattr $C$DW$1000, DW_AT_type(*$C$DW$T$37)
    9571                      .dwattr $C$DW$1000, DW_AT_name("ENB")
    9572                      .dwattr $C$DW$1000, DW_AT_TI_symbol_name("_ENB")
    9573                      .dwattr $C$DW$1000, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9574                      .dwattr $C$DW$1000, DW_AT_accessibility(DW_ACCESS_public)
    9575              
    9576              $C$DW$1001      .dwtag  DW_TAG_member
    9577                      .dwattr $C$DW$1001, DW_AT_type(*$C$DW$T$37)
    9578                      .dwattr $C$DW$1001, DW_AT_name("RES")
    9579                      .dwattr $C$DW$1001, DW_AT_TI_symbol_name("_RES")
    9580                      .dwattr $C$DW$1001, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9581                      .dwattr $C$DW$1001, DW_AT_accessibility(DW_ACCESS_public)
    9582              
    9583              $C$DW$1002      .dwtag  DW_TAG_member
    9584                      .dwattr $C$DW$1002, DW_AT_type(*$C$DW$T$32)
    9585                      .dwattr $C$DW$1002, DW_AT_name("VelEnd")
    9586                      .dwattr $C$DW$1002, DW_AT_TI_symbol_name("_VelEnd")
    9587                      .dwattr $C$DW$1002, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 14:01:10 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{05E34366-D316-4032-A5DC-F5883D36D03E} PAGE  188

    9588                      .dwattr $C$DW$1002, DW_AT_accessibility(DW_ACCESS_public)
    9589              
    9590              $C$DW$1003      .dwtag  DW_TAG_member
    9591                      .dwattr $C$DW$1003, DW_AT_type(*$C$DW$T$32)
    9592                      .dwattr $C$DW$1003, DW_AT_name("AccLim")
    9593                      .dwattr $C$DW$1003, DW_AT_TI_symbol_name("_AccLim")
    9594                      .dwattr $C$DW$1003, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9595                      .dwattr $C$DW$1003, DW_AT_accessibility(DW_ACCESS_public)
    9596              
    9597              $C$DW$1004      .dwtag  DW_TAG_member
    9598                      .dwattr $C$DW$1004, DW_AT_type(*$C$DW$T$52)
    9599                      .dwattr $C$DW$1004, DW_AT_name("JrkLim")
    9600                      .dwattr $C$DW$1004, DW_AT_TI_symbol_name("_JrkLim")
    9601                      .dwattr $C$DW$1004, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9602                      .dwattr $C$DW$1004, DW_AT_accessibility(DW_ACCESS_public)
    9603              
    9604              $C$DW$1005      .dwtag  DW_TAG_member
    9605                      .dwattr $C$DW$1005, DW_AT_type(*$C$DW$T$69)
    9606                      .dwattr $C$DW$1005, DW_AT_name("STATUS")
    9607                      .dwattr $C$DW$1005, DW_AT_TI_symbol_name("_STATUS")
    9608                      .dwattr $C$DW$1005, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9609                      .dwattr $C$DW$1005, DW_AT_accessibility(DW_ACCESS_public)
    9610              
    9611              $C$DW$1006      .dwtag  DW_TAG_member
    9612                      .dwattr $C$DW$1006, DW_AT_type(*$C$DW$T$43)
    9613                      .dwattr $C$DW$1006, DW_AT_name("CurState")
    9614                      .dwattr $C$DW$1006, DW_AT_TI_symbol_name("_CurState")
    9615                      .dwattr $C$DW$1006, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    9616                      .dwattr $C$DW$1006, DW_AT_accessibility(DW_ACCESS_public)
    9617              
    9618              $C$DW$1007      .dwtag  DW_TAG_member
    9619                      .dwattr $C$DW$1007, DW_AT_type(*$C$DW$T$43)
    9620                      .dwattr $C$DW$1007, DW_AT_name("CurTran")
    9621                      .dwattr $C$DW$1007, DW_AT_TI_symbol_name("_CurTran")
    9622                      .dwattr $C$DW$1007, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9623                      .dwattr $C$DW$1007, DW_AT_accessibility(DW_ACCESS_public)
    9624              
    9625              $C$DW$1008      .dwtag  DW_TAG_member
    9626                      .dwattr $C$DW$1008, DW_AT_type(*$C$DW$T$71)
    9627                      .dwattr $C$DW$1008, DW_AT_name("FsmState")
    9628                      .dwattr $C$DW$1008, DW_AT_TI_symbol_name("_FsmState")
    9629                      .dwattr $C$DW$1008, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    9630                      .dwattr $C$DW$1008, DW_AT_accessibility(DW_ACCESS_public)
    9631              
    9632              $C$DW$1009      .dwtag  DW_TAG_member
    9633                      .dwattr $C$DW$1009, DW_AT_type(*$C$DW$T$39)
    9634                      .dwattr $C$DW$1009, DW_AT_name("Timer_tick")
    9635                      .dwattr $C$DW$1009, DW_AT_TI_symbol_name("_Timer_tick")
    9636                      .dwattr $C$DW$1009, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9637                      .dwattr $C$DW$1009, DW_AT_accessibility(DW_ACCESS_public)
    9638              
    9639              $C$DW$1010      .dwtag  DW_TAG_member
    9640                      .dwattr $C$DW$1010, DW_AT_type(*$C$DW$T$43)
    9641                      .dwattr $C$DW$1010, DW_AT_name("ERR_ID")
    9642                      .dwattr $C$DW$1010, DW_AT_TI_symbol_name("_ERR_ID")
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 14:01:10 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{05E34366-D316-4032-A5DC-F5883D36D03E} PAGE  189

    9643                      .dwattr $C$DW$1010, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9644                      .dwattr $C$DW$1010, DW_AT_accessibility(DW_ACCESS_public)
    9645              
    9646              $C$DW$1011      .dwtag  DW_TAG_member
    9647                      .dwattr $C$DW$1011, DW_AT_type(*$C$DW$T$72)
    9648                      .dwattr $C$DW$1011, DW_AT_name("CfgError")
    9649                      .dwattr $C$DW$1011, DW_AT_TI_symbol_name("_CfgError")
    9650                      .dwattr $C$DW$1011, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    9651                      .dwattr $C$DW$1011, DW_AT_accessibility(DW_ACCESS_public)
    9652              
    9653              $C$DW$1012      .dwtag  DW_TAG_member
    9654                      .dwattr $C$DW$1012, DW_AT_type(*$C$DW$T$73)
    9655                      .dwattr $C$DW$1012, DW_AT_name("s0")
    9656                      .dwattr $C$DW$1012, DW_AT_TI_symbol_name("_s0")
    9657                      .dwattr $C$DW$1012, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9658                      .dwattr $C$DW$1012, DW_AT_accessibility(DW_ACCESS_public)
    9659              
    9660                      .dwendtag $C$DW$T$74
    9661              
    9662              $C$DW$T$275     .dwtag  DW_TAG_typedef
    9663                      .dwattr $C$DW$T$275, DW_AT_name("ST_VelPlan_t")
    9664                      .dwattr $C$DW$T$275, DW_AT_type(*$C$DW$T$74)
    9665                      .dwattr $C$DW$T$275, DW_AT_language(DW_LANG_C)
    9666              
    9667              
    9668              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    9669                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x0e)
    9670              $C$DW$1013      .dwtag  DW_TAG_member
    9671                      .dwattr $C$DW$1013, DW_AT_type(*$C$DW$T$32)
    9672                      .dwattr $C$DW$1013, DW_AT_name("T_sec")
    9673                      .dwattr $C$DW$1013, DW_AT_TI_symbol_name("_T_sec")
    9674                      .dwattr $C$DW$1013, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9675                      .dwattr $C$DW$1013, DW_AT_accessibility(DW_ACCESS_public)
    9676              
    9677              $C$DW$1014      .dwtag  DW_TAG_member
    9678                      .dwattr $C$DW$1014, DW_AT_type(*$C$DW$T$34)
    9679                      .dwattr $C$DW$1014, DW_AT_name("LpfTime_tick")
    9680                      .dwattr $C$DW$1014, DW_AT_TI_symbol_name("_LpfTime_tick")
    9681                      .dwattr $C$DW$1014, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9682                      .dwattr $C$DW$1014, DW_AT_accessibility(DW_ACCESS_public)
    9683              
    9684              $C$DW$1015      .dwtag  DW_TAG_member
    9685                      .dwattr $C$DW$1015, DW_AT_type(*$C$DW$T$32)
    9686                      .dwattr $C$DW$1015, DW_AT_name("TimeOut_sec")
    9687                      .dwattr $C$DW$1015, DW_AT_TI_symbol_name("_TimeOut_sec")
    9688                      .dwattr $C$DW$1015, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9689                      .dwattr $C$DW$1015, DW_AT_accessibility(DW_ACCESS_public)
    9690              
    9691              $C$DW$1016      .dwtag  DW_TAG_member
    9692                      .dwattr $C$DW$1016, DW_AT_type(*$C$DW$T$32)
    9693                      .dwattr $C$DW$1016, DW_AT_name("GoalSpeed")
    9694                      .dwattr $C$DW$1016, DW_AT_TI_symbol_name("_GoalSpeed")
    9695                      .dwattr $C$DW$1016, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9696                      .dwattr $C$DW$1016, DW_AT_accessibility(DW_ACCESS_public)
    9697              
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 14:01:10 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{05E34366-D316-4032-A5DC-F5883D36D03E} PAGE  190

    9698              $C$DW$1017      .dwtag  DW_TAG_member
    9699                      .dwattr $C$DW$1017, DW_AT_type(*$C$DW$T$32)
    9700                      .dwattr $C$DW$1017, DW_AT_name("OutMax")
    9701                      .dwattr $C$DW$1017, DW_AT_TI_symbol_name("_OutMax")
    9702                      .dwattr $C$DW$1017, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9703                      .dwattr $C$DW$1017, DW_AT_accessibility(DW_ACCESS_public)
    9704              
    9705              $C$DW$1018      .dwtag  DW_TAG_member
    9706                      .dwattr $C$DW$1018, DW_AT_type(*$C$DW$T$32)
    9707                      .dwattr $C$DW$1018, DW_AT_name("RampTime_sec")
    9708                      .dwattr $C$DW$1018, DW_AT_TI_symbol_name("_RampTime_sec")
    9709                      .dwattr $C$DW$1018, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9710                      .dwattr $C$DW$1018, DW_AT_accessibility(DW_ACCESS_public)
    9711              
    9712              $C$DW$1019      .dwtag  DW_TAG_member
    9713                      .dwattr $C$DW$1019, DW_AT_type(*$C$DW$T$37)
    9714                      .dwattr $C$DW$1019, DW_AT_name("Sensorless")
    9715                      .dwattr $C$DW$1019, DW_AT_TI_symbol_name("_Sensorless")
    9716                      .dwattr $C$DW$1019, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9717                      .dwattr $C$DW$1019, DW_AT_accessibility(DW_ACCESS_public)
    9718              
    9719                      .dwendtag $C$DW$T$75
    9720              
    9721              $C$DW$T$76      .dwtag  DW_TAG_typedef
    9722                      .dwattr $C$DW$T$76, DW_AT_name("ST_VelIdCfg_t")
    9723                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    9724                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    9725              
    9726              
    9727              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    9728                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x2c)
    9729              $C$DW$1020      .dwtag  DW_TAG_member
    9730                      .dwattr $C$DW$1020, DW_AT_type(*$C$DW$T$76)
    9731                      .dwattr $C$DW$1020, DW_AT_name("cfg")
    9732                      .dwattr $C$DW$1020, DW_AT_TI_symbol_name("_cfg")
    9733                      .dwattr $C$DW$1020, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9734                      .dwattr $C$DW$1020, DW_AT_accessibility(DW_ACCESS_public)
    9735              
    9736              $C$DW$1021      .dwtag  DW_TAG_member
    9737                      .dwattr $C$DW$1021, DW_AT_type(*$C$DW$T$32)
    9738                      .dwattr $C$DW$1021, DW_AT_name("VelFdb")
    9739                      .dwattr $C$DW$1021, DW_AT_TI_symbol_name("_VelFdb")
    9740                      .dwattr $C$DW$1021, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9741                      .dwattr $C$DW$1021, DW_AT_accessibility(DW_ACCESS_public)
    9742              
    9743              $C$DW$1022      .dwtag  DW_TAG_member
    9744                      .dwattr $C$DW$1022, DW_AT_type(*$C$DW$T$37)
    9745                      .dwattr $C$DW$1022, DW_AT_name("ENB")
    9746                      .dwattr $C$DW$1022, DW_AT_TI_symbol_name("_ENB")
    9747                      .dwattr $C$DW$1022, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9748                      .dwattr $C$DW$1022, DW_AT_accessibility(DW_ACCESS_public)
    9749              
    9750              $C$DW$1023      .dwtag  DW_TAG_member
    9751                      .dwattr $C$DW$1023, DW_AT_type(*$C$DW$T$32)
    9752                      .dwattr $C$DW$1023, DW_AT_name("Out")
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 14:01:10 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{05E34366-D316-4032-A5DC-F5883D36D03E} PAGE  191

    9753                      .dwattr $C$DW$1023, DW_AT_TI_symbol_name("_Out")
    9754                      .dwattr $C$DW$1023, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9755                      .dwattr $C$DW$1023, DW_AT_accessibility(DW_ACCESS_public)
    9756              
    9757              $C$DW$1024      .dwtag  DW_TAG_member
    9758                      .dwattr $C$DW$1024, DW_AT_type(*$C$DW$T$32)
    9759                      .dwattr $C$DW$1024, DW_AT_name("InertiaEst")
    9760                      .dwattr $C$DW$1024, DW_AT_TI_symbol_name("_InertiaEst")
    9761                      .dwattr $C$DW$1024, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9762                      .dwattr $C$DW$1024, DW_AT_accessibility(DW_ACCESS_public)
    9763              
    9764              $C$DW$1025      .dwtag  DW_TAG_member
    9765                      .dwattr $C$DW$1025, DW_AT_type(*$C$DW$T$32)
    9766                      .dwattr $C$DW$1025, DW_AT_name("FrictionEst")
    9767                      .dwattr $C$DW$1025, DW_AT_TI_symbol_name("_FrictionEst")
    9768                      .dwattr $C$DW$1025, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    9769                      .dwattr $C$DW$1025, DW_AT_accessibility(DW_ACCESS_public)
    9770              
    9771              $C$DW$1026      .dwtag  DW_TAG_member
    9772                      .dwattr $C$DW$1026, DW_AT_type(*$C$DW$T$78)
    9773                      .dwattr $C$DW$1026, DW_AT_name("STATUS")
    9774                      .dwattr $C$DW$1026, DW_AT_TI_symbol_name("_STATUS")
    9775                      .dwattr $C$DW$1026, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9776                      .dwattr $C$DW$1026, DW_AT_accessibility(DW_ACCESS_public)
    9777              
    9778              $C$DW$1027      .dwtag  DW_TAG_member
    9779                      .dwattr $C$DW$1027, DW_AT_type(*$C$DW$T$43)
    9780                      .dwattr $C$DW$1027, DW_AT_name("ERR_ID")
    9781                      .dwattr $C$DW$1027, DW_AT_TI_symbol_name("_ERR_ID")
    9782                      .dwattr $C$DW$1027, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    9783                      .dwattr $C$DW$1027, DW_AT_accessibility(DW_ACCESS_public)
    9784              
    9785              $C$DW$1028      .dwtag  DW_TAG_member
    9786                      .dwattr $C$DW$1028, DW_AT_type(*$C$DW$T$79)
    9787                      .dwattr $C$DW$1028, DW_AT_name("s0")
    9788                      .dwattr $C$DW$1028, DW_AT_TI_symbol_name("_s0")
    9789                      .dwattr $C$DW$1028, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9790                      .dwattr $C$DW$1028, DW_AT_accessibility(DW_ACCESS_public)
    9791              
    9792                      .dwendtag $C$DW$T$80
    9793              
    9794              $C$DW$T$276     .dwtag  DW_TAG_typedef
    9795                      .dwattr $C$DW$T$276, DW_AT_name("ST_VelId_t")
    9796                      .dwattr $C$DW$T$276, DW_AT_type(*$C$DW$T$80)
    9797                      .dwattr $C$DW$T$276, DW_AT_language(DW_LANG_C)
    9798              
    9799              
    9800              $C$DW$T$86      .dwtag  DW_TAG_structure_type
    9801                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x12)
    9802              $C$DW$1029      .dwtag  DW_TAG_member
    9803                      .dwattr $C$DW$1029, DW_AT_type(*$C$DW$T$43)
    9804                      .dwattr $C$DW$1029, DW_AT_name("Major")
    9805                      .dwattr $C$DW$1029, DW_AT_TI_symbol_name("_Major")
    9806                      .dwattr $C$DW$1029, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9807                      .dwattr $C$DW$1029, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 14:01:10 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{05E34366-D316-4032-A5DC-F5883D36D03E} PAGE  192

    9808              
    9809              $C$DW$1030      .dwtag  DW_TAG_member
    9810                      .dwattr $C$DW$1030, DW_AT_type(*$C$DW$T$43)
    9811                      .dwattr $C$DW$1030, DW_AT_name("Minor")
    9812                      .dwattr $C$DW$1030, DW_AT_TI_symbol_name("_Minor")
    9813                      .dwattr $C$DW$1030, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9814                      .dwattr $C$DW$1030, DW_AT_accessibility(DW_ACCESS_public)
    9815              
    9816              $C$DW$1031      .dwtag  DW_TAG_member
    9817                      .dwattr $C$DW$1031, DW_AT_type(*$C$DW$T$43)
    9818                      .dwattr $C$DW$1031, DW_AT_name("Revision")
    9819                      .dwattr $C$DW$1031, DW_AT_TI_symbol_name("_Revision")
    9820                      .dwattr $C$DW$1031, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9821                      .dwattr $C$DW$1031, DW_AT_accessibility(DW_ACCESS_public)
    9822              
    9823              $C$DW$1032      .dwtag  DW_TAG_member
    9824                      .dwattr $C$DW$1032, DW_AT_type(*$C$DW$T$82)
    9825                      .dwattr $C$DW$1032, DW_AT_name("MathType")
    9826                      .dwattr $C$DW$1032, DW_AT_TI_symbol_name("_MathType")
    9827                      .dwattr $C$DW$1032, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9828                      .dwattr $C$DW$1032, DW_AT_accessibility(DW_ACCESS_public)
    9829              
    9830              $C$DW$1033      .dwtag  DW_TAG_member
    9831                      .dwattr $C$DW$1033, DW_AT_type(*$C$DW$T$45)
    9832                      .dwattr $C$DW$1033, DW_AT_name("SecureROM")
    9833                      .dwattr $C$DW$1033, DW_AT_TI_symbol_name("_SecureROM")
    9834                      .dwattr $C$DW$1033, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9835                      .dwattr $C$DW$1033, DW_AT_accessibility(DW_ACCESS_public)
    9836              
    9837              $C$DW$1034      .dwtag  DW_TAG_member
    9838                      .dwattr $C$DW$1034, DW_AT_type(*$C$DW$T$39)
    9839                      .dwattr $C$DW$1034, DW_AT_name("Date")
    9840                      .dwattr $C$DW$1034, DW_AT_TI_symbol_name("_Date")
    9841                      .dwattr $C$DW$1034, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9842                      .dwattr $C$DW$1034, DW_AT_accessibility(DW_ACCESS_public)
    9843              
    9844              $C$DW$1035      .dwtag  DW_TAG_member
    9845                      .dwattr $C$DW$1035, DW_AT_type(*$C$DW$T$85)
    9846                      .dwattr $C$DW$1035, DW_AT_name("Label")
    9847                      .dwattr $C$DW$1035, DW_AT_TI_symbol_name("_Label")
    9848                      .dwattr $C$DW$1035, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9849                      .dwattr $C$DW$1035, DW_AT_accessibility(DW_ACCESS_public)
    9850              
    9851                      .dwendtag $C$DW$T$86
    9852              
    9853              $C$DW$T$251     .dwtag  DW_TAG_typedef
    9854                      .dwattr $C$DW$T$251, DW_AT_name("ST_Ver_t")
    9855                      .dwattr $C$DW$T$251, DW_AT_type(*$C$DW$T$86)
    9856                      .dwattr $C$DW$T$251, DW_AT_language(DW_LANG_C)
    9857              
    9858              
    9859              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    9860                      .dwattr $C$DW$T$19, DW_AT_name("IPD_HFI_Obj")
    9861                      .dwattr $C$DW$T$19, DW_AT_declaration
    9862                      .dwendtag $C$DW$T$19
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 14:01:10 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{05E34366-D316-4032-A5DC-F5883D36D03E} PAGE  193

    9863              
    9864              $C$DW$T$306     .dwtag  DW_TAG_pointer_type
    9865                      .dwattr $C$DW$T$306, DW_AT_type(*$C$DW$T$19)
    9866                      .dwattr $C$DW$T$306, DW_AT_address_class(0x20)
    9867              
    9868              $C$DW$T$307     .dwtag  DW_TAG_typedef
    9869                      .dwattr $C$DW$T$307, DW_AT_name("IPD_HFI_Handle")
    9870                      .dwattr $C$DW$T$307, DW_AT_type(*$C$DW$T$306)
    9871                      .dwattr $C$DW$T$307, DW_AT_language(DW_LANG_C)
    9872              
    9873              
    9874              $C$DW$T$94      .dwtag  DW_TAG_structure_type
    9875                      .dwattr $C$DW$T$94, DW_AT_name("_ADC_Obj_")
    9876                      .dwattr $C$DW$T$94, DW_AT_byte_size(0x6650)
    9877              $C$DW$1036      .dwtag  DW_TAG_member
    9878                      .dwattr $C$DW$1036, DW_AT_type(*$C$DW$T$88)
    9879                      .dwattr $C$DW$1036, DW_AT_name("ADCRESULT")
    9880                      .dwattr $C$DW$1036, DW_AT_TI_symbol_name("_ADCRESULT")
    9881                      .dwattr $C$DW$1036, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9882                      .dwattr $C$DW$1036, DW_AT_accessibility(DW_ACCESS_public)
    9883              
    9884              $C$DW$1037      .dwtag  DW_TAG_member
    9885                      .dwattr $C$DW$1037, DW_AT_type(*$C$DW$T$89)
    9886                      .dwattr $C$DW$1037, DW_AT_name("resvd_1")
    9887                      .dwattr $C$DW$1037, DW_AT_TI_symbol_name("_resvd_1")
    9888                      .dwattr $C$DW$1037, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9889                      .dwattr $C$DW$1037, DW_AT_accessibility(DW_ACCESS_public)
    9890              
    9891              $C$DW$1038      .dwtag  DW_TAG_member
    9892                      .dwattr $C$DW$1038, DW_AT_type(*$C$DW$T$87)
    9893                      .dwattr $C$DW$1038, DW_AT_name("ADCCTL1")
    9894                      .dwattr $C$DW$1038, DW_AT_TI_symbol_name("_ADCCTL1")
    9895                      .dwattr $C$DW$1038, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    9896                      .dwattr $C$DW$1038, DW_AT_accessibility(DW_ACCESS_public)
    9897              
    9898              $C$DW$1039      .dwtag  DW_TAG_member
    9899                      .dwattr $C$DW$1039, DW_AT_type(*$C$DW$T$87)
    9900                      .dwattr $C$DW$1039, DW_AT_name("ADCCTL2")
    9901                      .dwattr $C$DW$1039, DW_AT_TI_symbol_name("_ADCCTL2")
    9902                      .dwattr $C$DW$1039, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    9903                      .dwattr $C$DW$1039, DW_AT_accessibility(DW_ACCESS_public)
    9904              
    9905              $C$DW$1040      .dwtag  DW_TAG_member
    9906                      .dwattr $C$DW$1040, DW_AT_type(*$C$DW$T$90)
    9907                      .dwattr $C$DW$1040, DW_AT_name("rsvd_2")
    9908                      .dwattr $C$DW$1040, DW_AT_TI_symbol_name("_rsvd_2")
    9909                      .dwattr $C$DW$1040, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    9910                      .dwattr $C$DW$1040, DW_AT_accessibility(DW_ACCESS_public)
    9911              
    9912              $C$DW$1041      .dwtag  DW_TAG_member
    9913                      .dwattr $C$DW$1041, DW_AT_type(*$C$DW$T$87)
    9914                      .dwattr $C$DW$1041, DW_AT_name("ADCINTFLG")
    9915                      .dwattr $C$DW$1041, DW_AT_TI_symbol_name("_ADCINTFLG")
    9916                      .dwattr $C$DW$1041, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    9917                      .dwattr $C$DW$1041, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 14:01:10 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{05E34366-D316-4032-A5DC-F5883D36D03E} PAGE  194

    9918              
    9919              $C$DW$1042      .dwtag  DW_TAG_member
    9920                      .dwattr $C$DW$1042, DW_AT_type(*$C$DW$T$87)
    9921                      .dwattr $C$DW$1042, DW_AT_name("ADCINTFLGCLR")
    9922                      .dwattr $C$DW$1042, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    9923                      .dwattr $C$DW$1042, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    9924                      .dwattr $C$DW$1042, DW_AT_accessibility(DW_ACCESS_public)
    9925              
    9926              $C$DW$1043      .dwtag  DW_TAG_member
    9927                      .dwattr $C$DW$1043, DW_AT_type(*$C$DW$T$87)
    9928                      .dwattr $C$DW$1043, DW_AT_name("ADCINTOVF")
    9929                      .dwattr $C$DW$1043, DW_AT_TI_symbol_name("_ADCINTOVF")
    9930                      .dwattr $C$DW$1043, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    9931                      .dwattr $C$DW$1043, DW_AT_accessibility(DW_ACCESS_public)
    9932              
    9933              $C$DW$1044      .dwtag  DW_TAG_member
    9934                      .dwattr $C$DW$1044, DW_AT_type(*$C$DW$T$87)
    9935                      .dwattr $C$DW$1044, DW_AT_name("ADCINTOVFCLR")
    9936                      .dwattr $C$DW$1044, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    9937                      .dwattr $C$DW$1044, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    9938                      .dwattr $C$DW$1044, DW_AT_accessibility(DW_ACCESS_public)
    9939              
    9940              $C$DW$1045      .dwtag  DW_TAG_member
    9941                      .dwattr $C$DW$1045, DW_AT_type(*$C$DW$T$91)
    9942                      .dwattr $C$DW$1045, DW_AT_name("INTSELxNy")
    9943                      .dwattr $C$DW$1045, DW_AT_TI_symbol_name("_INTSELxNy")
    9944                      .dwattr $C$DW$1045, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    9945                      .dwattr $C$DW$1045, DW_AT_accessibility(DW_ACCESS_public)
    9946              
    9947              $C$DW$1046      .dwtag  DW_TAG_member
    9948                      .dwattr $C$DW$1046, DW_AT_type(*$C$DW$T$92)
    9949                      .dwattr $C$DW$1046, DW_AT_name("rsvd_3")
    9950                      .dwattr $C$DW$1046, DW_AT_TI_symbol_name("_rsvd_3")
    9951                      .dwattr $C$DW$1046, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    9952                      .dwattr $C$DW$1046, DW_AT_accessibility(DW_ACCESS_public)
    9953              
    9954              $C$DW$1047      .dwtag  DW_TAG_member
    9955                      .dwattr $C$DW$1047, DW_AT_type(*$C$DW$T$87)
    9956                      .dwattr $C$DW$1047, DW_AT_name("SOCPRICTRL")
    9957                      .dwattr $C$DW$1047, DW_AT_TI_symbol_name("_SOCPRICTRL")
    9958                      .dwattr $C$DW$1047, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    9959                      .dwattr $C$DW$1047, DW_AT_accessibility(DW_ACCESS_public)
    9960              
    9961              $C$DW$1048      .dwtag  DW_TAG_member
    9962                      .dwattr $C$DW$1048, DW_AT_type(*$C$DW$T$87)
    9963                      .dwattr $C$DW$1048, DW_AT_name("rsvd_4")
    9964                      .dwattr $C$DW$1048, DW_AT_TI_symbol_name("_rsvd_4")
    9965                      .dwattr $C$DW$1048, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    9966                      .dwattr $C$DW$1048, DW_AT_accessibility(DW_ACCESS_public)
    9967              
    9968              $C$DW$1049      .dwtag  DW_TAG_member
    9969                      .dwattr $C$DW$1049, DW_AT_type(*$C$DW$T$87)
    9970                      .dwattr $C$DW$1049, DW_AT_name("ADCSAMPLEMODE")
    9971                      .dwattr $C$DW$1049, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    9972                      .dwattr $C$DW$1049, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 14:01:10 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{05E34366-D316-4032-A5DC-F5883D36D03E} PAGE  195

    9973                      .dwattr $C$DW$1049, DW_AT_accessibility(DW_ACCESS_public)
    9974              
    9975              $C$DW$1050      .dwtag  DW_TAG_member
    9976                      .dwattr $C$DW$1050, DW_AT_type(*$C$DW$T$87)
    9977                      .dwattr $C$DW$1050, DW_AT_name("rsvd_5")
    9978                      .dwattr $C$DW$1050, DW_AT_TI_symbol_name("_rsvd_5")
    9979                      .dwattr $C$DW$1050, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    9980                      .dwattr $C$DW$1050, DW_AT_accessibility(DW_ACCESS_public)
    9981              
    9982              $C$DW$1051      .dwtag  DW_TAG_member
    9983                      .dwattr $C$DW$1051, DW_AT_type(*$C$DW$T$87)
    9984                      .dwattr $C$DW$1051, DW_AT_name("ADCINTSOCSEL1")
    9985                      .dwattr $C$DW$1051, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    9986                      .dwattr $C$DW$1051, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    9987                      .dwattr $C$DW$1051, DW_AT_accessibility(DW_ACCESS_public)
    9988              
    9989              $C$DW$1052      .dwtag  DW_TAG_member
    9990                      .dwattr $C$DW$1052, DW_AT_type(*$C$DW$T$87)
    9991                      .dwattr $C$DW$1052, DW_AT_name("ADCINTSOCSEL2")
    9992                      .dwattr $C$DW$1052, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    9993                      .dwattr $C$DW$1052, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    9994                      .dwattr $C$DW$1052, DW_AT_accessibility(DW_ACCESS_public)
    9995              
    9996              $C$DW$1053      .dwtag  DW_TAG_member
    9997                      .dwattr $C$DW$1053, DW_AT_type(*$C$DW$T$90)
    9998                      .dwattr $C$DW$1053, DW_AT_name("rsvd_6")
    9999                      .dwattr $C$DW$1053, DW_AT_TI_symbol_name("_rsvd_6")
   10000                      .dwattr $C$DW$1053, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
   10001                      .dwattr $C$DW$1053, DW_AT_accessibility(DW_ACCESS_public)
   10002              
   10003              $C$DW$1054      .dwtag  DW_TAG_member
   10004                      .dwattr $C$DW$1054, DW_AT_type(*$C$DW$T$87)
   10005                      .dwattr $C$DW$1054, DW_AT_name("ADCSOCFLG1")
   10006                      .dwattr $C$DW$1054, DW_AT_TI_symbol_name("_ADCSOCFLG1")
   10007                      .dwattr $C$DW$1054, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
   10008                      .dwattr $C$DW$1054, DW_AT_accessibility(DW_ACCESS_public)
   10009              
   10010              $C$DW$1055      .dwtag  DW_TAG_member
   10011                      .dwattr $C$DW$1055, DW_AT_type(*$C$DW$T$87)
   10012                      .dwattr $C$DW$1055, DW_AT_name("rsvd_7")
   10013                      .dwattr $C$DW$1055, DW_AT_TI_symbol_name("_rsvd_7")
   10014                      .dwattr $C$DW$1055, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   10015                      .dwattr $C$DW$1055, DW_AT_accessibility(DW_ACCESS_public)
   10016              
   10017              $C$DW$1056      .dwtag  DW_TAG_member
   10018                      .dwattr $C$DW$1056, DW_AT_type(*$C$DW$T$87)
   10019                      .dwattr $C$DW$1056, DW_AT_name("ADCSOCFRC1")
   10020                      .dwattr $C$DW$1056, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   10021                      .dwattr $C$DW$1056, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   10022                      .dwattr $C$DW$1056, DW_AT_accessibility(DW_ACCESS_public)
   10023              
   10024              $C$DW$1057      .dwtag  DW_TAG_member
   10025                      .dwattr $C$DW$1057, DW_AT_type(*$C$DW$T$87)
   10026                      .dwattr $C$DW$1057, DW_AT_name("rsvd_8")
   10027                      .dwattr $C$DW$1057, DW_AT_TI_symbol_name("_rsvd_8")
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 14:01:10 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{05E34366-D316-4032-A5DC-F5883D36D03E} PAGE  196

   10028                      .dwattr $C$DW$1057, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   10029                      .dwattr $C$DW$1057, DW_AT_accessibility(DW_ACCESS_public)
   10030              
   10031              $C$DW$1058      .dwtag  DW_TAG_member
   10032                      .dwattr $C$DW$1058, DW_AT_type(*$C$DW$T$87)
   10033                      .dwattr $C$DW$1058, DW_AT_name("ADCSOCOVF1")
   10034                      .dwattr $C$DW$1058, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   10035                      .dwattr $C$DW$1058, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   10036                      .dwattr $C$DW$1058, DW_AT_accessibility(DW_ACCESS_public)
   10037              
   10038              $C$DW$1059      .dwtag  DW_TAG_member
   10039                      .dwattr $C$DW$1059, DW_AT_type(*$C$DW$T$87)
   10040                      .dwattr $C$DW$1059, DW_AT_name("rsvd_9")
   10041                      .dwattr $C$DW$1059, DW_AT_TI_symbol_name("_rsvd_9")
   10042                      .dwattr $C$DW$1059, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
   10043                      .dwattr $C$DW$1059, DW_AT_accessibility(DW_ACCESS_public)
   10044              
   10045              $C$DW$1060      .dwtag  DW_TAG_member
   10046                      .dwattr $C$DW$1060, DW_AT_type(*$C$DW$T$87)
   10047                      .dwattr $C$DW$1060, DW_AT_name("ADCSOCOVFCLR1")
   10048                      .dwattr $C$DW$1060, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
   10049                      .dwattr $C$DW$1060, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
   10050                      .dwattr $C$DW$1060, DW_AT_accessibility(DW_ACCESS_public)
   10051              
   10052              $C$DW$1061      .dwtag  DW_TAG_member
   10053                      .dwattr $C$DW$1061, DW_AT_type(*$C$DW$T$87)
   10054                      .dwattr $C$DW$1061, DW_AT_name("rsvd_10")
   10055                      .dwattr $C$DW$1061, DW_AT_TI_symbol_name("_rsvd_10")
   10056                      .dwattr $C$DW$1061, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   10057                      .dwattr $C$DW$1061, DW_AT_accessibility(DW_ACCESS_public)
   10058              
   10059              $C$DW$1062      .dwtag  DW_TAG_member
   10060                      .dwattr $C$DW$1062, DW_AT_type(*$C$DW$T$88)
   10061                      .dwattr $C$DW$1062, DW_AT_name("ADCSOCxCTL")
   10062                      .dwattr $C$DW$1062, DW_AT_TI_symbol_name("_ADCSOCxCTL")
   10063                      .dwattr $C$DW$1062, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   10064                      .dwattr $C$DW$1062, DW_AT_accessibility(DW_ACCESS_public)
   10065              
   10066              $C$DW$1063      .dwtag  DW_TAG_member
   10067                      .dwattr $C$DW$1063, DW_AT_type(*$C$DW$T$88)
   10068                      .dwattr $C$DW$1063, DW_AT_name("rsvd_11")
   10069                      .dwattr $C$DW$1063, DW_AT_TI_symbol_name("_rsvd_11")
   10070                      .dwattr $C$DW$1063, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   10071                      .dwattr $C$DW$1063, DW_AT_accessibility(DW_ACCESS_public)
   10072              
   10073              $C$DW$1064      .dwtag  DW_TAG_member
   10074                      .dwattr $C$DW$1064, DW_AT_type(*$C$DW$T$87)
   10075                      .dwattr $C$DW$1064, DW_AT_name("ADCREFTRIM")
   10076                      .dwattr $C$DW$1064, DW_AT_TI_symbol_name("_ADCREFTRIM")
   10077                      .dwattr $C$DW$1064, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   10078                      .dwattr $C$DW$1064, DW_AT_accessibility(DW_ACCESS_public)
   10079              
   10080              $C$DW$1065      .dwtag  DW_TAG_member
   10081                      .dwattr $C$DW$1065, DW_AT_type(*$C$DW$T$87)
   10082                      .dwattr $C$DW$1065, DW_AT_name("ADCOFFTRIM")
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 14:01:10 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{05E34366-D316-4032-A5DC-F5883D36D03E} PAGE  197

   10083                      .dwattr $C$DW$1065, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   10084                      .dwattr $C$DW$1065, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   10085                      .dwattr $C$DW$1065, DW_AT_accessibility(DW_ACCESS_public)
   10086              
   10087              $C$DW$1066      .dwtag  DW_TAG_member
   10088                      .dwattr $C$DW$1066, DW_AT_type(*$C$DW$T$93)
   10089                      .dwattr $C$DW$1066, DW_AT_name("resvd_12")
   10090                      .dwattr $C$DW$1066, DW_AT_TI_symbol_name("_resvd_12")
   10091                      .dwattr $C$DW$1066, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   10092                      .dwattr $C$DW$1066, DW_AT_accessibility(DW_ACCESS_public)
   10093              
   10094              $C$DW$1067      .dwtag  DW_TAG_member
   10095                      .dwattr $C$DW$1067, DW_AT_type(*$C$DW$T$87)
   10096                      .dwattr $C$DW$1067, DW_AT_name("ADCREV")
   10097                      .dwattr $C$DW$1067, DW_AT_TI_symbol_name("_ADCREV")
   10098                      .dwattr $C$DW$1067, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   10099                      .dwattr $C$DW$1067, DW_AT_accessibility(DW_ACCESS_public)
   10100              
   10101                      .dwendtag $C$DW$T$94
   10102              
   10103              $C$DW$T$311     .dwtag  DW_TAG_typedef
   10104                      .dwattr $C$DW$T$311, DW_AT_name("ADC_Obj")
   10105                      .dwattr $C$DW$T$311, DW_AT_type(*$C$DW$T$94)
   10106                      .dwattr $C$DW$T$311, DW_AT_language(DW_LANG_C)
   10107              
   10108              $C$DW$T$179     .dwtag  DW_TAG_pointer_type
   10109                      .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$94)
   10110                      .dwattr $C$DW$T$179, DW_AT_address_class(0x20)
   10111              
   10112              $C$DW$T$180     .dwtag  DW_TAG_typedef
   10113                      .dwattr $C$DW$T$180, DW_AT_name("ADC_Handle")
   10114                      .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$179)
   10115                      .dwattr $C$DW$T$180, DW_AT_language(DW_LANG_C)
   10116              
   10117              
   10118              $C$DW$T$20      .dwtag  DW_TAG_structure_type
   10119                      .dwattr $C$DW$T$20, DW_AT_name("_AFSEL_Obj_")
   10120                      .dwattr $C$DW$T$20, DW_AT_declaration
   10121                      .dwendtag $C$DW$T$20
   10122              
   10123              $C$DW$T$312     .dwtag  DW_TAG_pointer_type
   10124                      .dwattr $C$DW$T$312, DW_AT_type(*$C$DW$T$20)
   10125                      .dwattr $C$DW$T$312, DW_AT_address_class(0x20)
   10126              
   10127              $C$DW$T$313     .dwtag  DW_TAG_typedef
   10128                      .dwattr $C$DW$T$313, DW_AT_name("AFSEL_Handle")
   10129                      .dwattr $C$DW$T$313, DW_AT_type(*$C$DW$T$312)
   10130                      .dwattr $C$DW$T$313, DW_AT_language(DW_LANG_C)
   10131              
   10132              
   10133              $C$DW$T$96      .dwtag  DW_TAG_structure_type
   10134                      .dwattr $C$DW$T$96, DW_AT_name("_CLARKE_Obj_")
   10135                      .dwattr $C$DW$T$96, DW_AT_byte_size(0x06)
   10136              $C$DW$1068      .dwtag  DW_TAG_member
   10137                      .dwattr $C$DW$1068, DW_AT_type(*$C$DW$T$95)
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 14:01:10 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{05E34366-D316-4032-A5DC-F5883D36D03E} PAGE  198

   10138                      .dwattr $C$DW$1068, DW_AT_name("alpha_sf")
   10139                      .dwattr $C$DW$1068, DW_AT_TI_symbol_name("_alpha_sf")
   10140                      .dwattr $C$DW$1068, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10141                      .dwattr $C$DW$1068, DW_AT_accessibility(DW_ACCESS_public)
   10142              
   10143              $C$DW$1069      .dwtag  DW_TAG_member
   10144                      .dwattr $C$DW$1069, DW_AT_type(*$C$DW$T$95)
   10145                      .dwattr $C$DW$1069, DW_AT_name("beta_sf")
   10146                      .dwattr $C$DW$1069, DW_AT_TI_symbol_name("_beta_sf")
   10147                      .dwattr $C$DW$1069, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10148                      .dwattr $C$DW$1069, DW_AT_accessibility(DW_ACCESS_public)
   10149              
   10150              $C$DW$1070      .dwtag  DW_TAG_member
   10151                      .dwattr $C$DW$1070, DW_AT_type(*$C$DW$T$84)
   10152                      .dwattr $C$DW$1070, DW_AT_name("numSensors")
   10153                      .dwattr $C$DW$1070, DW_AT_TI_symbol_name("_numSensors")
   10154                      .dwattr $C$DW$1070, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10155                      .dwattr $C$DW$1070, DW_AT_accessibility(DW_ACCESS_public)
   10156              
   10157                      .dwendtag $C$DW$T$96
   10158              
   10159              $C$DW$T$107     .dwtag  DW_TAG_typedef
   10160                      .dwattr $C$DW$T$107, DW_AT_name("CLARKE_Obj")
   10161                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$96)
   10162                      .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
   10163              
   10164              $C$DW$T$105     .dwtag  DW_TAG_pointer_type
   10165                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$96)
   10166                      .dwattr $C$DW$T$105, DW_AT_address_class(0x20)
   10167              
   10168              $C$DW$T$106     .dwtag  DW_TAG_typedef
   10169                      .dwattr $C$DW$T$106, DW_AT_name("CLARKE_Handle")
   10170                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$105)
   10171                      .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
   10172              
   10173              $C$DW$1071      .dwtag  DW_TAG_TI_far_type
   10174                      .dwattr $C$DW$1071, DW_AT_type(*$C$DW$T$106)
   10175              
   10176              $C$DW$T$317     .dwtag  DW_TAG_const_type
   10177                      .dwattr $C$DW$T$317, DW_AT_type(*$C$DW$1071)
   10178              
   10179              
   10180              $C$DW$T$98      .dwtag  DW_TAG_structure_type
   10181                      .dwattr $C$DW$T$98, DW_AT_name("_CLK_Obj_")
   10182                      .dwattr $C$DW$T$98, DW_AT_byte_size(0x11)
   10183              $C$DW$1072      .dwtag  DW_TAG_member
   10184                      .dwattr $C$DW$1072, DW_AT_type(*$C$DW$T$87)
   10185                      .dwattr $C$DW$1072, DW_AT_name("XCLK")
   10186                      .dwattr $C$DW$1072, DW_AT_TI_symbol_name("_XCLK")
   10187                      .dwattr $C$DW$1072, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10188                      .dwattr $C$DW$1072, DW_AT_accessibility(DW_ACCESS_public)
   10189              
   10190              $C$DW$1073      .dwtag  DW_TAG_member
   10191                      .dwattr $C$DW$1073, DW_AT_type(*$C$DW$T$87)
   10192                      .dwattr $C$DW$1073, DW_AT_name("rsvd_1")
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 14:01:10 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{05E34366-D316-4032-A5DC-F5883D36D03E} PAGE  199

   10193                      .dwattr $C$DW$1073, DW_AT_TI_symbol_name("_rsvd_1")
   10194                      .dwattr $C$DW$1073, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10195                      .dwattr $C$DW$1073, DW_AT_accessibility(DW_ACCESS_public)
   10196              
   10197              $C$DW$1074      .dwtag  DW_TAG_member
   10198                      .dwattr $C$DW$1074, DW_AT_type(*$C$DW$T$87)
   10199                      .dwattr $C$DW$1074, DW_AT_name("CLKCTL")
   10200                      .dwattr $C$DW$1074, DW_AT_TI_symbol_name("_CLKCTL")
   10201                      .dwattr $C$DW$1074, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10202                      .dwattr $C$DW$1074, DW_AT_accessibility(DW_ACCESS_public)
   10203              
   10204              $C$DW$1075      .dwtag  DW_TAG_member
   10205                      .dwattr $C$DW$1075, DW_AT_type(*$C$DW$T$97)
   10206                      .dwattr $C$DW$1075, DW_AT_name("rsvd_2")
   10207                      .dwattr $C$DW$1075, DW_AT_TI_symbol_name("_rsvd_2")
   10208                      .dwattr $C$DW$1075, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10209                      .dwattr $C$DW$1075, DW_AT_accessibility(DW_ACCESS_public)
   10210              
   10211              $C$DW$1076      .dwtag  DW_TAG_member
   10212                      .dwattr $C$DW$1076, DW_AT_type(*$C$DW$T$87)
   10213                      .dwattr $C$DW$1076, DW_AT_name("LOSPCP")
   10214                      .dwattr $C$DW$1076, DW_AT_TI_symbol_name("_LOSPCP")
   10215                      .dwattr $C$DW$1076, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   10216                      .dwattr $C$DW$1076, DW_AT_accessibility(DW_ACCESS_public)
   10217              
   10218              $C$DW$1077      .dwtag  DW_TAG_member
   10219                      .dwattr $C$DW$1077, DW_AT_type(*$C$DW$T$87)
   10220                      .dwattr $C$DW$1077, DW_AT_name("PCLKCR0")
   10221                      .dwattr $C$DW$1077, DW_AT_TI_symbol_name("_PCLKCR0")
   10222                      .dwattr $C$DW$1077, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10223                      .dwattr $C$DW$1077, DW_AT_accessibility(DW_ACCESS_public)
   10224              
   10225              $C$DW$1078      .dwtag  DW_TAG_member
   10226                      .dwattr $C$DW$1078, DW_AT_type(*$C$DW$T$87)
   10227                      .dwattr $C$DW$1078, DW_AT_name("PCLKCR1")
   10228                      .dwattr $C$DW$1078, DW_AT_TI_symbol_name("_PCLKCR1")
   10229                      .dwattr $C$DW$1078, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   10230                      .dwattr $C$DW$1078, DW_AT_accessibility(DW_ACCESS_public)
   10231              
   10232              $C$DW$1079      .dwtag  DW_TAG_member
   10233                      .dwattr $C$DW$1079, DW_AT_type(*$C$DW$T$90)
   10234                      .dwattr $C$DW$1079, DW_AT_name("rsvd_3")
   10235                      .dwattr $C$DW$1079, DW_AT_TI_symbol_name("_rsvd_3")
   10236                      .dwattr $C$DW$1079, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10237                      .dwattr $C$DW$1079, DW_AT_accessibility(DW_ACCESS_public)
   10238              
   10239              $C$DW$1080      .dwtag  DW_TAG_member
   10240                      .dwattr $C$DW$1080, DW_AT_type(*$C$DW$T$87)
   10241                      .dwattr $C$DW$1080, DW_AT_name("PCLKCR3")
   10242                      .dwattr $C$DW$1080, DW_AT_TI_symbol_name("_PCLKCR3")
   10243                      .dwattr $C$DW$1080, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10244                      .dwattr $C$DW$1080, DW_AT_accessibility(DW_ACCESS_public)
   10245              
   10246                      .dwendtag $C$DW$T$98
   10247              
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 14:01:10 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{05E34366-D316-4032-A5DC-F5883D36D03E} PAGE  200

   10248              $C$DW$T$181     .dwtag  DW_TAG_pointer_type
   10249                      .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$98)
   10250                      .dwattr $C$DW$T$181, DW_AT_address_class(0x20)
   10251              
   10252              $C$DW$T$182     .dwtag  DW_TAG_typedef
   10253                      .dwattr $C$DW$T$182, DW_AT_name("CLK_Handle")
   10254                      .dwattr $C$DW$T$182, DW_AT_type(*$C$DW$T$181)
   10255                      .dwattr $C$DW$T$182, DW_AT_language(DW_LANG_C)
   10256              
   10257              
   10258              $C$DW$T$99      .dwtag  DW_TAG_structure_type
   10259                      .dwattr $C$DW$T$99, DW_AT_name("_CPU_Obj_")
   10260                      .dwattr $C$DW$T$99, DW_AT_byte_size(0x01)
   10261              $C$DW$1081      .dwtag  DW_TAG_member
   10262                      .dwattr $C$DW$1081, DW_AT_type(*$C$DW$T$84)
   10263                      .dwattr $C$DW$1081, DW_AT_name("tmp")
   10264                      .dwattr $C$DW$1081, DW_AT_TI_symbol_name("_tmp")
   10265                      .dwattr $C$DW$1081, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10266                      .dwattr $C$DW$1081, DW_AT_accessibility(DW_ACCESS_public)
   10267              
   10268                      .dwendtag $C$DW$T$99
   10269              
   10270              $C$DW$T$183     .dwtag  DW_TAG_pointer_type
   10271                      .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$99)
   10272                      .dwattr $C$DW$T$183, DW_AT_address_class(0x20)
   10273              
   10274              $C$DW$T$184     .dwtag  DW_TAG_typedef
   10275                      .dwattr $C$DW$T$184, DW_AT_name("CPU_Handle")
   10276                      .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$183)
   10277                      .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
   10278              
   10279              
   10280              $C$DW$T$133     .dwtag  DW_TAG_structure_type
   10281                      .dwattr $C$DW$T$133, DW_AT_name("_CTRL_Obj_")
   10282                      .dwattr $C$DW$T$133, DW_AT_byte_size(0x10a)
   10283              $C$DW$1082      .dwtag  DW_TAG_member
   10284                      .dwattr $C$DW$1082, DW_AT_type(*$C$DW$T$100)
   10285                      .dwattr $C$DW$1082, DW_AT_name("version")
   10286                      .dwattr $C$DW$1082, DW_AT_TI_symbol_name("_version")
   10287                      .dwattr $C$DW$1082, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10288                      .dwattr $C$DW$1082, DW_AT_accessibility(DW_ACCESS_public)
   10289              
   10290              $C$DW$1083      .dwtag  DW_TAG_member
   10291                      .dwattr $C$DW$1083, DW_AT_type(*$C$DW$T$102)
   10292                      .dwattr $C$DW$1083, DW_AT_name("state")
   10293                      .dwattr $C$DW$1083, DW_AT_TI_symbol_name("_state")
   10294                      .dwattr $C$DW$1083, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10295                      .dwattr $C$DW$1083, DW_AT_accessibility(DW_ACCESS_public)
   10296              
   10297              $C$DW$1084      .dwtag  DW_TAG_member
   10298                      .dwattr $C$DW$1084, DW_AT_type(*$C$DW$T$102)
   10299                      .dwattr $C$DW$1084, DW_AT_name("prevState")
   10300                      .dwattr $C$DW$1084, DW_AT_TI_symbol_name("_prevState")
   10301                      .dwattr $C$DW$1084, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10302                      .dwattr $C$DW$1084, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Mon Mar  6 14:01:10 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{05E34366-D316-4032-A5DC-F5883D36D03E} PAGE  201

   10303              
   10304              $C$DW$1085      .dwtag  DW_TAG_member
   10305                      .dwattr $C$DW$1085, DW_AT_type(*$C$DW$T$104)
   10306                      .dwattr $C$DW$1085, DW_AT_name("errorCode")
   10307                      .dwattr $C$DW$1085, DW_AT_TI_symbol_name("_errorCode")
   10308                      .dwattr $C$DW$1085, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10309                      .dwattr $C$DW$1085, DW_AT_accessibility(DW_ACCESS_public)
   10310              
   10311              $C$DW$1086      .dwtag  DW_TAG_member
   10312                      .dwattr $C$DW$1086, DW_AT_type(*$C$DW$T$106)
   10313                      .dwattr $C$DW$1086, DW_AT_name("clarkeHandle_I")
   10314                      .dwattr $C$DW$1086, DW_AT_TI_symbol_name("_clarkeHandle_I")
   10315                      .dwattr $C$DW$1086, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10316                      .dwattr $C$DW$1086, DW_AT_accessibility(DW_ACCESS_public)
   10317              
   10318              $C$DW$1087      .dwtag  DW_TAG_member
   10319                      .dwattr $C$DW$1087, DW_AT_type(*$C$DW$T$107)
   10320                      .dwattr $C$DW$1087, DW_AT_name("clarke_I")
   10321                      .dwattr $C$DW$1087, DW_AT_TI_symbol_name("_clarke_I")
   10322                      .dwattr $C$DW$1087, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10323                      .dwattr $C$DW$1087, DW_AT_accessibility(DW_ACCESS_public)
   10324              
   10325              $C$DW$1088      .dwtag  DW_TAG_member
   10326                      .dwattr $C$DW$1088, DW_AT_type(*$C$DW$T$106)
   10327                      .dwattr $C$DW$1088, DW_AT_name("clarkeHandle_V")
   10328                      .dwattr $C$DW$1088, DW_AT_TI_symbol_name("_clarkeHandle_V")
   10329                      .dwattr $C$DW$1088, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10330                      .dwattr $C$DW$1088, DW_AT_accessibility(DW_ACCESS_public)
   10331              
   10332              $C$DW$1089      .dwtag  DW_TAG_member
   10333                      .dwattr $C$DW$1089, DW_AT_type(*$C$DW$T$107)
   10334                      .dwattr $C$DW$1089, DW_AT_name("clarke_V")
   10335                      .dwattr $C$DW$1089, DW_AT_TI_symbol_name("_clarke_V")
   10336                      .dwattr $C$DW$1089, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   10337                      .dwattr $C$DW$1089, DW_AT_accessibility(DW_ACCESS_public)
   10338              
