TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{27055C55-759B-4058-9F3D-3B9CDF016724} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                             PC v18.12.4.LTS *
       3              ;* Date/Time created: Wed Feb 22 13:06:47 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/GIANT/GIANT_TI_instaspin/motorware/motorware_1_01_00_18/sw/solutions
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v18.12.4.LTS Copyright (c) 1996-
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\GIANT\GIANT_TI_instaspin\motorware\motorware_1_01_00_18\sw\solut
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{27055C55-759B-4058-9F3D-3B9CDF016724} PAGE  164

    8342              
    8343              $C$DW$870       .dwtag  DW_TAG_enumerator
    8344                      .dwattr $C$DW$870, DW_AT_name("PIE_GroupNumber_7")
    8345                      .dwattr $C$DW$870, DW_AT_const_value(0x06)
    8346              
    8347              $C$DW$871       .dwtag  DW_TAG_enumerator
    8348                      .dwattr $C$DW$871, DW_AT_name("PIE_GroupNumber_8")
    8349                      .dwattr $C$DW$871, DW_AT_const_value(0x07)
    8350              
    8351              $C$DW$872       .dwtag  DW_TAG_enumerator
    8352                      .dwattr $C$DW$872, DW_AT_name("PIE_GroupNumber_9")
    8353                      .dwattr $C$DW$872, DW_AT_const_value(0x08)
    8354              
    8355              $C$DW$873       .dwtag  DW_TAG_enumerator
    8356                      .dwattr $C$DW$873, DW_AT_name("PIE_GroupNumber_10")
    8357                      .dwattr $C$DW$873, DW_AT_const_value(0x09)
    8358              
    8359              $C$DW$874       .dwtag  DW_TAG_enumerator
    8360                      .dwattr $C$DW$874, DW_AT_name("PIE_GroupNumber_11")
    8361                      .dwattr $C$DW$874, DW_AT_const_value(0x0a)
    8362              
    8363              $C$DW$875       .dwtag  DW_TAG_enumerator
    8364                      .dwattr $C$DW$875, DW_AT_name("PIE_GroupNumber_12")
    8365                      .dwattr $C$DW$875, DW_AT_const_value(0x0b)
    8366              
    8367                      .dwendtag $C$DW$T$221
    8368              
    8369              $C$DW$T$222     .dwtag  DW_TAG_typedef
    8370                      .dwattr $C$DW$T$222, DW_AT_name("PIE_GroupNumber_e")
    8371                      .dwattr $C$DW$T$222, DW_AT_type(*$C$DW$T$221)
    8372                      .dwattr $C$DW$T$222, DW_AT_language(DW_LANG_C)
    8373              
    8374              
    8375              $C$DW$T$224     .dwtag  DW_TAG_enumeration_type
    8376                      .dwattr $C$DW$T$224, DW_AT_byte_size(0x01)
    8377              $C$DW$876       .dwtag  DW_TAG_enumerator
    8378                      .dwattr $C$DW$876, DW_AT_name("CTRL_Type_PID_spd")
    8379                      .dwattr $C$DW$876, DW_AT_const_value(0x00)
    8380              
    8381              $C$DW$877       .dwtag  DW_TAG_enumerator
    8382                      .dwattr $C$DW$877, DW_AT_name("CTRL_Type_PID_Id")
    8383                      .dwattr $C$DW$877, DW_AT_const_value(0x01)
    8384              
    8385              $C$DW$878       .dwtag  DW_TAG_enumerator
    8386                      .dwattr $C$DW$878, DW_AT_name("CTRL_Type_PID_Iq")
    8387                      .dwattr $C$DW$878, DW_AT_const_value(0x02)
    8388              
    8389                      .dwendtag $C$DW$T$224
    8390              
    8391              $C$DW$T$225     .dwtag  DW_TAG_typedef
    8392                      .dwattr $C$DW$T$225, DW_AT_name("CTRL_Type_e")
    8393                      .dwattr $C$DW$T$225, DW_AT_type(*$C$DW$T$224)
    8394                      .dwattr $C$DW$T$225, DW_AT_language(DW_LANG_C)
    8395              
    8396              
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{27055C55-759B-4058-9F3D-3B9CDF016724} PAGE  165

    8397              $C$DW$T$227     .dwtag  DW_TAG_enumeration_type
    8398                      .dwattr $C$DW$T$227, DW_AT_byte_size(0x01)
    8399              $C$DW$879       .dwtag  DW_TAG_enumerator
    8400                      .dwattr $C$DW$879, DW_AT_name("HAL_SensorType_Current")
    8401                      .dwattr $C$DW$879, DW_AT_const_value(0x00)
    8402              
    8403              $C$DW$880       .dwtag  DW_TAG_enumerator
    8404                      .dwattr $C$DW$880, DW_AT_name("HAL_SensorType_Voltage")
    8405                      .dwattr $C$DW$880, DW_AT_const_value(0x01)
    8406              
    8407                      .dwendtag $C$DW$T$227
    8408              
    8409              $C$DW$T$228     .dwtag  DW_TAG_typedef
    8410                      .dwattr $C$DW$T$228, DW_AT_name("HAL_SensorType_e")
    8411                      .dwattr $C$DW$T$228, DW_AT_type(*$C$DW$T$227)
    8412                      .dwattr $C$DW$T$228, DW_AT_language(DW_LANG_C)
    8413              
    8414              
    8415              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    8416                      .dwattr $C$DW$T$19, DW_AT_name("IPD_HFI_Obj")
    8417                      .dwattr $C$DW$T$19, DW_AT_declaration
    8418                      .dwendtag $C$DW$T$19
    8419              
    8420              $C$DW$T$230     .dwtag  DW_TAG_pointer_type
    8421                      .dwattr $C$DW$T$230, DW_AT_type(*$C$DW$T$19)
    8422                      .dwattr $C$DW$T$230, DW_AT_address_class(0x20)
    8423              
    8424              $C$DW$T$231     .dwtag  DW_TAG_typedef
    8425                      .dwattr $C$DW$T$231, DW_AT_name("IPD_HFI_Handle")
    8426                      .dwattr $C$DW$T$231, DW_AT_type(*$C$DW$T$230)
    8427                      .dwattr $C$DW$T$231, DW_AT_language(DW_LANG_C)
    8428              
    8429              
    8430              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    8431                      .dwattr $C$DW$T$34, DW_AT_name("_ADC_Obj_")
    8432                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x6650)
    8433              $C$DW$881       .dwtag  DW_TAG_member
    8434                      .dwattr $C$DW$881, DW_AT_type(*$C$DW$T$28)
    8435                      .dwattr $C$DW$881, DW_AT_name("ADCRESULT")
    8436                      .dwattr $C$DW$881, DW_AT_TI_symbol_name("_ADCRESULT")
    8437                      .dwattr $C$DW$881, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8438                      .dwattr $C$DW$881, DW_AT_accessibility(DW_ACCESS_public)
    8439              
    8440              $C$DW$882       .dwtag  DW_TAG_member
    8441                      .dwattr $C$DW$882, DW_AT_type(*$C$DW$T$29)
    8442                      .dwattr $C$DW$882, DW_AT_name("resvd_1")
    8443                      .dwattr $C$DW$882, DW_AT_TI_symbol_name("_resvd_1")
    8444                      .dwattr $C$DW$882, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8445                      .dwattr $C$DW$882, DW_AT_accessibility(DW_ACCESS_public)
    8446              
    8447              $C$DW$883       .dwtag  DW_TAG_member
    8448                      .dwattr $C$DW$883, DW_AT_type(*$C$DW$T$27)
    8449                      .dwattr $C$DW$883, DW_AT_name("ADCCTL1")
    8450                      .dwattr $C$DW$883, DW_AT_TI_symbol_name("_ADCCTL1")
    8451                      .dwattr $C$DW$883, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{27055C55-759B-4058-9F3D-3B9CDF016724} PAGE  166

    8452                      .dwattr $C$DW$883, DW_AT_accessibility(DW_ACCESS_public)
    8453              
    8454              $C$DW$884       .dwtag  DW_TAG_member
    8455                      .dwattr $C$DW$884, DW_AT_type(*$C$DW$T$27)
    8456                      .dwattr $C$DW$884, DW_AT_name("ADCCTL2")
    8457                      .dwattr $C$DW$884, DW_AT_TI_symbol_name("_ADCCTL2")
    8458                      .dwattr $C$DW$884, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    8459                      .dwattr $C$DW$884, DW_AT_accessibility(DW_ACCESS_public)
    8460              
    8461              $C$DW$885       .dwtag  DW_TAG_member
    8462                      .dwattr $C$DW$885, DW_AT_type(*$C$DW$T$30)
    8463                      .dwattr $C$DW$885, DW_AT_name("rsvd_2")
    8464                      .dwattr $C$DW$885, DW_AT_TI_symbol_name("_rsvd_2")
    8465                      .dwattr $C$DW$885, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    8466                      .dwattr $C$DW$885, DW_AT_accessibility(DW_ACCESS_public)
    8467              
    8468              $C$DW$886       .dwtag  DW_TAG_member
    8469                      .dwattr $C$DW$886, DW_AT_type(*$C$DW$T$27)
    8470                      .dwattr $C$DW$886, DW_AT_name("ADCINTFLG")
    8471                      .dwattr $C$DW$886, DW_AT_TI_symbol_name("_ADCINTFLG")
    8472                      .dwattr $C$DW$886, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    8473                      .dwattr $C$DW$886, DW_AT_accessibility(DW_ACCESS_public)
    8474              
    8475              $C$DW$887       .dwtag  DW_TAG_member
    8476                      .dwattr $C$DW$887, DW_AT_type(*$C$DW$T$27)
    8477                      .dwattr $C$DW$887, DW_AT_name("ADCINTFLGCLR")
    8478                      .dwattr $C$DW$887, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    8479                      .dwattr $C$DW$887, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    8480                      .dwattr $C$DW$887, DW_AT_accessibility(DW_ACCESS_public)
    8481              
    8482              $C$DW$888       .dwtag  DW_TAG_member
    8483                      .dwattr $C$DW$888, DW_AT_type(*$C$DW$T$27)
    8484                      .dwattr $C$DW$888, DW_AT_name("ADCINTOVF")
    8485                      .dwattr $C$DW$888, DW_AT_TI_symbol_name("_ADCINTOVF")
    8486                      .dwattr $C$DW$888, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    8487                      .dwattr $C$DW$888, DW_AT_accessibility(DW_ACCESS_public)
    8488              
    8489              $C$DW$889       .dwtag  DW_TAG_member
    8490                      .dwattr $C$DW$889, DW_AT_type(*$C$DW$T$27)
    8491                      .dwattr $C$DW$889, DW_AT_name("ADCINTOVFCLR")
    8492                      .dwattr $C$DW$889, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    8493                      .dwattr $C$DW$889, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    8494                      .dwattr $C$DW$889, DW_AT_accessibility(DW_ACCESS_public)
    8495              
    8496              $C$DW$890       .dwtag  DW_TAG_member
    8497                      .dwattr $C$DW$890, DW_AT_type(*$C$DW$T$31)
    8498                      .dwattr $C$DW$890, DW_AT_name("INTSELxNy")
    8499                      .dwattr $C$DW$890, DW_AT_TI_symbol_name("_INTSELxNy")
    8500                      .dwattr $C$DW$890, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    8501                      .dwattr $C$DW$890, DW_AT_accessibility(DW_ACCESS_public)
    8502              
    8503              $C$DW$891       .dwtag  DW_TAG_member
    8504                      .dwattr $C$DW$891, DW_AT_type(*$C$DW$T$32)
    8505                      .dwattr $C$DW$891, DW_AT_name("rsvd_3")
    8506                      .dwattr $C$DW$891, DW_AT_TI_symbol_name("_rsvd_3")
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{27055C55-759B-4058-9F3D-3B9CDF016724} PAGE  167

    8507                      .dwattr $C$DW$891, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    8508                      .dwattr $C$DW$891, DW_AT_accessibility(DW_ACCESS_public)
    8509              
    8510              $C$DW$892       .dwtag  DW_TAG_member
    8511                      .dwattr $C$DW$892, DW_AT_type(*$C$DW$T$27)
    8512                      .dwattr $C$DW$892, DW_AT_name("SOCPRICTRL")
    8513                      .dwattr $C$DW$892, DW_AT_TI_symbol_name("_SOCPRICTRL")
    8514                      .dwattr $C$DW$892, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    8515                      .dwattr $C$DW$892, DW_AT_accessibility(DW_ACCESS_public)
    8516              
    8517              $C$DW$893       .dwtag  DW_TAG_member
    8518                      .dwattr $C$DW$893, DW_AT_type(*$C$DW$T$27)
    8519                      .dwattr $C$DW$893, DW_AT_name("rsvd_4")
    8520                      .dwattr $C$DW$893, DW_AT_TI_symbol_name("_rsvd_4")
    8521                      .dwattr $C$DW$893, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    8522                      .dwattr $C$DW$893, DW_AT_accessibility(DW_ACCESS_public)
    8523              
    8524              $C$DW$894       .dwtag  DW_TAG_member
    8525                      .dwattr $C$DW$894, DW_AT_type(*$C$DW$T$27)
    8526                      .dwattr $C$DW$894, DW_AT_name("ADCSAMPLEMODE")
    8527                      .dwattr $C$DW$894, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    8528                      .dwattr $C$DW$894, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    8529                      .dwattr $C$DW$894, DW_AT_accessibility(DW_ACCESS_public)
    8530              
    8531              $C$DW$895       .dwtag  DW_TAG_member
    8532                      .dwattr $C$DW$895, DW_AT_type(*$C$DW$T$27)
    8533                      .dwattr $C$DW$895, DW_AT_name("rsvd_5")
    8534                      .dwattr $C$DW$895, DW_AT_TI_symbol_name("_rsvd_5")
    8535                      .dwattr $C$DW$895, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    8536                      .dwattr $C$DW$895, DW_AT_accessibility(DW_ACCESS_public)
    8537              
    8538              $C$DW$896       .dwtag  DW_TAG_member
    8539                      .dwattr $C$DW$896, DW_AT_type(*$C$DW$T$27)
    8540                      .dwattr $C$DW$896, DW_AT_name("ADCINTSOCSEL1")
    8541                      .dwattr $C$DW$896, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    8542                      .dwattr $C$DW$896, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    8543                      .dwattr $C$DW$896, DW_AT_accessibility(DW_ACCESS_public)
    8544              
    8545              $C$DW$897       .dwtag  DW_TAG_member
    8546                      .dwattr $C$DW$897, DW_AT_type(*$C$DW$T$27)
    8547                      .dwattr $C$DW$897, DW_AT_name("ADCINTSOCSEL2")
    8548                      .dwattr $C$DW$897, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    8549                      .dwattr $C$DW$897, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    8550                      .dwattr $C$DW$897, DW_AT_accessibility(DW_ACCESS_public)
    8551              
    8552              $C$DW$898       .dwtag  DW_TAG_member
    8553                      .dwattr $C$DW$898, DW_AT_type(*$C$DW$T$30)
    8554                      .dwattr $C$DW$898, DW_AT_name("rsvd_6")
    8555                      .dwattr $C$DW$898, DW_AT_TI_symbol_name("_rsvd_6")
    8556                      .dwattr $C$DW$898, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    8557                      .dwattr $C$DW$898, DW_AT_accessibility(DW_ACCESS_public)
    8558              
    8559              $C$DW$899       .dwtag  DW_TAG_member
    8560                      .dwattr $C$DW$899, DW_AT_type(*$C$DW$T$27)
    8561                      .dwattr $C$DW$899, DW_AT_name("ADCSOCFLG1")
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{27055C55-759B-4058-9F3D-3B9CDF016724} PAGE  168

    8562                      .dwattr $C$DW$899, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    8563                      .dwattr $C$DW$899, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    8564                      .dwattr $C$DW$899, DW_AT_accessibility(DW_ACCESS_public)
    8565              
    8566              $C$DW$900       .dwtag  DW_TAG_member
    8567                      .dwattr $C$DW$900, DW_AT_type(*$C$DW$T$27)
    8568                      .dwattr $C$DW$900, DW_AT_name("rsvd_7")
    8569                      .dwattr $C$DW$900, DW_AT_TI_symbol_name("_rsvd_7")
    8570                      .dwattr $C$DW$900, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    8571                      .dwattr $C$DW$900, DW_AT_accessibility(DW_ACCESS_public)
    8572              
    8573              $C$DW$901       .dwtag  DW_TAG_member
    8574                      .dwattr $C$DW$901, DW_AT_type(*$C$DW$T$27)
    8575                      .dwattr $C$DW$901, DW_AT_name("ADCSOCFRC1")
    8576                      .dwattr $C$DW$901, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    8577                      .dwattr $C$DW$901, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    8578                      .dwattr $C$DW$901, DW_AT_accessibility(DW_ACCESS_public)
    8579              
    8580              $C$DW$902       .dwtag  DW_TAG_member
    8581                      .dwattr $C$DW$902, DW_AT_type(*$C$DW$T$27)
    8582                      .dwattr $C$DW$902, DW_AT_name("rsvd_8")
    8583                      .dwattr $C$DW$902, DW_AT_TI_symbol_name("_rsvd_8")
    8584                      .dwattr $C$DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    8585                      .dwattr $C$DW$902, DW_AT_accessibility(DW_ACCESS_public)
    8586              
    8587              $C$DW$903       .dwtag  DW_TAG_member
    8588                      .dwattr $C$DW$903, DW_AT_type(*$C$DW$T$27)
    8589                      .dwattr $C$DW$903, DW_AT_name("ADCSOCOVF1")
    8590                      .dwattr $C$DW$903, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    8591                      .dwattr $C$DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    8592                      .dwattr $C$DW$903, DW_AT_accessibility(DW_ACCESS_public)
    8593              
    8594              $C$DW$904       .dwtag  DW_TAG_member
    8595                      .dwattr $C$DW$904, DW_AT_type(*$C$DW$T$27)
    8596                      .dwattr $C$DW$904, DW_AT_name("rsvd_9")
    8597                      .dwattr $C$DW$904, DW_AT_TI_symbol_name("_rsvd_9")
    8598                      .dwattr $C$DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    8599                      .dwattr $C$DW$904, DW_AT_accessibility(DW_ACCESS_public)
    8600              
    8601              $C$DW$905       .dwtag  DW_TAG_member
    8602                      .dwattr $C$DW$905, DW_AT_type(*$C$DW$T$27)
    8603                      .dwattr $C$DW$905, DW_AT_name("ADCSOCOVFCLR1")
    8604                      .dwattr $C$DW$905, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    8605                      .dwattr $C$DW$905, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    8606                      .dwattr $C$DW$905, DW_AT_accessibility(DW_ACCESS_public)
    8607              
    8608              $C$DW$906       .dwtag  DW_TAG_member
    8609                      .dwattr $C$DW$906, DW_AT_type(*$C$DW$T$27)
    8610                      .dwattr $C$DW$906, DW_AT_name("rsvd_10")
    8611                      .dwattr $C$DW$906, DW_AT_TI_symbol_name("_rsvd_10")
    8612                      .dwattr $C$DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    8613                      .dwattr $C$DW$906, DW_AT_accessibility(DW_ACCESS_public)
    8614              
    8615              $C$DW$907       .dwtag  DW_TAG_member
    8616                      .dwattr $C$DW$907, DW_AT_type(*$C$DW$T$28)
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{27055C55-759B-4058-9F3D-3B9CDF016724} PAGE  169

    8617                      .dwattr $C$DW$907, DW_AT_name("ADCSOCxCTL")
    8618                      .dwattr $C$DW$907, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    8619                      .dwattr $C$DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    8620                      .dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
    8621              
    8622              $C$DW$908       .dwtag  DW_TAG_member
    8623                      .dwattr $C$DW$908, DW_AT_type(*$C$DW$T$28)
    8624                      .dwattr $C$DW$908, DW_AT_name("rsvd_11")
    8625                      .dwattr $C$DW$908, DW_AT_TI_symbol_name("_rsvd_11")
    8626                      .dwattr $C$DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    8627                      .dwattr $C$DW$908, DW_AT_accessibility(DW_ACCESS_public)
    8628              
    8629              $C$DW$909       .dwtag  DW_TAG_member
    8630                      .dwattr $C$DW$909, DW_AT_type(*$C$DW$T$27)
    8631                      .dwattr $C$DW$909, DW_AT_name("ADCREFTRIM")
    8632                      .dwattr $C$DW$909, DW_AT_TI_symbol_name("_ADCREFTRIM")
    8633                      .dwattr $C$DW$909, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    8634                      .dwattr $C$DW$909, DW_AT_accessibility(DW_ACCESS_public)
    8635              
    8636              $C$DW$910       .dwtag  DW_TAG_member
    8637                      .dwattr $C$DW$910, DW_AT_type(*$C$DW$T$27)
    8638                      .dwattr $C$DW$910, DW_AT_name("ADCOFFTRIM")
    8639                      .dwattr $C$DW$910, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    8640                      .dwattr $C$DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    8641                      .dwattr $C$DW$910, DW_AT_accessibility(DW_ACCESS_public)
    8642              
    8643              $C$DW$911       .dwtag  DW_TAG_member
    8644                      .dwattr $C$DW$911, DW_AT_type(*$C$DW$T$33)
    8645                      .dwattr $C$DW$911, DW_AT_name("resvd_12")
    8646                      .dwattr $C$DW$911, DW_AT_TI_symbol_name("_resvd_12")
    8647                      .dwattr $C$DW$911, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    8648                      .dwattr $C$DW$911, DW_AT_accessibility(DW_ACCESS_public)
    8649              
    8650              $C$DW$912       .dwtag  DW_TAG_member
    8651                      .dwattr $C$DW$912, DW_AT_type(*$C$DW$T$27)
    8652                      .dwattr $C$DW$912, DW_AT_name("ADCREV")
    8653                      .dwattr $C$DW$912, DW_AT_TI_symbol_name("_ADCREV")
    8654                      .dwattr $C$DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    8655                      .dwattr $C$DW$912, DW_AT_accessibility(DW_ACCESS_public)
    8656              
    8657                      .dwendtag $C$DW$T$34
    8658              
    8659              $C$DW$T$235     .dwtag  DW_TAG_typedef
    8660                      .dwattr $C$DW$T$235, DW_AT_name("ADC_Obj")
    8661                      .dwattr $C$DW$T$235, DW_AT_type(*$C$DW$T$34)
    8662                      .dwattr $C$DW$T$235, DW_AT_language(DW_LANG_C)
    8663              
    8664              $C$DW$T$124     .dwtag  DW_TAG_pointer_type
    8665                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$34)
    8666                      .dwattr $C$DW$T$124, DW_AT_address_class(0x20)
    8667              
    8668              $C$DW$T$125     .dwtag  DW_TAG_typedef
    8669                      .dwattr $C$DW$T$125, DW_AT_name("ADC_Handle")
    8670                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
    8671                      .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{27055C55-759B-4058-9F3D-3B9CDF016724} PAGE  170

    8672              
    8673              
    8674              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    8675                      .dwattr $C$DW$T$20, DW_AT_name("_AFSEL_Obj_")
    8676                      .dwattr $C$DW$T$20, DW_AT_declaration
    8677                      .dwendtag $C$DW$T$20
    8678              
    8679              $C$DW$T$236     .dwtag  DW_TAG_pointer_type
    8680                      .dwattr $C$DW$T$236, DW_AT_type(*$C$DW$T$20)
    8681                      .dwattr $C$DW$T$236, DW_AT_address_class(0x20)
    8682              
    8683              $C$DW$T$237     .dwtag  DW_TAG_typedef
    8684                      .dwattr $C$DW$T$237, DW_AT_name("AFSEL_Handle")
    8685                      .dwattr $C$DW$T$237, DW_AT_type(*$C$DW$T$236)
    8686                      .dwattr $C$DW$T$237, DW_AT_language(DW_LANG_C)
    8687              
    8688              
    8689              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    8690                      .dwattr $C$DW$T$38, DW_AT_name("_CLARKE_Obj_")
    8691                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x06)
    8692              $C$DW$913       .dwtag  DW_TAG_member
    8693                      .dwattr $C$DW$913, DW_AT_type(*$C$DW$T$35)
    8694                      .dwattr $C$DW$913, DW_AT_name("alpha_sf")
    8695                      .dwattr $C$DW$913, DW_AT_TI_symbol_name("_alpha_sf")
    8696                      .dwattr $C$DW$913, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8697                      .dwattr $C$DW$913, DW_AT_accessibility(DW_ACCESS_public)
    8698              
    8699              $C$DW$914       .dwtag  DW_TAG_member
    8700                      .dwattr $C$DW$914, DW_AT_type(*$C$DW$T$35)
    8701                      .dwattr $C$DW$914, DW_AT_name("beta_sf")
    8702                      .dwattr $C$DW$914, DW_AT_TI_symbol_name("_beta_sf")
    8703                      .dwattr $C$DW$914, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8704                      .dwattr $C$DW$914, DW_AT_accessibility(DW_ACCESS_public)
    8705              
    8706              $C$DW$915       .dwtag  DW_TAG_member
    8707                      .dwattr $C$DW$915, DW_AT_type(*$C$DW$T$37)
    8708                      .dwattr $C$DW$915, DW_AT_name("numSensors")
    8709                      .dwattr $C$DW$915, DW_AT_TI_symbol_name("_numSensors")
    8710                      .dwattr $C$DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8711                      .dwattr $C$DW$915, DW_AT_accessibility(DW_ACCESS_public)
    8712              
    8713                      .dwendtag $C$DW$T$38
    8714              
    8715              $C$DW$T$49      .dwtag  DW_TAG_typedef
    8716                      .dwattr $C$DW$T$49, DW_AT_name("CLARKE_Obj")
    8717                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$38)
    8718                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    8719              
    8720              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    8721                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$38)
    8722                      .dwattr $C$DW$T$47, DW_AT_address_class(0x20)
    8723              
    8724              $C$DW$T$48      .dwtag  DW_TAG_typedef
    8725                      .dwattr $C$DW$T$48, DW_AT_name("CLARKE_Handle")
    8726                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{27055C55-759B-4058-9F3D-3B9CDF016724} PAGE  171

    8727                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    8728              
    8729              $C$DW$916       .dwtag  DW_TAG_TI_far_type
    8730                      .dwattr $C$DW$916, DW_AT_type(*$C$DW$T$48)
    8731              
    8732              $C$DW$T$241     .dwtag  DW_TAG_const_type
    8733                      .dwattr $C$DW$T$241, DW_AT_type(*$C$DW$916)
    8734              
    8735              
    8736              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    8737                      .dwattr $C$DW$T$40, DW_AT_name("_CLK_Obj_")
    8738                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x11)
    8739              $C$DW$917       .dwtag  DW_TAG_member
    8740                      .dwattr $C$DW$917, DW_AT_type(*$C$DW$T$27)
    8741                      .dwattr $C$DW$917, DW_AT_name("XCLK")
    8742                      .dwattr $C$DW$917, DW_AT_TI_symbol_name("_XCLK")
    8743                      .dwattr $C$DW$917, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8744                      .dwattr $C$DW$917, DW_AT_accessibility(DW_ACCESS_public)
    8745              
    8746              $C$DW$918       .dwtag  DW_TAG_member
    8747                      .dwattr $C$DW$918, DW_AT_type(*$C$DW$T$27)
    8748                      .dwattr $C$DW$918, DW_AT_name("rsvd_1")
    8749                      .dwattr $C$DW$918, DW_AT_TI_symbol_name("_rsvd_1")
    8750                      .dwattr $C$DW$918, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8751                      .dwattr $C$DW$918, DW_AT_accessibility(DW_ACCESS_public)
    8752              
    8753              $C$DW$919       .dwtag  DW_TAG_member
    8754                      .dwattr $C$DW$919, DW_AT_type(*$C$DW$T$27)
    8755                      .dwattr $C$DW$919, DW_AT_name("CLKCTL")
    8756                      .dwattr $C$DW$919, DW_AT_TI_symbol_name("_CLKCTL")
    8757                      .dwattr $C$DW$919, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8758                      .dwattr $C$DW$919, DW_AT_accessibility(DW_ACCESS_public)
    8759              
    8760              $C$DW$920       .dwtag  DW_TAG_member
    8761                      .dwattr $C$DW$920, DW_AT_type(*$C$DW$T$39)
    8762                      .dwattr $C$DW$920, DW_AT_name("rsvd_2")
    8763                      .dwattr $C$DW$920, DW_AT_TI_symbol_name("_rsvd_2")
    8764                      .dwattr $C$DW$920, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8765                      .dwattr $C$DW$920, DW_AT_accessibility(DW_ACCESS_public)
    8766              
    8767              $C$DW$921       .dwtag  DW_TAG_member
    8768                      .dwattr $C$DW$921, DW_AT_type(*$C$DW$T$27)
    8769                      .dwattr $C$DW$921, DW_AT_name("LOSPCP")
    8770                      .dwattr $C$DW$921, DW_AT_TI_symbol_name("_LOSPCP")
    8771                      .dwattr $C$DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    8772                      .dwattr $C$DW$921, DW_AT_accessibility(DW_ACCESS_public)
    8773              
    8774              $C$DW$922       .dwtag  DW_TAG_member
    8775                      .dwattr $C$DW$922, DW_AT_type(*$C$DW$T$27)
    8776                      .dwattr $C$DW$922, DW_AT_name("PCLKCR0")
    8777                      .dwattr $C$DW$922, DW_AT_TI_symbol_name("_PCLKCR0")
    8778                      .dwattr $C$DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8779                      .dwattr $C$DW$922, DW_AT_accessibility(DW_ACCESS_public)
    8780              
    8781              $C$DW$923       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{27055C55-759B-4058-9F3D-3B9CDF016724} PAGE  172

    8782                      .dwattr $C$DW$923, DW_AT_type(*$C$DW$T$27)
    8783                      .dwattr $C$DW$923, DW_AT_name("PCLKCR1")
    8784                      .dwattr $C$DW$923, DW_AT_TI_symbol_name("_PCLKCR1")
    8785                      .dwattr $C$DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8786                      .dwattr $C$DW$923, DW_AT_accessibility(DW_ACCESS_public)
    8787              
    8788              $C$DW$924       .dwtag  DW_TAG_member
    8789                      .dwattr $C$DW$924, DW_AT_type(*$C$DW$T$30)
    8790                      .dwattr $C$DW$924, DW_AT_name("rsvd_3")
    8791                      .dwattr $C$DW$924, DW_AT_TI_symbol_name("_rsvd_3")
    8792                      .dwattr $C$DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8793                      .dwattr $C$DW$924, DW_AT_accessibility(DW_ACCESS_public)
    8794              
    8795              $C$DW$925       .dwtag  DW_TAG_member
    8796                      .dwattr $C$DW$925, DW_AT_type(*$C$DW$T$27)
    8797                      .dwattr $C$DW$925, DW_AT_name("PCLKCR3")
    8798                      .dwattr $C$DW$925, DW_AT_TI_symbol_name("_PCLKCR3")
    8799                      .dwattr $C$DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8800                      .dwattr $C$DW$925, DW_AT_accessibility(DW_ACCESS_public)
    8801              
    8802                      .dwendtag $C$DW$T$40
    8803              
    8804              $C$DW$T$126     .dwtag  DW_TAG_pointer_type
    8805                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$40)
    8806                      .dwattr $C$DW$T$126, DW_AT_address_class(0x20)
    8807              
    8808              $C$DW$T$127     .dwtag  DW_TAG_typedef
    8809                      .dwattr $C$DW$T$127, DW_AT_name("CLK_Handle")
    8810                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
    8811                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    8812              
    8813              
    8814              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    8815                      .dwattr $C$DW$T$41, DW_AT_name("_CPU_Obj_")
    8816                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    8817              $C$DW$926       .dwtag  DW_TAG_member
    8818                      .dwattr $C$DW$926, DW_AT_type(*$C$DW$T$37)
    8819                      .dwattr $C$DW$926, DW_AT_name("tmp")
    8820                      .dwattr $C$DW$926, DW_AT_TI_symbol_name("_tmp")
    8821                      .dwattr $C$DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8822                      .dwattr $C$DW$926, DW_AT_accessibility(DW_ACCESS_public)
    8823              
    8824                      .dwendtag $C$DW$T$41
    8825              
    8826              $C$DW$T$128     .dwtag  DW_TAG_pointer_type
    8827                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$41)
    8828                      .dwattr $C$DW$T$128, DW_AT_address_class(0x20)
    8829              
    8830              $C$DW$T$129     .dwtag  DW_TAG_typedef
    8831                      .dwattr $C$DW$T$129, DW_AT_name("CPU_Handle")
    8832                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$128)
    8833                      .dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
    8834              
    8835              
    8836              $C$DW$T$77      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{27055C55-759B-4058-9F3D-3B9CDF016724} PAGE  173

    8837                      .dwattr $C$DW$T$77, DW_AT_name("_CTRL_Obj_")
    8838                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x10a)
    8839              $C$DW$927       .dwtag  DW_TAG_member
    8840                      .dwattr $C$DW$927, DW_AT_type(*$C$DW$T$42)
    8841                      .dwattr $C$DW$927, DW_AT_name("version")
    8842                      .dwattr $C$DW$927, DW_AT_TI_symbol_name("_version")
    8843                      .dwattr $C$DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8844                      .dwattr $C$DW$927, DW_AT_accessibility(DW_ACCESS_public)
    8845              
    8846              $C$DW$928       .dwtag  DW_TAG_member
    8847                      .dwattr $C$DW$928, DW_AT_type(*$C$DW$T$44)
    8848                      .dwattr $C$DW$928, DW_AT_name("state")
    8849                      .dwattr $C$DW$928, DW_AT_TI_symbol_name("_state")
    8850                      .dwattr $C$DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8851                      .dwattr $C$DW$928, DW_AT_accessibility(DW_ACCESS_public)
    8852              
    8853              $C$DW$929       .dwtag  DW_TAG_member
    8854                      .dwattr $C$DW$929, DW_AT_type(*$C$DW$T$44)
    8855                      .dwattr $C$DW$929, DW_AT_name("prevState")
    8856                      .dwattr $C$DW$929, DW_AT_TI_symbol_name("_prevState")
    8857                      .dwattr $C$DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8858                      .dwattr $C$DW$929, DW_AT_accessibility(DW_ACCESS_public)
    8859              
    8860              $C$DW$930       .dwtag  DW_TAG_member
    8861                      .dwattr $C$DW$930, DW_AT_type(*$C$DW$T$46)
    8862                      .dwattr $C$DW$930, DW_AT_name("errorCode")
    8863                      .dwattr $C$DW$930, DW_AT_TI_symbol_name("_errorCode")
    8864                      .dwattr $C$DW$930, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8865                      .dwattr $C$DW$930, DW_AT_accessibility(DW_ACCESS_public)
    8866              
    8867              $C$DW$931       .dwtag  DW_TAG_member
    8868                      .dwattr $C$DW$931, DW_AT_type(*$C$DW$T$48)
    8869                      .dwattr $C$DW$931, DW_AT_name("clarkeHandle_I")
    8870                      .dwattr $C$DW$931, DW_AT_TI_symbol_name("_clarkeHandle_I")
    8871                      .dwattr $C$DW$931, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8872                      .dwattr $C$DW$931, DW_AT_accessibility(DW_ACCESS_public)
    8873              
    8874              $C$DW$932       .dwtag  DW_TAG_member
    8875                      .dwattr $C$DW$932, DW_AT_type(*$C$DW$T$49)
    8876                      .dwattr $C$DW$932, DW_AT_name("clarke_I")
    8877                      .dwattr $C$DW$932, DW_AT_TI_symbol_name("_clarke_I")
    8878                      .dwattr $C$DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8879                      .dwattr $C$DW$932, DW_AT_accessibility(DW_ACCESS_public)
    8880              
    8881              $C$DW$933       .dwtag  DW_TAG_member
    8882                      .dwattr $C$DW$933, DW_AT_type(*$C$DW$T$48)
    8883                      .dwattr $C$DW$933, DW_AT_name("clarkeHandle_V")
    8884                      .dwattr $C$DW$933, DW_AT_TI_symbol_name("_clarkeHandle_V")
    8885                      .dwattr $C$DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8886                      .dwattr $C$DW$933, DW_AT_accessibility(DW_ACCESS_public)
    8887              
    8888              $C$DW$934       .dwtag  DW_TAG_member
    8889                      .dwattr $C$DW$934, DW_AT_type(*$C$DW$T$49)
    8890                      .dwattr $C$DW$934, DW_AT_name("clarke_V")
    8891                      .dwattr $C$DW$934, DW_AT_TI_symbol_name("_clarke_V")
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{27055C55-759B-4058-9F3D-3B9CDF016724} PAGE  174

    8892                      .dwattr $C$DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8893                      .dwattr $C$DW$934, DW_AT_accessibility(DW_ACCESS_public)
    8894              
    8895              $C$DW$935       .dwtag  DW_TAG_member
    8896                      .dwattr $C$DW$935, DW_AT_type(*$C$DW$T$51)
    8897                      .dwattr $C$DW$935, DW_AT_name("estHandle")
    8898                      .dwattr $C$DW$935, DW_AT_TI_symbol_name("_estHandle")
    8899                      .dwattr $C$DW$935, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8900                      .dwattr $C$DW$935, DW_AT_accessibility(DW_ACCESS_public)
    8901              
    8902              $C$DW$936       .dwtag  DW_TAG_member
    8903                      .dwattr $C$DW$936, DW_AT_type(*$C$DW$T$53)
    8904                      .dwattr $C$DW$936, DW_AT_name("parkHandle")
    8905                      .dwattr $C$DW$936, DW_AT_TI_symbol_name("_parkHandle")
    8906                      .dwattr $C$DW$936, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    8907                      .dwattr $C$DW$936, DW_AT_accessibility(DW_ACCESS_public)
    8908              
    8909              $C$DW$937       .dwtag  DW_TAG_member
    8910                      .dwattr $C$DW$937, DW_AT_type(*$C$DW$T$54)
    8911                      .dwattr $C$DW$937, DW_AT_name("park")
    8912                      .dwattr $C$DW$937, DW_AT_TI_symbol_name("_park")
    8913                      .dwattr $C$DW$937, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8914                      .dwattr $C$DW$937, DW_AT_accessibility(DW_ACCESS_public)
    8915              
    8916              $C$DW$938       .dwtag  DW_TAG_member
    8917                      .dwattr $C$DW$938, DW_AT_type(*$C$DW$T$56)
    8918                      .dwattr $C$DW$938, DW_AT_name("pidHandle_Id")
    8919                      .dwattr $C$DW$938, DW_AT_TI_symbol_name("_pidHandle_Id")
    8920                      .dwattr $C$DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8921                      .dwattr $C$DW$938, DW_AT_accessibility(DW_ACCESS_public)
    8922              
    8923              $C$DW$939       .dwtag  DW_TAG_member
    8924                      .dwattr $C$DW$939, DW_AT_type(*$C$DW$T$57)
    8925                      .dwattr $C$DW$939, DW_AT_name("pid_Id")
    8926                      .dwattr $C$DW$939, DW_AT_TI_symbol_name("_pid_Id")
    8927                      .dwattr $C$DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    8928                      .dwattr $C$DW$939, DW_AT_accessibility(DW_ACCESS_public)
    8929              
    8930              $C$DW$940       .dwtag  DW_TAG_member
    8931                      .dwattr $C$DW$940, DW_AT_type(*$C$DW$T$56)
    8932                      .dwattr $C$DW$940, DW_AT_name("pidHandle_Iq")
    8933                      .dwattr $C$DW$940, DW_AT_TI_symbol_name("_pidHandle_Iq")
    8934                      .dwattr $C$DW$940, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    8935                      .dwattr $C$DW$940, DW_AT_accessibility(DW_ACCESS_public)
    8936              
    8937              $C$DW$941       .dwtag  DW_TAG_member
    8938                      .dwattr $C$DW$941, DW_AT_type(*$C$DW$T$57)
    8939                      .dwattr $C$DW$941, DW_AT_name("pid_Iq")
    8940                      .dwattr $C$DW$941, DW_AT_TI_symbol_name("_pid_Iq")
    8941                      .dwattr $C$DW$941, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    8942                      .dwattr $C$DW$941, DW_AT_accessibility(DW_ACCESS_public)
    8943              
    8944              $C$DW$942       .dwtag  DW_TAG_member
    8945                      .dwattr $C$DW$942, DW_AT_type(*$C$DW$T$56)
    8946                      .dwattr $C$DW$942, DW_AT_name("pidHandle_spd")
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{27055C55-759B-4058-9F3D-3B9CDF016724} PAGE  175

    8947                      .dwattr $C$DW$942, DW_AT_TI_symbol_name("_pidHandle_spd")
    8948                      .dwattr $C$DW$942, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    8949                      .dwattr $C$DW$942, DW_AT_accessibility(DW_ACCESS_public)
    8950              
    8951              $C$DW$943       .dwtag  DW_TAG_member
    8952                      .dwattr $C$DW$943, DW_AT_type(*$C$DW$T$57)
    8953                      .dwattr $C$DW$943, DW_AT_name("pid_spd")
    8954                      .dwattr $C$DW$943, DW_AT_TI_symbol_name("_pid_spd")
    8955                      .dwattr $C$DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    8956                      .dwattr $C$DW$943, DW_AT_accessibility(DW_ACCESS_public)
    8957              
    8958              $C$DW$944       .dwtag  DW_TAG_member
    8959                      .dwattr $C$DW$944, DW_AT_type(*$C$DW$T$59)
    8960                      .dwattr $C$DW$944, DW_AT_name("iparkHandle")
    8961                      .dwattr $C$DW$944, DW_AT_TI_symbol_name("_iparkHandle")
    8962                      .dwattr $C$DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    8963                      .dwattr $C$DW$944, DW_AT_accessibility(DW_ACCESS_public)
    8964              
    8965              $C$DW$945       .dwtag  DW_TAG_member
    8966                      .dwattr $C$DW$945, DW_AT_type(*$C$DW$T$60)
    8967                      .dwattr $C$DW$945, DW_AT_name("ipark")
    8968                      .dwattr $C$DW$945, DW_AT_TI_symbol_name("_ipark")
    8969                      .dwattr $C$DW$945, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    8970                      .dwattr $C$DW$945, DW_AT_accessibility(DW_ACCESS_public)
    8971              
    8972              $C$DW$946       .dwtag  DW_TAG_member
    8973                      .dwattr $C$DW$946, DW_AT_type(*$C$DW$T$62)
    8974                      .dwattr $C$DW$946, DW_AT_name("svgenHandle")
    8975                      .dwattr $C$DW$946, DW_AT_TI_symbol_name("_svgenHandle")
    8976                      .dwattr $C$DW$946, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    8977                      .dwattr $C$DW$946, DW_AT_accessibility(DW_ACCESS_public)
    8978              
    8979              $C$DW$947       .dwtag  DW_TAG_member
    8980                      .dwattr $C$DW$947, DW_AT_type(*$C$DW$T$63)
    8981                      .dwattr $C$DW$947, DW_AT_name("svgen")
    8982                      .dwattr $C$DW$947, DW_AT_TI_symbol_name("_svgen")
    8983                      .dwattr $C$DW$947, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    8984                      .dwattr $C$DW$947, DW_AT_accessibility(DW_ACCESS_public)
    8985              
    8986              $C$DW$948       .dwtag  DW_TAG_member
    8987                      .dwattr $C$DW$948, DW_AT_type(*$C$DW$T$65)
    8988                      .dwattr $C$DW$948, DW_AT_name("trajHandle_Id")
    8989                      .dwattr $C$DW$948, DW_AT_TI_symbol_name("_trajHandle_Id")
    8990                      .dwattr $C$DW$948, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    8991                      .dwattr $C$DW$948, DW_AT_accessibility(DW_ACCESS_public)
    8992              
    8993              $C$DW$949       .dwtag  DW_TAG_member
    8994                      .dwattr $C$DW$949, DW_AT_type(*$C$DW$T$66)
    8995                      .dwattr $C$DW$949, DW_AT_name("traj_Id")
    8996                      .dwattr $C$DW$949, DW_AT_TI_symbol_name("_traj_Id")
    8997                      .dwattr $C$DW$949, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    8998                      .dwattr $C$DW$949, DW_AT_accessibility(DW_ACCESS_public)
    8999              
    9000              $C$DW$950       .dwtag  DW_TAG_member
    9001                      .dwattr $C$DW$950, DW_AT_type(*$C$DW$T$65)
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{27055C55-759B-4058-9F3D-3B9CDF016724} PAGE  176

    9002                      .dwattr $C$DW$950, DW_AT_name("trajHandle_spd")
    9003                      .dwattr $C$DW$950, DW_AT_TI_symbol_name("_trajHandle_spd")
    9004                      .dwattr $C$DW$950, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    9005                      .dwattr $C$DW$950, DW_AT_accessibility(DW_ACCESS_public)
    9006              
    9007              $C$DW$951       .dwtag  DW_TAG_member
    9008                      .dwattr $C$DW$951, DW_AT_type(*$C$DW$T$66)
    9009                      .dwattr $C$DW$951, DW_AT_name("traj_spd")
    9010                      .dwattr $C$DW$951, DW_AT_TI_symbol_name("_traj_spd")
    9011                      .dwattr $C$DW$951, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    9012                      .dwattr $C$DW$951, DW_AT_accessibility(DW_ACCESS_public)
    9013              
    9014              $C$DW$952       .dwtag  DW_TAG_member
    9015                      .dwattr $C$DW$952, DW_AT_type(*$C$DW$T$65)
    9016                      .dwattr $C$DW$952, DW_AT_name("trajHandle_spdMax")
    9017                      .dwattr $C$DW$952, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    9018                      .dwattr $C$DW$952, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    9019                      .dwattr $C$DW$952, DW_AT_accessibility(DW_ACCESS_public)
    9020              
    9021              $C$DW$953       .dwtag  DW_TAG_member
    9022                      .dwattr $C$DW$953, DW_AT_type(*$C$DW$T$66)
    9023                      .dwattr $C$DW$953, DW_AT_name("traj_spdMax")
    9024                      .dwattr $C$DW$953, DW_AT_TI_symbol_name("_traj_spdMax")
    9025                      .dwattr $C$DW$953, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    9026                      .dwattr $C$DW$953, DW_AT_accessibility(DW_ACCESS_public)
    9027              
    9028              $C$DW$954       .dwtag  DW_TAG_member
    9029                      .dwattr $C$DW$954, DW_AT_type(*$C$DW$T$67)
    9030                      .dwattr $C$DW$954, DW_AT_name("motorParams")
    9031                      .dwattr $C$DW$954, DW_AT_TI_symbol_name("_motorParams")
    9032                      .dwattr $C$DW$954, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    9033                      .dwattr $C$DW$954, DW_AT_accessibility(DW_ACCESS_public)
    9034              
    9035              $C$DW$955       .dwtag  DW_TAG_member
    9036                      .dwattr $C$DW$955, DW_AT_type(*$C$DW$T$71)
    9037                      .dwattr $C$DW$955, DW_AT_name("waitTimes")
    9038                      .dwattr $C$DW$955, DW_AT_TI_symbol_name("_waitTimes")
    9039                      .dwattr $C$DW$955, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    9040                      .dwattr $C$DW$955, DW_AT_accessibility(DW_ACCESS_public)
    9041              
    9042              $C$DW$956       .dwtag  DW_TAG_member
    9043                      .dwattr $C$DW$956, DW_AT_type(*$C$DW$T$70)
    9044                      .dwattr $C$DW$956, DW_AT_name("counter_state")
    9045                      .dwattr $C$DW$956, DW_AT_TI_symbol_name("_counter_state")
    9046                      .dwattr $C$DW$956, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    9047                      .dwattr $C$DW$956, DW_AT_accessibility(DW_ACCESS_public)
    9048              
    9049              $C$DW$957       .dwtag  DW_TAG_member
    9050                      .dwattr $C$DW$957, DW_AT_type(*$C$DW$T$73)
    9051                      .dwattr $C$DW$957, DW_AT_name("numIsrTicksPerCtrlTick")
    9052                      .dwattr $C$DW$957, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    9053                      .dwattr $C$DW$957, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    9054                      .dwattr $C$DW$957, DW_AT_accessibility(DW_ACCESS_public)
    9055              
    9056              $C$DW$958       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{27055C55-759B-4058-9F3D-3B9CDF016724} PAGE  177

    9057                      .dwattr $C$DW$958, DW_AT_type(*$C$DW$T$73)
    9058                      .dwattr $C$DW$958, DW_AT_name("numCtrlTicksPerCurrentTick")
    9059                      .dwattr $C$DW$958, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    9060                      .dwattr $C$DW$958, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    9061                      .dwattr $C$DW$958, DW_AT_accessibility(DW_ACCESS_public)
    9062              
    9063              $C$DW$959       .dwtag  DW_TAG_member
    9064                      .dwattr $C$DW$959, DW_AT_type(*$C$DW$T$73)
    9065                      .dwattr $C$DW$959, DW_AT_name("numCtrlTicksPerSpeedTick")
    9066                      .dwattr $C$DW$959, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    9067                      .dwattr $C$DW$959, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    9068                      .dwattr $C$DW$959, DW_AT_accessibility(DW_ACCESS_public)
    9069              
    9070              $C$DW$960       .dwtag  DW_TAG_member
    9071                      .dwattr $C$DW$960, DW_AT_type(*$C$DW$T$73)
    9072                      .dwattr $C$DW$960, DW_AT_name("numCtrlTicksPerTrajTick")
    9073                      .dwattr $C$DW$960, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    9074                      .dwattr $C$DW$960, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    9075                      .dwattr $C$DW$960, DW_AT_accessibility(DW_ACCESS_public)
    9076              
    9077              $C$DW$961       .dwtag  DW_TAG_member
    9078                      .dwattr $C$DW$961, DW_AT_type(*$C$DW$T$70)
    9079                      .dwattr $C$DW$961, DW_AT_name("ctrlFreq_Hz")
    9080                      .dwattr $C$DW$961, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    9081                      .dwattr $C$DW$961, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    9082                      .dwattr $C$DW$961, DW_AT_accessibility(DW_ACCESS_public)
    9083              
    9084              $C$DW$962       .dwtag  DW_TAG_member
    9085                      .dwattr $C$DW$962, DW_AT_type(*$C$DW$T$70)
    9086                      .dwattr $C$DW$962, DW_AT_name("trajFreq_Hz")
    9087                      .dwattr $C$DW$962, DW_AT_TI_symbol_name("_trajFreq_Hz")
    9088                      .dwattr $C$DW$962, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    9089                      .dwattr $C$DW$962, DW_AT_accessibility(DW_ACCESS_public)
    9090              
    9091              $C$DW$963       .dwtag  DW_TAG_member
    9092                      .dwattr $C$DW$963, DW_AT_type(*$C$DW$T$35)
    9093                      .dwattr $C$DW$963, DW_AT_name("trajPeriod_sec")
    9094                      .dwattr $C$DW$963, DW_AT_TI_symbol_name("_trajPeriod_sec")
    9095                      .dwattr $C$DW$963, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    9096                      .dwattr $C$DW$963, DW_AT_accessibility(DW_ACCESS_public)
    9097              
    9098              $C$DW$964       .dwtag  DW_TAG_member
    9099                      .dwattr $C$DW$964, DW_AT_type(*$C$DW$T$74)
    9100                      .dwattr $C$DW$964, DW_AT_name("ctrlPeriod_sec")
    9101                      .dwattr $C$DW$964, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    9102                      .dwattr $C$DW$964, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    9103                      .dwattr $C$DW$964, DW_AT_accessibility(DW_ACCESS_public)
    9104              
    9105              $C$DW$965       .dwtag  DW_TAG_member
    9106                      .dwattr $C$DW$965, DW_AT_type(*$C$DW$T$35)
    9107                      .dwattr $C$DW$965, DW_AT_name("maxVsMag_pu")
    9108                      .dwattr $C$DW$965, DW_AT_TI_symbol_name("_maxVsMag_pu")
    9109                      .dwattr $C$DW$965, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    9110                      .dwattr $C$DW$965, DW_AT_accessibility(DW_ACCESS_public)
    9111              
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{27055C55-759B-4058-9F3D-3B9CDF016724} PAGE  178

    9112              $C$DW$966       .dwtag  DW_TAG_member
    9113                      .dwattr $C$DW$966, DW_AT_type(*$C$DW$T$75)
    9114                      .dwattr $C$DW$966, DW_AT_name("Iab_in")
    9115                      .dwattr $C$DW$966, DW_AT_TI_symbol_name("_Iab_in")
    9116                      .dwattr $C$DW$966, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    9117                      .dwattr $C$DW$966, DW_AT_accessibility(DW_ACCESS_public)
    9118              
    9119              $C$DW$967       .dwtag  DW_TAG_member
    9120                      .dwattr $C$DW$967, DW_AT_type(*$C$DW$T$75)
    9121                      .dwattr $C$DW$967, DW_AT_name("Iab_filt")
    9122                      .dwattr $C$DW$967, DW_AT_TI_symbol_name("_Iab_filt")
    9123                      .dwattr $C$DW$967, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    9124                      .dwattr $C$DW$967, DW_AT_accessibility(DW_ACCESS_public)
    9125              
    9126              $C$DW$968       .dwtag  DW_TAG_member
    9127                      .dwattr $C$DW$968, DW_AT_type(*$C$DW$T$75)
    9128                      .dwattr $C$DW$968, DW_AT_name("Idq_in")
    9129                      .dwattr $C$DW$968, DW_AT_TI_symbol_name("_Idq_in")
    9130                      .dwattr $C$DW$968, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    9131                      .dwattr $C$DW$968, DW_AT_accessibility(DW_ACCESS_public)
    9132              
    9133              $C$DW$969       .dwtag  DW_TAG_member
    9134                      .dwattr $C$DW$969, DW_AT_type(*$C$DW$T$75)
    9135                      .dwattr $C$DW$969, DW_AT_name("Vab_in")
    9136                      .dwattr $C$DW$969, DW_AT_TI_symbol_name("_Vab_in")
    9137                      .dwattr $C$DW$969, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    9138                      .dwattr $C$DW$969, DW_AT_accessibility(DW_ACCESS_public)
    9139              
    9140              $C$DW$970       .dwtag  DW_TAG_member
    9141                      .dwattr $C$DW$970, DW_AT_type(*$C$DW$T$35)
    9142                      .dwattr $C$DW$970, DW_AT_name("spd_out")
    9143                      .dwattr $C$DW$970, DW_AT_TI_symbol_name("_spd_out")
    9144                      .dwattr $C$DW$970, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    9145                      .dwattr $C$DW$970, DW_AT_accessibility(DW_ACCESS_public)
    9146              
    9147              $C$DW$971       .dwtag  DW_TAG_member
    9148                      .dwattr $C$DW$971, DW_AT_type(*$C$DW$T$75)
    9149                      .dwattr $C$DW$971, DW_AT_name("Vab_out")
    9150                      .dwattr $C$DW$971, DW_AT_TI_symbol_name("_Vab_out")
    9151                      .dwattr $C$DW$971, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    9152                      .dwattr $C$DW$971, DW_AT_accessibility(DW_ACCESS_public)
    9153              
    9154              $C$DW$972       .dwtag  DW_TAG_member
    9155                      .dwattr $C$DW$972, DW_AT_type(*$C$DW$T$75)
    9156                      .dwattr $C$DW$972, DW_AT_name("Vdq_out")
    9157                      .dwattr $C$DW$972, DW_AT_TI_symbol_name("_Vdq_out")
    9158                      .dwattr $C$DW$972, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    9159                      .dwattr $C$DW$972, DW_AT_accessibility(DW_ACCESS_public)
    9160              
    9161              $C$DW$973       .dwtag  DW_TAG_member
    9162                      .dwattr $C$DW$973, DW_AT_type(*$C$DW$T$74)
    9163                      .dwattr $C$DW$973, DW_AT_name("Rhf")
    9164                      .dwattr $C$DW$973, DW_AT_TI_symbol_name("_Rhf")
    9165                      .dwattr $C$DW$973, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    9166                      .dwattr $C$DW$973, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{27055C55-759B-4058-9F3D-3B9CDF016724} PAGE  179

    9167              
    9168              $C$DW$974       .dwtag  DW_TAG_member
    9169                      .dwattr $C$DW$974, DW_AT_type(*$C$DW$T$74)
    9170                      .dwattr $C$DW$974, DW_AT_name("Lhf")
    9171                      .dwattr $C$DW$974, DW_AT_TI_symbol_name("_Lhf")
    9172                      .dwattr $C$DW$974, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    9173                      .dwattr $C$DW$974, DW_AT_accessibility(DW_ACCESS_public)
    9174              
    9175              $C$DW$975       .dwtag  DW_TAG_member
    9176                      .dwattr $C$DW$975, DW_AT_type(*$C$DW$T$74)
    9177                      .dwattr $C$DW$975, DW_AT_name("RoverL")
    9178                      .dwattr $C$DW$975, DW_AT_TI_symbol_name("_RoverL")
    9179                      .dwattr $C$DW$975, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    9180                      .dwattr $C$DW$975, DW_AT_accessibility(DW_ACCESS_public)
    9181              
    9182              $C$DW$976       .dwtag  DW_TAG_member
    9183                      .dwattr $C$DW$976, DW_AT_type(*$C$DW$T$35)
    9184                      .dwattr $C$DW$976, DW_AT_name("Kp_Id")
    9185                      .dwattr $C$DW$976, DW_AT_TI_symbol_name("_Kp_Id")
    9186                      .dwattr $C$DW$976, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    9187                      .dwattr $C$DW$976, DW_AT_accessibility(DW_ACCESS_public)
    9188              
    9189              $C$DW$977       .dwtag  DW_TAG_member
    9190                      .dwattr $C$DW$977, DW_AT_type(*$C$DW$T$35)
    9191                      .dwattr $C$DW$977, DW_AT_name("Kp_Iq")
    9192                      .dwattr $C$DW$977, DW_AT_TI_symbol_name("_Kp_Iq")
    9193                      .dwattr $C$DW$977, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    9194                      .dwattr $C$DW$977, DW_AT_accessibility(DW_ACCESS_public)
    9195              
    9196              $C$DW$978       .dwtag  DW_TAG_member
    9197                      .dwattr $C$DW$978, DW_AT_type(*$C$DW$T$35)
    9198                      .dwattr $C$DW$978, DW_AT_name("Kp_spd")
    9199                      .dwattr $C$DW$978, DW_AT_TI_symbol_name("_Kp_spd")
    9200                      .dwattr $C$DW$978, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    9201                      .dwattr $C$DW$978, DW_AT_accessibility(DW_ACCESS_public)
    9202              
    9203              $C$DW$979       .dwtag  DW_TAG_member
    9204                      .dwattr $C$DW$979, DW_AT_type(*$C$DW$T$35)
    9205                      .dwattr $C$DW$979, DW_AT_name("Ki_Id")
    9206                      .dwattr $C$DW$979, DW_AT_TI_symbol_name("_Ki_Id")
    9207                      .dwattr $C$DW$979, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    9208                      .dwattr $C$DW$979, DW_AT_accessibility(DW_ACCESS_public)
    9209              
    9210              $C$DW$980       .dwtag  DW_TAG_member
    9211                      .dwattr $C$DW$980, DW_AT_type(*$C$DW$T$35)
    9212                      .dwattr $C$DW$980, DW_AT_name("Ki_Iq")
    9213                      .dwattr $C$DW$980, DW_AT_TI_symbol_name("_Ki_Iq")
    9214                      .dwattr $C$DW$980, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    9215                      .dwattr $C$DW$980, DW_AT_accessibility(DW_ACCESS_public)
    9216              
    9217              $C$DW$981       .dwtag  DW_TAG_member
    9218                      .dwattr $C$DW$981, DW_AT_type(*$C$DW$T$35)
    9219                      .dwattr $C$DW$981, DW_AT_name("Ki_spd")
    9220                      .dwattr $C$DW$981, DW_AT_TI_symbol_name("_Ki_spd")
    9221                      .dwattr $C$DW$981, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{27055C55-759B-4058-9F3D-3B9CDF016724} PAGE  180

    9222                      .dwattr $C$DW$981, DW_AT_accessibility(DW_ACCESS_public)
    9223              
    9224              $C$DW$982       .dwtag  DW_TAG_member
    9225                      .dwattr $C$DW$982, DW_AT_type(*$C$DW$T$35)
    9226                      .dwattr $C$DW$982, DW_AT_name("Kd_Id")
    9227                      .dwattr $C$DW$982, DW_AT_TI_symbol_name("_Kd_Id")
    9228                      .dwattr $C$DW$982, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    9229                      .dwattr $C$DW$982, DW_AT_accessibility(DW_ACCESS_public)
    9230              
    9231              $C$DW$983       .dwtag  DW_TAG_member
    9232                      .dwattr $C$DW$983, DW_AT_type(*$C$DW$T$35)
    9233                      .dwattr $C$DW$983, DW_AT_name("Kd_Iq")
    9234                      .dwattr $C$DW$983, DW_AT_TI_symbol_name("_Kd_Iq")
    9235                      .dwattr $C$DW$983, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    9236                      .dwattr $C$DW$983, DW_AT_accessibility(DW_ACCESS_public)
    9237              
    9238              $C$DW$984       .dwtag  DW_TAG_member
    9239                      .dwattr $C$DW$984, DW_AT_type(*$C$DW$T$35)
    9240                      .dwattr $C$DW$984, DW_AT_name("Kd_spd")
    9241                      .dwattr $C$DW$984, DW_AT_TI_symbol_name("_Kd_spd")
    9242                      .dwattr $C$DW$984, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    9243                      .dwattr $C$DW$984, DW_AT_accessibility(DW_ACCESS_public)
    9244              
    9245              $C$DW$985       .dwtag  DW_TAG_member
    9246                      .dwattr $C$DW$985, DW_AT_type(*$C$DW$T$35)
    9247                      .dwattr $C$DW$985, DW_AT_name("Ui_Id")
    9248                      .dwattr $C$DW$985, DW_AT_TI_symbol_name("_Ui_Id")
    9249                      .dwattr $C$DW$985, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    9250                      .dwattr $C$DW$985, DW_AT_accessibility(DW_ACCESS_public)
    9251              
    9252              $C$DW$986       .dwtag  DW_TAG_member
    9253                      .dwattr $C$DW$986, DW_AT_type(*$C$DW$T$35)
    9254                      .dwattr $C$DW$986, DW_AT_name("Ui_Iq")
    9255                      .dwattr $C$DW$986, DW_AT_TI_symbol_name("_Ui_Iq")
    9256                      .dwattr $C$DW$986, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    9257                      .dwattr $C$DW$986, DW_AT_accessibility(DW_ACCESS_public)
    9258              
    9259              $C$DW$987       .dwtag  DW_TAG_member
    9260                      .dwattr $C$DW$987, DW_AT_type(*$C$DW$T$35)
    9261                      .dwattr $C$DW$987, DW_AT_name("Ui_spd")
    9262                      .dwattr $C$DW$987, DW_AT_TI_symbol_name("_Ui_spd")
    9263                      .dwattr $C$DW$987, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    9264                      .dwattr $C$DW$987, DW_AT_accessibility(DW_ACCESS_public)
    9265              
    9266              $C$DW$988       .dwtag  DW_TAG_member
    9267                      .dwattr $C$DW$988, DW_AT_type(*$C$DW$T$75)
    9268                      .dwattr $C$DW$988, DW_AT_name("Idq_ref")
    9269                      .dwattr $C$DW$988, DW_AT_TI_symbol_name("_Idq_ref")
    9270                      .dwattr $C$DW$988, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    9271                      .dwattr $C$DW$988, DW_AT_accessibility(DW_ACCESS_public)
    9272              
    9273              $C$DW$989       .dwtag  DW_TAG_member
    9274                      .dwattr $C$DW$989, DW_AT_type(*$C$DW$T$35)
    9275                      .dwattr $C$DW$989, DW_AT_name("IdRated")
    9276                      .dwattr $C$DW$989, DW_AT_TI_symbol_name("_IdRated")
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{27055C55-759B-4058-9F3D-3B9CDF016724} PAGE  181

    9277                      .dwattr $C$DW$989, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    9278                      .dwattr $C$DW$989, DW_AT_accessibility(DW_ACCESS_public)
    9279              
    9280              $C$DW$990       .dwtag  DW_TAG_member
    9281                      .dwattr $C$DW$990, DW_AT_type(*$C$DW$T$35)
    9282                      .dwattr $C$DW$990, DW_AT_name("spd_ref")
    9283                      .dwattr $C$DW$990, DW_AT_TI_symbol_name("_spd_ref")
    9284                      .dwattr $C$DW$990, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    9285                      .dwattr $C$DW$990, DW_AT_accessibility(DW_ACCESS_public)
    9286              
    9287              $C$DW$991       .dwtag  DW_TAG_member
    9288                      .dwattr $C$DW$991, DW_AT_type(*$C$DW$T$35)
    9289                      .dwattr $C$DW$991, DW_AT_name("spd_max")
    9290                      .dwattr $C$DW$991, DW_AT_TI_symbol_name("_spd_max")
    9291                      .dwattr $C$DW$991, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    9292                      .dwattr $C$DW$991, DW_AT_accessibility(DW_ACCESS_public)
    9293              
    9294              $C$DW$992       .dwtag  DW_TAG_member
    9295                      .dwattr $C$DW$992, DW_AT_type(*$C$DW$T$73)
    9296                      .dwattr $C$DW$992, DW_AT_name("counter_current")
    9297                      .dwattr $C$DW$992, DW_AT_TI_symbol_name("_counter_current")
    9298                      .dwattr $C$DW$992, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    9299                      .dwattr $C$DW$992, DW_AT_accessibility(DW_ACCESS_public)
    9300              
    9301              $C$DW$993       .dwtag  DW_TAG_member
    9302                      .dwattr $C$DW$993, DW_AT_type(*$C$DW$T$73)
    9303                      .dwattr $C$DW$993, DW_AT_name("counter_isr")
    9304                      .dwattr $C$DW$993, DW_AT_TI_symbol_name("_counter_isr")
    9305                      .dwattr $C$DW$993, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    9306                      .dwattr $C$DW$993, DW_AT_accessibility(DW_ACCESS_public)
    9307              
    9308              $C$DW$994       .dwtag  DW_TAG_member
    9309                      .dwattr $C$DW$994, DW_AT_type(*$C$DW$T$73)
    9310                      .dwattr $C$DW$994, DW_AT_name("counter_speed")
    9311                      .dwattr $C$DW$994, DW_AT_TI_symbol_name("_counter_speed")
    9312                      .dwattr $C$DW$994, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    9313                      .dwattr $C$DW$994, DW_AT_accessibility(DW_ACCESS_public)
    9314              
    9315              $C$DW$995       .dwtag  DW_TAG_member
    9316                      .dwattr $C$DW$995, DW_AT_type(*$C$DW$T$73)
    9317                      .dwattr $C$DW$995, DW_AT_name("counter_traj")
    9318                      .dwattr $C$DW$995, DW_AT_TI_symbol_name("_counter_traj")
    9319                      .dwattr $C$DW$995, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    9320                      .dwattr $C$DW$995, DW_AT_accessibility(DW_ACCESS_public)
    9321              
    9322              $C$DW$996       .dwtag  DW_TAG_member
    9323                      .dwattr $C$DW$996, DW_AT_type(*$C$DW$T$76)
    9324                      .dwattr $C$DW$996, DW_AT_name("flag_enableCtrl")
    9325                      .dwattr $C$DW$996, DW_AT_TI_symbol_name("_flag_enableCtrl")
    9326                      .dwattr $C$DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    9327                      .dwattr $C$DW$996, DW_AT_accessibility(DW_ACCESS_public)
    9328              
    9329              $C$DW$997       .dwtag  DW_TAG_member
    9330                      .dwattr $C$DW$997, DW_AT_type(*$C$DW$T$76)
    9331                      .dwattr $C$DW$997, DW_AT_name("flag_enableDcBusComp")
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{27055C55-759B-4058-9F3D-3B9CDF016724} PAGE  182

    9332                      .dwattr $C$DW$997, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    9333                      .dwattr $C$DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    9334                      .dwattr $C$DW$997, DW_AT_accessibility(DW_ACCESS_public)
    9335              
    9336              $C$DW$998       .dwtag  DW_TAG_member
    9337                      .dwattr $C$DW$998, DW_AT_type(*$C$DW$T$76)
    9338                      .dwattr $C$DW$998, DW_AT_name("flag_enablePowerWarp")
    9339                      .dwattr $C$DW$998, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    9340                      .dwattr $C$DW$998, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    9341                      .dwattr $C$DW$998, DW_AT_accessibility(DW_ACCESS_public)
    9342              
    9343              $C$DW$999       .dwtag  DW_TAG_member
    9344                      .dwattr $C$DW$999, DW_AT_type(*$C$DW$T$76)
    9345                      .dwattr $C$DW$999, DW_AT_name("flag_enableOffset")
    9346                      .dwattr $C$DW$999, DW_AT_TI_symbol_name("_flag_enableOffset")
    9347                      .dwattr $C$DW$999, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    9348                      .dwattr $C$DW$999, DW_AT_accessibility(DW_ACCESS_public)
    9349              
    9350              $C$DW$1000      .dwtag  DW_TAG_member
    9351                      .dwattr $C$DW$1000, DW_AT_type(*$C$DW$T$76)
    9352                      .dwattr $C$DW$1000, DW_AT_name("flag_enableSpeedCtrl")
    9353                      .dwattr $C$DW$1000, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    9354                      .dwattr $C$DW$1000, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    9355                      .dwattr $C$DW$1000, DW_AT_accessibility(DW_ACCESS_public)
    9356              
    9357              $C$DW$1001      .dwtag  DW_TAG_member
    9358                      .dwattr $C$DW$1001, DW_AT_type(*$C$DW$T$76)
    9359                      .dwattr $C$DW$1001, DW_AT_name("flag_enableUserMotorParams")
    9360                      .dwattr $C$DW$1001, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    9361                      .dwattr $C$DW$1001, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    9362                      .dwattr $C$DW$1001, DW_AT_accessibility(DW_ACCESS_public)
    9363              
    9364              $C$DW$1002      .dwtag  DW_TAG_member
    9365                      .dwattr $C$DW$1002, DW_AT_type(*$C$DW$T$75)
    9366                      .dwattr $C$DW$1002, DW_AT_name("Idq_offset_pu")
    9367                      .dwattr $C$DW$1002, DW_AT_TI_symbol_name("_Idq_offset_pu")
    9368                      .dwattr $C$DW$1002, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    9369                      .dwattr $C$DW$1002, DW_AT_accessibility(DW_ACCESS_public)
    9370              
    9371              $C$DW$1003      .dwtag  DW_TAG_member
    9372                      .dwattr $C$DW$1003, DW_AT_type(*$C$DW$T$75)
    9373                      .dwattr $C$DW$1003, DW_AT_name("Vdq_offset_pu")
    9374                      .dwattr $C$DW$1003, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    9375                      .dwattr $C$DW$1003, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    9376                      .dwattr $C$DW$1003, DW_AT_accessibility(DW_ACCESS_public)
    9377              
    9378              $C$DW$1004      .dwtag  DW_TAG_member
    9379                      .dwattr $C$DW$1004, DW_AT_type(*$C$DW$T$35)
    9380                      .dwattr $C$DW$1004, DW_AT_name("angle_pu")
    9381                      .dwattr $C$DW$1004, DW_AT_TI_symbol_name("_angle_pu")
    9382                      .dwattr $C$DW$1004, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    9383                      .dwattr $C$DW$1004, DW_AT_accessibility(DW_ACCESS_public)
    9384              
    9385              $C$DW$1005      .dwtag  DW_TAG_member
    9386                      .dwattr $C$DW$1005, DW_AT_type(*$C$DW$T$35)
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{27055C55-759B-4058-9F3D-3B9CDF016724} PAGE  183

    9387                      .dwattr $C$DW$1005, DW_AT_name("speed_ref_pu")
    9388                      .dwattr $C$DW$1005, DW_AT_TI_symbol_name("_speed_ref_pu")
    9389                      .dwattr $C$DW$1005, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    9390                      .dwattr $C$DW$1005, DW_AT_accessibility(DW_ACCESS_public)
    9391              
    9392              $C$DW$1006      .dwtag  DW_TAG_member
    9393                      .dwattr $C$DW$1006, DW_AT_type(*$C$DW$T$35)
    9394                      .dwattr $C$DW$1006, DW_AT_name("speed_fb_pu")
    9395                      .dwattr $C$DW$1006, DW_AT_TI_symbol_name("_speed_fb_pu")
    9396                      .dwattr $C$DW$1006, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    9397                      .dwattr $C$DW$1006, DW_AT_accessibility(DW_ACCESS_public)
    9398              
    9399              $C$DW$1007      .dwtag  DW_TAG_member
    9400                      .dwattr $C$DW$1007, DW_AT_type(*$C$DW$T$35)
    9401                      .dwattr $C$DW$1007, DW_AT_name("speed_outMax_pu")
    9402                      .dwattr $C$DW$1007, DW_AT_TI_symbol_name("_speed_outMax_pu")
    9403                      .dwattr $C$DW$1007, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    9404                      .dwattr $C$DW$1007, DW_AT_accessibility(DW_ACCESS_public)
    9405              
    9406              $C$DW$1008      .dwtag  DW_TAG_member
    9407                      .dwattr $C$DW$1008, DW_AT_type(*$C$DW$T$76)
    9408                      .dwattr $C$DW$1008, DW_AT_name("flag_enableCurrentCtrl")
    9409                      .dwattr $C$DW$1008, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    9410                      .dwattr $C$DW$1008, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    9411                      .dwattr $C$DW$1008, DW_AT_accessibility(DW_ACCESS_public)
    9412              
    9413              $C$DW$1009      .dwtag  DW_TAG_member
    9414                      .dwattr $C$DW$1009, DW_AT_type(*$C$DW$T$35)
    9415                      .dwattr $C$DW$1009, DW_AT_name("torque_head_comm")
    9416                      .dwattr $C$DW$1009, DW_AT_TI_symbol_name("_torque_head_comm")
    9417                      .dwattr $C$DW$1009, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    9418                      .dwattr $C$DW$1009, DW_AT_accessibility(DW_ACCESS_public)
    9419              
    9420                      .dwendtag $C$DW$T$77
    9421              
    9422              $C$DW$T$248     .dwtag  DW_TAG_typedef
    9423                      .dwattr $C$DW$T$248, DW_AT_name("CTRL_Obj")
    9424                      .dwattr $C$DW$T$248, DW_AT_type(*$C$DW$T$77)
    9425                      .dwattr $C$DW$T$248, DW_AT_language(DW_LANG_C)
    9426              
    9427              $C$DW$T$249     .dwtag  DW_TAG_pointer_type
    9428                      .dwattr $C$DW$T$249, DW_AT_type(*$C$DW$T$248)
    9429                      .dwattr $C$DW$T$249, DW_AT_address_class(0x20)
    9430              
    9431              $C$DW$T$203     .dwtag  DW_TAG_pointer_type
    9432                      .dwattr $C$DW$T$203, DW_AT_type(*$C$DW$T$77)
    9433                      .dwattr $C$DW$T$203, DW_AT_address_class(0x20)
    9434              
    9435              $C$DW$T$204     .dwtag  DW_TAG_typedef
    9436                      .dwattr $C$DW$T$204, DW_AT_name("CTRL_Handle")
    9437                      .dwattr $C$DW$T$204, DW_AT_type(*$C$DW$T$203)
    9438                      .dwattr $C$DW$T$204, DW_AT_language(DW_LANG_C)
    9439              
    9440              $C$DW$1010      .dwtag  DW_TAG_TI_far_type
    9441                      .dwattr $C$DW$1010, DW_AT_type(*$C$DW$T$204)
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{27055C55-759B-4058-9F3D-3B9CDF016724} PAGE  184

    9442              
    9443              $C$DW$T$250     .dwtag  DW_TAG_const_type
    9444                      .dwattr $C$DW$T$250, DW_AT_type(*$C$DW$1010)
    9445              
    9446              
    9447              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    9448                      .dwattr $C$DW$T$80, DW_AT_name("_CTRL_Version_")
    9449                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x04)
    9450              $C$DW$1011      .dwtag  DW_TAG_member
    9451                      .dwattr $C$DW$1011, DW_AT_type(*$C$DW$T$26)
    9452                      .dwattr $C$DW$1011, DW_AT_name("rsvd")
    9453                      .dwattr $C$DW$1011, DW_AT_TI_symbol_name("_rsvd")
    9454                      .dwattr $C$DW$1011, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9455                      .dwattr $C$DW$1011, DW_AT_accessibility(DW_ACCESS_public)
    9456              
    9457              $C$DW$1012      .dwtag  DW_TAG_member
    9458                      .dwattr $C$DW$1012, DW_AT_type(*$C$DW$T$79)
    9459                      .dwattr $C$DW$1012, DW_AT_name("targetProc")
    9460                      .dwattr $C$DW$1012, DW_AT_TI_symbol_name("_targetProc")
    9461                      .dwattr $C$DW$1012, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9462                      .dwattr $C$DW$1012, DW_AT_accessibility(DW_ACCESS_public)
    9463              
    9464              $C$DW$1013      .dwtag  DW_TAG_member
    9465                      .dwattr $C$DW$1013, DW_AT_type(*$C$DW$T$26)
    9466                      .dwattr $C$DW$1013, DW_AT_name("major")
    9467                      .dwattr $C$DW$1013, DW_AT_TI_symbol_name("_major")
    9468                      .dwattr $C$DW$1013, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9469                      .dwattr $C$DW$1013, DW_AT_accessibility(DW_ACCESS_public)
    9470              
    9471              $C$DW$1014      .dwtag  DW_TAG_member
    9472                      .dwattr $C$DW$1014, DW_AT_type(*$C$DW$T$26)
    9473                      .dwattr $C$DW$1014, DW_AT_name("minor")
    9474                      .dwattr $C$DW$1014, DW_AT_TI_symbol_name("_minor")
    9475                      .dwattr $C$DW$1014, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9476                      .dwattr $C$DW$1014, DW_AT_accessibility(DW_ACCESS_public)
    9477              
    9478                      .dwendtag $C$DW$T$80
    9479              
    9480              $C$DW$T$42      .dwtag  DW_TAG_typedef
    9481                      .dwattr $C$DW$T$42, DW_AT_name("CTRL_Version")
    9482                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$80)
    9483                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    9484              
    9485              $C$DW$T$256     .dwtag  DW_TAG_pointer_type
    9486                      .dwattr $C$DW$T$256, DW_AT_type(*$C$DW$T$42)
    9487                      .dwattr $C$DW$T$256, DW_AT_address_class(0x20)
    9488              
    9489              
    9490              $C$DW$T$87      .dwtag  DW_TAG_structure_type
    9491                      .dwattr $C$DW$T$87, DW_AT_name("_DRV8301_Obj_")
    9492                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x08)
    9493              $C$DW$1015      .dwtag  DW_TAG_member
    9494                      .dwattr $C$DW$1015, DW_AT_type(*$C$DW$T$82)
    9495                      .dwattr $C$DW$1015, DW_AT_name("spiHandle")
    9496                      .dwattr $C$DW$1015, DW_AT_TI_symbol_name("_spiHandle")
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{27055C55-759B-4058-9F3D-3B9CDF016724} PAGE  185

    9497                      .dwattr $C$DW$1015, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9498                      .dwattr $C$DW$1015, DW_AT_accessibility(DW_ACCESS_public)
    9499              
    9500              $C$DW$1016      .dwtag  DW_TAG_member
    9501                      .dwattr $C$DW$1016, DW_AT_type(*$C$DW$T$84)
    9502                      .dwattr $C$DW$1016, DW_AT_name("gpioHandle")
    9503                      .dwattr $C$DW$1016, DW_AT_TI_symbol_name("_gpioHandle")
    9504                      .dwattr $C$DW$1016, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9505                      .dwattr $C$DW$1016, DW_AT_accessibility(DW_ACCESS_public)
    9506              
    9507              $C$DW$1017      .dwtag  DW_TAG_member
    9508                      .dwattr $C$DW$1017, DW_AT_type(*$C$DW$T$86)
    9509                      .dwattr $C$DW$1017, DW_AT_name("gpioNumber")
    9510                      .dwattr $C$DW$1017, DW_AT_TI_symbol_name("_gpioNumber")
    9511                      .dwattr $C$DW$1017, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9512                      .dwattr $C$DW$1017, DW_AT_accessibility(DW_ACCESS_public)
    9513              
    9514              $C$DW$1018      .dwtag  DW_TAG_member
    9515                      .dwattr $C$DW$1018, DW_AT_type(*$C$DW$T$76)
    9516                      .dwattr $C$DW$1018, DW_AT_name("RxTimeOut")
    9517                      .dwattr $C$DW$1018, DW_AT_TI_symbol_name("_RxTimeOut")
    9518                      .dwattr $C$DW$1018, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9519                      .dwattr $C$DW$1018, DW_AT_accessibility(DW_ACCESS_public)
    9520              
    9521              $C$DW$1019      .dwtag  DW_TAG_member
    9522                      .dwattr $C$DW$1019, DW_AT_type(*$C$DW$T$76)
    9523                      .dwattr $C$DW$1019, DW_AT_name("enableTimeOut")
    9524                      .dwattr $C$DW$1019, DW_AT_TI_symbol_name("_enableTimeOut")
    9525                      .dwattr $C$DW$1019, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9526                      .dwattr $C$DW$1019, DW_AT_accessibility(DW_ACCESS_public)
    9527              
    9528                      .dwendtag $C$DW$T$87
    9529              
    9530              $C$DW$T$156     .dwtag  DW_TAG_typedef
    9531                      .dwattr $C$DW$T$156, DW_AT_name("DRV8301_Obj")
    9532                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$87)
    9533                      .dwattr $C$DW$T$156, DW_AT_language(DW_LANG_C)
    9534              
    9535              $C$DW$T$154     .dwtag  DW_TAG_pointer_type
    9536                      .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$87)
    9537                      .dwattr $C$DW$T$154, DW_AT_address_class(0x20)
    9538              
    9539              $C$DW$T$155     .dwtag  DW_TAG_typedef
    9540                      .dwattr $C$DW$T$155, DW_AT_name("DRV8301_Handle")
    9541                      .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$154)
    9542                      .dwattr $C$DW$T$155, DW_AT_language(DW_LANG_C)
    9543              
    9544              
    9545              $C$DW$T$98      .dwtag  DW_TAG_structure_type
    9546                      .dwattr $C$DW$T$98, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    9547                      .dwattr $C$DW$T$98, DW_AT_byte_size(0x05)
    9548              $C$DW$1020      .dwtag  DW_TAG_member
    9549                      .dwattr $C$DW$1020, DW_AT_type(*$C$DW$T$89)
    9550                      .dwattr $C$DW$1020, DW_AT_name("DRV8301_CURRENT")
    9551                      .dwattr $C$DW$1020, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{27055C55-759B-4058-9F3D-3B9CDF016724} PAGE  186

    9552                      .dwattr $C$DW$1020, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9553                      .dwattr $C$DW$1020, DW_AT_accessibility(DW_ACCESS_public)
    9554              
    9555              $C$DW$1021      .dwtag  DW_TAG_member
    9556                      .dwattr $C$DW$1021, DW_AT_type(*$C$DW$T$91)
    9557                      .dwattr $C$DW$1021, DW_AT_name("DRV8301_RESET")
    9558                      .dwattr $C$DW$1021, DW_AT_TI_symbol_name("_DRV8301_RESET")
    9559                      .dwattr $C$DW$1021, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9560                      .dwattr $C$DW$1021, DW_AT_accessibility(DW_ACCESS_public)
    9561              
    9562              $C$DW$1022      .dwtag  DW_TAG_member
    9563                      .dwattr $C$DW$1022, DW_AT_type(*$C$DW$T$93)
    9564                      .dwattr $C$DW$1022, DW_AT_name("PWM_MODE")
    9565                      .dwattr $C$DW$1022, DW_AT_TI_symbol_name("_PWM_MODE")
    9566                      .dwattr $C$DW$1022, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9567                      .dwattr $C$DW$1022, DW_AT_accessibility(DW_ACCESS_public)
    9568              
    9569              $C$DW$1023      .dwtag  DW_TAG_member
    9570                      .dwattr $C$DW$1023, DW_AT_type(*$C$DW$T$95)
    9571                      .dwattr $C$DW$1023, DW_AT_name("OC_MODE")
    9572                      .dwattr $C$DW$1023, DW_AT_TI_symbol_name("_OC_MODE")
    9573                      .dwattr $C$DW$1023, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9574                      .dwattr $C$DW$1023, DW_AT_accessibility(DW_ACCESS_public)
    9575              
    9576              $C$DW$1024      .dwtag  DW_TAG_member
    9577                      .dwattr $C$DW$1024, DW_AT_type(*$C$DW$T$97)
    9578                      .dwattr $C$DW$1024, DW_AT_name("OC_ADJ_SET")
    9579                      .dwattr $C$DW$1024, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    9580                      .dwattr $C$DW$1024, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9581                      .dwattr $C$DW$1024, DW_AT_accessibility(DW_ACCESS_public)
    9582              
    9583                      .dwendtag $C$DW$T$98
    9584              
    9585              $C$DW$T$112     .dwtag  DW_TAG_typedef
    9586                      .dwattr $C$DW$T$112, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    9587                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$98)
    9588                      .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    9589              
    9590              
    9591              $C$DW$T$107     .dwtag  DW_TAG_structure_type
    9592                      .dwattr $C$DW$T$107, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    9593                      .dwattr $C$DW$T$107, DW_AT_byte_size(0x04)
    9594              $C$DW$1025      .dwtag  DW_TAG_member
    9595                      .dwattr $C$DW$1025, DW_AT_type(*$C$DW$T$100)
    9596                      .dwattr $C$DW$1025, DW_AT_name("OCTW_SET")
    9597                      .dwattr $C$DW$1025, DW_AT_TI_symbol_name("_OCTW_SET")
    9598                      .dwattr $C$DW$1025, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9599                      .dwattr $C$DW$1025, DW_AT_accessibility(DW_ACCESS_public)
    9600              
    9601              $C$DW$1026      .dwtag  DW_TAG_member
    9602                      .dwattr $C$DW$1026, DW_AT_type(*$C$DW$T$102)
    9603                      .dwattr $C$DW$1026, DW_AT_name("GAIN")
    9604                      .dwattr $C$DW$1026, DW_AT_TI_symbol_name("_GAIN")
    9605                      .dwattr $C$DW$1026, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9606                      .dwattr $C$DW$1026, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{27055C55-759B-4058-9F3D-3B9CDF016724} PAGE  187

    9607              
    9608              $C$DW$1027      .dwtag  DW_TAG_member
    9609                      .dwattr $C$DW$1027, DW_AT_type(*$C$DW$T$104)
    9610                      .dwattr $C$DW$1027, DW_AT_name("DC_CAL_CH1p2")
    9611                      .dwattr $C$DW$1027, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    9612                      .dwattr $C$DW$1027, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9613                      .dwattr $C$DW$1027, DW_AT_accessibility(DW_ACCESS_public)
    9614              
    9615              $C$DW$1028      .dwtag  DW_TAG_member
    9616                      .dwattr $C$DW$1028, DW_AT_type(*$C$DW$T$106)
    9617                      .dwattr $C$DW$1028, DW_AT_name("OC_TOFF")
    9618                      .dwattr $C$DW$1028, DW_AT_TI_symbol_name("_OC_TOFF")
    9619                      .dwattr $C$DW$1028, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9620                      .dwattr $C$DW$1028, DW_AT_accessibility(DW_ACCESS_public)
    9621              
    9622                      .dwendtag $C$DW$T$107
    9623              
    9624              $C$DW$T$113     .dwtag  DW_TAG_typedef
    9625                      .dwattr $C$DW$T$113, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    9626                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$107)
    9627                      .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    9628              
    9629              
    9630              $C$DW$T$108     .dwtag  DW_TAG_structure_type
    9631                      .dwattr $C$DW$T$108, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    9632                      .dwattr $C$DW$T$108, DW_AT_byte_size(0x0b)
    9633              $C$DW$1029      .dwtag  DW_TAG_member
    9634                      .dwattr $C$DW$1029, DW_AT_type(*$C$DW$T$76)
    9635                      .dwattr $C$DW$1029, DW_AT_name("FAULT")
    9636                      .dwattr $C$DW$1029, DW_AT_TI_symbol_name("_FAULT")
    9637                      .dwattr $C$DW$1029, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9638                      .dwattr $C$DW$1029, DW_AT_accessibility(DW_ACCESS_public)
    9639              
    9640              $C$DW$1030      .dwtag  DW_TAG_member
    9641                      .dwattr $C$DW$1030, DW_AT_type(*$C$DW$T$76)
    9642                      .dwattr $C$DW$1030, DW_AT_name("GVDD_UV")
    9643                      .dwattr $C$DW$1030, DW_AT_TI_symbol_name("_GVDD_UV")
    9644                      .dwattr $C$DW$1030, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9645                      .dwattr $C$DW$1030, DW_AT_accessibility(DW_ACCESS_public)
    9646              
    9647              $C$DW$1031      .dwtag  DW_TAG_member
    9648                      .dwattr $C$DW$1031, DW_AT_type(*$C$DW$T$76)
    9649                      .dwattr $C$DW$1031, DW_AT_name("PVDD_UV")
    9650                      .dwattr $C$DW$1031, DW_AT_TI_symbol_name("_PVDD_UV")
    9651                      .dwattr $C$DW$1031, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9652                      .dwattr $C$DW$1031, DW_AT_accessibility(DW_ACCESS_public)
    9653              
    9654              $C$DW$1032      .dwtag  DW_TAG_member
    9655                      .dwattr $C$DW$1032, DW_AT_type(*$C$DW$T$76)
    9656                      .dwattr $C$DW$1032, DW_AT_name("OTSD")
    9657                      .dwattr $C$DW$1032, DW_AT_TI_symbol_name("_OTSD")
    9658                      .dwattr $C$DW$1032, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9659                      .dwattr $C$DW$1032, DW_AT_accessibility(DW_ACCESS_public)
    9660              
    9661              $C$DW$1033      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Wed Feb 22 13:06:48 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{27055C55-759B-4058-9F3D-3B9CDF016724} PAGE  188

    9662                      .dwattr $C$DW$1033, DW_AT_type(*$C$DW$T$76)
    9663                      .dwattr $C$DW$1033, DW_AT_name("OTW")
    9664                      .dwattr $C$DW$1033, DW_AT_TI_symbol_name("_OTW")
    9665                      .dwattr $C$DW$1033, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9666                      .dwattr $C$DW$1033, DW_AT_accessibility(DW_ACCESS_public)
    9667              
    9668              $C$DW$1034      .dwtag  DW_TAG_member
    9669                      .dwattr $C$DW$1034, DW_AT_type(*$C$DW$T$76)
    9670                      .dwattr $C$DW$1034, DW_AT_name("FETHA_OC")
    9671                      .dwattr $C$DW$1034, DW_AT_TI_symbol_name("_FETHA_OC")
    9672                      .dwattr $C$DW$1034, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9673                      .dwattr $C$DW$1034, DW_AT_accessibility(DW_ACCESS_public)
    9674              
    9675              $C$DW$1035      .dwtag  DW_TAG_member
    9676                      .dwattr $C$DW$1035, DW_AT_type(*$C$DW$T$76)
    9677                      .dwattr $C$DW$1035, DW_AT_name("FETLA_OC")
    9678                      .dwattr $C$DW$1035, DW_AT_TI_symbol_name("_FETLA_OC")
    9679                      .dwattr $C$DW$1035, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9680                      .dwattr $C$DW$1035, DW_AT_accessibility(DW_ACCESS_public)
    9681              
    9682              $C$DW$1036      .dwtag  DW_TAG_member
    9683                      .dwattr $C$DW$1036, DW_AT_type(*$C$DW$T$76)
    9684                      .dwattr $C$DW$1036, DW_AT_name("FETHB_OC")
    9685                      .dwattr $C$DW$1036, DW_AT_TI_symbol_name("_FETHB_OC")
    9686                      .dwattr $C$DW$1036, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    9687                      .dwattr $C$DW$1036, DW_AT_accessibility(DW_ACCESS_public)
    9688              
    9689              $C$DW$1037      .dwtag  DW_TAG_member
    9690                      .dwattr $C$DW$1037, DW_AT_type(*$C$DW$T$76)
    9691                      .dwattr $C$DW$1037, DW_AT_name("FETLB_OC")
    9692                      .dwattr $C$DW$1037, DW_AT_TI_symbol_name("_FETLB_OC")
    9693                      .dwattr $C$DW$1037, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9694                      .dwattr $C$DW$1037, DW_AT_accessibility(DW_ACCESS_public)
    9695              
