TMS320C2000 Assembler PC v22.6.0 Sat Mar 18 10:05:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{9D292E58-35E1-4E86-9F71-402D081F0D5B} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.0.LTS *
       3              ;* Date/Time created: Sat Mar 18 10:05:42 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/GIANT/GIANT_TI_instaspin/TI_instaspin_indoor_smart_trainer/motorware
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.0.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\GIANT\GIANT_TI_instaspin\TI_instaspin_indoor_smart_trainer\motor
      13              ;       C:\ti\ccs1220\ccs\tools\compiler\ti-cgt-c2000_22.6.0.LTS\bin\opt2000.exe C:\\Users\\User\\AppData\\Lo

    3505              
    3506              $C$DW$T$42      .dwtag  DW_TAG_enumeration_type
    3507                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    3508              $C$DW$259       .dwtag  DW_TAG_enumerator
    3509                      .dwattr $C$DW$259, DW_AT_name("SCI_Priority_Immediate")
    3510                      .dwattr $C$DW$259, DW_AT_const_value(0x00)
    3511              
    3512              $C$DW$260       .dwtag  DW_TAG_enumerator
    3513                      .dwattr $C$DW$260, DW_AT_name("SCI_Priority_FreeRun")
    3514                      .dwattr $C$DW$260, DW_AT_const_value(0x08)
    3515              
    3516              $C$DW$261       .dwtag  DW_TAG_enumerator
    3517                      .dwattr $C$DW$261, DW_AT_name("SCI_Priority_AfterRxRxSeq")
TMS320C2000 Assembler PC v22.6.0 Sat Mar 18 10:05:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{9D292E58-35E1-4E86-9F71-402D081F0D5B} PAGE   66

    3518                      .dwattr $C$DW$261, DW_AT_const_value(0x10)
    3519              
    3520                      .dwendtag $C$DW$T$42
    3521              
    3522              $C$DW$T$43      .dwtag  DW_TAG_typedef
    3523                      .dwattr $C$DW$T$43, DW_AT_name("SCI_Priority_e")
    3524                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    3525                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    3526              
    3527              $C$DW$262       .dwtag  DW_TAG_TI_far_type
    3528                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$43)
    3529              
    3530              $C$DW$T$44      .dwtag  DW_TAG_const_type
    3531                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$262)
    3532              
    3533              
    3534              $C$DW$T$45      .dwtag  DW_TAG_enumeration_type
    3535                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    3536              $C$DW$263       .dwtag  DW_TAG_enumerator
    3537                      .dwattr $C$DW$263, DW_AT_name("SCI_Parity_Odd")
    3538                      .dwattr $C$DW$263, DW_AT_const_value(0x00)
    3539              
    3540              $C$DW$264       .dwtag  DW_TAG_enumerator
    3541                      .dwattr $C$DW$264, DW_AT_name("SCI_Parity_Even")
    3542                      .dwattr $C$DW$264, DW_AT_const_value(0x40)
    3543              
    3544                      .dwendtag $C$DW$T$45
    3545              
    3546              $C$DW$T$46      .dwtag  DW_TAG_typedef
    3547                      .dwattr $C$DW$T$46, DW_AT_name("SCI_Parity_e")
    3548                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    3549                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    3550              
    3551              $C$DW$265       .dwtag  DW_TAG_TI_far_type
    3552                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$46)
    3553              
    3554              $C$DW$T$47      .dwtag  DW_TAG_const_type
    3555                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$265)
    3556              
    3557              
    3558              $C$DW$T$48      .dwtag  DW_TAG_enumeration_type
    3559                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    3560              $C$DW$266       .dwtag  DW_TAG_enumerator
    3561                      .dwattr $C$DW$266, DW_AT_name("SCI_FifoLevel_Empty")
    3562                      .dwattr $C$DW$266, DW_AT_const_value(0x00)
    3563              
    3564              $C$DW$267       .dwtag  DW_TAG_enumerator
    3565                      .dwattr $C$DW$267, DW_AT_name("SCI_FifoLevel_1_Word")
    3566                      .dwattr $C$DW$267, DW_AT_const_value(0x01)
    3567              
    3568              $C$DW$268       .dwtag  DW_TAG_enumerator
    3569                      .dwattr $C$DW$268, DW_AT_name("SCI_FifoLevel_2_Words")
    3570                      .dwattr $C$DW$268, DW_AT_const_value(0x02)
    3571              
    3572              $C$DW$269       .dwtag  DW_TAG_enumerator
TMS320C2000 Assembler PC v22.6.0 Sat Mar 18 10:05:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{9D292E58-35E1-4E86-9F71-402D081F0D5B} PAGE   67

    3573                      .dwattr $C$DW$269, DW_AT_name("SCI_FifoLevel_3_Words")
    3574                      .dwattr $C$DW$269, DW_AT_const_value(0x03)
    3575              
    3576              $C$DW$270       .dwtag  DW_TAG_enumerator
    3577                      .dwattr $C$DW$270, DW_AT_name("SCI_FifoLevel_4_Words")
    3578                      .dwattr $C$DW$270, DW_AT_const_value(0x04)
    3579              
    3580                      .dwendtag $C$DW$T$48
    3581              
    3582              $C$DW$T$49      .dwtag  DW_TAG_typedef
    3583                      .dwattr $C$DW$T$49, DW_AT_name("SCI_FifoLevel_e")
    3584                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    3585                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    3586              
    3587              $C$DW$271       .dwtag  DW_TAG_TI_far_type
    3588                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$49)
    3589              
    3590              $C$DW$T$50      .dwtag  DW_TAG_const_type
    3591                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$271)
    3592              
    3593              
    3594              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    3595                      .dwattr $C$DW$T$23, DW_AT_name("_SCI_Obj_")
    3596                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x10)
    3597              $C$DW$272       .dwtag  DW_TAG_member
    3598                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$21)
    3599                      .dwattr $C$DW$272, DW_AT_name("SCICCR")
    3600                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_SCICCR")
    3601                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3602                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3603              
    3604              $C$DW$273       .dwtag  DW_TAG_member
    3605                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$21)
    3606                      .dwattr $C$DW$273, DW_AT_name("SCICTL1")
    3607                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_SCICTL1")
    3608                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3609                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3610              
    3611              $C$DW$274       .dwtag  DW_TAG_member
    3612                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$21)
    3613                      .dwattr $C$DW$274, DW_AT_name("SCIHBAUD")
    3614                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_SCIHBAUD")
    3615                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3616                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3617              
    3618              $C$DW$275       .dwtag  DW_TAG_member
    3619                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$21)
    3620                      .dwattr $C$DW$275, DW_AT_name("SCILBAUD")
    3621                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_SCILBAUD")
    3622                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3623                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3624              
    3625              $C$DW$276       .dwtag  DW_TAG_member
    3626                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$21)
    3627                      .dwattr $C$DW$276, DW_AT_name("SCICTL2")
TMS320C2000 Assembler PC v22.6.0 Sat Mar 18 10:05:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{9D292E58-35E1-4E86-9F71-402D081F0D5B} PAGE   68

    3628                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_SCICTL2")
    3629                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3630                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3631              
    3632              $C$DW$277       .dwtag  DW_TAG_member
    3633                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$21)
    3634                      .dwattr $C$DW$277, DW_AT_name("SCIRXST")
    3635                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_SCIRXST")
    3636                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3637                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3638              
    3639              $C$DW$278       .dwtag  DW_TAG_member
    3640                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$21)
    3641                      .dwattr $C$DW$278, DW_AT_name("SCIRXEMU")
    3642                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_SCIRXEMU")
    3643                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3644                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3645              
    3646              $C$DW$279       .dwtag  DW_TAG_member
    3647                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$21)
    3648                      .dwattr $C$DW$279, DW_AT_name("SCIRXBUF")
    3649                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_SCIRXBUF")
    3650                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3651                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3652              
    3653              $C$DW$280       .dwtag  DW_TAG_member
    3654                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$21)
    3655                      .dwattr $C$DW$280, DW_AT_name("rsvd_1")
    3656                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_rsvd_1")
    3657                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3658                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3659              
    3660              $C$DW$281       .dwtag  DW_TAG_member
    3661                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$21)
    3662                      .dwattr $C$DW$281, DW_AT_name("SCITXBUF")
    3663                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_SCITXBUF")
    3664                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3665                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3666              
    3667              $C$DW$282       .dwtag  DW_TAG_member
    3668                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$21)
    3669                      .dwattr $C$DW$282, DW_AT_name("SCIFFTX")
    3670                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_SCIFFTX")
    3671                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3672                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3673              
    3674              $C$DW$283       .dwtag  DW_TAG_member
    3675                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$21)
    3676                      .dwattr $C$DW$283, DW_AT_name("SCIFFRX")
    3677                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_SCIFFRX")
    3678                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3679                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3680              
    3681              $C$DW$284       .dwtag  DW_TAG_member
    3682                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v22.6.0 Sat Mar 18 10:05:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{9D292E58-35E1-4E86-9F71-402D081F0D5B} PAGE   69

    3683                      .dwattr $C$DW$284, DW_AT_name("SCIFFCT")
    3684                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_SCIFFCT")
    3685                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3686                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3687              
    3688              $C$DW$285       .dwtag  DW_TAG_member
    3689                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$22)
    3690                      .dwattr $C$DW$285, DW_AT_name("rsvd_2")
    3691                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_rsvd_2")
    3692                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3693                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3694              
    3695              $C$DW$286       .dwtag  DW_TAG_member
    3696                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$21)
    3697                      .dwattr $C$DW$286, DW_AT_name("SCIPRI")
    3698                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_SCIPRI")
    3699                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3700                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3701              
    3702                      .dwendtag $C$DW$T$23
    3703              
    3704              $C$DW$T$51      .dwtag  DW_TAG_typedef
    3705                      .dwattr $C$DW$T$51, DW_AT_name("SCI_Obj")
    3706                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$23)
    3707                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    3708              
    3709              $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    3710                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$23)
    3711                      .dwattr $C$DW$T$26, DW_AT_address_class(0x20)
    3712              
    3713              $C$DW$T$27      .dwtag  DW_TAG_typedef
    3714                      .dwattr $C$DW$T$27, DW_AT_name("SCI_Handle")
    3715                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    3716                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    3717              
    3718              $C$DW$287       .dwtag  DW_TAG_TI_far_type
    3719                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$27)
    3720              
    3721              $C$DW$T$52      .dwtag  DW_TAG_const_type
    3722                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$287)
    3723              
    3724              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3725                      .dwattr $C$DW$T$2, DW_AT_name("void")
    3726              
    3727              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3728                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3729                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3730              
    3731              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3732                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3733                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3734                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3735              
    3736              $C$DW$T$5       .dwtag  DW_TAG_base_type
    3737                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
TMS320C2000 Assembler PC v22.6.0 Sat Mar 18 10:05:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{9D292E58-35E1-4E86-9F71-402D081F0D5B} PAGE   70

    3738                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3739                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3740              
    3741              $C$DW$T$6       .dwtag  DW_TAG_base_type
    3742                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3743                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3744                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3745              
    3746              $C$DW$T$7       .dwtag  DW_TAG_base_type
    3747                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3748                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3749                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    3750              
    3751              $C$DW$T$8       .dwtag  DW_TAG_base_type
    3752                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3753                      .dwattr $C$DW$T$8, DW_AT_name("short")
    3754                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    3755              
    3756              $C$DW$T$9       .dwtag  DW_TAG_base_type
    3757                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3758                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3759                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    3760              
    3761              $C$DW$T$10      .dwtag  DW_TAG_base_type
