TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:45 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{371984D1-2429-48D0-908E-D3BF17B03527} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                             PC v18.12.4.LTS *
       3              ;* Date/Time created: Tue Feb 21 14:51:45 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/GIANT/GAINT_TI_instaspin/motorware/motorware_1_01_00_18/sw/modules/u
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v18.12.4.LTS Copyright (c) 1996-
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\GIANT\GAINT_TI_instaspin\motorware\motorware_1_01_00_18\sw\solut
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("EST_setLs_d_pu")

    3325                      .dwattr $C$DW$328, DW_AT_name("USER_ErrorCode_estFreq_Hz_High")
    3326                      .dwattr $C$DW$328, DW_AT_const_value(0x60)
    3327              
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:45 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{371984D1-2429-48D0-908E-D3BF17B03527} PAGE   66

    3328              $C$DW$329       .dwtag  DW_TAG_enumerator
    3329                      .dwattr $C$DW$329, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low")
    3330                      .dwattr $C$DW$329, DW_AT_const_value(0x61)
    3331              
    3332              $C$DW$330       .dwtag  DW_TAG_enumerator
    3333                      .dwattr $C$DW$330, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High")
    3334                      .dwattr $C$DW$330, DW_AT_const_value(0x62)
    3335              
    3336              $C$DW$331       .dwtag  DW_TAG_enumerator
    3337                      .dwattr $C$DW$331, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low")
    3338                      .dwattr $C$DW$331, DW_AT_const_value(0x63)
    3339              
    3340              $C$DW$332       .dwtag  DW_TAG_enumerator
    3341                      .dwattr $C$DW$332, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High")
    3342                      .dwattr $C$DW$332, DW_AT_const_value(0x64)
    3343              
    3344              $C$DW$333       .dwtag  DW_TAG_enumerator
    3345                      .dwattr $C$DW$333, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low")
    3346                      .dwattr $C$DW$333, DW_AT_const_value(0x65)
    3347              
    3348              $C$DW$334       .dwtag  DW_TAG_enumerator
    3349                      .dwattr $C$DW$334, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High")
    3350                      .dwattr $C$DW$334, DW_AT_const_value(0x66)
    3351              
    3352              $C$DW$335       .dwtag  DW_TAG_enumerator
    3353                      .dwattr $C$DW$335, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low")
    3354                      .dwattr $C$DW$335, DW_AT_const_value(0x67)
    3355              
    3356              $C$DW$336       .dwtag  DW_TAG_enumerator
    3357                      .dwattr $C$DW$336, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High")
    3358                      .dwattr $C$DW$336, DW_AT_const_value(0x68)
    3359              
    3360              $C$DW$337       .dwtag  DW_TAG_enumerator
    3361                      .dwattr $C$DW$337, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low")
    3362                      .dwattr $C$DW$337, DW_AT_const_value(0x69)
    3363              
    3364              $C$DW$338       .dwtag  DW_TAG_enumerator
    3365                      .dwattr $C$DW$338, DW_AT_name("USER_numErrorCodes")
    3366                      .dwattr $C$DW$338, DW_AT_const_value(0x6a)
    3367              
    3368                      .dwendtag $C$DW$T$78
    3369              
    3370              $C$DW$T$79      .dwtag  DW_TAG_typedef
    3371                      .dwattr $C$DW$T$79, DW_AT_name("USER_ErrorCode_e")
    3372                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    3373                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    3374              
    3375              $C$DW$339       .dwtag  DW_TAG_TI_far_type
    3376                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$79)
    3377              
    3378              $C$DW$T$81      .dwtag  DW_TAG_const_type
    3379                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$339)
    3380              
    3381              
    3382              $C$DW$T$86      .dwtag  DW_TAG_enumeration_type
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:45 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{371984D1-2429-48D0-908E-D3BF17B03527} PAGE   67

    3383                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x01)
    3384              $C$DW$340       .dwtag  DW_TAG_enumerator
    3385                      .dwattr $C$DW$340, DW_AT_name("CTRL_Type_PID_spd")
    3386                      .dwattr $C$DW$340, DW_AT_const_value(0x00)
    3387              
    3388              $C$DW$341       .dwtag  DW_TAG_enumerator
    3389                      .dwattr $C$DW$341, DW_AT_name("CTRL_Type_PID_Id")
    3390                      .dwattr $C$DW$341, DW_AT_const_value(0x01)
    3391              
    3392              $C$DW$342       .dwtag  DW_TAG_enumerator
    3393                      .dwattr $C$DW$342, DW_AT_name("CTRL_Type_PID_Iq")
    3394                      .dwattr $C$DW$342, DW_AT_const_value(0x02)
    3395              
    3396                      .dwendtag $C$DW$T$86
    3397              
    3398              $C$DW$T$87      .dwtag  DW_TAG_typedef
    3399                      .dwattr $C$DW$T$87, DW_AT_name("CTRL_Type_e")
    3400                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    3401                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    3402              
    3403              $C$DW$343       .dwtag  DW_TAG_TI_far_type
    3404                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$87)
    3405              
    3406              $C$DW$T$88      .dwtag  DW_TAG_const_type
    3407                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$343)
    3408              
    3409              
    3410              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    3411                      .dwattr $C$DW$T$24, DW_AT_name("_CLARKE_Obj_")
    3412                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x06)
    3413              $C$DW$344       .dwtag  DW_TAG_member
    3414                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$20)
    3415                      .dwattr $C$DW$344, DW_AT_name("alpha_sf")
    3416                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_alpha_sf")
    3417                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3418                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3419              
    3420              $C$DW$345       .dwtag  DW_TAG_member
    3421                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$20)
    3422                      .dwattr $C$DW$345, DW_AT_name("beta_sf")
    3423                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_beta_sf")
    3424                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3425                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3426              
    3427              $C$DW$346       .dwtag  DW_TAG_member
    3428                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$23)
    3429                      .dwattr $C$DW$346, DW_AT_name("numSensors")
    3430                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_numSensors")
    3431                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3432                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3433              
    3434                      .dwendtag $C$DW$T$24
    3435              
    3436              $C$DW$T$32      .dwtag  DW_TAG_typedef
    3437                      .dwattr $C$DW$T$32, DW_AT_name("CLARKE_Obj")
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:45 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{371984D1-2429-48D0-908E-D3BF17B03527} PAGE   68

    3438                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$24)
    3439                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    3440              
    3441              $C$DW$T$30      .dwtag  DW_TAG_pointer_type
    3442                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$24)
    3443                      .dwattr $C$DW$T$30, DW_AT_address_class(0x20)
    3444              
    3445              $C$DW$T$31      .dwtag  DW_TAG_typedef
    3446                      .dwattr $C$DW$T$31, DW_AT_name("CLARKE_Handle")
    3447                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    3448                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    3449              
    3450              
    3451              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    3452                      .dwattr $C$DW$T$60, DW_AT_name("_CTRL_Obj_")
    3453                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x10a)
    3454              $C$DW$347       .dwtag  DW_TAG_member
    3455                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$25)
    3456                      .dwattr $C$DW$347, DW_AT_name("version")
    3457                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_version")
    3458                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3459                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3460              
    3461              $C$DW$348       .dwtag  DW_TAG_member
    3462                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$27)
    3463                      .dwattr $C$DW$348, DW_AT_name("state")
    3464                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_state")
    3465                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3466                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3467              
    3468              $C$DW$349       .dwtag  DW_TAG_member
    3469                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$27)
    3470                      .dwattr $C$DW$349, DW_AT_name("prevState")
    3471                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_prevState")
    3472                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3473                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3474              
    3475              $C$DW$350       .dwtag  DW_TAG_member
    3476                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$29)
    3477                      .dwattr $C$DW$350, DW_AT_name("errorCode")
    3478                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_errorCode")
    3479                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3480                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3481              
    3482              $C$DW$351       .dwtag  DW_TAG_member
    3483                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$31)
    3484                      .dwattr $C$DW$351, DW_AT_name("clarkeHandle_I")
    3485                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_clarkeHandle_I")
    3486                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3487                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3488              
    3489              $C$DW$352       .dwtag  DW_TAG_member
    3490                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$32)
    3491                      .dwattr $C$DW$352, DW_AT_name("clarke_I")
    3492                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_clarke_I")
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:45 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{371984D1-2429-48D0-908E-D3BF17B03527} PAGE   69

    3493                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3494                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3495              
    3496              $C$DW$353       .dwtag  DW_TAG_member
    3497                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$31)
    3498                      .dwattr $C$DW$353, DW_AT_name("clarkeHandle_V")
    3499                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_clarkeHandle_V")
    3500                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3501                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3502              
    3503              $C$DW$354       .dwtag  DW_TAG_member
    3504                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$32)
    3505                      .dwattr $C$DW$354, DW_AT_name("clarke_V")
    3506                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_clarke_V")
    3507                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3508                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3509              
    3510              $C$DW$355       .dwtag  DW_TAG_member
    3511                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$34)
    3512                      .dwattr $C$DW$355, DW_AT_name("estHandle")
    3513                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_estHandle")
    3514                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3515                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3516              
    3517              $C$DW$356       .dwtag  DW_TAG_member
    3518                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$36)
    3519                      .dwattr $C$DW$356, DW_AT_name("parkHandle")
    3520                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_parkHandle")
    3521                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3522                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3523              
    3524              $C$DW$357       .dwtag  DW_TAG_member
    3525                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$37)
    3526                      .dwattr $C$DW$357, DW_AT_name("park")
    3527                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_park")
    3528                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3529                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3530              
    3531              $C$DW$358       .dwtag  DW_TAG_member
    3532                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$39)
    3533                      .dwattr $C$DW$358, DW_AT_name("pidHandle_Id")
    3534                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_pidHandle_Id")
    3535                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3536                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3537              
    3538              $C$DW$359       .dwtag  DW_TAG_member
    3539                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$40)
    3540                      .dwattr $C$DW$359, DW_AT_name("pid_Id")
    3541                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_pid_Id")
    3542                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3543                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3544              
    3545              $C$DW$360       .dwtag  DW_TAG_member
    3546                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$39)
    3547                      .dwattr $C$DW$360, DW_AT_name("pidHandle_Iq")
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:45 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{371984D1-2429-48D0-908E-D3BF17B03527} PAGE   70

    3548                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_pidHandle_Iq")
    3549                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3550                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3551              
    3552              $C$DW$361       .dwtag  DW_TAG_member
    3553                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$40)
    3554                      .dwattr $C$DW$361, DW_AT_name("pid_Iq")
    3555                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_pid_Iq")
    3556                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3557                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3558              
    3559              $C$DW$362       .dwtag  DW_TAG_member
    3560                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$39)
    3561                      .dwattr $C$DW$362, DW_AT_name("pidHandle_spd")
    3562                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_pidHandle_spd")
    3563                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3564                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3565              
    3566              $C$DW$363       .dwtag  DW_TAG_member
    3567                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$40)
    3568                      .dwattr $C$DW$363, DW_AT_name("pid_spd")
    3569                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_pid_spd")
    3570                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3571                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3572              
    3573              $C$DW$364       .dwtag  DW_TAG_member
    3574                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$42)
    3575                      .dwattr $C$DW$364, DW_AT_name("iparkHandle")
    3576                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_iparkHandle")
    3577                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3578                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3579              
    3580              $C$DW$365       .dwtag  DW_TAG_member
    3581                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$43)
    3582                      .dwattr $C$DW$365, DW_AT_name("ipark")
    3583                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_ipark")
    3584                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3585                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3586              
    3587              $C$DW$366       .dwtag  DW_TAG_member
    3588                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$45)
    3589                      .dwattr $C$DW$366, DW_AT_name("svgenHandle")
    3590                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_svgenHandle")
    3591                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3592                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3593              
    3594              $C$DW$367       .dwtag  DW_TAG_member
    3595                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$46)
    3596                      .dwattr $C$DW$367, DW_AT_name("svgen")
    3597                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_svgen")
    3598                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3599                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3600              
    3601              $C$DW$368       .dwtag  DW_TAG_member
    3602                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$48)
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:45 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{371984D1-2429-48D0-908E-D3BF17B03527} PAGE   71

    3603                      .dwattr $C$DW$368, DW_AT_name("trajHandle_Id")
    3604                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_trajHandle_Id")
    3605                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3606                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3607              
    3608              $C$DW$369       .dwtag  DW_TAG_member
    3609                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$49)
    3610                      .dwattr $C$DW$369, DW_AT_name("traj_Id")
    3611                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_traj_Id")
    3612                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3613                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3614              
    3615              $C$DW$370       .dwtag  DW_TAG_member
    3616                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$48)
    3617                      .dwattr $C$DW$370, DW_AT_name("trajHandle_spd")
    3618                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_trajHandle_spd")
    3619                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3620                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3621              
    3622              $C$DW$371       .dwtag  DW_TAG_member
    3623                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$49)
    3624                      .dwattr $C$DW$371, DW_AT_name("traj_spd")
    3625                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_traj_spd")
    3626                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    3627                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3628              
    3629              $C$DW$372       .dwtag  DW_TAG_member
    3630                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$48)
    3631                      .dwattr $C$DW$372, DW_AT_name("trajHandle_spdMax")
    3632                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    3633                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3634                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3635              
    3636              $C$DW$373       .dwtag  DW_TAG_member
    3637                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$49)
    3638                      .dwattr $C$DW$373, DW_AT_name("traj_spdMax")
    3639                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_traj_spdMax")
    3640                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3641                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3642              
    3643              $C$DW$374       .dwtag  DW_TAG_member
    3644                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$50)
    3645                      .dwattr $C$DW$374, DW_AT_name("motorParams")
    3646                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_motorParams")
    3647                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3648                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3649              
    3650              $C$DW$375       .dwtag  DW_TAG_member
    3651                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$54)
    3652                      .dwattr $C$DW$375, DW_AT_name("waitTimes")
    3653                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_waitTimes")
    3654                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3655                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3656              
    3657              $C$DW$376       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:45 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{371984D1-2429-48D0-908E-D3BF17B03527} PAGE   72

    3658                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$53)
    3659                      .dwattr $C$DW$376, DW_AT_name("counter_state")
    3660                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_counter_state")
    3661                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    3662                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3663              
    3664              $C$DW$377       .dwtag  DW_TAG_member
    3665                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$56)
    3666                      .dwattr $C$DW$377, DW_AT_name("numIsrTicksPerCtrlTick")
    3667                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3668                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3669                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3670              
    3671              $C$DW$378       .dwtag  DW_TAG_member
    3672                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$56)
    3673                      .dwattr $C$DW$378, DW_AT_name("numCtrlTicksPerCurrentTick")
    3674                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3675                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    3676                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3677              
    3678              $C$DW$379       .dwtag  DW_TAG_member
    3679                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$56)
    3680                      .dwattr $C$DW$379, DW_AT_name("numCtrlTicksPerSpeedTick")
    3681                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3682                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3683                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3684              
    3685              $C$DW$380       .dwtag  DW_TAG_member
    3686                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$56)
    3687                      .dwattr $C$DW$380, DW_AT_name("numCtrlTicksPerTrajTick")
    3688                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3689                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    3690                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3691              
    3692              $C$DW$381       .dwtag  DW_TAG_member
    3693                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$53)
    3694                      .dwattr $C$DW$381, DW_AT_name("ctrlFreq_Hz")
    3695                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    3696                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3697                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3698              
    3699              $C$DW$382       .dwtag  DW_TAG_member
    3700                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$53)
    3701                      .dwattr $C$DW$382, DW_AT_name("trajFreq_Hz")
    3702                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_trajFreq_Hz")
    3703                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3704                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3705              
    3706              $C$DW$383       .dwtag  DW_TAG_member
    3707                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$20)
    3708                      .dwattr $C$DW$383, DW_AT_name("trajPeriod_sec")
    3709                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_trajPeriod_sec")
    3710                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3711                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3712              
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:45 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{371984D1-2429-48D0-908E-D3BF17B03527} PAGE   73

    3713              $C$DW$384       .dwtag  DW_TAG_member
    3714                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$57)
    3715                      .dwattr $C$DW$384, DW_AT_name("ctrlPeriod_sec")
    3716                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    3717                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3718                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3719              
    3720              $C$DW$385       .dwtag  DW_TAG_member
    3721                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$20)
    3722                      .dwattr $C$DW$385, DW_AT_name("maxVsMag_pu")
    3723                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3724                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3725                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3726              
    3727              $C$DW$386       .dwtag  DW_TAG_member
    3728                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$58)
    3729                      .dwattr $C$DW$386, DW_AT_name("Iab_in")
    3730                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_Iab_in")
    3731                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3732                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3733              
    3734              $C$DW$387       .dwtag  DW_TAG_member
    3735                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$58)
    3736                      .dwattr $C$DW$387, DW_AT_name("Iab_filt")
    3737                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_Iab_filt")
    3738                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3739                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3740              
    3741              $C$DW$388       .dwtag  DW_TAG_member
    3742                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$58)
    3743                      .dwattr $C$DW$388, DW_AT_name("Idq_in")
    3744                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_Idq_in")
    3745                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3746                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3747              
    3748              $C$DW$389       .dwtag  DW_TAG_member
    3749                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$58)
    3750                      .dwattr $C$DW$389, DW_AT_name("Vab_in")
    3751                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_Vab_in")
    3752                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3753                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3754              
    3755              $C$DW$390       .dwtag  DW_TAG_member
    3756                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$20)
    3757                      .dwattr $C$DW$390, DW_AT_name("spd_out")
    3758                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_spd_out")
    3759                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3760                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3761              
    3762              $C$DW$391       .dwtag  DW_TAG_member
    3763                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$58)
    3764                      .dwattr $C$DW$391, DW_AT_name("Vab_out")
    3765                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_Vab_out")
    3766                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3767                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:45 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{371984D1-2429-48D0-908E-D3BF17B03527} PAGE   74

    3768              
    3769              $C$DW$392       .dwtag  DW_TAG_member
    3770                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$58)
    3771                      .dwattr $C$DW$392, DW_AT_name("Vdq_out")
    3772                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_Vdq_out")
    3773                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3774                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3775              
    3776              $C$DW$393       .dwtag  DW_TAG_member
    3777                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$57)
    3778                      .dwattr $C$DW$393, DW_AT_name("Rhf")
    3779                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_Rhf")
    3780                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3781                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3782              
    3783              $C$DW$394       .dwtag  DW_TAG_member
    3784                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$57)
    3785                      .dwattr $C$DW$394, DW_AT_name("Lhf")
    3786                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_Lhf")
    3787                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3788                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3789              
    3790              $C$DW$395       .dwtag  DW_TAG_member
    3791                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$57)
    3792                      .dwattr $C$DW$395, DW_AT_name("RoverL")
    3793                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_RoverL")
    3794                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3795                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3796              
    3797              $C$DW$396       .dwtag  DW_TAG_member
    3798                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$20)
    3799                      .dwattr $C$DW$396, DW_AT_name("Kp_Id")
    3800                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_Kp_Id")
    3801                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3802                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3803              
    3804              $C$DW$397       .dwtag  DW_TAG_member
    3805                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$20)
    3806                      .dwattr $C$DW$397, DW_AT_name("Kp_Iq")
    3807                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_Kp_Iq")
    3808                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3809                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3810              
    3811              $C$DW$398       .dwtag  DW_TAG_member
    3812                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$20)
    3813                      .dwattr $C$DW$398, DW_AT_name("Kp_spd")
    3814                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_Kp_spd")
    3815                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3816                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3817              
    3818              $C$DW$399       .dwtag  DW_TAG_member
    3819                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$20)
    3820                      .dwattr $C$DW$399, DW_AT_name("Ki_Id")
    3821                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_Ki_Id")
    3822                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:45 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{371984D1-2429-48D0-908E-D3BF17B03527} PAGE   75

    3823                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3824              
    3825              $C$DW$400       .dwtag  DW_TAG_member
    3826                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$20)
    3827                      .dwattr $C$DW$400, DW_AT_name("Ki_Iq")
    3828                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_Ki_Iq")
    3829                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3830                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3831              
    3832              $C$DW$401       .dwtag  DW_TAG_member
    3833                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$20)
    3834                      .dwattr $C$DW$401, DW_AT_name("Ki_spd")
    3835                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_Ki_spd")
    3836                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3837                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3838              
    3839              $C$DW$402       .dwtag  DW_TAG_member
    3840                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$20)
    3841                      .dwattr $C$DW$402, DW_AT_name("Kd_Id")
    3842                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_Kd_Id")
    3843                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3844                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3845              
    3846              $C$DW$403       .dwtag  DW_TAG_member
    3847                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$20)
    3848                      .dwattr $C$DW$403, DW_AT_name("Kd_Iq")
    3849                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_Kd_Iq")
    3850                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3851                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3852              
    3853              $C$DW$404       .dwtag  DW_TAG_member
    3854                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$20)
    3855                      .dwattr $C$DW$404, DW_AT_name("Kd_spd")
    3856                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_Kd_spd")
    3857                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3858                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3859              
    3860              $C$DW$405       .dwtag  DW_TAG_member
    3861                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$20)
    3862                      .dwattr $C$DW$405, DW_AT_name("Ui_Id")
    3863                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_Ui_Id")
    3864                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    3865                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3866              
    3867              $C$DW$406       .dwtag  DW_TAG_member
    3868                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$20)
    3869                      .dwattr $C$DW$406, DW_AT_name("Ui_Iq")
    3870                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_Ui_Iq")
    3871                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    3872                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3873              
    3874              $C$DW$407       .dwtag  DW_TAG_member
    3875                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$20)
    3876                      .dwattr $C$DW$407, DW_AT_name("Ui_spd")
    3877                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_Ui_spd")
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:45 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{371984D1-2429-48D0-908E-D3BF17B03527} PAGE   76

    3878                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    3879                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    3880              
    3881              $C$DW$408       .dwtag  DW_TAG_member
    3882                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$58)
    3883                      .dwattr $C$DW$408, DW_AT_name("Idq_ref")
    3884                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_Idq_ref")
    3885                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    3886                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3887              
    3888              $C$DW$409       .dwtag  DW_TAG_member
    3889                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$20)
    3890                      .dwattr $C$DW$409, DW_AT_name("IdRated")
    3891                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_IdRated")
    3892                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    3893                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3894              
    3895              $C$DW$410       .dwtag  DW_TAG_member
    3896                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$20)
    3897                      .dwattr $C$DW$410, DW_AT_name("spd_ref")
    3898                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_spd_ref")
    3899                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    3900                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3901              
    3902              $C$DW$411       .dwtag  DW_TAG_member
    3903                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$20)
    3904                      .dwattr $C$DW$411, DW_AT_name("spd_max")
    3905                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_spd_max")
    3906                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    3907                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3908              
    3909              $C$DW$412       .dwtag  DW_TAG_member
    3910                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$56)
    3911                      .dwattr $C$DW$412, DW_AT_name("counter_current")
    3912                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_counter_current")
    3913                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3914                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3915              
    3916              $C$DW$413       .dwtag  DW_TAG_member
    3917                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$56)
    3918                      .dwattr $C$DW$413, DW_AT_name("counter_isr")
    3919                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_counter_isr")
    3920                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    3921                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3922              
    3923              $C$DW$414       .dwtag  DW_TAG_member
    3924                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$56)
    3925                      .dwattr $C$DW$414, DW_AT_name("counter_speed")
    3926                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_counter_speed")
    3927                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3928                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3929              
    3930              $C$DW$415       .dwtag  DW_TAG_member
    3931                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$56)
    3932                      .dwattr $C$DW$415, DW_AT_name("counter_traj")
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:45 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{371984D1-2429-48D0-908E-D3BF17B03527} PAGE   77

    3933                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_counter_traj")
    3934                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    3935                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3936              
    3937              $C$DW$416       .dwtag  DW_TAG_member
    3938                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$59)
    3939                      .dwattr $C$DW$416, DW_AT_name("flag_enableCtrl")
    3940                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_flag_enableCtrl")
    3941                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3942                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3943              
    3944              $C$DW$417       .dwtag  DW_TAG_member
    3945                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$59)
    3946                      .dwattr $C$DW$417, DW_AT_name("flag_enableDcBusComp")
    3947                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    3948                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    3949                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3950              
    3951              $C$DW$418       .dwtag  DW_TAG_member
    3952                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$59)
    3953                      .dwattr $C$DW$418, DW_AT_name("flag_enablePowerWarp")
    3954                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    3955                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3956                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3957              
    3958              $C$DW$419       .dwtag  DW_TAG_member
    3959                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$59)
    3960                      .dwattr $C$DW$419, DW_AT_name("flag_enableOffset")
    3961                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_flag_enableOffset")
    3962                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    3963                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3964              
    3965              $C$DW$420       .dwtag  DW_TAG_member
    3966                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$59)
    3967                      .dwattr $C$DW$420, DW_AT_name("flag_enableSpeedCtrl")
    3968                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    3969                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3970                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3971              
    3972              $C$DW$421       .dwtag  DW_TAG_member
    3973                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$59)
    3974                      .dwattr $C$DW$421, DW_AT_name("flag_enableUserMotorParams")
    3975                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    3976                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    3977                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3978              
    3979              $C$DW$422       .dwtag  DW_TAG_member
    3980                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$58)
    3981                      .dwattr $C$DW$422, DW_AT_name("Idq_offset_pu")
    3982                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_Idq_offset_pu")
    3983                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    3984                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3985              
    3986              $C$DW$423       .dwtag  DW_TAG_member
    3987                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$58)
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:45 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{371984D1-2429-48D0-908E-D3BF17B03527} PAGE   78

    3988                      .dwattr $C$DW$423, DW_AT_name("Vdq_offset_pu")
    3989                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    3990                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    3991                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3992              
    3993              $C$DW$424       .dwtag  DW_TAG_member
    3994                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$20)
    3995                      .dwattr $C$DW$424, DW_AT_name("angle_pu")
    3996                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_angle_pu")
    3997                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    3998                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3999              
    4000              $C$DW$425       .dwtag  DW_TAG_member
    4001                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$20)
    4002                      .dwattr $C$DW$425, DW_AT_name("speed_ref_pu")
    4003                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_speed_ref_pu")
    4004                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    4005                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    4006              
    4007              $C$DW$426       .dwtag  DW_TAG_member
    4008                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$20)
    4009                      .dwattr $C$DW$426, DW_AT_name("speed_fb_pu")
    4010                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_speed_fb_pu")
    4011                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    4012                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4013              
    4014              $C$DW$427       .dwtag  DW_TAG_member
    4015                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$20)
    4016                      .dwattr $C$DW$427, DW_AT_name("speed_outMax_pu")
    4017                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_speed_outMax_pu")
    4018                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    4019                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4020              
    4021              $C$DW$428       .dwtag  DW_TAG_member
    4022                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$59)
    4023                      .dwattr $C$DW$428, DW_AT_name("flag_enableCurrentCtrl")
    4024                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    4025                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    4026                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4027              
    4028              $C$DW$429       .dwtag  DW_TAG_member
    4029                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$20)
    4030                      .dwattr $C$DW$429, DW_AT_name("torque_head_comm")
    4031                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_torque_head_comm")
    4032                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    4033                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4034              
    4035                      .dwendtag $C$DW$T$60
    4036              
    4037              $C$DW$T$89      .dwtag  DW_TAG_typedef
    4038                      .dwattr $C$DW$T$89, DW_AT_name("CTRL_Obj")
    4039                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$60)
    4040                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    4041              
    4042              $C$DW$T$90      .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:45 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{371984D1-2429-48D0-908E-D3BF17B03527} PAGE   79

    4043                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$60)
    4044                      .dwattr $C$DW$T$90, DW_AT_address_class(0x20)
    4045              
    4046              $C$DW$T$91      .dwtag  DW_TAG_typedef
    4047                      .dwattr $C$DW$T$91, DW_AT_name("CTRL_Handle")
    4048                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    4049                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    4050              
    4051              $C$DW$430       .dwtag  DW_TAG_TI_far_type
    4052                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$91)
    4053              
    4054              $C$DW$T$92      .dwtag  DW_TAG_const_type
    4055                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$430)
    4056              
    4057              
    4058              $C$DW$T$64      .dwtag  DW_TAG_structure_type
    4059                      .dwattr $C$DW$T$64, DW_AT_name("_CTRL_Version_")
    4060                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x04)
    4061              $C$DW$431       .dwtag  DW_TAG_member
    4062                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$61)
    4063                      .dwattr $C$DW$431, DW_AT_name("rsvd")
    4064                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_rsvd")
    4065                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4066                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4067              
    4068              $C$DW$432       .dwtag  DW_TAG_member
    4069                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$63)
    4070                      .dwattr $C$DW$432, DW_AT_name("targetProc")
    4071                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_targetProc")
    4072                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4073                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4074              
    4075              $C$DW$433       .dwtag  DW_TAG_member
    4076                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$61)
    4077                      .dwattr $C$DW$433, DW_AT_name("major")
    4078                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_major")
    4079                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4080                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    4081              
    4082              $C$DW$434       .dwtag  DW_TAG_member
    4083                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$61)
    4084                      .dwattr $C$DW$434, DW_AT_name("minor")
    4085                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_minor")
    4086                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4087                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4088              
    4089                      .dwendtag $C$DW$T$64
    4090              
    4091              $C$DW$T$25      .dwtag  DW_TAG_typedef
    4092                      .dwattr $C$DW$T$25, DW_AT_name("CTRL_Version")
    4093                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$64)
    4094                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    4095              
    4096              
    4097              $C$DW$T$19      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:45 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{371984D1-2429-48D0-908E-D3BF17B03527} PAGE   80

    4098                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    4099                      .dwattr $C$DW$T$19, DW_AT_declaration
    4100                      .dwendtag $C$DW$T$19
    4101              
    4102              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    4103                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$19)
    4104                      .dwattr $C$DW$T$33, DW_AT_address_class(0x20)
    4105              
    4106              $C$DW$T$34      .dwtag  DW_TAG_typedef
    4107                      .dwattr $C$DW$T$34, DW_AT_name("EST_Handle")
    4108                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    4109                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    4110              
    4111              
    4112              $C$DW$T$65      .dwtag  DW_TAG_structure_type
    4113                      .dwattr $C$DW$T$65, DW_AT_name("_IPARK_Obj_")
    4114                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x04)
    4115              $C$DW$435       .dwtag  DW_TAG_member
    4116                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$20)
    4117                      .dwattr $C$DW$435, DW_AT_name("sinTh")
    4118                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_sinTh")
    4119                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4120                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4121              
    4122              $C$DW$436       .dwtag  DW_TAG_member
    4123                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$20)
    4124                      .dwattr $C$DW$436, DW_AT_name("cosTh")
    4125                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_cosTh")
    4126                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4127                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4128              
    4129                      .dwendtag $C$DW$T$65
    4130              
    4131              $C$DW$T$43      .dwtag  DW_TAG_typedef
    4132                      .dwattr $C$DW$T$43, DW_AT_name("IPARK_Obj")
    4133                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$65)
    4134                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    4135              
    4136              $C$DW$T$41      .dwtag  DW_TAG_pointer_type
    4137                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$65)
    4138                      .dwattr $C$DW$T$41, DW_AT_address_class(0x20)
    4139              
    4140              $C$DW$T$42      .dwtag  DW_TAG_typedef
    4141                      .dwattr $C$DW$T$42, DW_AT_name("IPARK_Handle")
    4142                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    4143                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    4144              
    4145              
    4146              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    4147                      .dwattr $C$DW$T$67, DW_AT_name("_MATH_vec2_")
    4148                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
    4149              $C$DW$437       .dwtag  DW_TAG_member
    4150                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$66)
    4151                      .dwattr $C$DW$437, DW_AT_name("value")
    4152                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_value")
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:45 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{371984D1-2429-48D0-908E-D3BF17B03527} PAGE   81

    4153                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4154                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4155              
    4156                      .dwendtag $C$DW$T$67
    4157              
    4158              $C$DW$T$58      .dwtag  DW_TAG_typedef
    4159                      .dwattr $C$DW$T$58, DW_AT_name("MATH_vec2")
    4160                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$67)
    4161                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    4162              
    4163              
    4164              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    4165                      .dwattr $C$DW$T$70, DW_AT_name("_MOTOR_Params_")
    4166                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0e)
    4167              $C$DW$438       .dwtag  DW_TAG_member
    4168                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$69)
    4169                      .dwattr $C$DW$438, DW_AT_name("type")
    4170                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_type")
    4171                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4172                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4173              
    4174              $C$DW$439       .dwtag  DW_TAG_member
    4175                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$56)
    4176                      .dwattr $C$DW$439, DW_AT_name("numPolePairs")
    4177                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_numPolePairs")
    4178                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4179                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4180              
    4181              $C$DW$440       .dwtag  DW_TAG_member
    4182                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$57)
    4183                      .dwattr $C$DW$440, DW_AT_name("Lr_H")
    4184                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_Lr_H")
    4185                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4186                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4187              
    4188              $C$DW$441       .dwtag  DW_TAG_member
    4189                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$57)
    4190                      .dwattr $C$DW$441, DW_AT_name("Ls_d_H")
    4191                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_Ls_d_H")
    4192                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4193                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4194              
    4195              $C$DW$442       .dwtag  DW_TAG_member
    4196                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$57)
    4197                      .dwattr $C$DW$442, DW_AT_name("Ls_q_H")
    4198                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_Ls_q_H")
    4199                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4200                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4201              
    4202              $C$DW$443       .dwtag  DW_TAG_member
    4203                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$57)
    4204                      .dwattr $C$DW$443, DW_AT_name("Rr_Ohm")
    4205                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_Rr_Ohm")
    4206                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4207                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:45 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{371984D1-2429-48D0-908E-D3BF17B03527} PAGE   82

    4208              
    4209              $C$DW$444       .dwtag  DW_TAG_member
    4210                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$57)
    4211                      .dwattr $C$DW$444, DW_AT_name("Rs_Ohm")
    4212                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_Rs_Ohm")
    4213                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4214                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4215              
    4216              $C$DW$445       .dwtag  DW_TAG_member
    4217                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$57)
    4218                      .dwattr $C$DW$445, DW_AT_name("ratedFlux_VpHz")
    4219                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_ratedFlux_VpHz")
    4220                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4221                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4222              
    4223                      .dwendtag $C$DW$T$70
    4224              
    4225              $C$DW$T$50      .dwtag  DW_TAG_typedef
    4226                      .dwattr $C$DW$T$50, DW_AT_name("MOTOR_Params")
    4227                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$70)
    4228                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    4229              
    4230              
    4231              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    4232                      .dwattr $C$DW$T$71, DW_AT_name("_PARK_Obj_")
    4233                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x04)
    4234              $C$DW$446       .dwtag  DW_TAG_member
    4235                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$20)
    4236                      .dwattr $C$DW$446, DW_AT_name("sinTh")
    4237                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_sinTh")
    4238                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4239                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4240              
    4241              $C$DW$447       .dwtag  DW_TAG_member
    4242                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$20)
    4243                      .dwattr $C$DW$447, DW_AT_name("cosTh")
    4244                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_cosTh")
    4245                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4246                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4247              
    4248                      .dwendtag $C$DW$T$71
    4249              
    4250              $C$DW$T$37      .dwtag  DW_TAG_typedef
    4251                      .dwattr $C$DW$T$37, DW_AT_name("PARK_Obj")
    4252                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$71)
    4253                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    4254              
    4255              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    4256                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$71)
    4257                      .dwattr $C$DW$T$35, DW_AT_address_class(0x20)
    4258              
    4259              $C$DW$T$36      .dwtag  DW_TAG_typedef
    4260                      .dwattr $C$DW$T$36, DW_AT_name("PARK_Handle")
    4261                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    4262                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:45 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{371984D1-2429-48D0-908E-D3BF17B03527} PAGE   83

    4263              
    4264              
    4265              $C$DW$T$72      .dwtag  DW_TAG_structure_type
    4266                      .dwattr $C$DW$T$72, DW_AT_name("_PID_Obj_")
    4267                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x10)
    4268              $C$DW$448       .dwtag  DW_TAG_member
    4269                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$20)
    4270                      .dwattr $C$DW$448, DW_AT_name("Kp")
    4271                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_Kp")
    4272                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4273                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4274              
    4275              $C$DW$449       .dwtag  DW_TAG_member
    4276                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$20)
    4277                      .dwattr $C$DW$449, DW_AT_name("Ki")
    4278                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_Ki")
    4279                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4280                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4281              
    4282              $C$DW$450       .dwtag  DW_TAG_member
    4283                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$20)
    4284                      .dwattr $C$DW$450, DW_AT_name("Kd")
    4285                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_Kd")
    4286                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4287                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4288              
    4289              $C$DW$451       .dwtag  DW_TAG_member
    4290                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$20)
    4291                      .dwattr $C$DW$451, DW_AT_name("Ui")
    4292                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_Ui")
    4293                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4294                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4295              
    4296              $C$DW$452       .dwtag  DW_TAG_member
    4297                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$20)
    4298                      .dwattr $C$DW$452, DW_AT_name("refValue")
    4299                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_refValue")
    4300                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4301                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4302              
    4303              $C$DW$453       .dwtag  DW_TAG_member
    4304                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$20)
    4305                      .dwattr $C$DW$453, DW_AT_name("fbackValue")
    4306                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_fbackValue")
    4307                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4308                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4309              
    4310              $C$DW$454       .dwtag  DW_TAG_member
    4311                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$20)
    4312                      .dwattr $C$DW$454, DW_AT_name("outMin")
    4313                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_outMin")
    4314                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4315                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4316              
    4317              $C$DW$455       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:45 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{371984D1-2429-48D0-908E-D3BF17B03527} PAGE   84

    4318                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$20)
    4319                      .dwattr $C$DW$455, DW_AT_name("outMax")
    4320                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_outMax")
    4321                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4322                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4323              
    4324                      .dwendtag $C$DW$T$72
    4325              
    4326              $C$DW$T$40      .dwtag  DW_TAG_typedef
    4327                      .dwattr $C$DW$T$40, DW_AT_name("PID_Obj")
    4328                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$72)
    4329                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    4330              
    4331              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    4332                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$72)
    4333                      .dwattr $C$DW$T$38, DW_AT_address_class(0x20)
    4334              
    4335              $C$DW$T$39      .dwtag  DW_TAG_typedef
    4336                      .dwattr $C$DW$T$39, DW_AT_name("PID_Handle")
    4337                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    4338                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    4339              
    4340              
    4341              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    4342                      .dwattr $C$DW$T$73, DW_AT_name("_SVGEN_Obj_")
    4343                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x02)
    4344              $C$DW$456       .dwtag  DW_TAG_member
    4345                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$20)
    4346                      .dwattr $C$DW$456, DW_AT_name("maxModulation")
    4347                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_maxModulation")
    4348                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4349                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4350              
    4351                      .dwendtag $C$DW$T$73
    4352              
    4353              $C$DW$T$46      .dwtag  DW_TAG_typedef
    4354                      .dwattr $C$DW$T$46, DW_AT_name("SVGEN_Obj")
    4355                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$73)
    4356                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    4357              
    4358              $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    4359                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$73)
    4360                      .dwattr $C$DW$T$44, DW_AT_address_class(0x20)
    4361              
    4362              $C$DW$T$45      .dwtag  DW_TAG_typedef
    4363                      .dwattr $C$DW$T$45, DW_AT_name("SVGEN_Handle")
    4364                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    4365                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    4366              
    4367              
    4368              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    4369                      .dwattr $C$DW$T$74, DW_AT_name("_TRAJ_Obj_")
    4370                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x0a)
    4371              $C$DW$457       .dwtag  DW_TAG_member
    4372                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:45 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{371984D1-2429-48D0-908E-D3BF17B03527} PAGE   85

    4373                      .dwattr $C$DW$457, DW_AT_name("targetValue")
    4374                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_targetValue")
    4375                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4376                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4377              
    4378              $C$DW$458       .dwtag  DW_TAG_member
    4379                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$20)
    4380                      .dwattr $C$DW$458, DW_AT_name("intValue")
    4381                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_intValue")
    4382                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4383                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4384              
    4385              $C$DW$459       .dwtag  DW_TAG_member
    4386                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$20)
    4387                      .dwattr $C$DW$459, DW_AT_name("minValue")
    4388                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_minValue")
    4389                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4390                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4391              
    4392              $C$DW$460       .dwtag  DW_TAG_member
    4393                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$20)
    4394                      .dwattr $C$DW$460, DW_AT_name("maxValue")
    4395                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_maxValue")
    4396                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4397                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4398              
    4399              $C$DW$461       .dwtag  DW_TAG_member
    4400                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$20)
    4401                      .dwattr $C$DW$461, DW_AT_name("maxDelta")
    4402                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_maxDelta")
    4403                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4404                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4405              
    4406                      .dwendtag $C$DW$T$74
    4407              
    4408              $C$DW$T$49      .dwtag  DW_TAG_typedef
    4409                      .dwattr $C$DW$T$49, DW_AT_name("TRAJ_Obj")
    4410                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$74)
    4411                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    4412              
    4413              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    4414                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$74)
    4415                      .dwattr $C$DW$T$47, DW_AT_address_class(0x20)
    4416              
    4417              $C$DW$T$48      .dwtag  DW_TAG_typedef
    4418                      .dwattr $C$DW$T$48, DW_AT_name("TRAJ_Handle")
    4419                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    4420                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    4421              
    4422              
    4423              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    4424                      .dwattr $C$DW$T$80, DW_AT_name("_USER_Params_")
    4425                      .dwattr $C$DW$T$80, DW_AT_byte_size(0xac)
    4426              $C$DW$462       .dwtag  DW_TAG_member
    4427                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$57)
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:45 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{371984D1-2429-48D0-908E-D3BF17B03527} PAGE   86

    4428                      .dwattr $C$DW$462, DW_AT_name("iqFullScaleCurrent_A")
    4429                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    4430                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4431                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4432              
    4433              $C$DW$463       .dwtag  DW_TAG_member
    4434                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$57)
    4435                      .dwattr $C$DW$463, DW_AT_name("iqFullScaleVoltage_V")
    4436                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    4437                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4438                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4439              
    4440              $C$DW$464       .dwtag  DW_TAG_member
    4441                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$57)
    4442                      .dwattr $C$DW$464, DW_AT_name("iqFullScaleFreq_Hz")
    4443                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_iqFullScaleFreq_Hz")
    4444                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4445                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4446              
    4447              $C$DW$465       .dwtag  DW_TAG_member
    4448                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$56)
    4449                      .dwattr $C$DW$465, DW_AT_name("numIsrTicksPerCtrlTick")
    4450                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    4451                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4452                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4453              
    4454              $C$DW$466       .dwtag  DW_TAG_member
    4455                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$56)
    4456                      .dwattr $C$DW$466, DW_AT_name("numCtrlTicksPerCurrentTick")
    4457                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    4458                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4459                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4460              
    4461              $C$DW$467       .dwtag  DW_TAG_member
    4462                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$56)
    4463                      .dwattr $C$DW$467, DW_AT_name("numCtrlTicksPerEstTick")
    4464                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_numCtrlTicksPerEstTick")
    4465                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4466                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4467              
    4468              $C$DW$468       .dwtag  DW_TAG_member
    4469                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$56)
    4470                      .dwattr $C$DW$468, DW_AT_name("numCtrlTicksPerSpeedTick")
    4471                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    4472                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4473                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4474              
    4475              $C$DW$469       .dwtag  DW_TAG_member
    4476                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$56)
    4477                      .dwattr $C$DW$469, DW_AT_name("numCtrlTicksPerTrajTick")
    4478                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    4479                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4480                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4481              
    4482              $C$DW$470       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:45 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{371984D1-2429-48D0-908E-D3BF17B03527} PAGE   87

    4483                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$23)
    4484                      .dwattr $C$DW$470, DW_AT_name("numCurrentSensors")
    4485                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_numCurrentSensors")
    4486                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4487                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4488              
    4489              $C$DW$471       .dwtag  DW_TAG_member
    4490                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$23)
    4491                      .dwattr $C$DW$471, DW_AT_name("numVoltageSensors")
    4492                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_numVoltageSensors")
    4493                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4494                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    4495              
    4496              $C$DW$472       .dwtag  DW_TAG_member
    4497                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$57)
    4498                      .dwattr $C$DW$472, DW_AT_name("offsetPole_rps")
    4499                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_offsetPole_rps")
    4500                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4501                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    4502              
    4503              $C$DW$473       .dwtag  DW_TAG_member
    4504                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$57)
    4505                      .dwattr $C$DW$473, DW_AT_name("fluxPole_rps")
    4506                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_fluxPole_rps")
    4507                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4508                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    4509              
    4510              $C$DW$474       .dwtag  DW_TAG_member
    4511                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$57)
    4512                      .dwattr $C$DW$474, DW_AT_name("zeroSpeedLimit")
    4513                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_zeroSpeedLimit")
    4514                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4515                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    4516              
    4517              $C$DW$475       .dwtag  DW_TAG_member
    4518                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$57)
    4519                      .dwattr $C$DW$475, DW_AT_name("forceAngleFreq_Hz")
    4520                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_forceAngleFreq_Hz")
    4521                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4522                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    4523              
    4524              $C$DW$476       .dwtag  DW_TAG_member
    4525                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$57)
    4526                      .dwattr $C$DW$476, DW_AT_name("maxAccel_Hzps")
    4527                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_maxAccel_Hzps")
    4528                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4529                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    4530              
    4531              $C$DW$477       .dwtag  DW_TAG_member
    4532                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$57)
    4533                      .dwattr $C$DW$477, DW_AT_name("maxAccel_est_Hzps")
    4534                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_maxAccel_est_Hzps")
    4535                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4536                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    4537              
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:45 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{371984D1-2429-48D0-908E-D3BF17B03527} PAGE   88

    4538              $C$DW$478       .dwtag  DW_TAG_member
    4539                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$57)
    4540                      .dwattr $C$DW$478, DW_AT_name("directionPole_rps")
    4541                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_directionPole_rps")
    4542                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4543                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    4544              
    4545              $C$DW$479       .dwtag  DW_TAG_member
    4546                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$57)
    4547                      .dwattr $C$DW$479, DW_AT_name("speedPole_rps")
    4548                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_speedPole_rps")
    4549                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4550                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    4551              
    4552              $C$DW$480       .dwtag  DW_TAG_member
    4553                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$57)
    4554                      .dwattr $C$DW$480, DW_AT_name("dcBusPole_rps")
    4555                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_dcBusPole_rps")
    4556                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4557                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    4558              
    4559              $C$DW$481       .dwtag  DW_TAG_member
    4560                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$57)
    4561                      .dwattr $C$DW$481, DW_AT_name("fluxFraction")
    4562                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_fluxFraction")
    4563                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4564                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    4565              
    4566              $C$DW$482       .dwtag  DW_TAG_member
    4567                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$57)
    4568                      .dwattr $C$DW$482, DW_AT_name("indEst_speedMaxFraction")
    4569                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_indEst_speedMaxFraction")
    4570                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4571                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    4572              
    4573              $C$DW$483       .dwtag  DW_TAG_member
    4574                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$57)
    4575                      .dwattr $C$DW$483, DW_AT_name("powerWarpGain")
    4576                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_powerWarpGain")
    4577                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4578                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    4579              
    4580              $C$DW$484       .dwtag  DW_TAG_member
    4581                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$56)
    4582                      .dwattr $C$DW$484, DW_AT_name("systemFreq_MHz")
    4583                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_systemFreq_MHz")
    4584                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4585                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    4586              
    4587              $C$DW$485       .dwtag  DW_TAG_member
    4588                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$57)
    4589                      .dwattr $C$DW$485, DW_AT_name("pwmPeriod_usec")
    4590                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_pwmPeriod_usec")
    4591                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4592                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:45 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{371984D1-2429-48D0-908E-D3BF17B03527} PAGE   89

    4593              
    4594              $C$DW$486       .dwtag  DW_TAG_member
    4595                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$57)
    4596                      .dwattr $C$DW$486, DW_AT_name("voltage_sf")
    4597                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_voltage_sf")
    4598                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4599                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    4600              
    4601              $C$DW$487       .dwtag  DW_TAG_member
    4602                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$57)
    4603                      .dwattr $C$DW$487, DW_AT_name("current_sf")
    4604                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_current_sf")
    4605                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4606                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    4607              
    4608              $C$DW$488       .dwtag  DW_TAG_member
    4609                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$57)
    4610                      .dwattr $C$DW$488, DW_AT_name("voltageFilterPole_rps")
    4611                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_voltageFilterPole_rps")
    4612                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4613                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    4614              
    4615              $C$DW$489       .dwtag  DW_TAG_member
    4616                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$57)
    4617                      .dwattr $C$DW$489, DW_AT_name("maxVsMag_pu")
    4618                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_maxVsMag_pu")
    4619                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4620                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    4621              
    4622              $C$DW$490       .dwtag  DW_TAG_member
    4623                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$57)
    4624                      .dwattr $C$DW$490, DW_AT_name("estKappa")
    4625                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_estKappa")
    4626                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4627                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    4628              
    4629              $C$DW$491       .dwtag  DW_TAG_member
    4630                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$69)
    4631                      .dwattr $C$DW$491, DW_AT_name("motor_type")
    4632                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_motor_type")
    4633                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4634                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    4635              
    4636              $C$DW$492       .dwtag  DW_TAG_member
    4637                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$56)
    4638                      .dwattr $C$DW$492, DW_AT_name("motor_numPolePairs")
    4639                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_motor_numPolePairs")
    4640                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    4641                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    4642              
    4643              $C$DW$493       .dwtag  DW_TAG_member
    4644                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$57)
    4645                      .dwattr $C$DW$493, DW_AT_name("motor_ratedFlux")
    4646                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_motor_ratedFlux")
    4647                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
TMS320C2000 Assembler PC v18.12.4 Tue Feb 21 14:51:45 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\User\AppData\Local\Temp\{371984D1-2429-48D0-908E-D3BF17B03527} PAGE   90

    4648                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    4649              
    4650              $C$DW$494       .dwtag  DW_TAG_member
    4651                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$57)
    4652                      .dwattr $C$DW$494, DW_AT_name("motor_Rr")
    4653                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_motor_Rr")
    4654                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4655                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    4656              
    4657              $C$DW$495       .dwtag  DW_TAG_member
    4658                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$57)
    4659                      .dwattr $C$DW$495, DW_AT_name("motor_Rs")
    4660                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_motor_Rs")
    4661                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4662                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    4663              
    4664              $C$DW$496       .dwtag  DW_TAG_member
    4665                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$57)
    4666                      .dwattr $C$DW$496, DW_AT_name("motor_Ls_d")
    4667                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_motor_Ls_d")
    4668                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4669                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    4670              
    4671              $C$DW$497       .dwtag  DW_TAG_member
    4672                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$57)
    4673                      .dwattr $C$DW$497, DW_AT_name("motor_Ls_q")
    4674                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_motor_Ls_q")
    4675                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    4676                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    4677              
