TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{11550F7E-BF27-45A2-8B51-A4633DC20E3B} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.0.LTS *
       3              ;* Date/Time created: Thu May 11 17:35:51 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/GIANT/GiantNEO/motorware/motorware_1_01_00_18/sw/modules/user/src/32
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.0.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\GIANT\GiantNEO\motorware\motorware_1_01_00_18\sw\solutions\insta
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("EST_setLs_d_pu")

    3322                      .dwattr $C$DW$328, DW_AT_name("USER_ErrorCode_estFreq_Hz_High")
    3323                      .dwattr $C$DW$328, DW_AT_const_value(0x60)
    3324              
    3325              $C$DW$329       .dwtag  DW_TAG_enumerator
    3326                      .dwattr $C$DW$329, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low")
    3327                      .dwattr $C$DW$329, DW_AT_const_value(0x61)
    3328              
    3329              $C$DW$330       .dwtag  DW_TAG_enumerator
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{11550F7E-BF27-45A2-8B51-A4633DC20E3B} PAGE   66

    3330                      .dwattr $C$DW$330, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High")
    3331                      .dwattr $C$DW$330, DW_AT_const_value(0x62)
    3332              
    3333              $C$DW$331       .dwtag  DW_TAG_enumerator
    3334                      .dwattr $C$DW$331, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low")
    3335                      .dwattr $C$DW$331, DW_AT_const_value(0x63)
    3336              
    3337              $C$DW$332       .dwtag  DW_TAG_enumerator
    3338                      .dwattr $C$DW$332, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High")
    3339                      .dwattr $C$DW$332, DW_AT_const_value(0x64)
    3340              
    3341              $C$DW$333       .dwtag  DW_TAG_enumerator
    3342                      .dwattr $C$DW$333, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low")
    3343                      .dwattr $C$DW$333, DW_AT_const_value(0x65)
    3344              
    3345              $C$DW$334       .dwtag  DW_TAG_enumerator
    3346                      .dwattr $C$DW$334, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High")
    3347                      .dwattr $C$DW$334, DW_AT_const_value(0x66)
    3348              
    3349              $C$DW$335       .dwtag  DW_TAG_enumerator
    3350                      .dwattr $C$DW$335, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low")
    3351                      .dwattr $C$DW$335, DW_AT_const_value(0x67)
    3352              
    3353              $C$DW$336       .dwtag  DW_TAG_enumerator
    3354                      .dwattr $C$DW$336, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High")
    3355                      .dwattr $C$DW$336, DW_AT_const_value(0x68)
    3356              
    3357              $C$DW$337       .dwtag  DW_TAG_enumerator
    3358                      .dwattr $C$DW$337, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low")
    3359                      .dwattr $C$DW$337, DW_AT_const_value(0x69)
    3360              
    3361              $C$DW$338       .dwtag  DW_TAG_enumerator
    3362                      .dwattr $C$DW$338, DW_AT_name("USER_numErrorCodes")
    3363                      .dwattr $C$DW$338, DW_AT_const_value(0x6a)
    3364              
    3365                      .dwendtag $C$DW$T$78
    3366              
    3367              $C$DW$T$79      .dwtag  DW_TAG_typedef
    3368                      .dwattr $C$DW$T$79, DW_AT_name("USER_ErrorCode_e")
    3369                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    3370                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    3371              
    3372              $C$DW$339       .dwtag  DW_TAG_TI_far_type
    3373                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$79)
    3374              
    3375              $C$DW$T$81      .dwtag  DW_TAG_const_type
    3376                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$339)
    3377              
    3378              
    3379              $C$DW$T$86      .dwtag  DW_TAG_enumeration_type
    3380                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x01)
    3381              $C$DW$340       .dwtag  DW_TAG_enumerator
    3382                      .dwattr $C$DW$340, DW_AT_name("CTRL_Type_PID_spd")
    3383                      .dwattr $C$DW$340, DW_AT_const_value(0x00)
    3384              
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{11550F7E-BF27-45A2-8B51-A4633DC20E3B} PAGE   67

    3385              $C$DW$341       .dwtag  DW_TAG_enumerator
    3386                      .dwattr $C$DW$341, DW_AT_name("CTRL_Type_PID_Id")
    3387                      .dwattr $C$DW$341, DW_AT_const_value(0x01)
    3388              
    3389              $C$DW$342       .dwtag  DW_TAG_enumerator
    3390                      .dwattr $C$DW$342, DW_AT_name("CTRL_Type_PID_Iq")
    3391                      .dwattr $C$DW$342, DW_AT_const_value(0x02)
    3392              
    3393                      .dwendtag $C$DW$T$86
    3394              
    3395              $C$DW$T$87      .dwtag  DW_TAG_typedef
    3396                      .dwattr $C$DW$T$87, DW_AT_name("CTRL_Type_e")
    3397                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    3398                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    3399              
    3400              $C$DW$343       .dwtag  DW_TAG_TI_far_type
    3401                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$87)
    3402              
    3403              $C$DW$T$88      .dwtag  DW_TAG_const_type
    3404                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$343)
    3405              
    3406              
    3407              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    3408                      .dwattr $C$DW$T$24, DW_AT_name("_CLARKE_Obj_")
    3409                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x06)
    3410              $C$DW$344       .dwtag  DW_TAG_member
    3411                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$20)
    3412                      .dwattr $C$DW$344, DW_AT_name("alpha_sf")
    3413                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_alpha_sf")
    3414                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3415                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3416              
    3417              $C$DW$345       .dwtag  DW_TAG_member
    3418                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$20)
    3419                      .dwattr $C$DW$345, DW_AT_name("beta_sf")
    3420                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_beta_sf")
    3421                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3422                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3423              
    3424              $C$DW$346       .dwtag  DW_TAG_member
    3425                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$23)
    3426                      .dwattr $C$DW$346, DW_AT_name("numSensors")
    3427                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_numSensors")
    3428                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3429                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3430              
    3431                      .dwendtag $C$DW$T$24
    3432              
    3433              $C$DW$T$32      .dwtag  DW_TAG_typedef
    3434                      .dwattr $C$DW$T$32, DW_AT_name("CLARKE_Obj")
    3435                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$24)
    3436                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    3437              
    3438              $C$DW$T$30      .dwtag  DW_TAG_pointer_type
    3439                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{11550F7E-BF27-45A2-8B51-A4633DC20E3B} PAGE   68

    3440                      .dwattr $C$DW$T$30, DW_AT_address_class(0x20)
    3441              
    3442              $C$DW$T$31      .dwtag  DW_TAG_typedef
    3443                      .dwattr $C$DW$T$31, DW_AT_name("CLARKE_Handle")
    3444                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    3445                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    3446              
    3447              
    3448              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    3449                      .dwattr $C$DW$T$60, DW_AT_name("_CTRL_Obj_")
    3450                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x10a)
    3451              $C$DW$347       .dwtag  DW_TAG_member
    3452                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$25)
    3453                      .dwattr $C$DW$347, DW_AT_name("version")
    3454                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_version")
    3455                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3456                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3457              
    3458              $C$DW$348       .dwtag  DW_TAG_member
    3459                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$27)
    3460                      .dwattr $C$DW$348, DW_AT_name("state")
    3461                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_state")
    3462                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3463                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3464              
    3465              $C$DW$349       .dwtag  DW_TAG_member
    3466                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$27)
    3467                      .dwattr $C$DW$349, DW_AT_name("prevState")
    3468                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_prevState")
    3469                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3470                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3471              
    3472              $C$DW$350       .dwtag  DW_TAG_member
    3473                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$29)
    3474                      .dwattr $C$DW$350, DW_AT_name("errorCode")
    3475                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_errorCode")
    3476                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3477                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3478              
    3479              $C$DW$351       .dwtag  DW_TAG_member
    3480                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$31)
    3481                      .dwattr $C$DW$351, DW_AT_name("clarkeHandle_I")
    3482                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_clarkeHandle_I")
    3483                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3484                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3485              
    3486              $C$DW$352       .dwtag  DW_TAG_member
    3487                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$32)
    3488                      .dwattr $C$DW$352, DW_AT_name("clarke_I")
    3489                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_clarke_I")
    3490                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3491                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3492              
    3493              $C$DW$353       .dwtag  DW_TAG_member
    3494                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{11550F7E-BF27-45A2-8B51-A4633DC20E3B} PAGE   69

    3495                      .dwattr $C$DW$353, DW_AT_name("clarkeHandle_V")
    3496                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_clarkeHandle_V")
    3497                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3498                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3499              
    3500              $C$DW$354       .dwtag  DW_TAG_member
    3501                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$32)
    3502                      .dwattr $C$DW$354, DW_AT_name("clarke_V")
    3503                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_clarke_V")
    3504                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3505                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3506              
    3507              $C$DW$355       .dwtag  DW_TAG_member
    3508                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$34)
    3509                      .dwattr $C$DW$355, DW_AT_name("estHandle")
    3510                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_estHandle")
    3511                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3512                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3513              
    3514              $C$DW$356       .dwtag  DW_TAG_member
    3515                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$36)
    3516                      .dwattr $C$DW$356, DW_AT_name("parkHandle")
    3517                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_parkHandle")
    3518                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3519                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3520              
    3521              $C$DW$357       .dwtag  DW_TAG_member
    3522                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$37)
    3523                      .dwattr $C$DW$357, DW_AT_name("park")
    3524                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_park")
    3525                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3526                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3527              
    3528              $C$DW$358       .dwtag  DW_TAG_member
    3529                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$39)
    3530                      .dwattr $C$DW$358, DW_AT_name("pidHandle_Id")
    3531                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_pidHandle_Id")
    3532                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3533                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3534              
    3535              $C$DW$359       .dwtag  DW_TAG_member
    3536                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$40)
    3537                      .dwattr $C$DW$359, DW_AT_name("pid_Id")
    3538                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_pid_Id")
    3539                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3540                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3541              
    3542              $C$DW$360       .dwtag  DW_TAG_member
    3543                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$39)
    3544                      .dwattr $C$DW$360, DW_AT_name("pidHandle_Iq")
    3545                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_pidHandle_Iq")
    3546                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3547                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3548              
    3549              $C$DW$361       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{11550F7E-BF27-45A2-8B51-A4633DC20E3B} PAGE   70

    3550                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$40)
    3551                      .dwattr $C$DW$361, DW_AT_name("pid_Iq")
    3552                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_pid_Iq")
    3553                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3554                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3555              
    3556              $C$DW$362       .dwtag  DW_TAG_member
    3557                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$39)
    3558                      .dwattr $C$DW$362, DW_AT_name("pidHandle_spd")
    3559                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_pidHandle_spd")
    3560                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3561                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3562              
    3563              $C$DW$363       .dwtag  DW_TAG_member
    3564                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$40)
    3565                      .dwattr $C$DW$363, DW_AT_name("pid_spd")
    3566                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_pid_spd")
    3567                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3568                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3569              
    3570              $C$DW$364       .dwtag  DW_TAG_member
    3571                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$42)
    3572                      .dwattr $C$DW$364, DW_AT_name("iparkHandle")
    3573                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_iparkHandle")
    3574                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3575                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3576              
    3577              $C$DW$365       .dwtag  DW_TAG_member
    3578                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$43)
    3579                      .dwattr $C$DW$365, DW_AT_name("ipark")
    3580                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_ipark")
    3581                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3582                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3583              
    3584              $C$DW$366       .dwtag  DW_TAG_member
    3585                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$45)
    3586                      .dwattr $C$DW$366, DW_AT_name("svgenHandle")
    3587                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_svgenHandle")
    3588                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3589                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3590              
    3591              $C$DW$367       .dwtag  DW_TAG_member
    3592                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$46)
    3593                      .dwattr $C$DW$367, DW_AT_name("svgen")
    3594                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_svgen")
    3595                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3596                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3597              
    3598              $C$DW$368       .dwtag  DW_TAG_member
    3599                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$48)
    3600                      .dwattr $C$DW$368, DW_AT_name("trajHandle_Id")
    3601                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_trajHandle_Id")
    3602                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3603                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3604              
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{11550F7E-BF27-45A2-8B51-A4633DC20E3B} PAGE   71

    3605              $C$DW$369       .dwtag  DW_TAG_member
    3606                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$49)
    3607                      .dwattr $C$DW$369, DW_AT_name("traj_Id")
    3608                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_traj_Id")
    3609                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3610                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3611              
    3612              $C$DW$370       .dwtag  DW_TAG_member
    3613                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$48)
    3614                      .dwattr $C$DW$370, DW_AT_name("trajHandle_spd")
    3615                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_trajHandle_spd")
    3616                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3617                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3618              
    3619              $C$DW$371       .dwtag  DW_TAG_member
    3620                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$49)
    3621                      .dwattr $C$DW$371, DW_AT_name("traj_spd")
    3622                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_traj_spd")
    3623                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    3624                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3625              
    3626              $C$DW$372       .dwtag  DW_TAG_member
    3627                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$48)
    3628                      .dwattr $C$DW$372, DW_AT_name("trajHandle_spdMax")
    3629                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    3630                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3631                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3632              
    3633              $C$DW$373       .dwtag  DW_TAG_member
    3634                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$49)
    3635                      .dwattr $C$DW$373, DW_AT_name("traj_spdMax")
    3636                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_traj_spdMax")
    3637                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3638                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3639              
    3640              $C$DW$374       .dwtag  DW_TAG_member
    3641                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$50)
    3642                      .dwattr $C$DW$374, DW_AT_name("motorParams")
    3643                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_motorParams")
    3644                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3645                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3646              
    3647              $C$DW$375       .dwtag  DW_TAG_member
    3648                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$54)
    3649                      .dwattr $C$DW$375, DW_AT_name("waitTimes")
    3650                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_waitTimes")
    3651                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3652                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3653              
    3654              $C$DW$376       .dwtag  DW_TAG_member
    3655                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$53)
    3656                      .dwattr $C$DW$376, DW_AT_name("counter_state")
    3657                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_counter_state")
    3658                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    3659                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{11550F7E-BF27-45A2-8B51-A4633DC20E3B} PAGE   72

    3660              
    3661              $C$DW$377       .dwtag  DW_TAG_member
    3662                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$56)
    3663                      .dwattr $C$DW$377, DW_AT_name("numIsrTicksPerCtrlTick")
    3664                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3665                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3666                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3667              
    3668              $C$DW$378       .dwtag  DW_TAG_member
    3669                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$56)
    3670                      .dwattr $C$DW$378, DW_AT_name("numCtrlTicksPerCurrentTick")
    3671                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3672                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    3673                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3674              
    3675              $C$DW$379       .dwtag  DW_TAG_member
    3676                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$56)
    3677                      .dwattr $C$DW$379, DW_AT_name("numCtrlTicksPerSpeedTick")
    3678                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3679                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3680                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3681              
    3682              $C$DW$380       .dwtag  DW_TAG_member
    3683                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$56)
    3684                      .dwattr $C$DW$380, DW_AT_name("numCtrlTicksPerTrajTick")
    3685                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3686                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    3687                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3688              
    3689              $C$DW$381       .dwtag  DW_TAG_member
    3690                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$53)
    3691                      .dwattr $C$DW$381, DW_AT_name("ctrlFreq_Hz")
    3692                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    3693                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3694                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3695              
    3696              $C$DW$382       .dwtag  DW_TAG_member
    3697                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$53)
    3698                      .dwattr $C$DW$382, DW_AT_name("trajFreq_Hz")
    3699                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_trajFreq_Hz")
    3700                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3701                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3702              
    3703              $C$DW$383       .dwtag  DW_TAG_member
    3704                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$20)
    3705                      .dwattr $C$DW$383, DW_AT_name("trajPeriod_sec")
    3706                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_trajPeriod_sec")
    3707                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3708                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3709              
    3710              $C$DW$384       .dwtag  DW_TAG_member
    3711                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$57)
    3712                      .dwattr $C$DW$384, DW_AT_name("ctrlPeriod_sec")
    3713                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    3714                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{11550F7E-BF27-45A2-8B51-A4633DC20E3B} PAGE   73

    3715                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3716              
    3717              $C$DW$385       .dwtag  DW_TAG_member
    3718                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$20)
    3719                      .dwattr $C$DW$385, DW_AT_name("maxVsMag_pu")
    3720                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3721                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3722                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3723              
    3724              $C$DW$386       .dwtag  DW_TAG_member
    3725                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$58)
    3726                      .dwattr $C$DW$386, DW_AT_name("Iab_in")
    3727                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_Iab_in")
    3728                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3729                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3730              
    3731              $C$DW$387       .dwtag  DW_TAG_member
    3732                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$58)
    3733                      .dwattr $C$DW$387, DW_AT_name("Iab_filt")
    3734                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_Iab_filt")
    3735                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3736                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3737              
    3738              $C$DW$388       .dwtag  DW_TAG_member
    3739                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$58)
    3740                      .dwattr $C$DW$388, DW_AT_name("Idq_in")
    3741                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_Idq_in")
    3742                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3743                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3744              
    3745              $C$DW$389       .dwtag  DW_TAG_member
    3746                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$58)
    3747                      .dwattr $C$DW$389, DW_AT_name("Vab_in")
    3748                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_Vab_in")
    3749                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3750                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3751              
    3752              $C$DW$390       .dwtag  DW_TAG_member
    3753                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$20)
    3754                      .dwattr $C$DW$390, DW_AT_name("spd_out")
    3755                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_spd_out")
    3756                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3757                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3758              
    3759              $C$DW$391       .dwtag  DW_TAG_member
    3760                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$58)
    3761                      .dwattr $C$DW$391, DW_AT_name("Vab_out")
    3762                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_Vab_out")
    3763                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3764                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3765              
    3766              $C$DW$392       .dwtag  DW_TAG_member
    3767                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$58)
    3768                      .dwattr $C$DW$392, DW_AT_name("Vdq_out")
    3769                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_Vdq_out")
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{11550F7E-BF27-45A2-8B51-A4633DC20E3B} PAGE   74

    3770                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3771                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3772              
    3773              $C$DW$393       .dwtag  DW_TAG_member
    3774                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$57)
    3775                      .dwattr $C$DW$393, DW_AT_name("Rhf")
    3776                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_Rhf")
    3777                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3778                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3779              
    3780              $C$DW$394       .dwtag  DW_TAG_member
    3781                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$57)
    3782                      .dwattr $C$DW$394, DW_AT_name("Lhf")
    3783                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_Lhf")
    3784                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3785                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3786              
    3787              $C$DW$395       .dwtag  DW_TAG_member
    3788                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$57)
    3789                      .dwattr $C$DW$395, DW_AT_name("RoverL")
    3790                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_RoverL")
    3791                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3792                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3793              
    3794              $C$DW$396       .dwtag  DW_TAG_member
    3795                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$20)
    3796                      .dwattr $C$DW$396, DW_AT_name("Kp_Id")
    3797                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_Kp_Id")
    3798                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3799                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3800              
    3801              $C$DW$397       .dwtag  DW_TAG_member
    3802                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$20)
    3803                      .dwattr $C$DW$397, DW_AT_name("Kp_Iq")
    3804                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_Kp_Iq")
    3805                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3806                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3807              
    3808              $C$DW$398       .dwtag  DW_TAG_member
    3809                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$20)
    3810                      .dwattr $C$DW$398, DW_AT_name("Kp_spd")
    3811                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_Kp_spd")
    3812                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3813                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3814              
    3815              $C$DW$399       .dwtag  DW_TAG_member
    3816                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$20)
    3817                      .dwattr $C$DW$399, DW_AT_name("Ki_Id")
    3818                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_Ki_Id")
    3819                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3820                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3821              
    3822              $C$DW$400       .dwtag  DW_TAG_member
    3823                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$20)
    3824                      .dwattr $C$DW$400, DW_AT_name("Ki_Iq")
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{11550F7E-BF27-45A2-8B51-A4633DC20E3B} PAGE   75

    3825                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_Ki_Iq")
    3826                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3827                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3828              
    3829              $C$DW$401       .dwtag  DW_TAG_member
    3830                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$20)
    3831                      .dwattr $C$DW$401, DW_AT_name("Ki_spd")
    3832                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_Ki_spd")
    3833                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3834                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3835              
    3836              $C$DW$402       .dwtag  DW_TAG_member
    3837                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$20)
    3838                      .dwattr $C$DW$402, DW_AT_name("Kd_Id")
    3839                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_Kd_Id")
    3840                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3841                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3842              
    3843              $C$DW$403       .dwtag  DW_TAG_member
    3844                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$20)
    3845                      .dwattr $C$DW$403, DW_AT_name("Kd_Iq")
    3846                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_Kd_Iq")
    3847                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3848                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3849              
    3850              $C$DW$404       .dwtag  DW_TAG_member
    3851                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$20)
    3852                      .dwattr $C$DW$404, DW_AT_name("Kd_spd")
    3853                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_Kd_spd")
    3854                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3855                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3856              
    3857              $C$DW$405       .dwtag  DW_TAG_member
    3858                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$20)
    3859                      .dwattr $C$DW$405, DW_AT_name("Ui_Id")
    3860                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_Ui_Id")
    3861                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    3862                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3863              
    3864              $C$DW$406       .dwtag  DW_TAG_member
    3865                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$20)
    3866                      .dwattr $C$DW$406, DW_AT_name("Ui_Iq")
    3867                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_Ui_Iq")
    3868                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    3869                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3870              
    3871              $C$DW$407       .dwtag  DW_TAG_member
    3872                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$20)
    3873                      .dwattr $C$DW$407, DW_AT_name("Ui_spd")
    3874                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_Ui_spd")
    3875                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    3876                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    3877              
    3878              $C$DW$408       .dwtag  DW_TAG_member
    3879                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$58)
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{11550F7E-BF27-45A2-8B51-A4633DC20E3B} PAGE   76

    3880                      .dwattr $C$DW$408, DW_AT_name("Idq_ref")
    3881                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_Idq_ref")
    3882                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    3883                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3884              
    3885              $C$DW$409       .dwtag  DW_TAG_member
    3886                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$20)
    3887                      .dwattr $C$DW$409, DW_AT_name("IdRated")
    3888                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_IdRated")
    3889                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    3890                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3891              
    3892              $C$DW$410       .dwtag  DW_TAG_member
    3893                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$20)
    3894                      .dwattr $C$DW$410, DW_AT_name("spd_ref")
    3895                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_spd_ref")
    3896                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    3897                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3898              
    3899              $C$DW$411       .dwtag  DW_TAG_member
    3900                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$20)
    3901                      .dwattr $C$DW$411, DW_AT_name("spd_max")
    3902                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_spd_max")
    3903                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    3904                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3905              
    3906              $C$DW$412       .dwtag  DW_TAG_member
    3907                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$56)
    3908                      .dwattr $C$DW$412, DW_AT_name("counter_current")
    3909                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_counter_current")
    3910                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3911                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3912              
    3913              $C$DW$413       .dwtag  DW_TAG_member
    3914                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$56)
    3915                      .dwattr $C$DW$413, DW_AT_name("counter_isr")
    3916                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_counter_isr")
    3917                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    3918                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3919              
    3920              $C$DW$414       .dwtag  DW_TAG_member
    3921                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$56)
    3922                      .dwattr $C$DW$414, DW_AT_name("counter_speed")
    3923                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_counter_speed")
    3924                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3925                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3926              
    3927              $C$DW$415       .dwtag  DW_TAG_member
    3928                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$56)
    3929                      .dwattr $C$DW$415, DW_AT_name("counter_traj")
    3930                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_counter_traj")
    3931                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    3932                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3933              
    3934              $C$DW$416       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{11550F7E-BF27-45A2-8B51-A4633DC20E3B} PAGE   77

    3935                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$59)
    3936                      .dwattr $C$DW$416, DW_AT_name("flag_enableCtrl")
    3937                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_flag_enableCtrl")
    3938                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3939                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3940              
    3941              $C$DW$417       .dwtag  DW_TAG_member
    3942                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$59)
    3943                      .dwattr $C$DW$417, DW_AT_name("flag_enableDcBusComp")
    3944                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    3945                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    3946                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3947              
    3948              $C$DW$418       .dwtag  DW_TAG_member
    3949                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$59)
    3950                      .dwattr $C$DW$418, DW_AT_name("flag_enablePowerWarp")
    3951                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    3952                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3953                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3954              
    3955              $C$DW$419       .dwtag  DW_TAG_member
    3956                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$59)
    3957                      .dwattr $C$DW$419, DW_AT_name("flag_enableOffset")
    3958                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_flag_enableOffset")
    3959                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    3960                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3961              
    3962              $C$DW$420       .dwtag  DW_TAG_member
    3963                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$59)
    3964                      .dwattr $C$DW$420, DW_AT_name("flag_enableSpeedCtrl")
    3965                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    3966                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3967                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3968              
    3969              $C$DW$421       .dwtag  DW_TAG_member
    3970                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$59)
    3971                      .dwattr $C$DW$421, DW_AT_name("flag_enableUserMotorParams")
    3972                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    3973                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    3974                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3975              
    3976              $C$DW$422       .dwtag  DW_TAG_member
    3977                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$58)
    3978                      .dwattr $C$DW$422, DW_AT_name("Idq_offset_pu")
    3979                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_Idq_offset_pu")
    3980                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    3981                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3982              
    3983              $C$DW$423       .dwtag  DW_TAG_member
    3984                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$58)
    3985                      .dwattr $C$DW$423, DW_AT_name("Vdq_offset_pu")
    3986                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    3987                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    3988                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3989              
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{11550F7E-BF27-45A2-8B51-A4633DC20E3B} PAGE   78

    3990              $C$DW$424       .dwtag  DW_TAG_member
    3991                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$20)
    3992                      .dwattr $C$DW$424, DW_AT_name("angle_pu")
    3993                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_angle_pu")
    3994                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    3995                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3996              
    3997              $C$DW$425       .dwtag  DW_TAG_member
    3998                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$20)
    3999                      .dwattr $C$DW$425, DW_AT_name("speed_ref_pu")
    4000                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_speed_ref_pu")
    4001                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    4002                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    4003              
    4004              $C$DW$426       .dwtag  DW_TAG_member
    4005                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$20)
    4006                      .dwattr $C$DW$426, DW_AT_name("speed_fb_pu")
    4007                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_speed_fb_pu")
    4008                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    4009                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4010              
    4011              $C$DW$427       .dwtag  DW_TAG_member
    4012                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$20)
    4013                      .dwattr $C$DW$427, DW_AT_name("speed_outMax_pu")
    4014                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_speed_outMax_pu")
    4015                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    4016                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4017              
    4018              $C$DW$428       .dwtag  DW_TAG_member
    4019                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$59)
    4020                      .dwattr $C$DW$428, DW_AT_name("flag_enableCurrentCtrl")
    4021                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    4022                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    4023                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4024              
    4025              $C$DW$429       .dwtag  DW_TAG_member
    4026                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$20)
    4027                      .dwattr $C$DW$429, DW_AT_name("torque_head_comm")
    4028                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_torque_head_comm")
    4029                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    4030                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4031              
    4032                      .dwendtag $C$DW$T$60
    4033              
    4034              $C$DW$T$89      .dwtag  DW_TAG_typedef
    4035                      .dwattr $C$DW$T$89, DW_AT_name("CTRL_Obj")
    4036                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$60)
    4037                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    4038              
    4039              $C$DW$T$90      .dwtag  DW_TAG_pointer_type
    4040                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$60)
    4041                      .dwattr $C$DW$T$90, DW_AT_address_class(0x20)
    4042              
    4043              $C$DW$T$91      .dwtag  DW_TAG_typedef
    4044                      .dwattr $C$DW$T$91, DW_AT_name("CTRL_Handle")
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{11550F7E-BF27-45A2-8B51-A4633DC20E3B} PAGE   79

    4045                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    4046                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    4047              
    4048              $C$DW$430       .dwtag  DW_TAG_TI_far_type
    4049                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$91)
    4050              
    4051              $C$DW$T$92      .dwtag  DW_TAG_const_type
    4052                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$430)
    4053              
    4054              
    4055              $C$DW$T$64      .dwtag  DW_TAG_structure_type
    4056                      .dwattr $C$DW$T$64, DW_AT_name("_CTRL_Version_")
    4057                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x04)
    4058              $C$DW$431       .dwtag  DW_TAG_member
    4059                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$61)
    4060                      .dwattr $C$DW$431, DW_AT_name("rsvd")
    4061                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_rsvd")
    4062                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4063                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4064              
    4065              $C$DW$432       .dwtag  DW_TAG_member
    4066                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$63)
    4067                      .dwattr $C$DW$432, DW_AT_name("targetProc")
    4068                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_targetProc")
    4069                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4070                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4071              
    4072              $C$DW$433       .dwtag  DW_TAG_member
    4073                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$61)
    4074                      .dwattr $C$DW$433, DW_AT_name("major")
    4075                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_major")
    4076                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4077                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    4078              
    4079              $C$DW$434       .dwtag  DW_TAG_member
    4080                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$61)
    4081                      .dwattr $C$DW$434, DW_AT_name("minor")
    4082                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_minor")
    4083                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4084                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4085              
    4086                      .dwendtag $C$DW$T$64
    4087              
    4088              $C$DW$T$25      .dwtag  DW_TAG_typedef
    4089                      .dwattr $C$DW$T$25, DW_AT_name("CTRL_Version")
    4090                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$64)
    4091                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    4092              
    4093              
    4094              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    4095                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    4096                      .dwattr $C$DW$T$19, DW_AT_declaration
    4097                      .dwendtag $C$DW$T$19
    4098              
    4099              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{11550F7E-BF27-45A2-8B51-A4633DC20E3B} PAGE   80

    4100                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$19)
    4101                      .dwattr $C$DW$T$33, DW_AT_address_class(0x20)
    4102              
    4103              $C$DW$T$34      .dwtag  DW_TAG_typedef
    4104                      .dwattr $C$DW$T$34, DW_AT_name("EST_Handle")
    4105                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    4106                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    4107              
    4108              
    4109              $C$DW$T$65      .dwtag  DW_TAG_structure_type
    4110                      .dwattr $C$DW$T$65, DW_AT_name("_IPARK_Obj_")
    4111                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x04)
    4112              $C$DW$435       .dwtag  DW_TAG_member
    4113                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$20)
    4114                      .dwattr $C$DW$435, DW_AT_name("sinTh")
    4115                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_sinTh")
    4116                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4117                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4118              
    4119              $C$DW$436       .dwtag  DW_TAG_member
    4120                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$20)
    4121                      .dwattr $C$DW$436, DW_AT_name("cosTh")
    4122                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_cosTh")
    4123                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4124                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4125              
    4126                      .dwendtag $C$DW$T$65
    4127              
    4128              $C$DW$T$43      .dwtag  DW_TAG_typedef
    4129                      .dwattr $C$DW$T$43, DW_AT_name("IPARK_Obj")
    4130                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$65)
    4131                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    4132              
    4133              $C$DW$T$41      .dwtag  DW_TAG_pointer_type
    4134                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$65)
    4135                      .dwattr $C$DW$T$41, DW_AT_address_class(0x20)
    4136              
    4137              $C$DW$T$42      .dwtag  DW_TAG_typedef
    4138                      .dwattr $C$DW$T$42, DW_AT_name("IPARK_Handle")
    4139                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    4140                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    4141              
    4142              
    4143              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    4144                      .dwattr $C$DW$T$67, DW_AT_name("_MATH_vec2_")
    4145                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
    4146              $C$DW$437       .dwtag  DW_TAG_member
    4147                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$66)
    4148                      .dwattr $C$DW$437, DW_AT_name("value")
    4149                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_value")
    4150                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4151                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4152              
    4153                      .dwendtag $C$DW$T$67
    4154              
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{11550F7E-BF27-45A2-8B51-A4633DC20E3B} PAGE   81

    4155              $C$DW$T$58      .dwtag  DW_TAG_typedef
    4156                      .dwattr $C$DW$T$58, DW_AT_name("MATH_vec2")
    4157                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$67)
    4158                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    4159              
    4160              
    4161              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    4162                      .dwattr $C$DW$T$70, DW_AT_name("_MOTOR_Params_")
    4163                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0e)
    4164              $C$DW$438       .dwtag  DW_TAG_member
    4165                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$69)
    4166                      .dwattr $C$DW$438, DW_AT_name("type")
    4167                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_type")
    4168                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4169                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4170              
    4171              $C$DW$439       .dwtag  DW_TAG_member
    4172                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$56)
    4173                      .dwattr $C$DW$439, DW_AT_name("numPolePairs")
    4174                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_numPolePairs")
    4175                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4176                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4177              
    4178              $C$DW$440       .dwtag  DW_TAG_member
    4179                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$57)
    4180                      .dwattr $C$DW$440, DW_AT_name("Lr_H")
    4181                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_Lr_H")
    4182                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4183                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4184              
    4185              $C$DW$441       .dwtag  DW_TAG_member
    4186                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$57)
    4187                      .dwattr $C$DW$441, DW_AT_name("Ls_d_H")
    4188                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_Ls_d_H")
    4189                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4190                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4191              
    4192              $C$DW$442       .dwtag  DW_TAG_member
    4193                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$57)
    4194                      .dwattr $C$DW$442, DW_AT_name("Ls_q_H")
    4195                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_Ls_q_H")
    4196                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4197                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4198              
    4199              $C$DW$443       .dwtag  DW_TAG_member
    4200                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$57)
    4201                      .dwattr $C$DW$443, DW_AT_name("Rr_Ohm")
    4202                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_Rr_Ohm")
    4203                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4204                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4205              
    4206              $C$DW$444       .dwtag  DW_TAG_member
    4207                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$57)
    4208                      .dwattr $C$DW$444, DW_AT_name("Rs_Ohm")
    4209                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_Rs_Ohm")
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{11550F7E-BF27-45A2-8B51-A4633DC20E3B} PAGE   82

    4210                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4211                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4212              
    4213              $C$DW$445       .dwtag  DW_TAG_member
    4214                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$57)
    4215                      .dwattr $C$DW$445, DW_AT_name("ratedFlux_VpHz")
    4216                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_ratedFlux_VpHz")
    4217                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4218                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4219              
    4220                      .dwendtag $C$DW$T$70
    4221              
    4222              $C$DW$T$50      .dwtag  DW_TAG_typedef
    4223                      .dwattr $C$DW$T$50, DW_AT_name("MOTOR_Params")
    4224                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$70)
    4225                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    4226              
    4227              
    4228              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    4229                      .dwattr $C$DW$T$71, DW_AT_name("_PARK_Obj_")
    4230                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x04)
    4231              $C$DW$446       .dwtag  DW_TAG_member
    4232                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$20)
    4233                      .dwattr $C$DW$446, DW_AT_name("sinTh")
    4234                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_sinTh")
    4235                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4236                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4237              
    4238              $C$DW$447       .dwtag  DW_TAG_member
    4239                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$20)
    4240                      .dwattr $C$DW$447, DW_AT_name("cosTh")
    4241                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_cosTh")
    4242                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4243                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4244              
    4245                      .dwendtag $C$DW$T$71
    4246              
    4247              $C$DW$T$37      .dwtag  DW_TAG_typedef
    4248                      .dwattr $C$DW$T$37, DW_AT_name("PARK_Obj")
    4249                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$71)
    4250                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    4251              
    4252              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    4253                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$71)
    4254                      .dwattr $C$DW$T$35, DW_AT_address_class(0x20)
    4255              
    4256              $C$DW$T$36      .dwtag  DW_TAG_typedef
    4257                      .dwattr $C$DW$T$36, DW_AT_name("PARK_Handle")
    4258                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    4259                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    4260              
    4261              
    4262              $C$DW$T$72      .dwtag  DW_TAG_structure_type
    4263                      .dwattr $C$DW$T$72, DW_AT_name("_PID_Obj_")
    4264                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x10)
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{11550F7E-BF27-45A2-8B51-A4633DC20E3B} PAGE   83

    4265              $C$DW$448       .dwtag  DW_TAG_member
    4266                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$20)
    4267                      .dwattr $C$DW$448, DW_AT_name("Kp")
    4268                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_Kp")
    4269                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4270                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4271              
    4272              $C$DW$449       .dwtag  DW_TAG_member
    4273                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$20)
    4274                      .dwattr $C$DW$449, DW_AT_name("Ki")
    4275                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_Ki")
    4276                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4277                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4278              
    4279              $C$DW$450       .dwtag  DW_TAG_member
    4280                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$20)
    4281                      .dwattr $C$DW$450, DW_AT_name("Kd")
    4282                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_Kd")
    4283                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4284                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4285              
    4286              $C$DW$451       .dwtag  DW_TAG_member
    4287                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$20)
    4288                      .dwattr $C$DW$451, DW_AT_name("Ui")
    4289                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_Ui")
    4290                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4291                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4292              
    4293              $C$DW$452       .dwtag  DW_TAG_member
    4294                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$20)
    4295                      .dwattr $C$DW$452, DW_AT_name("refValue")
    4296                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_refValue")
    4297                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4298                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4299              
    4300              $C$DW$453       .dwtag  DW_TAG_member
    4301                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$20)
    4302                      .dwattr $C$DW$453, DW_AT_name("fbackValue")
    4303                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_fbackValue")
    4304                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4305                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4306              
    4307              $C$DW$454       .dwtag  DW_TAG_member
    4308                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$20)
    4309                      .dwattr $C$DW$454, DW_AT_name("outMin")
    4310                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_outMin")
    4311                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4312                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4313              
    4314              $C$DW$455       .dwtag  DW_TAG_member
    4315                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$20)
    4316                      .dwattr $C$DW$455, DW_AT_name("outMax")
    4317                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_outMax")
    4318                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4319                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{11550F7E-BF27-45A2-8B51-A4633DC20E3B} PAGE   84

    4320              
    4321                      .dwendtag $C$DW$T$72
    4322              
    4323              $C$DW$T$40      .dwtag  DW_TAG_typedef
    4324                      .dwattr $C$DW$T$40, DW_AT_name("PID_Obj")
    4325                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$72)
    4326                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    4327              
    4328              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    4329                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$72)
    4330                      .dwattr $C$DW$T$38, DW_AT_address_class(0x20)
    4331              
    4332              $C$DW$T$39      .dwtag  DW_TAG_typedef
    4333                      .dwattr $C$DW$T$39, DW_AT_name("PID_Handle")
    4334                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    4335                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    4336              
    4337              
    4338              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    4339                      .dwattr $C$DW$T$73, DW_AT_name("_SVGEN_Obj_")
    4340                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x02)
    4341              $C$DW$456       .dwtag  DW_TAG_member
    4342                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$20)
    4343                      .dwattr $C$DW$456, DW_AT_name("maxModulation")
    4344                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_maxModulation")
    4345                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4346                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4347              
    4348                      .dwendtag $C$DW$T$73
    4349              
    4350              $C$DW$T$46      .dwtag  DW_TAG_typedef
    4351                      .dwattr $C$DW$T$46, DW_AT_name("SVGEN_Obj")
    4352                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$73)
    4353                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    4354              
    4355              $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    4356                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$73)
    4357                      .dwattr $C$DW$T$44, DW_AT_address_class(0x20)
    4358              
    4359              $C$DW$T$45      .dwtag  DW_TAG_typedef
    4360                      .dwattr $C$DW$T$45, DW_AT_name("SVGEN_Handle")
    4361                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    4362                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    4363              
    4364              
    4365              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    4366                      .dwattr $C$DW$T$74, DW_AT_name("_TRAJ_Obj_")
    4367                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x0a)
    4368              $C$DW$457       .dwtag  DW_TAG_member
    4369                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$20)
    4370                      .dwattr $C$DW$457, DW_AT_name("targetValue")
    4371                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_targetValue")
    4372                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4373                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4374              
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{11550F7E-BF27-45A2-8B51-A4633DC20E3B} PAGE   85

    4375              $C$DW$458       .dwtag  DW_TAG_member
    4376                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$20)
    4377                      .dwattr $C$DW$458, DW_AT_name("intValue")
    4378                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_intValue")
    4379                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4380                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4381              
    4382              $C$DW$459       .dwtag  DW_TAG_member
    4383                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$20)
    4384                      .dwattr $C$DW$459, DW_AT_name("minValue")
    4385                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_minValue")
    4386                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4387                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4388              
    4389              $C$DW$460       .dwtag  DW_TAG_member
    4390                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$20)
    4391                      .dwattr $C$DW$460, DW_AT_name("maxValue")
    4392                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_maxValue")
    4393                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4394                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4395              
    4396              $C$DW$461       .dwtag  DW_TAG_member
    4397                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$20)
    4398                      .dwattr $C$DW$461, DW_AT_name("maxDelta")
    4399                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_maxDelta")
    4400                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4401                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4402              
    4403                      .dwendtag $C$DW$T$74
    4404              
    4405              $C$DW$T$49      .dwtag  DW_TAG_typedef
    4406                      .dwattr $C$DW$T$49, DW_AT_name("TRAJ_Obj")
    4407                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$74)
    4408                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    4409              
    4410              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    4411                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$74)
    4412                      .dwattr $C$DW$T$47, DW_AT_address_class(0x20)
    4413              
    4414              $C$DW$T$48      .dwtag  DW_TAG_typedef
    4415                      .dwattr $C$DW$T$48, DW_AT_name("TRAJ_Handle")
    4416                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    4417                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    4418              
    4419              
    4420              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    4421                      .dwattr $C$DW$T$80, DW_AT_name("_USER_Params_")
    4422                      .dwattr $C$DW$T$80, DW_AT_byte_size(0xac)
    4423              $C$DW$462       .dwtag  DW_TAG_member
    4424                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$57)
    4425                      .dwattr $C$DW$462, DW_AT_name("iqFullScaleCurrent_A")
    4426                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    4427                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4428                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4429              
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{11550F7E-BF27-45A2-8B51-A4633DC20E3B} PAGE   86

    4430              $C$DW$463       .dwtag  DW_TAG_member
    4431                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$57)
    4432                      .dwattr $C$DW$463, DW_AT_name("iqFullScaleVoltage_V")
    4433                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    4434                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4435                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4436              
    4437              $C$DW$464       .dwtag  DW_TAG_member
    4438                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$57)
    4439                      .dwattr $C$DW$464, DW_AT_name("iqFullScaleFreq_Hz")
    4440                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_iqFullScaleFreq_Hz")
    4441                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4442                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4443              
    4444              $C$DW$465       .dwtag  DW_TAG_member
    4445                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$56)
    4446                      .dwattr $C$DW$465, DW_AT_name("numIsrTicksPerCtrlTick")
    4447                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    4448                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4449                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4450              
    4451              $C$DW$466       .dwtag  DW_TAG_member
    4452                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$56)
    4453                      .dwattr $C$DW$466, DW_AT_name("numCtrlTicksPerCurrentTick")
    4454                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    4455                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4456                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4457              
    4458              $C$DW$467       .dwtag  DW_TAG_member
    4459                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$56)
    4460                      .dwattr $C$DW$467, DW_AT_name("numCtrlTicksPerEstTick")
    4461                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_numCtrlTicksPerEstTick")
    4462                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4463                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4464              
    4465              $C$DW$468       .dwtag  DW_TAG_member
    4466                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$56)
    4467                      .dwattr $C$DW$468, DW_AT_name("numCtrlTicksPerSpeedTick")
    4468                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    4469                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4470                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4471              
    4472              $C$DW$469       .dwtag  DW_TAG_member
    4473                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$56)
    4474                      .dwattr $C$DW$469, DW_AT_name("numCtrlTicksPerTrajTick")
    4475                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    4476                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4477                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4478              
    4479              $C$DW$470       .dwtag  DW_TAG_member
    4480                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$23)
    4481                      .dwattr $C$DW$470, DW_AT_name("numCurrentSensors")
    4482                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_numCurrentSensors")
    4483                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4484                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{11550F7E-BF27-45A2-8B51-A4633DC20E3B} PAGE   87

    4485              
    4486              $C$DW$471       .dwtag  DW_TAG_member
    4487                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$23)
    4488                      .dwattr $C$DW$471, DW_AT_name("numVoltageSensors")
    4489                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_numVoltageSensors")
    4490                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4491                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    4492              
    4493              $C$DW$472       .dwtag  DW_TAG_member
    4494                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$57)
    4495                      .dwattr $C$DW$472, DW_AT_name("offsetPole_rps")
    4496                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_offsetPole_rps")
    4497                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4498                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    4499              
    4500              $C$DW$473       .dwtag  DW_TAG_member
    4501                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$57)
    4502                      .dwattr $C$DW$473, DW_AT_name("fluxPole_rps")
    4503                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_fluxPole_rps")
    4504                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4505                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    4506              
    4507              $C$DW$474       .dwtag  DW_TAG_member
    4508                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$57)
    4509                      .dwattr $C$DW$474, DW_AT_name("zeroSpeedLimit")
    4510                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_zeroSpeedLimit")
    4511                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4512                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    4513              
    4514              $C$DW$475       .dwtag  DW_TAG_member
    4515                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$57)
    4516                      .dwattr $C$DW$475, DW_AT_name("forceAngleFreq_Hz")
    4517                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_forceAngleFreq_Hz")
    4518                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4519                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    4520              
    4521              $C$DW$476       .dwtag  DW_TAG_member
    4522                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$57)
    4523                      .dwattr $C$DW$476, DW_AT_name("maxAccel_Hzps")
    4524                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_maxAccel_Hzps")
    4525                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4526                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    4527              
    4528              $C$DW$477       .dwtag  DW_TAG_member
    4529                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$57)
    4530                      .dwattr $C$DW$477, DW_AT_name("maxAccel_est_Hzps")
    4531                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_maxAccel_est_Hzps")
    4532                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4533                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    4534              
    4535              $C$DW$478       .dwtag  DW_TAG_member
    4536                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$57)
    4537                      .dwattr $C$DW$478, DW_AT_name("directionPole_rps")
    4538                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_directionPole_rps")
    4539                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{11550F7E-BF27-45A2-8B51-A4633DC20E3B} PAGE   88

    4540                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    4541              
    4542              $C$DW$479       .dwtag  DW_TAG_member
    4543                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$57)
    4544                      .dwattr $C$DW$479, DW_AT_name("speedPole_rps")
    4545                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_speedPole_rps")
    4546                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4547                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    4548              
    4549              $C$DW$480       .dwtag  DW_TAG_member
    4550                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$57)
    4551                      .dwattr $C$DW$480, DW_AT_name("dcBusPole_rps")
    4552                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_dcBusPole_rps")
    4553                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4554                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    4555              
    4556              $C$DW$481       .dwtag  DW_TAG_member
    4557                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$57)
    4558                      .dwattr $C$DW$481, DW_AT_name("fluxFraction")
    4559                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_fluxFraction")
    4560                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4561                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    4562              
    4563              $C$DW$482       .dwtag  DW_TAG_member
    4564                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$57)
    4565                      .dwattr $C$DW$482, DW_AT_name("indEst_speedMaxFraction")
    4566                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_indEst_speedMaxFraction")
    4567                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4568                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    4569              
    4570              $C$DW$483       .dwtag  DW_TAG_member
    4571                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$57)
    4572                      .dwattr $C$DW$483, DW_AT_name("powerWarpGain")
    4573                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_powerWarpGain")
    4574                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4575                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    4576              
    4577              $C$DW$484       .dwtag  DW_TAG_member
    4578                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$56)
    4579                      .dwattr $C$DW$484, DW_AT_name("systemFreq_MHz")
    4580                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_systemFreq_MHz")
    4581                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4582                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    4583              
    4584              $C$DW$485       .dwtag  DW_TAG_member
    4585                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$57)
    4586                      .dwattr $C$DW$485, DW_AT_name("pwmPeriod_usec")
    4587                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_pwmPeriod_usec")
    4588                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4589                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    4590              
    4591              $C$DW$486       .dwtag  DW_TAG_member
    4592                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$57)
    4593                      .dwattr $C$DW$486, DW_AT_name("voltage_sf")
    4594                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_voltage_sf")
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{11550F7E-BF27-45A2-8B51-A4633DC20E3B} PAGE   89

    4595                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4596                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    4597              
    4598              $C$DW$487       .dwtag  DW_TAG_member
    4599                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$57)
    4600                      .dwattr $C$DW$487, DW_AT_name("current_sf")
    4601                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_current_sf")
    4602                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4603                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    4604              
    4605              $C$DW$488       .dwtag  DW_TAG_member
    4606                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$57)
    4607                      .dwattr $C$DW$488, DW_AT_name("voltageFilterPole_rps")
    4608                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_voltageFilterPole_rps")
    4609                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4610                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    4611              
    4612              $C$DW$489       .dwtag  DW_TAG_member
    4613                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$57)
    4614                      .dwattr $C$DW$489, DW_AT_name("maxVsMag_pu")
    4615                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_maxVsMag_pu")
    4616                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4617                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    4618              
    4619              $C$DW$490       .dwtag  DW_TAG_member
    4620                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$57)
    4621                      .dwattr $C$DW$490, DW_AT_name("estKappa")
    4622                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_estKappa")
    4623                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4624                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    4625              
    4626              $C$DW$491       .dwtag  DW_TAG_member
    4627                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$69)
    4628                      .dwattr $C$DW$491, DW_AT_name("motor_type")
    4629                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_motor_type")
    4630                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4631                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    4632              
    4633              $C$DW$492       .dwtag  DW_TAG_member
    4634                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$56)
    4635                      .dwattr $C$DW$492, DW_AT_name("motor_numPolePairs")
    4636                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_motor_numPolePairs")
    4637                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    4638                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    4639              
    4640              $C$DW$493       .dwtag  DW_TAG_member
    4641                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$57)
    4642                      .dwattr $C$DW$493, DW_AT_name("motor_ratedFlux")
    4643                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_motor_ratedFlux")
    4644                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4645                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    4646              
    4647              $C$DW$494       .dwtag  DW_TAG_member
    4648                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$57)
    4649                      .dwattr $C$DW$494, DW_AT_name("motor_Rr")
TMS320C2000 Assembler PC v22.6.0 Thu May 11 17:35:51 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\GA5354\AppData\Local\Temp\{11550F7E-BF27-45A2-8B51-A4633DC20E3B} PAGE   90

    4650                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_motor_Rr")
    4651                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4652                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    4653              
    4654              $C$DW$495       .dwtag  DW_TAG_member
    4655                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$57)
    4656                      .dwattr $C$DW$495, DW_AT_name("motor_Rs")
    4657                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_motor_Rs")
    4658                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4659                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    4660              
    4661              $C$DW$496       .dwtag  DW_TAG_member
    4662                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$57)
    4663                      .dwattr $C$DW$496, DW_AT_name("motor_Ls_d")
    4664                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_motor_Ls_d")
    4665                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4666                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    4667              
    4668              $C$DW$497       .dwtag  DW_TAG_member
    4669                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$57)
    4670                      .dwattr $C$DW$497, DW_AT_name("motor_Ls_q")
    4671                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_motor_Ls_q")
    4672                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    4673                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    4674              
